{"title":"The.Blacklist.S01E01.HDTV.x264-LOL","uid":8956938,"size":366837962,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0079291c7dc0c86f52589c29def6957bd12a0a86&amp;dn=The.Blacklist.S01E01.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Thhaque","files":1,"time":1380020434,"description":"Plot\n\nRaymond &quot;Red&quot; Reddington, one of the FBI's most wanted fugitives, surrenders in person at FBI Headquarters in Washington, D.C. He claims that he and the FBI have the same interests: bringing down dangerous criminals and terrorists. Reddington will co-operate, but insists that he will speak only to Elizabeth Keen, a rookie FBI profiler. Keen questions Reddington's sudden interest in her, though he claims that Keen is very special. After the FBI brings down a terrorist he provided information on, Reddington reveals that the terrorist is only just the first of many. In the last two decades, he's made a list of criminals and terrorists he believes the FBI cannot find because they did not know they exist and that they matter the most. Reddington calls it &quot;The Blacklist&quot;.\n\n\nCast and characters\n\nJames Spader as Raymond &quot;Red&quot; Reddington, one of the FBI's most wanted fugitives, known for brokering deals for criminals and called &quot;The Concierge of Crime&quot;, who surrenders to the FBI and provides information but continues to pursue his own agenda.\nMegan Boone as FBI Special Agent Elizabeth Keen, a profiler and the only one to whom Reddington will speak.\nHarry Lennix as FBI Assistant Director Harold Cooper.\nDiego Klattenhoff as FBI Agent Donald Ressler\nRyan Eggold as Tom Keen, Elizabeth's husband\nParminder Nagra as FBI agent Margot Malik\nIlfenesh Hadera as Jennifer Palmer","torrent":{"xt":"urn:btih:0079291c7dc0c86f52589c29def6957bd12a0a86","amp;dn":"The.Blacklist.S01E01.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0079291c7dc0c86f52589c29def6957bd12a0a86","infoHashBuffer":{"type":"Buffer","data":[0,121,41,28,125,192,200,111,82,88,156,41,222,246,149,123,209,42,10,134]},"announce":[],"urlList":[]}}