{"title":"History and Clinical Examination at a Glance, 3E [StormRG]","uid":10939170,"size":28693956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:015806997fe656715a04927e8225666bd63ba070&amp;dn=History+and+Clinical+Examination+at+a+Glance%2C+3E+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"0xmovva","files":2,"time":1409482435,"description":"Author: Jonathan Gleadle \nPaperback: 232 pages\nPublisher: Wiley-Blackwell; 3 edition (January 30, 2012)\nLanguage: English\nISBN-10: 0470654465\nISBN-13: 978-0470654460\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nEvery medical student must be able to take an accurate history and perform a physical examination. This third edition of History and Clinical Examination at a Glance provides a concise, highly illustrated companion to help you develop these vital skills as you practice on the wards. Building on an overview of the patient/doctor relationship and basic enquiry, the text supports learning either by system or presentation of common conditions, with step-by-step and evidence-based information to support clinical examination and help you formulate a sound differential diagnosis.\nHistory and Clinical Examination at a Glance features:\n\nSuccinct text and full colour illustrations, including many brand new clinical photographs\nA new section on the development of communication skills, which explains how to communicate in different circumstances, and with different groups of people\nA self-assessment framework which can be used individually, by tutors, or in group practice to prepare for OSCEs\n\nHistory and Clinical Examination at a Glance is the perfect guide for medical, health science students, and junior doctors, as an ideal resource for clinical attachments, last-minute revision, or whenever you need a refresher.","torrent":{"xt":"urn:btih:015806997fe656715a04927e8225666bd63ba070","amp;dn":"History+and+Clinical+Examination+at+a+Glance%2C+3E+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015806997fe656715a04927e8225666bd63ba070","infoHashBuffer":{"type":"Buffer","data":[1,88,6,153,127,230,86,113,90,4,146,126,130,37,102,107,214,59,160,112]},"announce":[],"urlList":[]}}