{"title":"JJ Grey and Mofro - Georgia Warhorse [2010][EAC,log,cue. FLAC]","uid":8340644,"size":331366680,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:01a45183f081866a4812f86b659ee6a4a063e152&amp;dn=JJ+Grey+and+Mofro+-+Georgia+Warhorse+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dickspic","files":14,"time":1365092984,"description":"Artist: JJ Grey &amp; Mofro\nRelease: Georgia Warhorse\nDiscogs: 3559352\nReleased: 2010-08-24\nLabel: Alligator Records\nCatalog#: AL 4938\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Blues, Rock, Electric Blues\n\nTracklisting:\n\n01. Diyo Dayo (3:58)\n02. King Hummingbird (6:57)\n03. The Sweetest Thing (4:28)\n04. All (4:26)\n05. Georgia Warhorse (5:44)\n06. Gotta Know (6:04)\n07. Hide &amp; Seek (3:45)\n08. Beautiful World (4:01)\n09. Slow, Hot &amp; Sweaty (4:37)\n10. The Hottest Spot In Hell (4:03)\n11. Lullaby (4:55)\n\nMaybe number five is the charm? Not that JJ Grey and his ever evolving backing band Mofro care. But it's possible that Georgia Warhorse may be the record that pulls them from the glorified cult status they've enjoyed for a decade into the lights on the mainstream's fringes -- but don't count on it. Grey's music is far too real; too poetically, sonically, and atmospherically rooted in vintage Southern soul, rock and blues traditions to translate readily into radio fodder. Georgia Warhorse (named for a tenacious and resilient species of grasshopper) contains 11 new originals, recorded at Jim DeVito's Retrophonics Studio in St. Augustine -- as were all four previous albums. The music is steeped in funky, greasy, slippery Southern R&amp;B, blues and rock. The backbone slipping slow-grind funk of &quot;Diya Dayo&quot; opens the set with a wailing harmonica, a chunky single string vamp and a Howlin' Wolf meets Stax chorused refrain. Grey changes it up immediately with two ballads, the first of which, the seven-minute &quot;King Hummingbird,&quot; is one of the most beautiful things here. It drips with raw, laidback swamp soul. (Chris Robinson would give his eye teeth to have written, let alone sung, it.) &quot;The Sweetest Thing&quot; features the signature voice of Toots Hibbert, Grey's greatest influence after Otis Redding. With a Muscle Shoals-styled horn chart, the pair take a midtempo ballad and mold it into a sensual, simmering love song. The title track is a gritty blues eco-manifesto from the grasshopper's point of view. &quot;Slow, Hot &amp; Sweaty,&quot; introduced by a Rhodes piano, is representative of its title and scorches with its brazenly sexual heat. &quot;The Hottest Spot in Hell,&quot; is the most uptempo thing here, an overtly bluesly rocker. But Grey's deep ringing baritone pulls from Memphis soul rather than Southern Rock. The B3 twsts in your gut and the snare breaks pop in your spine. The set closes with &quot;Lullaby,&quot; featuring guest Derek Trucks. It commences slowly, a shimmering soul number; but it morphs into a crescendo of blues, trancelike drums, wide-open horns and chanted vocals that bring the album down around the listener. Georgia Warhorse, like each of its its predecessors, is another giant step forward in terms of its craft and quality. It will no doubt find the space in our culture that yet remains for music that's as authentic as the ground under your feet, because that's where it comes from -- just before it moves, simply and directly, through the body of the listener, into the human heart.","torrent":{"xt":"urn:btih:01a45183f081866a4812f86b659ee6a4a063e152","amp;dn":"JJ+Grey+and+Mofro+-+Georgia+Warhorse+%5B2010%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01a45183f081866a4812f86b659ee6a4a063e152","infoHashBuffer":{"type":"Buffer","data":[1,164,81,131,240,129,134,106,72,18,248,107,101,158,230,164,160,99,225,82]},"announce":[],"urlList":[]}}