{"title":"Star Command Galaxies (Alpha 4)","uid":11899888,"size":540097189,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:01f9774122ca263764d2715a72223e699d7e8d3c&amp;dn=Star+Command+Galaxies+%28Alpha+4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Lamasu","files":1,"time":1431279351,"description":"Star Command Galaxies is the next chapter in Star Command coming out in 2015 for Windows, Mac and Linux. Take control of a Starship in a randomly generated galaxy where players can build their own ship, hire and level up their own crew, explore alien planets on away team missions and battle other alien ships.\n\nStar Command Galaxies began development after the Android release of Star Command on mobile devices. The team at Warballoon wanted to build a much larger, more expansive and less linear version of the game. The focus was on replayability - the universe was never the same twice. The team more than doubled in size and a new engine was chosen, Unity, to bring Galaxies to life. Virtually every element of Star Command mobile was examined and reimagined, from the tiles to the way players built ships. The result is a game that is more than 5x larger than the original. \n\nFeatures:\n- Randomly generated galaxy for your crew to explore.\n- Build a ship in your own vision, from the hull to the Antorian paintings on the wall.\n- Explore procedurally generated planets with your crew on away team missions.\n- Build bars, holodecks, crew quarters and other rooms to keep your crew alive and happy!\n- Battle alien vessels and customize your ship to be a sleek scout or massive battleship.\n\nNote: This is a Windows-only version.\n\nIf the default volume is too low, feel free to change it in the settings.\n\nIf you like the game, support the developer, buy it! &lt;a href=&quot;\nhttp://www.starcommandgalaxies.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.starcommandgalaxies.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:01f9774122ca263764d2715a72223e699d7e8d3c","amp;dn":"Star+Command+Galaxies+%28Alpha+4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01f9774122ca263764d2715a72223e699d7e8d3c","infoHashBuffer":{"type":"Buffer","data":[1,249,119,65,34,202,38,55,100,210,113,90,114,34,62,105,157,126,141,60]},"announce":[],"urlList":[]}}