{"title":"Secrets Hidden in the films of Stanley Kubrick","uid":6764435,"size":686188382,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0204f69d8aafcca945175f6cc7ddd5def693550e&amp;dn=Secrets+Hidden+in+the+films+of+Stanley+Kubrick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"rosie1966","files":2,"time":1319318980,"description":"Kubrick's Odyssey: Secrets Hidden in the films of Stanley Kubrick\n\nPart One: Kubrick and Apollo\n\nThis provocative and insightful film is the first in a series of documentaries that will reveal the secret knowledge embedded in the work of the greatest filmmaker of all time: Stanley Kubrick. This famed movie director who made films such as 2001: A Space Odyssey, A Clockwork Orange, The Shining and Eyes Wide Shut, placed symbols and hidden anecdotes into his films that tell a far different story than the films appeared to be saying. In Kubrick's Odyssey, Part I, Kubrick and Apollo, author and filmmaker, Jay Weidner presents compelling evidence of how Stanley Kubrick directed the Apollo moon landings. He reveals that the film, 2001: A Space Odyssey was not only a retelling of Arthur C. Clarke and Stanley Kubrick's novel, but also a research and development project that assisted Kubrick in the creation of the Apollo moon footage. In light of this revelation, Weidner also explores Kubrick's film, The Shining and shows that this film is, in actuality, the story of Kubrick's personal travails as he secretly worked on the Apollo footage for NASA.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0204f69d8aafcca945175f6cc7ddd5def693550e","amp;dn":"Secrets+Hidden+in+the+films+of+Stanley+Kubrick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0204f69d8aafcca945175f6cc7ddd5def693550e","infoHashBuffer":{"type":"Buffer","data":[2,4,246,157,138,175,204,169,69,23,95,108,199,221,213,222,246,147,85,14]},"announce":[],"urlList":[]}}