{"title":"Set Adrift Upon the World: The Sutherland Clearances","uid":15749282,"size":8361988,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:021f4344f6c8d15a6783bfd68e17d1f0f9844ded&amp;dn=Set+Adrift+Upon+the+World%3A+The+Sutherland+Clearances&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"marty14","files":1,"time":1473012229,"description":"Set Adrift Upon the World: The Sutherland Clearances - James Hunter [epub]\r\n\r\nThey would be better dead, they said, than set adrift upon the world. But set adrift they were – thousands of them, their communities destroyed, their homes demolished and burned. Such were the Sutherland Clearances, an extraordinary episode involving the deliberate depopulation of much of a Scottish county.\r\n\r\nWhat was done in the course of that episode was planned and carried out by a small group of men and one woman. Most of those involved wrote a great deal about their actions, intentions and feelings, and much of it has been preserved. There are no equivalent collections of material from those whose communities ceased to exist. Their feelings and fears are harder to access, but they are by no means irrecoverable.\r\n\r\nIn this book James Hunter tells the story of the Sutherland Clearances. His researches took him to archives in Scotland, England and Canada, to the now deserted straths of Sutherland, to the frozen shores of Hudson Bay. The result is a gripping, moving, definitive account of a people’s struggle for survival in the face of tragedy and disaster which includes experiences which have not featured in any previous such account","torrent":{"xt":"urn:btih:021f4344f6c8d15a6783bfd68e17d1f0f9844ded","amp;dn":"Set+Adrift+Upon+the+World%3A+The+Sutherland+Clearances","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"021f4344f6c8d15a6783bfd68e17d1f0f9844ded","infoHashBuffer":{"type":"Buffer","data":[2,31,67,68,246,200,209,90,103,131,191,214,142,23,209,240,249,132,77,237]},"announce":[],"urlList":[]}}