{"title":"An Introduction to Cognitive Psychology: Processes and Disorders","uid":12692809,"size":7923690,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0293e6991565f19fee1a81b9a634bc7f0e33697f&amp;dn=An+Introduction+to+Cognitive+Psychology%3A+Processes+and+Disorders&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"NoctDeath","files":2,"time":1446700375,"description":"Title: An Introduction to Cognitive Psychology: Processes and Disorders \r\nAuthor: David Groome \r\nFormat: PDF \r\nHardcover: 496 pages \r\nPublisher: Psychology Press; 3 edition (February 21, 2014) \r\nLanguage: English \r\nISBN: 9781848720923 \r\n\r\n\r\nDavid Groome with Nicola Brace, Graham Edgar, Helen Edgar, Michael Eysenck, Tom Manly, Hayley Ness, Graham Pike, Sophie Scott, and Elizabeth Styles.\r\n\r\nAn Introduction to Cognitive Psychology: Processes and Disorders is a comprehensive introductory textbook for undergraduate students. The third edition of this well-established text has been completely revised and updated to cover all the key areas of cognition, including perception, attention, memory, thinking and language. Uniquely, alongside chapters on normal cognitive function, there are chapters on related clinical disorders (agnosia, amnesia, thought disorder and aphasia) which help to provide a thorough insight into the nature of cognition.\r\n\r\nKey features:\r\n\r\n- Completely revised and updated throughout to provide a comprehensive overview of current thinking in the field\r\n- Accessibly written and including new authors, including Sophie Scott, Tom Manly, Hayley Ness, and Elizabeth Styles, all established experts in their field\r\n- A new chapter on Emotion and Cognition, written by Michael Eysenck, the leading authority in the field \r\n- Greater coverage of neuropsychological disorders, with additional material from the latest brain imaging research that has completely revolutionized neuropsychology\r\n- Specially designed textbook features, chapter summaries, further reading, and a glossary of key terms\r\n- A companion website featuring an extensive range of online resources for both teachers and students.\r\n\r\nWritten to cover all levels of ability using helpful figures and illustrations, An Introduction to Cognitive Psychology has sufficient depth to appeal to the most able students while the clear and accessible text, written by experienced teachers, will help students who find the material difficult. It will appeal to any student on an undergraduate psychology degree course, as well as to medical students and those studying in related clinical professions such as nursing","torrent":{"xt":"urn:btih:0293e6991565f19fee1a81b9a634bc7f0e33697f","amp;dn":"An+Introduction+to+Cognitive+Psychology%3A+Processes+and+Disorders","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0293e6991565f19fee1a81b9a634bc7f0e33697f","infoHashBuffer":{"type":"Buffer","data":[2,147,230,153,21,101,241,159,238,26,129,185,166,52,188,127,14,51,105,127]},"announce":[],"urlList":[]}}