{"title":"The Profit Season 2 HDTV 720p","uid":13256987,"size":19389589542,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:029526dc47d0f213e9e95ffa35606043d7d9e0e1&amp;dn=The+Profit+Season+2+HDTV+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"theprofittpb","files":18,"time":1453226347,"description":"Marcus Lemonis is &quot;The Profit&quot; and will do whatever it takes to fix a failing business--hire people, fire people and spend his own money.\r\n\r\nStarring: Marcus Lemonis \r\nOriginal air date: December 16, 2014\r\n\r\n1. Athans Motors\r\nPete Athans sank his entire life savings into a high-end used car dealership that's short on profits. Marcus will either be the driving force he needs, or this business will crash and burn.\r\n\r\n2. A. Stein Meat Products\r\nMarcus Lemonis visits A. Stein Meat Products, a second-generation business run by two lifelong friends. Last year, this $50 million-a-year meat wholesaler somehow managed to lose $400,000.\r\n\r\n3. Michael Sena's Pro-Fit\r\nMichael and Tina Sena have a great little gym right outside of Chicago. And while they help clients shed weight, they can't seem to figure out how to build a healthy profit.\r\n\r\n4. WorldWideTrailer Sales, Inc.\r\nA trailer business in Tampa, FL specializing in food concessions is being driven into the ground by two owners in a toxic partnership who compete for control.\r\n\r\n5. Skullduggery\r\nBrothers Steve &amp; Peter Koehl run Skullduggery, a toy, craft kit, and fossil replica company owned by their father. Despite sales of $1.6 million last year, they can't seem to turn a profit.\r\n\r\n6. Sweet Pete's\r\nPeter &amp; Allison Behringer are candy makers who run Sweet Pete's in Jacksonville, FL. Their product is excellent, but their business is failing and has yet to turn a profit.\r\n\r\n7. Amazing Grapes Wine Store\r\nA couple of wine connoisseurs in Orange Country turn their passion of collecting fine wines into a business that unfortunately has never been profitable.\r\n\r\n8. Key West Key Lime Pie\r\nKey West Key Lime Pie Company is a true rags-to-riches culinary story, having grown from a roadside stand. Even after grossing an impressive $1.4 million a year, it didn't turn a profit.\r\n\r\n9. Courage B\r\nTempers boil over at Courage b, a family-run clothing company, when Marcus Lemonis pushes for his biggest transformation yet. Nicolas blames his mother for dragging the company into the red.\r\n\r\n10. Artistic Stitch\r\nHanging by a thread, an embroidery and silk screening company in Queens, NY, is about to close its doors forever after the owner borrowed way beyond his means to expand his business.\r\n\r\n11. Swanson's Fish Market\r\nSwanson's Fish Market is a successful second-generation business is drowning in debt after a devastating fire. As more details begin to surface, Marcus realizes he may be in over his head.\r\n\r\n12. Unique Salon &amp; Spa\r\nA Long Island salon owner burned by her ex-partner can't get to the root of her business problems. If Marcus can't help Carolyn move on from her past, Unique Salon &amp; Spa may close for good.\r\n\r\n13. West End Coffee Company\r\nInside The West End Coffee Company, friction is brewing between the co-owners. Can Marcus help the partners and ex-lovers get the business back in the green?\r\n\r\n14. Coopersburg Sports\r\nCoopersburg Sports is a sports and novelty business in desperate need of help. Will Marcus Lemonis be able to help them stay in the game?\r\n\r\n15. Shuler's BBQ\r\nA popular family-run BBQ restaurant in the tranquil town of Latta, SC, is about to go up in smoke if Marcus Lemonis can't help them in time.\r\n\r\n16. ASL Sign Sales &amp; Service\r\nA know-it-all sign shop owner goes head-to-head with Marcus Lemonis in Surfside Beach, South Carolina. Later, Marcus makes a surprise visit to a business from Season 1.\r\n\r\n17. My Big Fat Greek Gyro\r\nIn Pittsburgh, PA, the owners of My Big Fat Greek Gyro, a Greek sandwich shop chain, have failing franchisees about to revolt...and Marcus might just be too late.\r\n\r\n18. A Progress Report\r\nMarcus checks in with businesses from Season 1 and 2, such as Athans Motors, WorldWide Trailer Sales, Inc., Mr. Green Tea, Michael Sena's Pro-Fit, and Sweet Pete's","torrent":{"xt":"urn:btih:029526dc47d0f213e9e95ffa35606043d7d9e0e1","amp;dn":"The+Profit+Season+2+HDTV+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"029526dc47d0f213e9e95ffa35606043d7d9e0e1","infoHashBuffer":{"type":"Buffer","data":[2,149,38,220,71,208,242,19,233,233,95,250,53,96,96,67,215,217,224,225]},"announce":[],"urlList":[]}}