{"title":"The Invention of Germany (BBC Radio 4 Documentary)","uid":6790734,"size":39628408,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:02c9ffa6569382dacbf385fe43fc157905178a52&amp;dn=The+Invention+of+Germany+%28BBC+Radio+4+Documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"fakeplastictrousers2","files":-1,"time":1320254101,"description":"The Invention of Germany\n\nFrom BBC Radio 4. Presented by Misha Glenny.\n\nA three part history of Germany before the world wars, revealing how weak and fragmented it used to be.\n\nGermany as we understand it, unified and strong, only came into existence a mere 140 years ago. Before then? Well there was Bavaria and Prussia, Saxony, Baden Wurttemberg, Pomerania, Westfalia, Schleswig Holstein. This list is extremely long. And defining where one bit ended and the next began - well, it was utterly bewildering.\n\nPart 1:\n\nThe series starts with the siege of Magdeburg of 1631, when a city the size of Paris was burnt to the ground. The events of the Thirty Years War hugely influenced later German nationalists, as Swedes, French, Danish, Spanish and huge numbers of Scottish mercenaries rampaged through the area we now call Germany.\n\nPart 2:\n\nIn this second programme, Misha Glenny explores the rise of Prussia - from Frederick the Great in 1740 to humiliation by Napoleon in 1806. He discovers a state far removed from the images of Iron Crosses, spiked helmets and officious bureaucrats of popular imagination. It is Prussia that will eventually create modern Germany, but first there are several myths to dispel.\n\nPart 3:\n\nIn 1871, at the Palace of Mirrors in Versailles, the king of Prussia was crowned emperor of the newly unified German empire - a quite staggering event.\n\nTravelling from the great areas of conflict - Alsace Lorraine in the west to Konnigratz in the east - Misha Glenny brings to life moments in European history that have huge resonance today.","torrent":{"xt":"urn:btih:02c9ffa6569382dacbf385fe43fc157905178a52","amp;dn":"The+Invention+of+Germany+%28BBC+Radio+4+Documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02c9ffa6569382dacbf385fe43fc157905178a52","infoHashBuffer":{"type":"Buffer","data":[2,201,255,166,86,147,130,218,203,243,133,254,67,252,21,121,5,23,138,82]},"announce":[],"urlList":[]}}