{"title":"Mastering Autodesk Inventor 2010 - (Malestrom)","uid":5143797,"size":18232896,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03366bd9a69606b569f40e35b7f199b7bd45d7ab&amp;dn=Mastering+Autodesk+Inventor+2010+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1257102214,"description":" &lt;a href=&quot;http://bayimg.com/GAeMEAACk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/GAeMEAACk&lt;/a&gt;\n\n\nCurtis Waguespack, &quot;Mastering Autodesk Inventor 2010&quot;\nSybex | 2009 | ISBN: 0470478306 | 816 pages | PDF\n\nA complete tutorial for the real-world application of Autodesk Inventor, plus video instruction on DVD\n\nUsed to design everything from airplanes to appliances, Autodesk Inventor is the industry-leading 3D mechanical design software. This detailed tutorial and reference covers practical applications to help you solve design problems in your own work environment, allowing you to do more with less.\n\nIt also addresses topics that are often omitted from other guides, such as Inventor Professional modules, design tactics for large assemblies, using 2D and 3D data from other CAD systems, and a detailed overview of the Inventor utility tools such as Design Assistant and Task Scheduler that you didn't even know you had.\n\n* Teaches the most popular 3D mechanical design software in the context of real-world workflows and work environments\n* Provides an overview of the Inventor 2010 ribbon Interface, Inventor design concepts, and advanced information on productivity-boosting and visualization tools\n* Offers crucial information on data exchange, including SolidWorks, Catia, Pro-E, and others.\n* Shares details on documentation, including exploded presentation files, simple animations, rendered animations and stills with Inventor Studio, and sheet metal flat patterns\n* Covers Inventor, Inventor Professional, and Inventor LT\n* Includes a DVD with before-and-after tutorial files, a search able PDF of the book, innovative video tutorials for each chapter, and more\n\nMastering Autodesk Inventor teaches you to get the most from the software and provides a reference to help you on the job, allowing you to utilize the tools you didn't even know you had to quickly achieve professional results.\n","torrent":{"xt":"urn:btih:03366bd9a69606b569f40e35b7f199b7bd45d7ab","amp;dn":"Mastering+Autodesk+Inventor+2010+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03366bd9a69606b569f40e35b7f199b7bd45d7ab","infoHashBuffer":{"type":"Buffer","data":[3,54,107,217,166,150,6,181,105,244,14,53,183,241,153,183,189,69,215,171]},"announce":[],"urlList":[]}}