{"title":"Sexually Broken--Krissy Lynn bound and throat trained","uid":11679400,"size":869173847,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:03f31249cd27efb2db643c9c9185e72cb04ce5fa&amp;dn=Sexually+Broken--Krissy+Lynn+bound+and+throat+trained&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"merzedes","files":1,"time":1423011375,"description":"Busty porn star Krissy Lynn bound and throat trained, roughly fucked by hard cock! | Krissy Lynn | Matt Williams | Maestro \n\nJanuary 30, 2015\n\n\nHigh MP4 only.\n\n\nBubblebutted throat slut used hard in both holes by big dick \n\nBusty bubblebutted Krissy Lynn is here for one thing and one thing only. To be used from both ends by big cock until she can not get her eyes uncrossed. Her body and her holes are built for hard rough sex and we are going to put them through their paces. Today Krissy finds out exactly what Sexuallybroken means. She is in for the ride of her life.\n\nBlindfolded and handcuffed is the warmup, cutting off her vision and reducing her to a mouth hole for dick. We simply walk right up and make use of todays mouth hole. To make sure she can not cheat we add in a wooden tongue trap to prevent her pushing the cock out. Poor little Krissy is not used to having no way out, and she struggles uselessly against her cuffs.\n\nEnough warm up. We throw our dazed and drooling slut over a stool and get down to the main course, stuffing her full of dick from both ends. Krissy moans in helpless pleasure as the dicks turn her into a sex sandwich. The cuffs keeps her firmly in place, she can not escape the dick. Her only option is to surrender to her fate, and surrender she does as she cums all over the hard cock buried deep inside her.\n\nBy the time we have had our fill, our bubble butted porn star is draped over the fuck stool like a wet rag, unable to even lift her head up as drool pours out of her well used mouth. This is what getting hit by the cock truck looks like. Welcome back to Sexuallybroken my dear... \n\n\n\nUploaded by Merzedes and Shallow2\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n  \n\nCheers  :-)","torrent":{"xt":"urn:btih:03f31249cd27efb2db643c9c9185e72cb04ce5fa","amp;dn":"Sexually+Broken--Krissy+Lynn+bound+and+throat+trained","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03f31249cd27efb2db643c9c9185e72cb04ce5fa","infoHashBuffer":{"type":"Buffer","data":[3,243,18,73,205,39,239,178,219,100,60,156,145,133,231,44,176,76,229,250]},"announce":[],"urlList":[]}}