{"title":"Age of Empires III: The Asian Dynasties (Mac)","uid":4530597,"size":654062161,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:041fa68e1eaa5f61f5bff38f58a321865eed6c9f&amp;dn=Age+of+Empires+III%3A+The+Asian+Dynasties+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"brukerdose","files":16,"time":1227542713,"description":"Product Features\n\n    * Playable Asian Civilizations - Command one of three fierce Asian civilizations - the \nIndians, the Chinese or the Japanese each with its own unique armies led by powerful \nwarrior Monks, Daimyo, Mansabdars and other special units\n    * Single Player Campaigns - Play through three new mini campaigns with new heroes \nand villains\n    * New Ways to Play - With the addition of Wonders of the world and the new Export \nresource, Age of Empires III - The Asian Dynasties injects an intriguing level of depth to \nexisting Age of Empires III strategy. If used wisely, these new features can mean the \ndifference between rousing a victory or a humiliating defeat.\n    * An Immersive World - Explore an exotic Asian setting over 11 new Random Maps, \nthree new Home Cities, and interactions with new native civilizations, all while battling \nopponents in new game modes, including King of the Hill, Regicide, and Treaty No-\nBlockade.\n    * 15 monumental Asian Wonders\n\n\nProduct Description\n\nExperience firsthand the rich and historical influences of Asia while commanding units and \nexpanding your empire in the Eastern world. In Age of Empires III: The Asian Dynasties, \nthree new campaigns?comprised of 15 new scenarios?tell stories of Asian struggle during \nsome of the most pivotal moments in history. In 15th century China, an immense \ntreasure fleet aims to expand the influence of the Ming Dynasty to distant shores. When a \npower hungry admiral sends the ships adrift into seas unknown, the voyage takes an \nunexpected turn...to the west. In 16th century Japan, a loyal general leads the armies of \nhis adopted father, Tokugawa Ieyasu, in a bid to seize power. But as the greater war \nrages, a surprising revelation ignites an unexpected internal struggle that must be won \nbefore the epic Battle of Sekigahara. In 19th century India, a soft-spoken lieutenant in \nthe pay of the British East India Company can endure the foreign occupiers no longer, and \ntakes up arms against his superiors.\n\n\nSystem Requirements\n\n    * Full version of Age of Empires III required\n    * Mac OS X version 10.3.9\n    * 1.2GHz PowerPC G4 or Intel processor (faster processor may be necessary for online\n multi-player, depending on the number of combatants)\n    * 512MB of RAM\n    * 64MB video RAM (Intel GMA graphics supported)\n    * Broadband Internet access required for online multiplayer\n\n\nInstructions\n\nMount Image with Toast, and install.\nTo play, keep dmg image mounted with Roxio Toast until a crack is produced.","torrent":{"xt":"urn:btih:041fa68e1eaa5f61f5bff38f58a321865eed6c9f","amp;dn":"Age+of+Empires+III%3A+The+Asian+Dynasties+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"041fa68e1eaa5f61f5bff38f58a321865eed6c9f","infoHashBuffer":{"type":"Buffer","data":[4,31,166,142,30,170,95,97,245,191,243,143,88,163,33,134,94,237,108,159]},"announce":[],"urlList":[]}}