{"title":"Dusan Makavejev - W.R.- Mysteries of the Organism (1971)","uid":3545173,"size":734519296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:048486a4c15e316818bdf90f29e719f21bf488d9&amp;dn=Dusan+Makavejev+-+W.R.-+Mysteries+of+the+Organism+%281971%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"kegir","files":1,"time":1161727036,"description":"Yugoslavian Title: W.R. - Misterije organizma\nEnglish Title: W.R. - Mysteries of the Organism\nDirector: Dusan Makavejev\nYear: 1971\nLanguage: Serbo-Croatian\nSubtitles: English (hardsubs)\n\nFile Name .............: W.R.-Mysteries.of.the.Organism.1971.Dusan.Makavejev.VHS.DivX511.engsub.avi\nFile Size (in bytes) ..: 734,519,296 bytes\nRuntime (# of frames) .: 01:23:53 (120676 frames)\n\nVideo Codec ...........: DivX 5.0\nFrame Size ............: 640x480 () [=] [=1.333]\nFPS ...................: 23.976\nVideo Bitrate .........: 1028 kb/s\nBits per Pixel ........: 0.140 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[N-VOP]...[]...[GMC]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 131 kb/s [2 channel(s)] VBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\nSourse: VHS (quality is OK and you want find this on DVD)\n\n\nPlot Synopsis from allmovie.com\n\n&quot;W.R.&quot; is pioneering sexologist Wilhelm Reich, whose precedent-breaking theories concerning carnal behavior and politics made him persona non grata in most Eastern European scientific circles. Even as late as 1971, Reich&amp;#039;s notions could bring down the wrath of censors and bluenoses, and this indeed was the fate of Yugoslav filmmaker Dusan Makavejev&amp;#039;s WR: Mysteries of the Organism. Makavejev elucidates the Reichian mindset via interviews with the doctor&amp;#039;s relatives and colleagues (we even hear from Reich&amp;#039;s barber!) Also illustrated is the ongoing conflict between the free-thinking disciples of W.R.&amp;#039;s sociopolitical attitudes and the adherents of sterile Stalinism. As it turned out, Reich ended up in jail in the United States, providing a golden opportunity for Makavejev to interview such American sexual liberationists as the Screw magazine editor and Betty Dodson. Woven into the factual proceedings is a fictional plotline concerning the romance between Reich adherent Milena and uptight Soviet athlete Vladimir Ilyich. Though the film was never released in Makavejev&amp;#039;s native Yugoslavia, WR: Mysteries of the Organism firmly established the iconoclastic filmmaker&amp;#039;s international reputation.\nHal Erickson\n\nReview from allmovie.com\n\nOf the numerous films of the late &amp;#039;60s and early &amp;#039;70s that positively gloried in the sexual revolution and the release of social shackles on free expression in general, WR: Mysteries of the Organism is one of the most ambitious, most confused, and downright weirdest. It was also one of the most controversial, its numerous nude sex scenes and frank dialog about masturbation and sexual stimulation ensuring both substantial audiences and outcries from guardians of morality. Still, its audaciousness and radicalism invite both admiration and irritation. On the one hand, it&amp;#039;s a bold attempt to mix sexuality and radical politics, with nonlinear intercutting between documentary-style footage (shot in America) and a fictional surreal subplot (shot in Yugoslavia) involving young actors. On the other, however, it&amp;#039;s an awkward blend that sometimes seems to be several incomplete films jammed into one, with none of the threads allowed fullest exposition. The U.S. documentary sections often (but not always) focus on the life of Wilhelm Reich, the psychoanalyst whose theories (particularly related to sexual behavior) spurred government censorship. While what&amp;#039;s onscreen is certainly intriguing, there&amp;#039;s not enough of a context for those unfamiliar with Reich to grasp what his work was all about, though some of the ancillary American scenes are rich in both anti-establishment stance and crude humor. In one, the editor of Screw magazine gets his private part plaster-cast, and in others, Tuli Kupferberg is seen romping around the streets of New York in ludicrous military regalia while &quot;Kill for Peace&quot; (by his legendary rock group the Fugs) plays on the soundtrack. More memorable, perhaps, are the sequences of the fictional Yugoslavian film-within-the-film, where the actors sometimes have full-frontal nudity intercourse with abandon, but also where the female lead lobbies for sexual freedom and Socialist political revolution to reconcile with each other. That could have been dryly didactic, but it&amp;#039;s done with absurd theatricalism, particularly in the film&amp;#039;s highlight, where the heroine delivers a speech advocating free love from a balcony to her fellow tenants in the midst of a dreary apartment building. Anti-authoritarian protest and criticism against social and moral institutions of both the West and the East run rampant throughout a film that&amp;#039;s memorable for the giddiness of its taboo-busting (and the sheer oddity of much of its imagery), yet in other ways is an incoherent mess.\nRichie Unterberger\n\nThanks to hellboytr for the upload at KG\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;\n","torrent":{"xt":"urn:btih:048486a4c15e316818bdf90f29e719f21bf488d9","amp;dn":"Dusan+Makavejev+-+W.R.-+Mysteries+of+the+Organism+%281971%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"048486a4c15e316818bdf90f29e719f21bf488d9","infoHashBuffer":{"type":"Buffer","data":[4,132,134,164,193,94,49,104,24,189,249,15,41,231,25,242,27,244,136,217]},"announce":[],"urlList":[]}}