{"title":"Inception The Shooting Script(epub){Zzzzz}","uid":11404125,"size":2991724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:050e819ec6044fd60ee92812ece8b68c10e25948&amp;dn=Inception+The+Shooting+Script%28epub%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"zombie_rox","files":1,"time":1415456025,"description":"Product Description\nInception, writer-director Christopher Nolan's seventh feature film, joins the epic scope of The Dark Knight with the narrative sophistication of Memento. The story of a group of thieves who specialize in invading the mind through one's dreams, Inception explores the Nolan's signature psychological themes of memory, paranoia, and self-doubt as the protagonist, Dom Cobb, is pitted against a hostile subconscious spurred on by personal demons and regrets from the past. In a conversational preface, Nolan discusses with brother and frequent collaborator, Jonah, the genesis of the idea for the film and the decade-long process it took to write it. Detailing the results of Nolan's efforts, Inception: The Shooting Script includes key storyboard sequences, full-color concept art, and an appendix on the workings of the mysterious Pasiv Device that Cobb and his fellow extractors use to initiate the dream-share. An exclusive exploration of a highly original concept, Inception: The Shooting Script is the record of a writer-director at the height of his craft.\n\nPublisher: Insight Editions, Div of Palace Publishing Group, LP (27 August 2010)\nLanguage: English\nISBN-10: 1608870154\nISBN-13: 978-1608870158\n\nMost Helpful Customer Reviews\n\na TON of thought went into this book. 7 August 2010\nBy Nanker Phelge -\nthis book goes above and beyond. it features the amazing, multi-layered and completely readable script by christopher nolan. however, it also has storyboards, full credits for the film, an excellent preface and a PASIV device instruction manual. The PASIV device (better known as the dream machine) &quot;instruction manual&quot; is amazing and fun to look at. it's also very intricate and detailed. this book is really an essential purchase for anyone who wants to look deeper into the masterpiece that INCEPTION is. i think its one of the best published scripts i've ever bought.\n\nVery Very Good, but not exactly what you see in the movie 7 August 2010\nBy Jianjing Zhang -\nSince I watched Inception for the third time two weeks ago, I've been waiting for this, because really there's some dialogue I did not capture in the theatre\n\nThis is the book I wanted, reading this just like reading a novel without getting bored. It is probably the best script I've read since Batman Begins, also by Nolan\n\nSome original concept arts are included along with a interesting dream machine manual\n\nSome of the scenes in the movie are not included in this script (one example is in the final kick back scenes where in the movie, there are lots of cuts from different levels, but in this script, it is much simpler), and some of the dialogues are slightly different, actually I think Nolan added some additional scenes in the movie just in order that the audience are more easily to catch up the plot.\n\nA highly readable screenplay, that lets you plunge even deeper into the dream (or may provide the &quot;kick&quot; you need to wake up!) 20 December 2010\nBy Nathan Andersen -\nCobb is a dream thief, hired by powerful bigwigs as a kind of corporate spy to ferret out trade secrets, not by sneaking into offices and tapping phones; rather, his job is to infiltrate the mind while the victim sleeps, and find a way to tap into his or her subconscious. He used to be the best, but now it turns out his deep-seated guilt at a past misdeed is coming back to haunt him in his dreams even as the real life consequences of his past are catching up with him while awake.\n\nThe movie's intense, and keeps your mind racing while you're sitting on the edge of your seats. The screenplay reads extremely well, and has much of the same page-turning intensity - but gives you time to reflect on the precise plot and dialogue lines. There are a few scenes in here that were cut out of the movie - and I can see why, because they are always dialogue heavy scenes, explaining the mechanisms of extraction and inception or showing early stages of the planning that went into the heist into Fischer's mind. While they might have slowed down the story on screen, they do clarify things quite a bit, especially a couple of scenes in which Eames and Cobb and Arthur are discussing how and why they need to implant the idea of breaking up his father's company in 3 different stages.\n\nThere's an intriguing interview between Chris Nolan and his brother Jonathan about the initial inception of Inception, and there are several storyboarded scenes. There's also what looks like a professional instruction manual for the intravenous dream device (that they carry around in a shiny suitcase). Highly recommended for lovers of the movie - it's always illuminating to read the screenplay of a film you've seen and enjoyed, and this screenplay is extremely readable. I've read several, but I found this one to be not only intriguing but fun. (The last time I couldn't put down a screenplay once I'd started was when I read Tarantino's initial script for Inglourious Basterds.)\n\nA Must Have if you Loved the Movie 10 October 2010\nBy Nerd -\nThis book is the perfect takeaway if you loved the film like I did. It contains the complete shooting script (there is no novelization), a chapter of concept art, an extensive interview with Nolan about the creative development and themes in the film, storyboards, and a mock operating manual for the PASIV dream device. All in all this is an amazing find for less than $20, and you end up appreciating the film even more. Nolan deserves the Oscar for best screenplay","torrent":{"xt":"urn:btih:050e819ec6044fd60ee92812ece8b68c10e25948","amp;dn":"Inception+The+Shooting+Script%28epub%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"050e819ec6044fd60ee92812ece8b68c10e25948","infoHashBuffer":{"type":"Buffer","data":[5,14,129,158,198,4,79,214,14,233,40,18,236,232,182,140,16,226,89,72]},"announce":[],"urlList":[]}}