{"title":"Encyclopedia of the American Revolution by Boatner (History US)","uid":11779206,"size":272784443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0518ec4023676710c184db48bdcaeb1a593a4bd6&amp;dn=Encyclopedia+of+the+American+Revolution+by+Boatner+%28History+US%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":1,"time":1427485220,"description":"Encyclopedia of the American Revolution\nDavid McKay Company | 1966 | English | 1318 pages | PDF | 260 MB\n\nThis book is a handy reference for the Revolution. It is jam-packed with valuable information, trivia, references, and wisdom that is seldom found in an encyclopedia-type volume. Written for the researcher in mind, this book is invaluable. This volume is highly recommended, and it is useful, and quite literally, indispensable for the serious student.\n\n*I first became aware of Mr. Boatner's work over ten years ago when I purchased his book, &quot;The Civil War Dictionary&quot;. This book was indispensable in my writting and researching of the Civil War. His work is acurate, consise, and ballanced. When I turned my efforts to the Revolutionary War and learned Mr. Boatner had a book that covered this war, it went to the top of my list of a must have reference books on the Revolutionary War. When I received it I was not disappointed. Mr. Boatner turned in another quality piece of work. I was very surprised that the Revolutionary volume was over 300 pages bigger than the Civil War volume. There is also a better index and more cross references for to help one find the specfic topic your looking for. This is not a fluff book with a lot of pictures. In fact there are no pictures, just a lot of facts on every aspect of the war, the battles, places, and people on all sides who participated. There a lot of maps and organizational charts to help visualize these facts. If your are serious about learning about the Revolutionary War, this book is a must for you home or town library.\n\nAmazon","torrent":{"xt":"urn:btih:0518ec4023676710c184db48bdcaeb1a593a4bd6","amp;dn":"Encyclopedia+of+the+American+Revolution+by+Boatner+%28History+US%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0518ec4023676710c184db48bdcaeb1a593a4bd6","infoHashBuffer":{"type":"Buffer","data":[5,24,236,64,35,103,103,16,193,132,219,72,189,202,235,26,89,58,75,214]},"announce":[],"urlList":[]}}