{"title":"The Buccaneers of America","uid":15741216,"size":1747330,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0571cf702eda481b532150a39813f4b582442c3c&amp;dn=The+Buccaneers+of+America&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"marty14","files":1,"time":1472915295,"description":"The Buccaneers of America by Alexander O. Exquemelin\r\n\r\nA cross between genuine privateers, commissioned to defend a country's colonies and trade, and outright pirates, buccaneers were largely English, French, and Dutch adventurers who plied the waters among the Caribbean Islands and along the coasts of Central America, Venezuela, and Colombia more than 300 years ago. The activities of these bands of plundering sea rovers reached a peak in the second half of the seventeenth century, when this remarkable eyewitness account was first published (1678).\r\n\r\nAlexander Exquemelin, thought to be a Frenchman who enlisted with the buccaneers for a time, chronicles the bold feats of these raiders as they ravaged shipping and terrorized Caribbean settlements. Exquemelin provides fascinating details of the French presence in Hispaniola (now comprising the island nations of Haiti and the Dominican Republic) describes the features of that country and its inhabitants, and comments at length on the origin of the buccaneers, vividly recounting their rules of conduct and way of life. These bold plunderers come across as shrewd strategists, crack shots, fine navigators, wild debauchers, and greedy adventurers who frequently engaged in vicious acts of cruelty. Among the figures in his rogues' gallery, none stands out more than the infamous Henry Morgan, whose exploits culminated in the seizure and burning of Panama City.\r\n\r\nA bestseller in its own time, The Buccaneers of America will fascinate any modern reader intrigued by piracy and by the often sordid history of European conflicts in the Caribbean and on the Spanish Main","torrent":{"xt":"urn:btih:0571cf702eda481b532150a39813f4b582442c3c","amp;dn":"The+Buccaneers+of+America","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0571cf702eda481b532150a39813f4b582442c3c","infoHashBuffer":{"type":"Buffer","data":[5,113,207,112,46,218,72,27,83,33,80,163,152,19,244,181,130,68,44,60]},"announce":[],"urlList":[]}}