{"title":"Camilo Jose Cela - Nobel Prize in Literature, 1989 (3 books)","uid":13869000,"size":9763085,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0602b4825f286329084d4d6bde7474d969004d53&amp;dn=Camilo+Jose+Cela+-+Nobel+Prize+in+Literature%2C+1989+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":10,"time":1458085038,"description":"\nCAMILO JOSÉ CELA (1916-2002) was a Spanish novelist, short story writer and essayist associated with the Generation of '36 movement.  He was awarded the 1989 Nobel Prize in Literature &quot;for a rich and intensive prose, which with restrained compassion forms a challenging vision of man's vulnerability.&quot;\r\n\r\nHis first novel, THE FAMILY OF PASCUAL DUARTE (1942), was deemed too violent and crude for the Spain of the 1940s, which was in the early stages of General Franco's long dictatorship, and in less than a year it was banned.  It contains themes of extreme realism and existentialism in which the characters live on the margins of society and their lives are submersed in anguish and pain.  The protagonist, Pascual Duarte, has trouble finding validity in conventional morality and commits a number of crimes, including murders, for which he feels nothing.  The novel is now often cited as having breathed new life into Spanish literature in the years immediately following the bloody 1936-39 civil war.\r\n\r\nTHE HIVE (1950), also banned for many years by the Franco regime, presents a panoramic view of the degredation and suffering of the lower-middle class in post-Civil War Spain.  Cela's typical style -- a sarcastic, often grotesque, form of realism -- is exemplified here.  Readers are introduced to more than 300 characters through a series of starkly rendered interlocking vignettes, transforming this book from a social document into a towering work of inventive fiction.  Filled with violence, hunger, and compassion, the novel captures the ambitions and constraints of life under a dictatorship.\r\n\r\nJOURNEY TO THE ALCARRIA (1948) is the best known of the &quot;vagabundajes&quot;, Cela's term for his books of travels, in which he wanders from village to village, through farms and along country roads in the mountainous region northeast of Madrid, in search of the Spanish character.  It has been described as &quot;the most celebrated Spanish travelogue of all times.&quot;\r\n\r\nFinally, this collection includes Cela's Nobel Prize acceptance speech and a 1996 interview with Paris Review.\r\n\r\n\r\nThe following texts are in PDF format (Pascual Duarte is also in ePUB):\r\n\r\n* &quot;The Art of Fiction, No. 145&quot; (Paris Review, Summer 1996).  Interview by Valerie Miles.\r\n\r\n* Eulogy to the Fable: The Nobel Prize Lecture (Nobel Foundation, 1989).  Translated by Mary Penney.\r\n\r\n* The Family of Pascual Duarte (Little Brown, 1964).  Translated by Anthony Kerrigan.  Scan courtesy of @pharmakate. -- PDF + ePUB\r\n\r\n* The Hive (Noonday, 1965).  Translated by J.M. Cohen and Arturo Barea.\r\n\r\n* Journey to the Alcarria: Travels Through the Spanish Countryside (Atlantic Monthly, 1990).  Translated by Frances M. Lopez-Morillas.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                        \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:0602b4825f286329084d4d6bde7474d969004d53","amp;dn":"Camilo+Jose+Cela+-+Nobel+Prize+in+Literature%2C+1989+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0602b4825f286329084d4d6bde7474d969004d53","infoHashBuffer":{"type":"Buffer","data":[6,2,180,130,95,40,99,41,8,77,77,107,222,116,116,217,105,0,77,83]},"announce":[],"urlList":[]}}