{"title":"Road Redemption v25.11.2015","uid":12859286,"size":1862955222,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0632b88317ebed0fda1ce8cce00622bef7a4ad29&amp;dn=Road+Redemption+v25.11.2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"dauphong","files":1,"time":1448717710,"description":"Lead your motorcycle gang on an epic journey across the country in this brutal driving combat adventure.\r\n\r\nEarn money by completing races, assassinations, robberies, and other challenges in your path. As you collect loot, you'll upgrade your character, your bike, and your weapons.\r\n\r\nOne Life To Live\r\n\r\nDriving a motorcycle at 100 mph while trying to hit someone with a pipe is dangerous, and death can come quickly. There are no extra lives nor continues. Fortunately, every time you die, all the experience you've collected can be used to upgrade your character, your bike, and your weapons.\r\n\r\nIn the multiplayer mode, you can work with your friends or fight against them. It's up to you.\r\n\r\nA Truly Epic Quest\r\n\r\nRoad Redemption takes place in a post-apocalyptic America, ruled by a brutal dictator. Without telling anyone, your gang leader has decided to head to the capital on a desperate assassination attempt. When the government catches him, the consequences for your gang, and everyone you know and love, will be devastating.\r\n\r\nIt's up to you and your fellow gang members to race across hundreds of miles of dangerous highways in order to track down your derelict leader before the government does. What you do next is up to you. Do you try to stop him in order to protect your family and friends from punishment, or do you join him in a risky attempt at ending the oppression once and for all?","torrent":{"xt":"urn:btih:0632b88317ebed0fda1ce8cce00622bef7a4ad29","amp;dn":"Road+Redemption+v25.11.2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0632b88317ebed0fda1ce8cce00622bef7a4ad29","infoHashBuffer":{"type":"Buffer","data":[6,50,184,131,23,235,237,15,218,28,232,204,224,6,34,190,247,164,173,41]},"announce":[],"urlList":[]}}