{"title":"Der ewige Jude - The Eternal Jew (with english subs)(1940)","uid":4677976,"size":819232516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06bef9c5b0f334fc2c63b8a3e66cf0b38e05d12e&amp;dn=Der+ewige+Jude+-+The+Eternal+Jew+%28with+english+subs%29%281940%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"red_gonzo","files":1,"time":1232970356,"description":"This is the controversial and highly antisemitic nazi propaganda film Der ewige Jude - The Eternal Jew (1940) which assumes the central thesis of being the immutable racial personality traits that, according to Nazi doctrine, characterize the Jew as a wandering cultural parasite. Done in the style of a documentary it consists of feature and documentary footage combined with materials filmed shortly after the Nazi occupation of Poland. At this time Poland's Jewish population was about three million, roughly ten percent of the total population. Its title in german is Der ewige Jude, the german term for the character of the &quot;Wandering Jew&quot; in medieval folklore. A British film of the same name had been produced in 1934 but unlike the later Nazi film, it portrayed the Jews in a favorable light as the victims of unjustified persecution throughout history, by the likes of the Inquisition. The later Goebbels film appears to be have been intended as a violently anti-Semitic version of this previous British film. Throughout the movie Aryan men are shown to find satisfaction in physical labor and the creation of value and Jews are depicted as finding pleasure in money and a hedonist lifestyle. While members of the Aryan race live healthily, rich Jews are shown as living in bug-infested and dirty homes, even though they could afford better. The footage to convey this was actually captured in ghettos, where living conditions were very poor and unsanitary surroundings were virtually inevitable. While Germanic/Nordic man has an appreciation for Northern culture and imagery, Jews are alleged only to find satisfaction in the grotesque and decadent. Many things that run contrary to Nazi doctrine are associated with Jewish influence, such as modern art, cultural relativism, anarchic and socialist movements, as well as sexual liberation. The film criticizes Jewish religious practices and criticises kosher slaughtering (shechita) in which animals bleed to death, as inhumane, contrasting it with Nazi laws requiring that animals be anaesthetized prior to slaughter. One of the shots early in the film shows a pack of rats emerging from a sewer, juxtaposed with a crowd of Jews in a bustling Polish street. Close-ups of individuals show sickly, malformed facial features. The narration explains how as rats are the vermin of the animal kingdom, Jews are the vermin of the human race and similarly spread disease and corruption. Unlike rats, however, the narrator continues, Jews have the uncanny ability to change their appearance and blend into their &quot;human hosts.&quot; A scene depicts four bearded men in traditional Jewish costume, then shows them shaved and in modern business suits, while the narrator explains that only a &quot;trained eye&quot; can distinguish their Jewish features. Jews were filmed as they actually lived and worked in Poland in 1940. Jewish history, religion, society, cultural tendencies and business practices are explored. Their ritual-slaughter section has some of the most horrifying scenes ever filmed. 65 min. Note: English subtitles are hardcoded into the movie.\n\nVideo specs:\nVideo codec: divx, 736x560, 1501 kbps\nAudio codec: mp3, 48kHz, Stereo\n","torrent":{"xt":"urn:btih:06bef9c5b0f334fc2c63b8a3e66cf0b38e05d12e","amp;dn":"Der+ewige+Jude+-+The+Eternal+Jew+%28with+english+subs%29%281940%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06bef9c5b0f334fc2c63b8a3e66cf0b38e05d12e","infoHashBuffer":{"type":"Buffer","data":[6,190,249,197,176,243,52,252,44,99,184,163,230,108,240,179,142,5,209,46]},"announce":[],"urlList":[]}}