{"title":"The Secret Sex Life of a Single Mom [Epub &amp; PDF] [StormRG]","uid":10442411,"size":1867473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06ce362a4528a766492d3b0b45d3d4e556610569&amp;dn=The+Secret+Sex+Life+of+a+Single+Mom+%5BEpub+%26amp%3B+PDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"krystine","files":-1,"time":1403908314,"description":"The Secret Sex Life of a Single Mom\nAuthor: Delaine Moore\nPublished: 2012\nPublisher: Seal Press\nISBN: 9781580053860\nFormat: Retail Epub and PDF\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nPDF-Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nFor seven years, Delaine Moore devoted herself to being the perfect wife and stay-at-home mom to her three kids. But when betrayal and infidelities plough through her life, she suddenly finds herself in a new role: 37 years old, going through a divorce, and thrown into a single-hood she has no idea how to navigate. Amidst her emotional turmoil, her long-dormant libido rouses to show her the way.\n\nThe Secret Sex Life of a Single Mom is the raw, funny and empowering story of the physical and spiritual self-discovery that results from Moore's sexual awakening. Connecting with a fiery, daring side of her personality that has been subsumed by motherhood and marriage, Moore gradually steps further and further outside of her confined identity and sexual boundaries. From online dating and attending a sex club to traveling out of country to explore BDSM with a Dominant, Moore tests her limits, regains ownership of her body, and takes full control of her life. More than the story of a woman's breaking and remaking after divorce, The Secret Sex Life of a Single Mom is a humorous, thoughtful exploration of what it means to be a woman and a sexual being, be she a mom, wife, girlfriend, or divorcee. It also serves as a reminder that when life slams you down, a little fire won't burn you -- it will awaken you.\n","torrent":{"xt":"urn:btih:06ce362a4528a766492d3b0b45d3d4e556610569","amp;dn":"The+Secret+Sex+Life+of+a+Single+Mom+%5BEpub+%26amp%3B+PDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ce362a4528a766492d3b0b45d3d4e556610569","infoHashBuffer":{"type":"Buffer","data":[6,206,54,42,69,40,167,102,73,45,59,11,69,211,212,229,86,97,5,105]},"announce":[],"urlList":[]}}