{"title":"Shakespeare's Globe Theatre As You Like It (2009) produced by Op","uid":8564054,"size":1466278776,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:06f8ff230751c63358ac8b91c341aa039e54c9b2&amp;dn=Shakespeare%27s+Globe+Theatre+As+You+Like+It+%282009%29+produced+by+Op&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"loninappleton","files":2,"time":1370957937,"description":"Shakespeare's Globe Theatre As You Like It  (2009)\nan Opus Arte Production\n\nIMDb  tt1710532/\n\nruntime 2hr 26 min\n\nDirector:  Thea Sharrock\nWriter:    William Shakespeare (play)\n\nCredits Camera supervisor, Andrew Watt ;\n        Composer, Stephen Warbeck.\n\nNotes \tDVD release of the 2009 motion picture\n\nOverview:\n\n As You Like It (Shakespeare's Globe Theatre)\n\n    Director:\n    Kriss Russmann\n\n    Cast:\n    Brendan Hughes,\n    Naomi Frederick,\n    Laura Rogers,\n    Dominic Rowan\n\nThe legendary Shakespeare's Globe Theater mounted this production of Shakespeare's romantic comedy As You Like It] in 2009, with a cast that includes Brendan Hughes as Duke Frederick, Naomi Frederick as Rosalind and Ganymede, Jack Laskey as Orlando, Laura Rogers as Celia and Aliena, and Dominic Rowan as Touchstone. Dick Bird designed the sets and Thea Sharrock directs for the stage, with choreography by Fin Walker.\n\nWiki description edited:\n\nAs You Like It is a pastoral comedy by William Shakespeare believed to have been written in 1599 or early 1600 and first published in the First Folio, 1623. The play's first performance is uncertain, though a performance at Wilton House in 1603 has been suggested as a possibility. As You Like It follows its heroine Rosalind as she flees persecution in her uncle's court, accompanied by her cousin Celia and Touchstone the court jester, to find safety and eventually, love, in the Forest of Arden. Historically, critical response has varied, with some critics finding the work of lesser quality than other Shakespearean works and some finding the play a work of great merit.\n\nThe play features one of Shakespeare's most famous and oft-quoted speeches, &quot;All the world's a stage&quot;, and is the origin of the phrase &quot;too much of a good thing&quot;. The play remains a favourite among audiences and has been adapted for radio, film, and musical theatre.\n\nMy notes\n\n   There is another torrent of this Opus Arte release in circulation.  However in viewing it I saw several (about 6) major glitches where a repetition of video occurs.\n  \n   This torrent is made from the original dvd and I have not seen that those glitches are on it.  Therefore this new release should be free of defects from recoding As You Like It.  \n   The descriptions above are dry in comparison to the actual experience of the \nperformance which includes a wrestling match,  and music composed for the songs contained in the play.  Music composition  has been done for many Shakespeare productions which contain song but none I've heard match these in style execution and wit.\n\n\n  Consult the Globe Theatre site for new releases.\n \n  As always I encourage the world audience for these torrents to acquire the actual dvd's for their libraries. And please also note that like The Met Opera, The Globe Theater supports movie theatre performances of the works.\n\n\n  Notes compiled June 10th  2013\n   ","torrent":{"xt":"urn:btih:06f8ff230751c63358ac8b91c341aa039e54c9b2","amp;dn":"Shakespeare%27s+Globe+Theatre+As+You+Like+It+%282009%29+produced+by+Op","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06f8ff230751c63358ac8b91c341aa039e54c9b2","infoHashBuffer":{"type":"Buffer","data":[6,248,255,35,7,81,198,51,88,172,139,145,195,65,170,3,158,84,201,178]},"announce":[],"urlList":[]}}