{"title":"Agatha Christie (Partners in Crime series) DivX - moviesbyrizzo","uid":6084812,"size":5004086595,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:077d7ecb9b514b2e8864ae7ba5eaf29f339e5b81&amp;dn=Agatha+Christie+%28Partners+in+Crime+series%29+DivX+-+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"moviesbyrizzo","files":-1,"time":1294276866,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0080336&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0080336&lt;/a&gt;\n\nAgatha Christie's Tommy and Tuppence &quot;Partners in Crime Series&quot; is fun\nfor those that enjoy polite British culture with a light air of frivolity\nwhile going about an apparently serious business.\n\nWe found these videos at a private site on the net, and discovered that\ntwo episodes were at a lower res from the remain bath - and were of an\nolder Xvid codec variant that didn't play on our new disc player. We therefore\nconverted the entire lot to DivX for you at mainly 640 X 480 (as original) with 1000k bitrate - except for two episodes in the bath (separate folder) that were lower res (382 X 288 with 718k bitrate) as I indicated. Audio is set to 128k on all.\n\nThis series isn't for everyone, you've gotta be a British fan to enjoy them.\nThen again the benefits of immersing yourself in British culture s that it invariably leads to an improved idea of civility and sensibility in articulation as well as Christianly idealism and romanticism too.\n\nI watched the entire series first decades ago before returning to University.\nIt was of course all on VHS tape back then, from the only British video store in\nthe town back then.\n\nAnyways, its a nice detective series that is a nice enough quality if you\nmainly want to enjoy the benefits of having the program in any event - rather\nthan the very best we could do - although please stay tuned to announcements\nof an HD version for you perhaps too, which I would be happy to provide as soon\nas is practicable to do - just as we plan two offerings in the Upstairs\nDownstairs series too for DivX vs HD - both!\n\nWe are seeding our Rumpole series - so please do join in - we have developed some\nseeds recently and enough may hopefully choose to stay as we add to the list of\ncompletions here too! Our Maigret offering is also nice, so please join in here\ntoo! We are also re-seeding all the Michael Rizzo Chessman karaoke series soon\nThanks to all that are on the job now (as we have been too recently to some \nextent!) The 3.62GB zip file vrsion of the 5.11GB collection (its posted at the\npiratebay) is a great one to get in on especially!)\n\n\nThanks and good luck with your seeding efforts on British content especially!\n\n\nMichael Rizzo Chessman\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:077d7ecb9b514b2e8864ae7ba5eaf29f339e5b81","amp;dn":"Agatha+Christie+%28Partners+in+Crime+series%29+DivX+-+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"077d7ecb9b514b2e8864ae7ba5eaf29f339e5b81","infoHashBuffer":{"type":"Buffer","data":[7,125,126,203,155,81,75,46,136,100,174,123,165,234,242,159,51,158,91,129]},"announce":[],"urlList":[]}}