{"title":"Introduction to Petroleum Engineering","uid":15964791,"size":6549074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:079b51f49206a927897a28201bb837baffebda07&amp;dn=Introduction+to+Petroleum+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1475717208,"description":"Introduction to Petroleum Engineering - John R. Fanchi, Richard L. Christiansen (Wiley, 2017).pdf\r\n\r\nPresents key concepts and terminology for a multidisciplinary range of topics in petroleum engineering\r\n\r\nFor the foreseeable future, oil and gas will continue to be a key source of energy for a global energy infrastructure that is designed to use fossil energy, and petroleum engineering will continue to be an essential skill set for providing the oil and gas needed to fuel the global economy.     \r\n\r\nIntroduction to Petroleum Engineering introduces people with technical backgrounds to petroleum engineering. The book presents fundamental terminology and concepts from geology, geophysics, petrophysics, drilling, production and reservoir engineering. It covers upstream, midstream, and downstream operations. Exercises at the end of each chapter are designed to highlight and reinforce material in the chapter, and encourage the reader to develop a deeper understanding of the material. Introduction to Petroleum Engineering features:\r\n\r\nAn introduction to all of the key concepts that are needed to understand oil and gas production from exploration through abandonment\r\nReviews of fundamental terminology and concepts from geology, geophysics, petrophysics, drilling, production and reservoir engineering\r\nThe role of oil and gas production in the global energy mix\r\nWorked examples in each chapter illustrate key concepts\r\nExercises at the end of each chapter highlight and reinforce material in the chapter\r\nThe material in Introduction to Petroleum Engineering will be a valuable resource for people with science and engineering backgrounds who would like to learn more about the engineering technology needed to produce oil and gas.\r\n\r\nJohn R. Fanchi holds the Ross B. Matthews Chair of Petroleum Engineering at Texas Christian University in Fort Worth, Texas. He has taught at the Colorado School of Mines, and has industrial experience with major oil and gas companies including Chevron and Marathon. He is a Distinguished Member of the Society of Petroleum Engineers.\r\n\r\nRichard L. Christiansen has taught Petroleum Engineering at the University of Utah and Colorado School of Mines. He has broad industrial experience as a petroleum engineer in independent and major oil and gas companies. He has a Ph.D. in chemical engineering from the University of Wisconsin","torrent":{"xt":"urn:btih:079b51f49206a927897a28201bb837baffebda07","amp;dn":"Introduction+to+Petroleum+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"079b51f49206a927897a28201bb837baffebda07","infoHashBuffer":{"type":"Buffer","data":[7,155,81,244,146,6,169,39,137,122,40,32,27,184,55,186,255,235,218,7]},"announce":[],"urlList":[]}}