{"title":"The University Of Google By Tara Brabazon (Abee)","uid":9149273,"size":1572026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0818bebee805252f342e3b1350ac9b141789c925&amp;dn=The+University+Of+Google+By+Tara+Brabazon+%28Abee%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"The_Abee","files":3,"time":1383656796,"description":"The University Of Google By Tara Brabazon (Abee)\n___\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41JJVkyoaWL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41JJVkyoaWL.jpg&lt;/a&gt;\n\nAbout:\n__\n\nLooking at schools and universities, it is difficult to pinpoint when education, teaching and learning started to haemorrhage purpose, aspiration and function. Libraries and librarians have been starved of funding. Teachers cram their curriculum with 'skill development' and 'generic competencies' because knowledge, creativity and originality are too expensive to provide to unmotivated students and parents obsessed with league tables, not learning.Meanwhile, the internet offers a glut of information on everything-under-the-sun, a mere mouse-click away. Bored surfers fill their cursors and minds with irrelevancies. We lose the capacity to sift, discard and judge. Information is no longer for social good, but for sale.Tara Brabazon argues that this information fetish has been profoundly damaging to our learning institutions and to the ambitions of our students and educators. In &quot;The University of Google&quot;, she projects a defiant and passionate vision of education as a pathway to renewal, where research is based on searching and students are on a journey through knowledge, rather than consumers in the shopping centre of cheap ideas.Angry, humorous and practical in equal measure, &quot;The University of Google&quot; is based on real teaching experience and on years of engaged and sometimes exasperated reflection on it. It is far from a luddite critique of the information age. Tara Brabazon celebrates the possibilities of digital platforms in education, but deplores the consequences of placing funding on technology and not teachers. In doing so, she opens a new debate on how to make our educational system both productive and provocative in the (post-) information age.\n\nAbout the Author:\n__\n\nTara was born in Perth, Western Australia in 1969. She is an award winning teacher, speaker and writer. Best known for her books on popular culture and online education, her goal is to challenge assumptions about teaching and learning. Tara is interested in discovering the voices and views of those silenced through traditional history. For her, popular culture carries a trace - a lipstick trace - of the passions, stories and ideas of disempowered communities. \n\n\nHardcover: 240 pages\nPublisher: Ashgate (November 20, 2007)\nLanguage: English\nISBN-10: 075467097X\nISBN-13: 978-0754670971\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t\t\n\n\t\t\t\t","torrent":{"xt":"urn:btih:0818bebee805252f342e3b1350ac9b141789c925","amp;dn":"The+University+Of+Google+By+Tara+Brabazon+%28Abee%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0818bebee805252f342e3b1350ac9b141789c925","infoHashBuffer":{"type":"Buffer","data":[8,24,190,190,232,5,37,47,52,46,59,19,80,172,155,20,23,137,201,37]},"announce":[],"urlList":[]}}