{"title":"Big Think Strategy: How to Leverage Bold Ideas and Leave Small T","uid":6483375,"size":10359907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0853ed82db7154acb96b4db2badf267d37eb2722&amp;dn=Big+Think+Strategy%3A+How+to+Leverage+Bold+Ideas+and+Leave+Small+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MANTESH","files":3,"time":1308613424,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51up1qe8q1L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51up1qe8q1L.jpg&lt;/a&gt;\n\n\n\n[\n\n\nBig Think Strategy: How to Leverage Bold Ideas and Leave Small Thinking Behind\n\n\n\nPublisher: Harvard Business School Press \nBernd H. Schmitt\n2007 \nEnglish\nISBN: 1422103218 \n188 Pages\nPDF \n9.87 MB\n\n\n\n\nBusiness leaders need bold strategies to stay relevant and win. In Big Think Strategy, Schmitt shows how to bring bold thinking into your business by sourcing big ideas and executing them creatively. With the tools in this book, any leader can overcome institutionalized small think the inertia, the narrow-mindedness, and the aversion to risk that block true innovation. Your reward? Big, bold, and decidedly doable strategies that excite your employees and leave your rivals scrambling.\n\nDrawing on years of advising corporate leaders on creativity and strategy development, Schmitt explains how to infuse fresh thinking into the planning process. Through his commentary on the Trojan War, the film Fitzcarraldo, and the composer Gustav Mahler, Schmitt uncovers the essence of bold leadership and the levers of revolutionary change. Abundant examples from Apple, Whole Foods, MySpace, IBM, General Electric, the Metropolitan Opera, and the Bill and Melinda Gates Foundation to name a few, show big think strategy in action.\n\nTested by daring executives in a diverse range of industries, the practical ideas and tools in this book will help you leverage bold ideas in your strategic planning and position your firm uniquely for lasting market relevance and success.\n\nAbout the Author\nBernd H. Schmitt is a professor at Columbia Business School in New York. His best-selling books, including Customer Experience Management, have been published in 16 languages worldwide. Schmitt advises senior executives on strategy, creativity, and innovation.\n\n\n\n[/color][/quote][/b]","torrent":{"xt":"urn:btih:0853ed82db7154acb96b4db2badf267d37eb2722","amp;dn":"Big+Think+Strategy%3A+How+to+Leverage+Bold+Ideas+and+Leave+Small+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0853ed82db7154acb96b4db2badf267d37eb2722","infoHashBuffer":{"type":"Buffer","data":[8,83,237,130,219,113,84,172,185,107,77,178,186,223,38,125,55,235,39,34]},"announce":[],"urlList":[]}}