{"title":"Heartless Bastards - Arrow [2012][EAC,log,cue. FLAC]","uid":8250447,"size":365490682,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:089614470a4c7836d6988efb3c10269d44d831ea&amp;dn=Heartless+Bastards+-+Arrow+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dickspic","files":14,"time":1363155306,"description":"Artist: Heartless Bastards\nRelease: Arrow\nDiscogs: 3432033\nReleased: 2012\nLabel: Partisan Records\nCatalog#: PTKF2101CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Rock, Rock &amp; Roll\n\nTracklisting:\n\n01. Marathon (6:10)\n02. Parted Ways (4:58)\n03. Got To Have Rock And Roll (3:55)\n04. Only For You (5:08)\n05. Simple Feeling (4:34)\n06. Skin And Bone (4:00)\n07. The Arrow Killed The Beast (6:31)\n08. Late In The Night (3:59)\n09. Low Low Low (5:03)\n10. Down In The Canyon (7:36)\n\n\nThe Heartless Bastards never got tagged as the next saviors of rock'n'roll, although they certainly possess all the relevant traits: a strong grounding not in blues but in blues rock, a conservative aesthetic that nods to rock history but is never beholden to any one particular artist or scene, and most importantly a frontwoman with a commanding voice. Perhaps their name was too misleading or their lineup too precarious, but the Bastards escaped the mantle that's been assigned to everyone from the Strokes to the Black Keys and most recently to the Alabama Shakes. If that has left them out of enviable company, at least they've managed to attract a loyal audience and even star in a crucial &quot;Friday Night Lights&quot;.\nTheir first for Partisan Records, Arrow is their crunchiest album since Erika Wennerstrom gutted the original trio in 2008 and rebuilt the Bastards as a quartet. Largely discarding the fiddle, pedal steel, and banjo that fleshed out 2009's The Mountain, the band and producer Jim Eno of Spoon strip things down to emphasize guitars and the rhythm section as much as vocals. They open these songs up, both enabling a heavier sound and making room for some weighty jamming. The result is less fussy than The Mountain, with room enough for some Skynyrd Southern rock on &quot;Late in the Night&quot; and Santana percussion on &quot;Skin and Bone&quot;. They've developed a larger musical vocabulary, but the results can be cumbersome: With timpani and crackling guitar right out of a Morricone soundtrack, the nearly seven-minute centerpiece &quot;The Arrow Killed the Beast&quot; is more melodramatic than dramatic, weighted down by import and exaggerated ambience.\nPerhaps the Bastards have begun courting the rock-revivalist constituency on Arrow. &quot;Whenever you need a pick-me-up, you gotta have gotta have rock'n'roll,&quot; Wennerstrom sings on &quot;Got to Have Rock and Roll&quot;. Despite the dry classic-rock riff and chugging momentum, the song makes for a tepid endorsement. &quot;Skin and Bone&quot; is much less corny, as Wennerstrom sings, &quot;Oh, I want it to be like when I was young.&quot; She may not be speaking specifically about rock'n'roll, but that line succinctly sums up listeners' evolving relationship with music and a desperate desire to connect as strongly as we did in our youth. Most of the Bastards songs address travel rather than age, which is how most touring bands interpret the write-what-you-know adage. &quot;Staring out at the city skyline, a marathon is going down the street,&quot; Wennerstrom sings on opener &quot;Marathon&quot;. The song is about how life is a &quot;long race home,&quot; and dangling participle aside, it's an immensely awkward image to open the album.\nWennerstrom has always been a fairly workmanlike songwriter, although her voice and her band compensate when words fail her. The lyrics on Arrow are best when they settle for serviceable instead of strive for profound, and the line that resonates with the most meaning is also the one of the simplest: &quot;Oh I got you on my mind,&quot; she sings throughout &quot;Late in the Night&quot;, and the romantic implications become clearer and bolder with each repetition. It helps that the Bastards play loud and hard enough to nearly drown out her vocals, reveling in the musical as well as the sexual tension. That's arguably more rock'n'roll than another song about rock'n'roll.","torrent":{"xt":"urn:btih:089614470a4c7836d6988efb3c10269d44d831ea","amp;dn":"Heartless+Bastards+-+Arrow+%5B2012%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089614470a4c7836d6988efb3c10269d44d831ea","infoHashBuffer":{"type":"Buffer","data":[8,150,20,71,10,76,120,54,214,152,142,251,60,16,38,157,68,216,49,234]},"announce":[],"urlList":[]}}