{"title":"Historical Archaeology of Ancient Japan by Farris [Gumpynator]","uid":15533334,"size":2875959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:089855a604763dc4c910f63eaac3372372e74d7f&amp;dn=Historical+Archaeology+of+Ancient+Japan+by+Farris+%5BGumpynator%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gumpyn8r","files":1,"time":1470855651,"description":"Sacred Texts and Buried Treasures: Issues on the Historical Archaeology of Ancient Japan by William Wayne Farris (PDF)\r\n\r\nSacred Texts and Buried Treasures offers substantial new insights into early Japanese history (A.D. 100-800) through an integrated discussion of historical texts and archaeological artifacts. It contends that the rich archaeological discoveries of the past few decades permit scholars to develop far more satisfactory interpretations of ancient Japan than was possible when they were heavily dependent on written sources. This is evidenced in the four specific areas of inquiry on which the author focuses his study: the age-old question of Yamatai, the &quot;lost&quot; realms of the third-century Queen Himiko; the controversy over Japan-Korea relations between 350 and 700; the creation of capital cities during the age of apprenticeship to Chinese civilization between 645 and 800; and the appropriation of Chinese-style governing arrangements during the same era. Sacred Texts and Buried Treasures effectively illustrates how archaeology and history have mutually informed, guided, and revised each other's postwar research on ancient Japanese society. It synthesizes the enormous amount of data accumulated by postwar archaeologists, only a small portion of which has ever reached a Western audience","torrent":{"xt":"urn:btih:089855a604763dc4c910f63eaac3372372e74d7f","amp;dn":"Historical+Archaeology+of+Ancient+Japan+by+Farris+%5BGumpynator%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"089855a604763dc4c910f63eaac3372372e74d7f","infoHashBuffer":{"type":"Buffer","data":[8,152,85,166,4,118,61,196,201,16,246,62,170,195,55,35,114,231,77,127]},"announce":[],"urlList":[]}}