{"title":"Need for Speed Underground v1.2.51733 (1-click run)","uid":8182612,"size":878381994,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:08bffef689fd0a7ee0de1e802e066a54ccd5bb72&amp;dn=Need+for+Speed+Underground+v1.2.51733+%281-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"The_Duck1","files":-1,"time":1361656269,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from USB-Stick.\nThese are a few things that makes a '1-click run' version a, better version.\nYou can find uninstall information here: http://www.friendsinwar.com/information.php\n\nBUILD AND RACE THE FASTEST URBAN EXOTIC\nHit the streets in the world's most elite tuner cars, and take down the ultimate racers in your own customized machine. To own the streets, you'll have to risk it all in a variety of high-styling, high-speed events -- including Drift, Drag, and Circuit. Tune your car to perfection by winning hundreds of upgrade parts, then go underground for the most intense, addictive driving experience of your life. When it comes to speed, no other game comes close to delivering this kind of action. And while the need for speed is what keeps you coming back for more, custom looks are your ticket to scoring big with the crowds. You are what you drive in Need for Speed Underground.\n\nKEY FEATURES\n# Feel speed like never before. Graphics that obliterate the envelope and turbocharged physics make this the fastest gameplay experience ever.\n# Choose from 20 elite licensed tuner cars from Mitsubishi, Toyota, Subaru, and more.\n# Fully customize your car with hundreds of aftermarket parts from top-name manufacturers. Change your car's appearance to fit your personality, change its performance to fit your driving style.\n# Huge, highly detailed environments push your gaming hardware to the absolute limit as you battle to own the streets in your urban street machine.\n# Race hard and win upgrades, including weight reduction kits, turbo, suspension kits, tires, wheels, and nitrous.\n# Set the asphalt ablaze in a variety of game modes including Drift, Drag, and Circuit.\n# Go underground and become the ultimate street racer in the epic Story mode.\n# Build your ideal car, take it online, and take on the world's fastest competition.","torrent":{"xt":"urn:btih:08bffef689fd0a7ee0de1e802e066a54ccd5bb72","amp;dn":"Need+for+Speed+Underground+v1.2.51733+%281-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08bffef689fd0a7ee0de1e802e066a54ccd5bb72","infoHashBuffer":{"type":"Buffer","data":[8,191,254,246,137,253,10,126,224,222,30,128,46,6,106,84,204,213,187,114]},"announce":[],"urlList":[]}}