{"title":"Design and Construction of Nuclear Power Plants","uid":12014142,"size":3508859,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08c655368b081792ec1b1a9e2ed1afb311f6ee84&amp;dn=Design+and+Construction+of+Nuclear+Power+Plants&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1434278893,"description":"ISBN 9783433030424\n\nDespite all the efforts being put into expanding renewable energy sources, large-scale power stations will be essential as part of a reliable energy supply strategy for a longer period. Given that they are low on CO2 emissions, many countries are moving into or expanding nuclear energy to cover their baseload supply.\nBuilding structures required for nuclear plants whose protective function means they are classified as safety-related, have to meet particular construction requirements more stringent than those involved in conventional construction. This book gives a comprehensive overview from approval aspects given by nuclear and construction law, with special attention to the interface between plant and construction engineering, to a building structure classification. All life cycle phases are considered, with the primary focus on execution. Accidental actions on structures, the safety concept and design and fastening systems are exposed to a particular treatment.\n\nSelected chapters from the German concrete yearbook are now being published in the new English &quot;Beton-Kalender Series&quot; for the benefit of an international audience.\nSince it was founded in 1906, the Ernst &amp; Sohn &quot;Beton-Kalender&quot; has been supporting developments in reinforced and prestressed concrete. The aim was to publish a yearbook to reflect progress in &quot;ferro-concrete&quot; structures until - as the book's first editor, Fritz von Emperger (1862-1942), expressed it - the &quot;tempestuous development&quot; in this form of construction came to an end. However, the &quot;Beton-Kalender&quot; quickly became the chosen work of reference for civil and structural engineers, and apart from the years 1945-1950 has been published annually ever since","torrent":{"xt":"urn:btih:08c655368b081792ec1b1a9e2ed1afb311f6ee84","amp;dn":"Design+and+Construction+of+Nuclear+Power+Plants","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08c655368b081792ec1b1a9e2ed1afb311f6ee84","infoHashBuffer":{"type":"Buffer","data":[8,198,85,54,139,8,23,146,236,27,26,158,46,209,175,179,17,246,238,132]},"announce":[],"urlList":[]}}