{"title":"Historical Controversies and Revisionism - Collection 3","uid":9466446,"size":209504949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0aa4ce156c4111be3f93ecbd84e4778734d04013&amp;dn=Historical+Controversies+and+Revisionism+-+Collection+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"moman73","files":27,"time":1389464833,"description":"Historical Controversies and Revisionism - Collection 3:\n\n\t&quot;History is Written by the Victors.&quot; Winston Churchill\n\nAnd that explains why history books are often one-sided. This series of uploads attempt at exploring the other versions of history. We have 27 titles here:\n\n-  Banner - Being a Historian; an Introduction to the Professional World of History (2012)\n\n-  Beck - Miracles and Massacres; True and Untold Stories of the Making of America (2013)\n\n-  Butz - The Hoax Of The Twentieth Century; the Case Against The Presumed Extermination Of European Jewry (2003)\n\n-  Finkelstein - Beyond Chutzpah; On the Misuse of Anti-Semitism and the Abuse of History (2008)\n\n-  Finkelstein &amp; Mazar - The Quest For The Historical Israel; Debating Archaeology and the History of Early Israel (2007)\n\n-  Grant - Greek &amp; Roman Historians; Information and Misinformation (1995)\n\n-  Heartfield - Unpatriotic History of the Second World War (2012)\n\n-  Hobson - The Eastern Origins of Western Civilisation (2007)\n\n-  Hoffman et al (Eds.) - Major Problems in American History; Vol. II, Since 1865, 3e (2012)\n\n-  Kelley - Versions of History from Antiquity to the Enlightenment (1991)\n\n-  Knight (Ed.) - Conspiracy Theories in American History; an Encyclopedia (2003)\n\n-  Lewis (Ed.) - American Wilderness; a New History (2007)\n\n-  Loewenberg - Fantasy and Reality in History (1995)\n\n-  Madaras &amp; SoRelle - Taking Sides; Clashing Views in United States History, Vol. 1, the Colonial Period to Reconstruction, 15e (2013)\n\n-  Mandel - The Meaning of the Second World War (1986)\n\n-  McCullagh -The Truth of History (1998)\n\n-  Meltzer - History Decoded; the 10 Greatest Conspiracies of All Time (2013)\n\n-  Menzies &amp; Hudson - Who Discovered America; the Untold History of the Peopling of the Americas (2013)\n\n-  Oldridge - Strange Histories.. from the Medieval and Renaissance Worlds (2007)\n\n-  Post - Who Owns America's Past; the Smithsonian and the Problem of History (2013)\n\n-  Raddeker - Sceptical History; Feminist and Postmodern Approaches in Practice (2007)\n\n-  Ruiz - The Terror of History; On the Uncertainties of Life in Western Civilization (2011)\n\n-  Stinnett - Day of Deceit; the Truth about FDR and Pearl Harbor (2000)\n\n-  Stone &amp; Kuznick - The Untold History of the United States (2012)\n\n-  Turner - Making Prehistory; Historical Science and the Scientific Realism Debate (2007)\n\n-  Wheeler et al - Discovering the American Past; a Look at the Evidence, Vol. 1, to 1877, 7e (2012)\n\n-  Widmer (Ed.) - The New York Times Disunion; Modern Historians Revisit and Reconsider the Civil War.. (2013)\n\n","torrent":{"xt":"urn:btih:0aa4ce156c4111be3f93ecbd84e4778734d04013","amp;dn":"Historical+Controversies+and+Revisionism+-+Collection+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aa4ce156c4111be3f93ecbd84e4778734d04013","infoHashBuffer":{"type":"Buffer","data":[10,164,206,21,108,65,17,190,63,147,236,189,132,228,119,135,52,208,64,19]},"announce":[],"urlList":[]}}