{"title":"Hair High - Bill Plympton - 2004 - VOST FR","uid":4881438,"size":920898915,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b0dd42b7f9a3ebb4c200f0281205ad47d65db65&amp;dn=Hair+High+-+Bill+Plympton+-+2004+-+VOST+FR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"peeloo","files":1,"time":1241401100,"description":"From Booklist\n\nPlympton's nonstop-metamorphosizing animation is one of the crowning delights of independent animated film, and his determination to make his cartoons pretty much by his lonesome ensures high quality control: you see what he wants you to see. Unfortunately, independent animation distribution is spotty; Mutant Aliens (2000) presented continuity sketches for a feature film that, three years later, few have actually seen. Fortunately, Plympton's wackiness comes through strongly in storyboard form, so take in his new feature film via this book, and pray that the movie-distributing powers-that-be send it your way (double bill with Mutant Aliens--OK?). The story belongs to the high-school romance genre, with the brainy new kid, before his first day of school properly begins, falling afoul of the ruling football hero and being sentenced to be the big jock's girlfriend's &quot;slave&quot;--and DON'T fall in love with her! (Well, do, 'cause then jocko will have the pleasure of murdalizing you.) Guess what? Showing no compunctions about offing even major characters, Plympton blows a ton of high-school cliches into the stratosphere. Ray Olson\n\n====\n\nSynopsis\n\nRod, le quaterback, et Cherrie, la pin-up, forment Le couple que tous aiment, craignent et admirent au lycÃƒÂ©e d'Echo Lake. Lorsque Spud le nouveau, timide et maladroit, tente de s'attirer la sympathie de ses camarades il commet lÃ‚Â¹irrÃƒÂ©parable et provoque la colÃƒÂ¨re de Rod. Il devient alors l'esclave de Cherrie et devra satisfaire ses moindres dÃƒÂ©sirs. Ils se dÃƒÂ©testent aussitÃƒÂ´t. Mais Cherrie restera-t-elle aussi insensible que le croÃƒÂ®t Rod ? Et Spud se laissera-t-il ÃƒÂ©ternellement faire sans rien dire ? \n","torrent":{"xt":"urn:btih:0b0dd42b7f9a3ebb4c200f0281205ad47d65db65","amp;dn":"Hair+High+-+Bill+Plympton+-+2004+-+VOST+FR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b0dd42b7f9a3ebb4c200f0281205ad47d65db65","infoHashBuffer":{"type":"Buffer","data":[11,13,212,43,127,154,62,187,76,32,15,2,129,32,90,212,125,101,219,101]},"announce":[],"urlList":[]}}