{"title":"Allen W. Dulles - The Craft of Intelligence [EPUB]","uid":9937931,"size":2598564,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b8a4eb33810bdbfa0c9803c4b31ad668ff20a05&amp;dn=Allen+W.+Dulles+-+The+Craft+of+Intelligence+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"iipq","files":1,"time":1397181753,"description":"Original Title: The Craft of Intelligence: America's Legendary Spy Master on the Fundamentals of Intelligence Gathering for a Free World\nAuthor: Allen W. Dulles\nPublisher: Lyons Press; 1st edition (April 1, 2006)\nISBN 1592282970 \nISBN13: 9781592282975\nLanguage: English\n\n\nIf the experts could point to any single book as a source for understanding twentieth-century intelligence, that book would be Allen W. Dulles's The Craft of Intelligence. This classic of spycraft is based on Dulles's incomparable experience as a diplomat, international lawyer, and America's premier intelligence officer. Dulles was a high-ranking officer of the CIA's predecessor - the Office of Strategic Services - and served eight years as director of the newly created CIA.\nIn The Craft of Intelligence, Dulles reveals how intelligence is collected and processed, and how the results contribute to the formation of national policy. He discusses methods of surveillance and the usefulness of defectors from hostile nations. His knowledge of Cold War Soviet espionage techniques is unrivaled, and he explains how the Soviet State Security Service recruited operatives and planted &quot;illegals&quot; in foreign countries. In an account enlivened with a wealth of personal anecdotes, Dulles also addresses the Bay of Pigs incident, denying that the 1961 invasion was based on a CIA estimate that a popular Cuban uprising would ensue. He spells out not only the techniques of modern espionage but also the philosophy and role of intelligence in a free society threatened by global conspiracies.This is a book for readers who seek wider understanding of the contribution of intelligence to our national security.\n\nCover: http://d202m5krfqbpi5.cloudfront.net/books/1388187313l/375593.jpg","torrent":{"xt":"urn:btih:0b8a4eb33810bdbfa0c9803c4b31ad668ff20a05","amp;dn":"Allen+W.+Dulles+-+The+Craft+of+Intelligence+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b8a4eb33810bdbfa0c9803c4b31ad668ff20a05","infoHashBuffer":{"type":"Buffer","data":[11,138,78,179,56,16,189,191,160,201,128,60,75,49,173,102,143,242,10,5]},"announce":[],"urlList":[]}}