{"title":"Livy - The History of Rome (6 translations)","uid":9740325,"size":17598170,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bd3ed7447e2019d0433dbce5285bc29c55cc998&amp;dn=Livy+-+The+History+of+Rome+%286+translations%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"workerbee","files":-1,"time":1394502780,"description":"\nTitus Livius Patavinus (59 BCE - 17 CE) -- or LIVY -- was a Roman historian who wrote a monumental history of ancient Rome and the Roman people.  Ab Urbe Condita Libri (&quot;The History of Rome from Its Foundation&quot;) covers the time from the stories of Aeneas, the earliest legendary period from before the city's founding in c. 753 BCE, to Livy's own times in the reign of the emperor Augustus.  Only about 25% of the work has survived.\n\nLivy's History was in demand from the publication of the first packet and continued through the entire classical period.  Interest in Livy declined in the Middle Ages but underwent an intense revival during the Renaissance.  Machiavelli's work on republics, the &quot;Discourses on Livy&quot; is presented as a commentary on the History of Rome.  For several hundred years, Livy's work was studied by the youth of every Western population.\n\n\nThe following 6 translations are a mixture of PDF and ePUB formats:\n\n* THE EARLY HISTORY OF ROME: Books I-V of The History of Rome from Its Foundation (Penguin Classics, 2002).  Translated by Aubrey de Selincourt, with an Introduction by R. M. Ogilvie, and a Preface and Additional Material by S. P. Oakley. -- ePUB\n\n* HANNIBAL'S WAR: Books XXI-XXX (Oxford World's Classics, 2006).  Translated by J. C. Yardley, with an Introduction and Notes by Dexter Hoyos. -- PDF\n\n* THE HISTORY OF ROME: Books I-V (Hackett, 2006).  Translated with an Introduction and Notes by Valerie M. Warrior. -- PDF\n\n* ROME AND ITALY: Books VI-X of The History of Rome from Its Foundation (Penguin Classics, 1982).  Translated and Annotated by Betty Radice, with an Introduction by R. M. Ogilvie. -- ePUB\n\n* ROME'S MEDITERANEAN EMPIRE: Books XLI-XLV &amp; The Periochae (Oxford World's Classics, 2007).  Translated with an Introduction and Notes by Jane D. Chaplin. -- PDF\n\n* THE WAR WITH HANNIBAL: Books XXI-XXX of The History of Rome from Its Foundation (Penguin Classics, 1972).  Translated by Aubrey de Selincourt, and Edited with an Introduction by Betty Radice. -- ePUB\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc., here:\n &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n\n","torrent":{"xt":"urn:btih:0bd3ed7447e2019d0433dbce5285bc29c55cc998","amp;dn":"Livy+-+The+History+of+Rome+%286+translations%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd3ed7447e2019d0433dbce5285bc29c55cc998","infoHashBuffer":{"type":"Buffer","data":[11,211,237,116,71,226,1,157,4,51,219,206,82,133,188,41,197,92,201,152]},"announce":[],"urlList":[]}}