{"title":"IT MUST BE MINDREADING - George Anderson (mind reading)","uid":8792070,"size":3416282,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bd751dd704ccd3134708bc14941f31cca1a4ffc&amp;dn=IT+MUST+BE+MINDREADING+-+George+Anderson+%28mind+reading%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"leopardog","files":1,"time":1375975132,"description":"It Must Be Mindreading\nby George Anderson\nPDF FORMAT\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/B002C8B494/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/B002C8B494/4353-20&lt;/a&gt;\n\nCheck the contents:\n1. The First Prediction: A practical discussion of the mental act.\n2. No Questions Written: A new concept of question answering that qualifies as sensational.\n3. &quot;Easy Money&quot; Mindreading: With a 2 cent gimmick that's worth $10.00.\n4. Playing Card Mindreading: A specialized routine from which a mentalist can make a living.\n5. Torn Center Deluge: A &quot;twist&quot; that makes the torn center dodge a real baffler.\n6. Palmistry Versus Mindreading: A private-reading question answering routine that's years ahead.\n7. My Best Billet Switch: You'll like it, too.\n8. &quot;Getting the Impression&quot;: A complete one man mindreading routine that is revolutionary. Terrifically simple and simply terrific.\n9. Another Sealed Envelope: A sealed message revelation know to very few.\n10. One Man Clip-Board Reading: Without advance preparation. No recess for copying, no &quot;reader.&quot;\n11. Alibi Answers: Sure-fire ways to handle trick questions without dodging them.\n12. The Vital Spot in the Question Act: A secret worth many times the cost of the book.\n13. The &quot;Truth or Consequences&quot; Prediction: A &quot;flash&quot; mental effect of &quot;illusion&quot; proportions without illusion problems.\n14, A Mental Illusion: A big, showy trick...actually a headline act in itself.\n15. The Mental Artist: A duplication of pictures drawn by spectators, line by line, as they mentally direct you while you're standing at a distance.\n16. &quot;Do As I Do&quot; Book Test: Already the favorite book test of those few who have seen it.\n17. The &quot;No Hands&quot; Book Test: A controlled coincidence book test is actually done by the spectators.\n18. The Human Equation: Method and routine both new and different.\n19. Mental Card Magic: Why it doesn't belong in the platform or club mental act and how to avoid it.\n20. Card Muscles: All the &quot;outs&quot; for a classic trick.\n21. The Ultimate Prediction: A &quot;no carbon, no stylus&quot; Swami test without confederates. Perfectly routined to answer every objection to the usual Swami prediction.\n22. The Pocket Mindreading: A close up mental effect that's clean, foolproof and baffling.\n23. The Crystal of the Future: The absolute ultimate in crystal gazing, where spectators see the answers to their questions.\n24. A Lesson in Living From Magic: Two thousand words of honest, practical information that can greatly influence your earnings.\n25. Bibliography: A candid discussion of other material in the field.\nWhy this is a great book:\nAll one-man effects! No confederates or assistants! No cumbersome or heavy gimmicks! Balance between close-up and platform material. Only two card effects, both for close-up. Tested material routined by a showman. Everything practical for today's working conditions.\nA printed, illustrated book. Nothing like it before or since.","torrent":{"xt":"urn:btih:0bd751dd704ccd3134708bc14941f31cca1a4ffc","amp;dn":"IT+MUST+BE+MINDREADING+-+George+Anderson+%28mind+reading%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bd751dd704ccd3134708bc14941f31cca1a4ffc","infoHashBuffer":{"type":"Buffer","data":[11,215,81,221,112,76,205,49,52,112,139,193,73,65,243,28,202,26,79,252]},"announce":[],"urlList":[]}}