{"title":"Lonely Planet - Discover California - 2nd Ed (2012).epub Gooner","uid":13644539,"size":95869890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0bf6feac2b23b64b30ff38204f44b0dda7850efd&amp;dn=Lonely+Planet+-+Discover+California+-+2nd+Ed+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1456153811,"description":"Lonely Planet - Discover California (Travel Guide) - 2nd Edition (2012).epub Gooner\r\n\r\nPublisher: Lonely Planet; 2 edition (May 1, 2012)\r\nLanguage: English\r\nISBN-10: 1742205615\r\nISBN-13: 978-1742205618\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Discover California is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Watch sunsets and surfers along the Pacific Coast Highway, hike through wildflower-strewn meadows in Yosemite, or dine on organic California cuisine while overlooking Napa Valley vineyards; all with your trusted travel companion. Discover the best of California and begin your journey now!\r\n\r\nInside Lonely Planet Discover California:\r\n\r\n* Full-color maps and images throughout\r\n\r\n* Highlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\r\n\r\n* Insider tips save you time and money and help you get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\r\n\r\n* Honest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\r\n\r\n* Cultural insights give you a richer and more rewarding travel experience - including history, art, literature, cinema, politics, landscapes, wildlife, beaches, cuisine, wine, and more\r\n\r\n* Over 35 color maps\r\n\r\n* Useful features - including Walking Tours, Month-by-Month (annual festival calendar), and Travel with Kids\r\n\r\n* Coverage of Northern California, Central Coast, Wine Country, San Francisco, Yosemite, Sierra Nevadas, San Diego, Palm Springs, Los Angeles, Disneyland, Orange County, and more\r\n\r\nThe Perfect Choice: Lonely Planet Discover California, our easy-to-use guide, is perfect for travelers who seek the most popular attractions a destination has to offer. Filled with inspiring and colorful photos, this guide focuses on the best of the best.\r\n\r\n* Looking for a comprehensive guide that recommends a wide range of experiences, both popular and offbeat, and extensively covers all the state has to offer? Check out Lonely Planet's California guide.\r\n\r\n* Looking for a guide to San Francisco or Los Angeles? Check out Lonely Planet's San Francisco City guide orLos Angeles, San Diego &amp; Southern California guide for a comprehensive look at all that each of these cities has to offer, or Lonely Planet's Discover San Francisco, a photo-rich guide to the city's most popular attractions.\r\n\r\nAuthors: Written and researched by Lonely Planet, Beth Kohn, Bridget Gleeson, Andrew Bender, Sara Benson, Alison Bing, Nate Cavalieri, Andrew Schulte-Peevers, and John A Vlahides.\r\n\r\nAbout Lonely Planet: Started in 1973, Lonely Planet has become the world's leading travel guide publisher with guidebooks to every destination on the planet, as well as an award-winning website, a suite of mobile and digital travel products, and a dedicated traveler community. Lonely Planet's mission is to enable curious travelers to experience the world and to truly get to the heart of the places they find themselves in","torrent":{"xt":"urn:btih:0bf6feac2b23b64b30ff38204f44b0dda7850efd","amp;dn":"Lonely+Planet+-+Discover+California+-+2nd+Ed+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bf6feac2b23b64b30ff38204f44b0dda7850efd","infoHashBuffer":{"type":"Buffer","data":[11,246,254,172,43,35,182,75,48,255,56,32,79,68,176,221,167,133,14,253]},"announce":[],"urlList":[]}}