{"title":"A Handbook of Applied Biopolymer Technology","uid":12402718,"size":66268893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0c281db1db8cb903ff0f8c6e6a5f4b213046bb70&amp;dn=A+Handbook+of+Applied+Biopolymer+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1442049855,"description":"A Handbook of Applied Biopolymer Technology - Synthesis, Degradation and Applications (RSC Green Chemistry No. 12) (2011).pdf\n\nISBN: 978-1-84973-151-5\n\nScientists are conducting active research in different fields of engineering, science and technology by adopting the Green Chemistry Principles and methodologies to devise new processes, with a view to help protect and ultimately save the environment from further anthropogenic interruptions and damage. With this in mind, the book provides an up-to-date, coherently written and objectively presented set of chapters from eminent international researchers who are actively involved in academic and technological research in the synthesis, (bio)degradation, testing and applications of biodegradable polymers and biopolymers. This pool of the latest ideas, recent research and technological progress, together with a high level of thinking with a comprehensive perspective, makes the emerging field of biodegradable polymer science and engineering (or bio-based polymers) linked to environmental sustainability, the essence of this key publication. The handbook consists of chapters written and contributed by international experts from academia who are world leaders in research and technology in sustainability and biopolymer and biodegradable polymer synthesis, characterisation, testing and use. The book highlights the following areas: green polymers; biopolymers and bionanocomposites; biodegradable and injectable polymers; biodegradable polyesters; synthesis and physical properties; discovery and characterization of biopolymers; degradable bioelastomers, lactic acid based biodegradable polymers; enzymatic degradation of biodegradable polymers; biodegradation of polymers in the composting environment; recent development in biodegradable polymers; research and applications and biodegradable foams. The book is aimed at technical, research-orientated and marketing people in industry, universities and institutions. It will also be of value to the worldwide public interested in sustainability issues and biopolymer development as well as others interested in the practical means that are being used to reduce the environmental impacts of chemical processes and products, to further eco-efficiency, and to advance the utilization of renewable resources for a bio-based production and supplier chain. Readers will gain a comprehensive and consolidated overview of the immense potential and ongoing research in bio-based and biodegradable polymer science, engineering and technology to make the world greener","torrent":{"xt":"urn:btih:0c281db1db8cb903ff0f8c6e6a5f4b213046bb70","amp;dn":"A+Handbook+of+Applied+Biopolymer+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c281db1db8cb903ff0f8c6e6a5f4b213046bb70","infoHashBuffer":{"type":"Buffer","data":[12,40,29,177,219,140,185,3,255,15,140,110,106,95,75,33,48,70,187,112]},"announce":[],"urlList":[]}}