{"title":"Laura Nyro - Discography (1966-2004) [FLAC]","uid":10425594,"size":5096518816,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0ca2a68d1ffadb744804456f779337beba47731f&amp;dn=Laura+Nyro+-+Discography+%281966-2004%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":7,"uploader":"politux","files":-1,"time":1403697143,"description":"\n  Laura Nyro - Discography (1966-2004) [FLAC]\n\n  Genres: Pop/Rock, Folk, Soul\n  Styles: Singer/Songwriter, Soft Rock\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  1966 More Than a New Discovery (2008)\n  1968 Eli and the Thirteenth Confession Confession (1990)\n  1969 New York Tendaberry (2002)\n  1970 Christmas and the Beads of Sweat (2008)\n  1973 The First Songs (1990)\n  1976 Smile (2008)\n  1977 Season of Lights (2008)\n  1978 Nested (2008)\n  1984 Mother's Spiritual (2008)\n  1989 Live at the Bottom Line \n  1990 Live from Mountain Stage\n  1994 Live in Japan (2003)\n  1998 Premium Best\n  2000 Time and Love - The Essential Masters\n  2001 Angel in the Dark\n  2002 Live - The Loom's Desire \n  2004 Spread Your Wings and Fly\n\n  Laura Nyro was one of pop music's true originals: A brilliant and innovative composer, her songs found greater commercial success in the hands of other performers, but her own records -- intricate, haunting works highlighting her singularly powerful vocal phrasing, evocative lyrics, and alchemical fusion of gospel, soul, folk, and jazz structures -- remain her definitive artistic legacy.\n\n  The daughter of a jazz trumpeter, she was born Laura Nigro on October 18, 1947, and composed her first songs at the age of eight. After attending Manhattan's famed High School of Music and Art, she began performing in area clubs, drawing on influences as diverse as Bob Dylan and John Coltrane. In 1967, Nyro issued her first LP, More Than a New Discovery; though commercially unsuccessful, the album was a treasure trove of material for other artists -- the Fifth Dimension scored with &quot;Wedding Bell Blues&quot; and &quot;Blowin' Away,&quot; Barbra Streisand covered &quot;Stoney End,&quot; and Blood, Sweat &amp; Tears tackled &quot;And When I Die.&quot;\n\n  In 1967, Nyro made just her second major live appearance to date at the Monterey Pop Festival, where her idiosyncratic performance baffled the crowd. However, David Geffen -- a music agent at the time -- caught her set and was so impressed that he quit his current position to become her manager. He also won Nyro a contract with Columbia, and in 1968 she returned with the extraordinary Eli and the Thirteenth Confession. While the album earned vast critical acclaim, she again found commercial success not with her own recordings, but with covers of Eli's songs, as the Fifth Dimension reached the charts with renditions of &quot;Stoned Soul Picnic&quot; and &quot;Sweet Blindness,&quot; while &quot;Eli's Comin'&quot; became a major hit for Three Dog Night.\n\n  At the age of 24, Nyro announced her retirement; she married, severed her industry connections, and moved to a small community in New England. However, the marriage ended in divorce, and in 1976 she resurfaced with Smile; a subsequent tour yielded the 1977 live set Season of Lights. However, the long layoff derailed whatever chart momentum her music had accrued, and after the dismal sales of 1978's Nested, she again retreated from the music business.\n\n  When Nyro finally returned from her self-imposed exile in 1984 with Mother's Spiritual, her music had grown more reserved and introspective; as the title indicated, her own motherhood provided considerable inspiration for her new work, as did her rustic New England lifestyle. While she did not make any overt declarations of retirement, Nyro waited another five years before issuing her next LP, Live at the Bottom Line, recorded at the legendary New York club; Walk the Dog &amp; Light the Light, her first collection of new material in nearly a decade, followed in 1993. Four years later, Nyro died of ovarian cancer, on April 8, 1997. A posthumous album, Angel in the Dark, was issued in 2001, and several additional live recordings also surfaced.\n\n  *Note to downloaders\n\n  I don't claim that this is a complete discography. I have collected as much material as I could find.  If something is missing you can try to find it and upload it for the community; asking for it here won't help.\n\n  Thanks to all the original rippers and uploaders. :)\t","torrent":{"xt":"urn:btih:0ca2a68d1ffadb744804456f779337beba47731f","amp;dn":"Laura+Nyro+-+Discography+%281966-2004%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ca2a68d1ffadb744804456f779337beba47731f","infoHashBuffer":{"type":"Buffer","data":[12,162,166,141,31,250,219,116,72,4,69,111,119,147,55,190,186,71,115,31]},"announce":[],"urlList":[]}}