{"title":"Woolfe The Red Hood Diaries - FANiSO","uid":11762495,"size":2522778639,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0d36ab05cd9c3b1b1f6878c5db09172ef2781609&amp;dn=Woolfe+The+Red+Hood+Diaries+-+FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dauphong","files":2,"time":1426623174,"description":"P R E S E N T S\nWoolfe - The Red Hood Diaries (c) GRIN\n\nSupplied By: A Friend Diskettes: 1 DVD\nCracked By: A Friend Game Type: Action, Adventure\nPackaged By: A Friend Released On: March 2015\n\nWoolfe - The Red Hood Diaries is a cinematic fable featuring a\nvengeful Red Riding Hood. All grown up, cried out and armed with an\naxe, our heroine embarks on an odyssey to avenge the death of her\nparents. Buckle up for a surprising take on the Red Riding Hood tale\nas you know it, some good old-fashioned action platforming, fun\ncombo-based hack 'n slash combat and rewarding environment puzzles\nexploring the attractive fantasy universe\n\nFeatures:\n\n* A twisted fairy tale story - Our take on the Red Riding Hood\nlegacy is not an ordinary bedtime story. Four years ago, Red\nRiding Hood's father Joseph, lead engineer for Woolfe\nIndustries, died in a work accident. At least, that's what his\nfamily was told. All grownup, our heroine is ready to unveil\nthe truth and present the bill for her tragic loss\n* A Rich, Visual Experience - Woolfe's atmospheric artwork lets\nthe player explore a rich fantasy universe centered around a\ncity paralyzed with fear and occupied by tin soldiers. Sneak\nthrough the slums, descend into the city sewer system, run\nthrough the harbour and escape the city into an evil forest\nwhere gravity, wolves and scary fairies are out to get you\n* 2.5 D Action-Platforming - The tale's 2.5 D levels combine\nthe simplicity of side scrolling gameplay with\nthree-dimensional puzzles to solve\n* Fast, Axe Wielding Combat - Armed with her trusty axe\nRed will need to skillfully execute combos to strike\nat her foes' weaknesses\n* Deranged Fairy Tale Enemies - On her journey, Red faces some\nbloody encounters with &quot;familiar fairytale faces&quot; such as The\nPied Piper, tin soldiers, big bad wolves, scary fairies and -of\ncourse- her nemesis B.B. Woolfe\n\nInstall\n\n1.) Unpack\n2.) Burn or mount\n3.) Play the game","torrent":{"xt":"urn:btih:0d36ab05cd9c3b1b1f6878c5db09172ef2781609","amp;dn":"Woolfe+The+Red+Hood+Diaries+-+FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d36ab05cd9c3b1b1f6878c5db09172ef2781609","infoHashBuffer":{"type":"Buffer","data":[13,54,171,5,205,156,59,27,31,104,120,197,219,9,23,46,242,120,22,9]},"announce":[],"urlList":[]}}