{"title":"Amos Lee - Mission Bell (2011) 320 vtwin88cube","uid":6130578,"size":129926563,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d6015a577c1b4a88d411736f5732c102dba40bf&amp;dn=Amos+Lee+-+Mission+Bell+%282011%29+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1296113400,"description":"Amos Lee\nMission Bell (2011)\n\nWith his laid-back vocal delivery and acoustic songwriting, Amos Lee draws inspiration from soul music, contemporary jazz, and '70s folk artists like James Taylor. The Philadelphia native first became serious about performing while attending the University of South Carolina during the mid-'90s. After graduating with a degree in English, he taught elementary school before deciding to pursue a music career full-time. A period of waiting tables and bartending followed as Lee honed his songwriting skills. He eventually landed some high-profile gigs as an opening act, including an extended tour with pianist/vocalist Norah Jones, whose bassist, Lee Alexander, agreed to produce Lee's first album.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\n\nFormat:\t\t\tMp3\nGenre:\t\t\tFolk\t\t\nM3U Playlist:\t\tYes\n\nRecorded in Arizona with Calexico's Joey Burns producing, Amos Lee's fourth studio album, 2011's Mission Bell, finds the singer/songwriter in a thoughtful mood and once again wrapping his soulful folk numbers in country, blues, and soft rock. A ruminative, lazy summer day of an album, Mission Bell is not dissimilar to Lee's last effort, 2008's Last Days at the Lodge, but lacks the more contemporary R&amp;B tracks that made Last Days a bit of a departure from Lee's more granola leanings. Here listeners get the introspective leadoff track &quot;El Camino&quot; and the airy Steve Winwood-sounding ballad &quot;Violin.&quot; Similarly engaging is the jaunty mid-album anthem &quot;Flower,&quot; which is equal parts the Commodores' &quot;Easy&quot; and Hall &amp; Oates' &quot;She's Gone.&quot; It's a brilliant, joyously melodic number with the only downside being that it only works to remind you how melodically dire the rest of the album is. Which isn't to say Mission Bell is bad. On the contrary, there is a lot to admire here and maybe that's the main problem. Lee is a talented songwriter with a distinctive pop voice who is becoming recognized as an heir to the American singer/songwriter throne -- a notion given weight by the addition of several well-known guest artists here, including roots rocker Lucinda Williams and country legend Willie Nelson. That said, he often favors rambling, low-key country numbers that get you to quietly consider the bittersweet nature of our existence rather than lose yourself in the song. You come off a track like &quot;Flower&quot; and keep waiting for another one to grab you in the same &quot;instant classic&quot; kind of way. If Mission Bell rings true, it's in the lyrics with Lee's knack for stories and personal revelations keeping you listening, and not always the melodic content.\n\n01.El Camino\n02.Windows Are Rolled Down\n03.Violin\n04.Flower\n05.Stay With Me\n06.Out Of The Cold\n08.Hello Again\n09.Learned A Lot\n10.Cup Of Sorrow\n11.Clear Blue Eyes (Feat. Lucinda Williams)\n12.Behind Me Now/El Camino Reprise (Feat. Willie Nelson)\n\n\nCheers!","torrent":{"xt":"urn:btih:0d6015a577c1b4a88d411736f5732c102dba40bf","amp;dn":"Amos+Lee+-+Mission+Bell+%282011%29+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d6015a577c1b4a88d411736f5732c102dba40bf","infoHashBuffer":{"type":"Buffer","data":[13,96,21,165,119,193,180,168,141,65,23,54,245,115,44,16,45,186,64,191]},"announce":[],"urlList":[]}}