{"title":"AMS Business Card Maker v9.0 GOTD plus Templates","uid":14996637,"size":184463505,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0d82d542bd8f547f25a0db746204af5784ca7bcc&amp;dn=AMS+Business+Card+Maker+v9.0+GOTD+plus+Templates&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZarkBit","files":1,"time":1466353649,"description":"AMS Business Card Maker v9.0 GOTD plus Templates\r\n\r\nBefore anything else, this is a Giveaway, which means that the original package does not contain all templates of the Studio version, BUT its data folder is included here, just copy the data folder into the installed folder and ull get all templates of the Studio version.\r\n\r\nConvenient software for designing and printing business cards with logos and photographs. Business Card Maker provides an exclusive collection of professionally designed templates along with rich editing options. Full version is available in reliable online stores.\r\n\r\nMaking different types of business cards\r\nVisiting cards with information about an employee and the company.\r\nContact cards for entrepreneurs - perfect for freelancers, sole lawyers, psychologists, estate agents, etc.\r\nCompany cards with corporate style design. Such cards can be great promotional material.\r\nBadges with a minimum of information in easy-to-read large print. It is possible to add a photo.\r\nDesign and editing features\r\n150+ professionally designed themed templates for different types of business.\r\nMake cards from scratch with dozens of layouts and color schemes.\r\nCreate prefect background: solid, gradient, textured, or with an image.\r\nAdd pictures, photos, and logos in various image formats.\r\nAlign design elements easily with &quot;snap to grid&quot; feature.\r\nCreate and save customized templates from any designer template.\r\nDatabase capabilities\r\nStore contact data of companies, employees, and entrepreneurs.\r\nApply stored data to any card template.\r\nQuick search of entries in the database.\r\nSupport for a large number of contact data fields.\r\nPrint options\r\nPrint on different paper sizes.\r\nSupport of 600 dpi print resolution and 1200 dpi resolution for export.\r\nSave on printing costs thanks to smart print layout.\r\nExport print layouts to image files with no quality loss.\r\nUse bleed to make sure the cards look perfect after trimming.\r\nPrint a trial sample, with one card on a page.\r\nDesign kit and resources\r\nOver a hundred images and clipart for different business areas.\r\nA wide range of beautiful backrounds.\r\nImport your own images to the program galleries","torrent":{"xt":"urn:btih:0d82d542bd8f547f25a0db746204af5784ca7bcc","amp;dn":"AMS+Business+Card+Maker+v9.0+GOTD+plus+Templates","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d82d542bd8f547f25a0db746204af5784ca7bcc","infoHashBuffer":{"type":"Buffer","data":[13,130,213,66,189,143,84,127,37,160,219,116,98,4,175,87,132,202,123,204]},"announce":[],"urlList":[]}}