{"title":"Paul McKenna - Hypnotherapy - Supreme Self Confidence","uid":4018273,"size":56071125,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0d9e93fbc07d8f00435e6e4d53bd2aba9a57ec5e&amp;dn=Paul+McKenna+-+Hypnotherapy+-+Supreme+Self+Confidence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"prince213","files":3,"time":1202503625,"description":"Product Details\n\n    * Format: MP3 @ 192kbps &amp; 128kbps\n    * Source: Audio CD\n    * Tracks: Introduction &amp; Hypnotic Induction\n    * Publisher: Paul McKenna Productions (June 15, 1996)\n    * ISBN-10: 1900148137\n    * ISBN-13: 978-1900148139\n\n\nCustomer Reviews\n\n \t    \t\n27 of 27 people found the following review helpful:\n4.0 out of 5 stars works well if you let it, 13 Oct 2004\nBy A Customer\nI have used this on and off for a long time and it certainly does the business, but it's important to understand that the whole hypnosis thing only works if you allow yourself to relax and go with it. It's not a magical thing where you switch the cd on and suddenly you are in a trance. If you listen attentively thinking 'why isn't anything happening yet?' then it simply won't work. It's like lying awake in bed constantly asking yourself 'why aren't I asleep yet?'.\n\nIt won't be for everyone because to a certain extent you have to be able to get your mind in a relaxed enough state by yourself to begin with in order for the hypnosis to start working, but if you can just allow yourself to switch off and do keep listening to it every day for a month then you will notice real improvements. I was very skeptical at first and it took a while to allow myself to get into it but it was certainly worth it. If you're worrying about trying to make out every word he says though or are worrying what to do when you count down to zero then you're in the wrong state of mind for it to work to begin with. You really do just have to empty your mind and let it drift over you.\n\n\t\n37 of 38 people found the following review helpful:\n5.0 out of 5 stars I overcame serious nerves to confidently speak in public!, 25 May 2004\nBy A Customer\nI bought this cd with a month to go before an important presentation, in the hope that it would help me conquer my nerves. I had previously had very bad experiences with public speaking - my nerves always seemed to give me away - as soon as I would hear the shakiness in my own voice I would know I couldn't expect the audience to have any faith in me when I appeared to doubt myself! I always felt so unprofessional, and would beat myself up afterwards for doing such a poor job, and I would already be worrying about the next time.\n\nI listened to track two of the cd every day for four weeks. After the first few times, I seemed conditioned to get into the &quot;trance&quot; state of mind really quickly - I would wake up at the end feeling calm, but generally not remembering much about the whole thing. Paul McKenna tells us this is common. I began to look forward to this relaxing time in my day, and noticed in advance of the presentation that I was beginning to feel more excited than nervous - then eventually realized that Paul talks directly about cultivating this feeling! I began to have growing faith that the cd was making a difference to me, and this belief helped me to expect things to be different this time.\n\nOn the presentation day I felt a small flurry of butterflies (rather than fear gripping at my chest as previously experienced!), kept under control with Paul's breathing technique. As soon as I started to talk, all my nerves and fears melted away - I could hear that my voice was strong, confident and lively, and the rest of me seemed to follow suit!\n\nFor the first time I was pleased with a presentation. I'm even looking forward to the next one - now that I know I can hold it together and be professional, I want to progress further - there's no reason I can't be really good at it now is there, with a bit of practice that is.\n\nThis cd has changed my career permanently - I was really worried about staying in the job I'm in with the poor presentation performances I'd given. I can hardly believe I'm now thinking about how to excel at the very same thing. I really recommend you give this cd a try - you have nothing to lose and possibly everything to gain after all. I will never get rid of my copy!\n\n\t\n26 of 26 people found the following review helpful:\n5.0 out of 5 stars This CD really works!!!, 7 Mar 2004\nBy A Customer\nThis CD really has improved my confidence and I would recommend it to others who have a problem in that area of their life's.\nI noticed a negative review from someone who thought it didn't work. But their problem was they were listening to CD and analyzing it. Hypnotism doesn't work this way it needs to act upon the unconscious mind and to do this we need to let go of our normal everyday analytical way of thinking. That's the whole point of counting and if you wonder what to do after counting back from 300 you have completely missed the point.\nMy advice to anyone using this CD is relax and let it flow through you.\n\n\n55 of 58 people found the following review helpful:\n5.0 out of 5 stars In a trance, 18 Dec 2003\nBy \tJ. A. Prevel &quot;www.DforDog.com&quot; - See all my reviews\n(REAL NAME)   \nPaul Mckenna's audio CDs are a great example of how a hypnotherapy session should feel. He doesn't claim to work 'magic'. Instead the listener should accept that the idea is to go into a trance, which is simply a form of deep relaxation.\n\nYou are not supposed to try to listen to everything he is saying and if anything I think the fact that he sometimes uses 2 voices actually helps to accentuate this point and allows you to relax and let his words flow over and around you. When he talks about breathing in and out you just follow your own relaxed breathing pattern. When he says count you can begin to count and then let your mind wander. Once you have achieved 'trance' then this will be possible and like many of the previous reviewers have said, you find that you have not literally heard all that he said but instead have let your mind go. I guess, if you did not go into trance and you ended up listening to this 'cold' like listening to a radio station, you will get very bored of it. However, for anyone who finds they can achieve trance, you will 'wake up' feeling refreshed and positive.\n\nWhen you see a hypnotist in person they have the luxury of being in the room with you and gouging your reactions. Considering Paul Mckenna does not have this luxury, I think he has done a sterling job of making an audio version that should suit as many people as possible and carry them along regardless of how easily they achieve trance.\n\nEvery time I listen to his CDs I hear something else that I never heard before. Sometimes I go into trance quickly and sometimes I go in and out during the session. Each time can indeed be different. If you have listened to any of these CDs and are not able to go into trance then think again about what trance is... it is a deep form of relaxation. Let your mind relax as if sinking into sleep and hopefully it should happen for you. I think of trance a bit like those 3D magic eye pictures. Remember them? Some people can see them straight away and some people have to keep trying. But once you can do it you can keep doing it with ease.\n\nI did read somewhere that people who have a good imagination and are focused can achieve trance... so have a go. It's only deep relaxation after all, and that has got to be good for you.\n\n\t\n55 of 93 people found the following review helpful:\n2.0 out of 5 stars Not for Everyone, 30 Nov 2003\nBy A Customer\nPerhaps I should wait until after the stipulated 21 listening's before dismissing this as a failure, but don't know if my patience will hold out that long. So far, I've listened six times, which already feels like more than enough.\n\nThe first section (working with the conscious mind) is practical and rational enough. The premise is that you can learn to associate positive and confident thoughts with a simple and discreet action (pressing thumb &amp; forefinger together), so that ultimately, performing the action triggers the thoughts, on demand. I've no major gripes with the theory - which is not new - although I wonder how long it takes a &quot;normal&quot; person to perfect it.\n\nThe second section supposedly works with the unconscious mind, by inducing a state of hypnotic trance, and this is where I really have a problem. So far, I've had no evidence or sensation whatsoever of entering a trance. It feels no different to listening to a rather odd but only mildly interesting radio programme. And there are a few problems with the content, too.\n\nFirstly, as another reviewer points out, the CD cannot be tailored to YOUR breathing, so when it reaches the spot where Paul is counting the breaths: &quot;IN....OUT&quot;, I invariably find I'm out of sync with him, and trying to breathe faster or slower, to compensate. This is not very natural or relaxing.\n\nThen there's the curious unanswered questions, which play on your mind. WHY does Paul invite us to: &quot;Close your eyes just as soon as you wish&quot;, some time AFTER he's already TOLD us to close them? And, when he invites us to count down from 300, what do we do when we reach zero? I realize the counting is purely a focusing device, but it unfocused you immediately, if you get to zero, and think: &quot;Uh-oh, now what?&quot;.\n\nAnd then there were some unfortunate analogies. Paul likes to compare confidence with the skills of reading and writing, which have become second nature. However, if, like me, you ever experienced any problems with reading and writing, or maybe still do, this is the exact opposite of confidence-inducing!\n\nSimilarly, Paul makes the assumption that everybody's infancy was a time when they felt safe, warm and secure, and invites us to re-experience that feeling. However, if, for any reason, you don't have that idyllic impression of childhood, this is another &quot;own goal&quot;.\n\nFinally, there are the gimmicky sound-effects. It seems as if they were concerned the CD would sound just &quot;too normal&quot; without them - not enough mystique - so they thought they'd better jazz it up somehow. As a result, we hear Paul's voice in &quot;many different ways&quot;, as he puts it. Particularly annoying is when one track is overlaid with another, so that you cannot make out what is being said in either. The implication is that your unconscious mind CAN. But a regular hypnotherapist, whom you visit in person, can only speak in one voice at a time, so this is surely not an integral part of the process? It seems to me to be a needless and frustrating gimmick (you spend a lot of time struggling to decipher what is being said).\n\nDespite my personal disappointment, I do think this CD could be of some value, to some people, but don't expect miracles. There is NO magic here. You could make yourself a tape of uplifting thoughts, and play them every night, and it would probably be as effective.\n\n\n12 of 19 people found the following review helpful:\n5.0 out of 5 stars magic, 23 Aug 2003\nBy \t&quot;ukyorkies&quot; - See all my reviews\nthe cd supreme self confidence cd is magic, that all i can say i would recommend to buy it ,and listen to it regularly. you will notice changes in your self, and your life.it has been very helpful to me.\n\n\n44 of 44 people found the following review helpful:\n5.0 out of 5 stars Life Changing!, 28 Jul 2003\nBy A Customer\nWhen I received this CD I wondered if it would actually make a difference. I have tried to deal with low self confidence many ways. Now, however, I wish I hadn't bothered! Paul McKenna's Supreme Self Confidence CD is shockingly effective. After only 3 or 4 listens, I found myself with the confidence to do the things I've dreamed about. I would (and have!) recommend this CD to people seeking help with confidence levels. For me, this CD was a life changer.\n\n\t\n10 of 16 people found the following review helpful:\n5.0 out of 5 stars Fantastic, 9 May 2003\nBy A Customer\nI have recently got hold of a copy of this CD and I have to say that I was not convinced this would work. Just like the other reviewer I found that I listened to the second part of the CD and I was concentrating on the things Paul Was telling me then the next thing I remember was coming around when I was told to. This is really fantastic. I have not been doing the programme long enough to report any results but The hypnosis seems to be working for this skeptic.\n\n10 of 13 people found the following review helpful:\n5.0 out of 5 stars Superb, 26 Mar 2003\nBy A Customer\nThe best investment you will ever make unless you win the lottery. This CD works best if you are a skeptic with regard to hypnotism but are determined to change your life. Paul McKenna is a genius.\n\n\n10 of 20 people found the following review helpful:\n5.0 out of 5 stars very good quality, 25 Jan 2003\nBy \tstefan LÃƒÆ’Ã‚Â¶fgren (MalmÃƒÆ’Ã‚Â¶ Sweden) - See all my reviews\nI have tried many different hypnosis tapes, guided meditations etc, and they have very different qualities. I have found Pauls tapes to be among the absolutely best in regard to the sound quality. They are also very good in content. I think he is very good at what he does, and I do enjoy listening to his tapes.\nThis self confidence tape is as good as the others, and I like it a lot.\n\nLots &amp; lots of customer's find this CD very helpful, now its time for you...\n\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:0d9e93fbc07d8f00435e6e4d53bd2aba9a57ec5e","amp;dn":"Paul+McKenna+-+Hypnotherapy+-+Supreme+Self+Confidence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d9e93fbc07d8f00435e6e4d53bd2aba9a57ec5e","infoHashBuffer":{"type":"Buffer","data":[13,158,147,251,192,125,143,0,67,94,110,77,83,189,42,186,154,87,236,94]},"announce":[],"urlList":[]}}