{"title":"WinRAR x64 (64 bit) 4.20 +Key {Team EAT} (Alien)","uid":7817826,"size":1657034,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0e7615144b0dd67c7baf8ab975e5e4dcdb7ad9ef&amp;dn=WinRAR+x64+%2864+bit%29+4.20+%2BKey+%7BTeam+EAT%7D+%28Alien%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Alien119","files":3,"time":1352680613,"description":"WinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format\n\nWinRAR Version 4.20\n\n1. Changes in RAR compression:\n\na) RAR general compression algorithm is optimized for better\nutilization of several processor cores. While some speed gain\nis possible even in single processor mode, best results\nare achieved in multi-core environment.\n\nSpeed gain depends on data type and average file size.\nSeveral cores are utilized more efficiently when compressing\nlarge files.\n\nb) we had to increase memory requirements to achieve higher\ncompression speed. General RAR compression algorithm allocates\nabout 120 MB comparing to 40 MB in WinRAR 4.11;\n\nc) RAR text compression algorithm cannot utilize several CPU cores\nefficiently, so its performance in multiprocessor environment\nis much lower than for general algorithm. Also its decompression\nspeed is much lower than in general algorithm regardless of\nCPU number. So we decided to disable the text algorithm by default.\n\nIf you need maximum possible compression ratio for plain text data\nregardless of speed, you can enable the text compression\nin &quot;Advanced compression parameter&quot; dialog. Press &quot;Compression...&quot;\nbutton on &quot;Advanced&quot; page of archiving dialog to access it.\nYou can also change this option permanently in default compression\nprofile;\n\nIn the command line mode the text compression can be enabled\nwith -mct switch;\n\nd) &quot;Fastest&quot; (-m1) compression mode also supports several processor\ncores now. In 4.11 it could use only a single processor core.\n\n2. RAR general decompression algorithm speed is slightly improved,\nthough not to same extent as RAR compression. RAR decompression\nis not able to use several processor cores, so its performance\ndoes not depend on a number of cores.\n\n3. Changes in ZIP compression:\n\na) now ZIP compression supports several processor cores resulting\nin noticeably higher performance in multi-core environment.\nSingle CPU ZIP compression is also faster than in 4.11;\n\nb) memory use for ZIP compression is increased to about 15 MB.\n\n4. Recovery volume creating and processing can use several CPU cores\nresulting in higher speed. Though, typically hard drive seek speed\nis a limiting factor for recovery volumes, so this gain is most\nnoticeable when working with solid state drive.\n\n5. Now the allowed value for -mt switch is 1 - 32,\nnot 0 - 16 as before.\n\n6. &quot;Find files&quot; command can search data in 7-Zip archives.\nPreviously &quot;Find files&quot; did not support .7z archive format.\n\n7. Windows 2000 is not supported by WinRAR and WinRAR self-extracting\nmodules anymore.\n\n8. &quot;Save current settings&quot; button in &quot;Advanced SFX options&quot; dialog\nis now available only when converting an existing archive to SFX.\nOptions saved with this button are applied only to convert to SFX\noperation.\n\nIf you create or update SFX archive, only SFX options stored\nin default compression profile are used. Options saved\nin &quot;Advanced SFX options&quot; dialog are ignored for these operations.\n\nHome page:\n &lt;a href=&quot;\nhttp://www.rarlab.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rarlab.com/&lt;/a&gt;\n\n\n\n\nTested And Working...\nScanned (With Kaspersky) And 100% Clean.\n\n\n\nPLS SEED TO KEEP THIS TORRENT ALIVE","torrent":{"xt":"urn:btih:0e7615144b0dd67c7baf8ab975e5e4dcdb7ad9ef","amp;dn":"WinRAR+x64+%2864+bit%29+4.20+%2BKey+%7BTeam+EAT%7D+%28Alien%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e7615144b0dd67c7baf8ab975e5e4dcdb7ad9ef","infoHashBuffer":{"type":"Buffer","data":[14,118,21,20,75,13,214,124,123,175,138,185,117,229,228,220,219,122,217,239]},"announce":[],"urlList":[]}}