{"title":"Dr. Myles Munroe - Six Secrets to Success","uid":6206775,"size":527411984,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:0e7aed4e76fd8db2cf9f745b426d83515382cf0d&amp;dn=Dr.+Myles+Munroe+-+Six+Secrets+to+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"prince213","files":5,"time":1298836590,"description":"Product Details\n\n    * Language: English\n    * Type: Video\n    * Format: DivX\n    * Extras Included: MP3 Audio Version\n\nProduct Description\n\nDr. Myles Munroe is an internationally renowned bestselling author, lecturer, teacher, life coach, government consultant, and leadership mentor. He has travelled around the world training leaders in business, government, education, sports, media, and religion.\n\nThis multi-gifted motivational speaker serves as a business consultant to governments, Fortune 500 companies and corporations, addressing critical issues that affect every aspect of human, professional, leadership, social, and spiritual development.\n\nDr. Munroe represents his country as the youngest recipient of the Queen's Birthday Honors of the Order of The British Empire (OBE) Award 1998 bestowed by Her Majesty, Queen Elizabeth of England, for his spiritual and social contributions to the national development of the Bahamas. He has also been honored by the government of the Bahamas with the Silver Jubilee Award (SJA) for providing twenty-five years of outstanding service to the Bahamas in the category of spiritual, social and religious development.\n\nPas. Myles is the senior pastor of Bahamas Faith Ministries International Fellowship, where his wife, Ruth Ann, serves as co-senior pastor. They are the proud parents of Charisa and Chairo (Myles Jr.).","torrent":{"xt":"urn:btih:0e7aed4e76fd8db2cf9f745b426d83515382cf0d","amp;dn":"Dr.+Myles+Munroe+-+Six+Secrets+to+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e7aed4e76fd8db2cf9f745b426d83515382cf0d","infoHashBuffer":{"type":"Buffer","data":[14,122,237,78,118,253,141,178,207,159,116,91,66,109,131,81,83,130,207,13]},"announce":[],"urlList":[]}}