{"title":"The Secrets of Quantum Physics - 2. Let There Be Life HDTV x264 ","uid":12139585,"size":355072041,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0e7d66ca4cae6f6c2204bcb127ec1c9af5b0bea3&amp;dn=The+Secrets+of+Quantum+Physics+-+2.+Let+There+Be+Life+HDTV+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"marxph","files":2,"time":1437319028,"description":"The Secrets of Quantum Physics follows Professor Jim Al-Khalili as he investigates the most accurate and yet perplexing scientific theory - quantum theory. It was at the beginning of the 20th century, scientists were led into the hidden workings of matter. They had discovered a realm where things can be in many places at once- chance and probability call the shots and reality appears to only truly exist when we can observe it. \n\nEpisode 2 of 2 - Let There Be Life: \n\nPhysicist Jim Al-Khalili routinely deals with the strangest subject in all of science - quantum physics, the astonishing and perplexing theory of sub-atomic particles. But now he's turning his attention to the world of nature. Can quantum mechanics explain the greatest mysteries in biology?\n\nHis first encounter is with the robin. This familiar little bird turns out to navigate using one of the most bizarre effects in physics - quantum entanglement, a process which seems to defy common sense. Even Albert Einstein himself could not believe it.\n\nJim finds that even the most personal of human experiences - our sense of smell - is touched by ethereal quantum vibrations. According to the latest experiments, it seems that our quantum noses are listening to smells. Jim then discovers that the most famous law of quantum physics - the uncertainty principle - is obeyed by plants and trees as they capture sunlight during the vital process of photosynthesis.\n\nFinally, Jim asks if quantum physics might play a role in evolution. Could the strange laws of the sub-atomic world, which allow objects to tunnel through impassable barriers in defiance of common sense, effect the mechanism by which living species evolve?\n\n===================================================================================\nSource.......: HDTV\nSize.........: 338MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:0e7d66ca4cae6f6c2204bcb127ec1c9af5b0bea3","amp;dn":"The+Secrets+of+Quantum+Physics+-+2.+Let+There+Be+Life+HDTV+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e7d66ca4cae6f6c2204bcb127ec1c9af5b0bea3","infoHashBuffer":{"type":"Buffer","data":[14,125,102,202,76,174,111,108,34,4,188,177,39,236,28,154,245,176,190,163]},"announce":[],"urlList":[]}}