{"title":"TTC - Beginnings of Judaism","uid":4137159,"size":535201084,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0f3ad36fe078f8dc0b39b84b6ef6cf5bc619a13c&amp;dn=TTC+-+Beginnings+of+Judaism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"phalos","files":51,"time":1208309195,"description":" Beginnings of Judaism\n(24 lectures, 30 minutes/lecture)\nCourse No. 6457\n\nTaught by Isaiah M. Gafni\nHebrew University, Jerusalem\nPh.D., Hebrew University, Jerusalem\n\nHow did Judaism develop from its biblical roots to the highly developed system we know today? What has changed?and what has remained constant? The answers to these questions are relevant to all faiths, as well as to anyone seeking to broaden their understanding of ancient history?a past that is inexorably linked to the present.\n\nThe roots of Judaism reach back to the Hebrew Bible?also known as the Old Testament by Christians. For thousands of years, Jews have looked to these scriptures for their origins, and have located in them the tenets of their faith. The Bible provides Jews reasons for sadness and joy, wisdom, and most of all, a profound belief in what God expects of them and has promised to them.\n\nThough Jews of every generation have recognized and cherished the Bible as the ultimate source of all Jewish existence, much of what is recognized today as Judaism does not appear in the Bible.\n\nFor example, worshipping in places other than the single, original Temple in Jerusalem is expressly forbidden by the Bible. Nevertheless, Jews today worship in synagogues wherever there might be a Jewish community. Similarly, the Rabbinic model, for centuries the most visible example of religious and communal leadership among Jews, is not mentioned anywhere in the Bible.\n\nIn Beginnings of Judaism, Professor Isaiah M. Gafni of The Hebrew University of Jerusalem leads a spirited and provocative exploration of how the Jewish faith struggled to continually redefine itself during the first thousand years after the completion of the last books of the Hebrew Bible, tenaciously clinging to existence through circumstances that might well have torn it asunder.\n\nThis course explores the evolution of an ancient faith into a system of beliefs, practices, and laws recognizable today as Judaism. We discover a tradition of vigorous and joyous debate?where reinterpretation coexists with profound acceptance of the original instructions from God regarding the practice of faith.\n\nInsights into this historical evolution?especially with respect to the roles of Jerusalem and the Diaspora in Jewish history?can also deepen one&amp;#039;s perception of the historical, psychological, and religious forces at play in the Middle East today.\n\nHow Did Judaism Survive the Destruction of Its Most Sacred Place?Twice?\n\nThe crucial millennium on which Professor Gafni focuses twice witnessed the destruction of the Jewish people&amp;#039;s most sacred place: the Jewish Temple in Jerusalem. It was first destroyed by the Babylonians in 586 B.C.E., and, after having been rebuilt 70 years later, was razed once again by the Romans in 70 C.E., after the Jews waged a fierce uprising against Roman rule in the province of Judea. A major portion of the course is devoted to the period between these two landmark events that altered Jewish history forever.\n\nThe destruction of the Second Temple, according to Professor Gafni, is &quot;arguably the most important watershed in the history of the Jewish people,&quot; bringing about &quot;a total reshaping and redefining of the Judaism that had evolved for centuries prior to that event.&quot;\n\nIndeed, in the wake of the second destruction, Judaism&amp;#039;s earthly religious and political center was literally removed. What came next was not an end, but a beginning. Synagogues replaced the Temple. Prayer came into being as an alternative to sacrificial worship. And Rabbinic Judaism in time became the dominant model of the faith. But as Professor Gafni emphasizes, the evolution of a reshaped Judaism took place amid constant tension created by two competing forces.\n\nOn one hand, there was the fervent belief in the unchanging continuity of Judaism&amp;#039;s scriptural roots?a belief clearly expressed in the Rabbinic formulation, &quot;Whatever an established student is destined to teach has already been revealed to Moses at Sinai.&quot;\n\nAt the same time, however, the challenges brought about by a rapidly changing world and the need to adapt the practice of the faith to new and often bitter realities in order to survive introduced a constant process of innovation.\n\nWhat Does One of the Most Famous Rabbinical Stories Reveal about Judaism?\n\nA ready awareness of this tension?the axial theme of Professor Gafni&amp;#039;s approach to the course?has always been implicit in Judaism. Indeed, a candid admission of its power forms the core of a famous legend told by the rabbis themselves. The story recounts how Moses was granted the privilege of an incognito visit, many hundreds of years after his death, to a class of students studying the same Torah, or book of learning, he had received from God on Mount Sinai.\n\nThe class is led by Rabbi Akiva, the most prominent Jewish sage of the 2nd century. As Moses listens to their animated discussion of the Torah, he hears Rabbi Akiva ascribe a particularly difficult issue as a law &quot;given to Moses at Sinai.&quot; Moses realizes he cannot even recognize this law they are discussing?the law supposedly given to him.\n\nThe legend makes clear that the legal system on which Judaism rests has continuously been reinterpreted, and even innovatively recast, to reflect changing realities. At the same time, that law is still understood, without apology or a need for explanation, to have been revealed to Moses at Mount Sinai. Indeed, the innovation and reinterpretation necessary to deal with new realities could never be labeled as such, lest the links to the divine revelation at Sinai be broken.\n\nOne of those new realities was the destruction of the First Temple in 586 B.C.E., which had been built by King Solomon in the mid-10th century.\n\nThat destruction?accompanied by the capture and exile to Babylonia of 10,000 of Judea&amp;#039;s priests, officers, warriors, and most respected families?denied the people of Israel the sanctified place where the scripturally mandated practice of their faith should be carried out. And with so many of their nation seized and expelled, they also received their first glimpse of the phenomenon of Jewish Diaspora?or dispersion?which forever altered the social and cultural structure of their people.\n\n&quot;The lessons that Jews would have to learn now, after the destruction of their First Temple, after their new and initial dispersion around the Middle East,&quot; notes Professor Gafni, &quot;would accompany them throughout all of Jewish history. And they go to the heart of understanding Judaism, and the complex makeup of Judaism, which at times is a faith but at times is a land-oriented religion. And Jews would constantly juggle these two components of their self-identity.\n\n&quot;When do you stress the ethnic? When do you stress the geographic? When do you play down the political and say, well, we are really a faith, we are really a way of life, and, as the prophet Jeremiah advised the exiled Israelites of his own day, we should establish that &amp;#039;way of life&amp;#039; wherever we might reside, even in captivity?&quot;\n\nIn telling this story, our riveting lecturer draws on more than four decades of teaching skills and a broad array of approaches?including historical narrative, biblical episodes, anecdotes, and some wonderfully apt Rabbinic tales?designed to bring into clear focus an ancient past. Professor Gafni&amp;#039;s expert instruction reminds us that a master teacher can help us see the past from the perspective of a participant.","torrent":{"xt":"urn:btih:0f3ad36fe078f8dc0b39b84b6ef6cf5bc619a13c","amp;dn":"TTC+-+Beginnings+of+Judaism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f3ad36fe078f8dc0b39b84b6ef6cf5bc619a13c","infoHashBuffer":{"type":"Buffer","data":[15,58,211,111,224,120,248,220,11,57,184,75,110,246,207,91,198,25,161,60]},"announce":[],"urlList":[]}}