{"title":"The Beatles - Beatles For Sale (1964) WMA320","uid":6282007,"size":87711707,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0f90548aee973e3219540bf6a0e4fcc453663435&amp;dn=The+Beatles+-+Beatles+For+Sale+%281964%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1301474048,"description":"The fourth album by the Fabs is, yes, kind of subdued, but not by much. There are upbeat numbers like &quot;Rock And Roll Music,&quot; the US #1 single &quot;Eight Days A Week,&quot; Ringo's cover of Carl Perkins' &quot;Honey Don't,&quot; and the Little Richard medley to speed things up. Gee, I've listed the bright spots of the album already!\nHowever, songs like &quot;I'm A Loser,&quot; &quot;Baby's In Black,&quot; and &quot;I Don't Want To Spoil The Party&quot; reflect a kind of weariness creeping in that later evolved into the introspective Rubber Soul. I mean, check out the sombre mugs on the album cover!\n\nThere aren't that many cover songs here than there were on their first two albums, but the ones they cover are beauts. The best of these is Chuck Berry's &quot;Rock And Roll Music&quot; with that immortal chorus, &quot;give me that rock and roll music/if you wanna dance with me.&quot;\n\nThat being said, the Beatles have expressed that melancholy in upbeat songs such as &quot;No Reply.&quot; That is about a girl who dates someone else and has her family covering for her. The poignancy expressed with the &quot;I nearly died&quot; refrain. And &quot;I'm A Loser,&quot; in the same uppity vein, has lyrics such as &quot;Beneath this mask I am wearing a frown.&quot; is it for her or for myself that I cry?&quot;\n\nThe mid-paced &quot;Baby's In Black&quot; has shades of Dylan, hard to tell since all four of them are singing in contrast to Dylan's stark solo vocal. Love that lyric: &quot;Baby's in black and I'm feeling blue.&quot;\n\nPaul sings a nice slow ditty &quot;I'll Follow The Sun&quot;, which happened to be one of his earliest compositions dating back to the late 1950's. In contrast, he wildly covers the engaging Little Richard medley, &quot;Kansas City/Hey, Hey, Hey, Hey.&quot; Wonder how it sounds compared to the original.\n\nDespite being Buddy Holly fans, &quot;Words Of Love&quot; is the only Holly song done, and it's lovingly done on this album, with Ringo's percussive instrument being a packing case of all things!\n\nGeorge's only song here is the Carl Perkins number &quot;Everybody's Trying To Be My Baby.&quot; Ironically, Ringo's song here is also a Carl Perkins number. Both do their admirably best here.\n\nFor Sale is still a superior Beatles album despite the sobriety of many of the songs. \n\nby Daniel J. Hamlow\n\nTRACKLIST:\n\n01 - No Reply.wma                                           \n02 - I'm A Loser.wma                                        \n03 - Baby's In Black.wma                                    \n04 - Rock And Roll Music.wma                                \n05 - I'll Follow The Sun.wma                                \n06 - Mr. Moonlight.wma                                      \n07 - Medley A - Kansas City B - Hey, Hey, Hey, Hey.wma      \n08 - Eight Days A Week.wma                                  \n09 - Words Of Love.wma                                      \n10 - Honey Don't.wma                                        \n11 - Every Little Thing.wma                                 \n12 - I Don't Want To Spoil The Party.wma                    \n13 - What You're Doing.wma                                  \n14 - Everybody's Trying To Be My Baby.wma \n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB","torrent":{"xt":"urn:btih:0f90548aee973e3219540bf6a0e4fcc453663435","amp;dn":"The+Beatles+-+Beatles+For+Sale+%281964%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f90548aee973e3219540bf6a0e4fcc453663435","infoHashBuffer":{"type":"Buffer","data":[15,144,84,138,238,151,62,50,25,84,11,246,160,228,252,196,83,102,52,53]},"announce":[],"urlList":[]}}