{"title":"Mo Yan - Nobel Prize in Literature, 2012 (13 books)","uid":14506960,"size":37746284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fb0c096d6a386edc1fb77e0612e512bef6e8042&amp;dn=Mo+Yan+-+Nobel+Prize+in+Literature%2C+2012+%2813+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":39,"time":1462235445,"description":"MO YAN, the pen name of Guan Moye (b. 1955), is a Chinese novelist and short story writer.  He was awarded the 2012 Nobel Prize in Literature for his work as a writer &quot;who with hallucinatory realism merges folk tales, history and the contemporary.&quot;\n\nThrough a mixture of fantasy and reality, historical and social perspectives, Mo Yan has created a world reminiscent in its complexity of those in the writings of Faulkner and García Márquez, at the same time finding a departure point in old Chinese literature and in oral tradition.  In his Award Ceremony Speech, Per Wästberg explained: &quot;Mo Yan is a poet who tears down stereotypical propaganda posters, elevating the individual from an anonymous human mass.  Using ridicule and sarcasm Mo Yan attacks history and its falsifications as well as deprivation and political hypocrisy.&quot;\n\nRED SORGHUM (1987) is an epic historical novel about the generations of a Shandong family between 1923 and 1976, dealing with upheavals in Chinese history such as the War of Resistance Against Japanese Aggression, the Communist Revolution, and the Cultural Revolution.  The film version of the novel won first prize in the Golden Bear awards at the 1988 Berlin Film Festival.  His second novel, THE GARLIC BALLADS (1988), is based on a true story of when the farmers of Gaomi Township rioted against a government that would not buy its crops, while THE REPUBLIC OF WINE (1992) is a satire around gastronomy and alcohol, which uses cannibalism as a metaphor for Chinese self-destruction, following Lu Xun.  Both were judged subversive because of their sharp criticism of contemporary Chinese society.\n\nBIG BREASTS &amp; WIDE HIPS (1996) is a broad historical fresco portraying 20th-century China through the microcosm of a single family, and dealing with female bodies, from a grandmother whose breasts are shattered by Japanese bullets, to a festival where one of the child characters blesses each woman of his town by stroking her breasts.  In POW! (2003), a benign old monk listens to a prospective novice’s tale of depravity, violence, and carnivorous excess while a nice little family drama -- in which nearly everyone dies -- unfurls.\n\nThe novel LIFE AND DEATH ARE WEARING ME OUT (2006) is a meta-fiction about the story of a landlord who is reincarnated in the form of various animals during the Chinese land reform movement, using black humour to describe everyday life and the violent transmogrifications in the young People's RePublic.  SANDALWOOD DEATH (2008) is a story of human cruelty in the crumbling Empire.  FROG (2009) spans the pre-revolutionary era and China's modern day consumer society, addressing the draconian One-Child Policy, and the conflicts between government abortion planners, who believe that they are doing the right thing, and prospective parents.\n\nThe six short stories in EXPLOSIONS &amp; OTHER STORIES (1991) present unsentimental portrayals of grinding poverty, forced abortion, sexual and emotional repression, with mordant humour and fantastical flights of imagination.  Mo Yan's often dark vision is transformed by his deep love for his land and people, his mastery of language and the sheer intensity and exuberance of his writing.  CHANGE (2010), a novella disguised as autobiography, or vice-versa, personalizes the political and social changes in China over the past few decades.  By moving back and forth in time and focusing on small events and everyday people, Mo Yan breathes life into history by describing the effects of larger-than-life events on the average citizen. \n\n\nThe following books are in ePUB/Mobi and/or PDF format as indicated below:\n\n* Big Breasts and Wide Hips: A Novel (Arcade, 2004).  Translated by Howard Goldblatt. -- ePUB/Mobi + PDF\n\n* Change (Seagull, 2010).  Translated by Howard Goldblatt. -- PDF\n\n* Explosions and Other Stories (Chinese University of Hong Kong, 1991).  Edited by Janice Wickeri. -- PDF\n\n* Frog (Penguin, 2014).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Garlic Ballads, The: A Novel (Arcade, 2012).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Life and Death are Wearing Me Out: A Novel (Arcade, 2011).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Pow! (Seagull, 2012).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Radish (Penguin, 2016).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Red Sorghum: A Novel of China (Penguin, 1994 / Arrow, 2003).  Translated by Howard Goldblatt. -- ePUB/Mobi + PDF (scan courtesy of @pharmakate)\n\n* Republic of Wine, The: A Novel (Arcade, 2000).  Translated by Howard Goldblatt. -- ePUB/Mobi + PDF\n\n* Sandalwood Death: A Novel (Univ. of Oklahoma, 2013).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Shifu, You’ll Do Anything for a Laugh (Arcade Pub., 2011).  Translated by Howard Goldblatt. -- ePUB/Mobi\n\n* Storytellers: The Nobel Prize Lecture (Nobel Foundation, 2012).  Translated by Howard Goldblatt. -- PDF\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                            \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:0fb0c096d6a386edc1fb77e0612e512bef6e8042","amp;dn":"Mo+Yan+-+Nobel+Prize+in+Literature%2C+2012+%2813+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb0c096d6a386edc1fb77e0612e512bef6e8042","infoHashBuffer":{"type":"Buffer","data":[15,176,192,150,214,163,134,237,193,251,119,224,97,46,81,43,239,110,128,66]},"announce":[],"urlList":[]}}