{"title":"Yoga Undressed - The Beginner Practice (Celebrate the Body In It","uid":8747603,"size":273319626,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0fb91f93b7b823f38a400e53bf2e427507fdeff0&amp;dn=Yoga+Undressed+-+The+Beginner+Practice+%28Celebrate+the+Body+In+It&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"hotpena","files":-1,"time":1374960724,"description":"Yoga Undressed - The Beginner Practice (Celebrate the Body In Its Most Sacred Form)\n-----------------------------------------------------------------------\n\nYour Body is a Temple. Come inside and pay homage ... \n\nSurrender to your natural, authentic being. Return to innocence, a sanctuary for your spirit where you can cultivate strength, grace, intimacy and reverence for your own sacred self.\n\nA flowing tantric vinyasa yoga practice combining an introduction to kundalini and the essentials of vinyasa hatha yoga, this Beginner movie will remind you of your joyful, unfettered spirit, as you move from grounding kundalini exercises to sun salutations, warrior poses, standing balances, backbends and twists.\n\nStrengthen and tone every part of your body, increase flexibility and balance and find peace of mind. Feel more empowered, energized, and beautiful with every new asana you learn, all done with a heightened sense of awareness, in your most essential, pure, and natural  state, radiant and at one with yourself.\nExperience the innate power and grace of your life force and your natural beauty, unadorned and perfect because of it your inherent freedom and essential aliveness that yoga serves to liberate.","torrent":{"xt":"urn:btih:0fb91f93b7b823f38a400e53bf2e427507fdeff0","amp;dn":"Yoga+Undressed+-+The+Beginner+Practice+%28Celebrate+the+Body+In+It","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb91f93b7b823f38a400e53bf2e427507fdeff0","infoHashBuffer":{"type":"Buffer","data":[15,185,31,147,183,184,35,243,138,64,14,83,191,46,66,117,7,253,239,240]},"announce":[],"urlList":[]}}