{"title":"The Illuminatus Trilogy - Robert Shea &amp; Robert Anton Wilson","uid":4517496,"size":659926444,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0fd89beb42d3840dcb79965f9e04d77fef4e7b87&amp;dn=The+Illuminatus+Trilogy+-+Robert+Shea+%26+Robert+Anton+Wilson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Lucid6425","files":109,"time":1227030912,"description":"UNABRIDGED AUDIOBOOK PERFORMED BY KEN CAMPBELL &amp; CHRIS FAIRBANK\n\nThe Illuminatus! Trilogy is a series of three novels written by Robert Shea and Robert Anton Wilson purportedly between 1969 and 1971[1], and first published in 1975. The trilogy is a satirical, postmodern, science fiction-influenced adventure story; a drug-, sex- and magic-laden trek through a number of conspiracy theories, both historical and imaginary, which hinge around the authors&amp;#039; version of the Illuminati. The narrative often switches between third and first person perspectives and jumps around in time. It is thematically dense, covering topics like counterculture, numerology and Discordianism.\n\nThe trilogy comprises the books The Eye in the Pyramid, The Golden Apple and Leviathan. They were first published starting in September 1975, as three separate volumes, and in 1984 as an omnibus; they are now more commonly reprinted in the latter form. The trilogy won the Prometheus Hall of Fame Award, designed to honor classic libertarian fiction\n, in 1986.[2] The authors went on to create several works, both fiction and nonfiction, that further discussed the themes of the trilogy, but no direct sequels were produced. Illuminatus! has been adapted for the stage, and has influenced several modern writers, musicians\nand games-makers. The popularity of the word &quot;fnord&quot; and the 23 enigma can both be attributed to the trilogy. It remains a seminal work of conspiracy fiction, predating Foucault&amp;#039;s Pendulum and The Da Vinci Code by decades.\n\n-http://en.wikipedia.org/wiki/The_Illuminatus!_Trilogy\n\nThis torrent\ncontains all 3 parts to the series.\n\nEnjoy!\n\n","torrent":{"xt":"urn:btih:0fd89beb42d3840dcb79965f9e04d77fef4e7b87","amp;dn":"The+Illuminatus+Trilogy+-+Robert+Shea+%26+Robert+Anton+Wilson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd89beb42d3840dcb79965f9e04d77fef4e7b87","infoHashBuffer":{"type":"Buffer","data":[15,216,155,235,66,211,132,13,203,121,150,95,158,4,215,127,239,78,123,135]},"announce":[],"urlList":[]}}