{"title":"Positive Intelligence: Why Only 20% of Teams and Individuals Ach","uid":7368077,"size":7265973,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:10068893ae957d17461ebb0d50ff6ca18b5f2133&amp;dn=Positive+Intelligence%3A+Why+Only+20%25+of+Teams+and+Individuals+Ach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"MANTESH","files":5,"time":1340157467,"description":"\n\n\n[img]http://ecx.images-amazon.com/images/I/41XYduAEDwL._SS500_.jpg[/img]\n\n[b][quote][color=Green]\n\n\nPositive Intelligence: Why Only 20% of Teams and Individuals Achieve Their True Potential AND HOW YOU CAN ACHIEVE YOURS \n\n\nPublisher: Greenleaf Book Group Press\nShirzad Chamine\n2012\nEnglish\nISBN: 1608322785 \nEPUB , MOBI , PDF \n224 pages\n6.92 MB\n\n\n\n New York Times Bestseller! In his popular Stanford University lectures, Shirzad Chamine reveals how to achieve one's true potential for both professional success and personal fulfillment. His groundbreaking research exposes ten well-disguised mental Saboteurs. Nearly 95 percent of the executives in his Stanford lectures conclude that these Saboteurs cause &quot;significant harm&quot; to achieving their full potential. With Positive Intelligence, you can learn the secret to defeating these internal foes.\n\n\n Positive Intelligence (PQ) measures the percentage of time your mind is serving you as opposed to sabotaging you. While your IQ and EQ (emotional intelligence) contribute to your maximum potential, it is your PQ that determines how much of that potential you actually achieve.\n\n The great news is that you can improve your PQ significantly in as little as 21 days. With higher PQ, teams and professionals ranging from leaders to salespeople perform 30-35 percent better on average. Importantly, they also report being far happier and less stressed.\n\n The breakthrough tools and techniques in this book have been refined over years of coaching hundreds of CEOs and their executive teams. Shirzad tells many of their remarkable stories, showing you how you too can take concrete steps to unleash the vast, untapped powers of your mind.\n\n DISCOVER HOW TO:\n\n * Identify and conquer your top mental Saboteurs. Common Saboteurs include the Judge, Controller, Victim, Avoider, and Pleaser.\n * Measure the Positive Intelligence score (PQ) for yourself or your team--see how close you come to the critical tipping point required for peak performance.\n * Increase PQ dramatically in as little as 21 days.\n * Develop new brain &quot;muscles,&quot; and access 5 untapped powers with energizing mental &quot;power games.&quot;\n * Apply PQ tools and techniques to increase both performance and fulfillment. Applications include team building, mastering workload, working with &quot;difficult&quot; people, improving work/life balance, reducing stress, and selling and persuading.\n\n\n\n[/color][/quote][/b]\n\n\n\n\n\n\n\n[img]http://torrent-stats.info/bb0d/15b9ededa.png[/img]\n\n\n","torrent":{"xt":"urn:btih:10068893ae957d17461ebb0d50ff6ca18b5f2133","amp;dn":"Positive+Intelligence%3A+Why+Only+20%25+of+Teams+and+Individuals+Ach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10068893ae957d17461ebb0d50ff6ca18b5f2133","infoHashBuffer":{"type":"Buffer","data":[16,6,136,147,174,149,125,23,70,30,187,13,80,255,108,161,139,95,33,51]},"announce":[],"urlList":[]}}