{"title":"The Beatles - Magical Mystery Tour [320k MP3]","uid":7704258,"size":89508492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1009647895caaf0ba50a7991b4bfe86f457b4f6d&amp;dn=The+Beatles+-+Magical+Mystery+Tour+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"smbdownload","files":-1,"time":1349639894,"description":"Magical Mystery Tour is a double EP and LP by the English rock group The Beatles, produced by George Martin, both including the six-song soundtrack to the 1967 film of the same name. The material was released in the United Kingdom on 8 December 1967 as a six-track double EP on the Parlophone label; in the United States the record, released on 27 November 1967, was an eleven-track LP compiled by Capitol Records, adding the band's 1967 single releases. The EP was also released in Germany, France, Spain, Yugoslavia, Australia and Japan.  The first official release of the recordings in the UK as an eleven-track LP did not occur until 1976.\n\nThe soundtrack was a critical and commercial success, a #1 album in the US and Grammy-nominated, despite the widespread media criticism of the Magical Mystery Tour film.\n\nIn 1987 when the Beatles updated its entire recorded canon for digital Compact Disc release, the track-listing of the 1967 US LP release was adopted as the official &quot;core catalogue&quot; version of the Magical Mystery Tour recordings rather than the six-track 1967 UK release which would not have been a practical configuration in the CD era. The album was remastered 9 September 2009 for the first time since its CD release.\n\nThe number of songs used in the film posed a challenge for The Beatles and their UK record company EMI, as there were too few for an LP album but too many for an EP.[3] One idea considered was to issue an EP which played at 33â…“ rpm but this would have caused a loss of audio fidelity that was deemed unacceptable. The solution chosen was to issue an innovative format of two EP's packaged in a gatefold sleeve with a 28-page booklet containing the lyrics and colour pictures.[3] Of the package, Bob Neaverson wrote &quot;While it certainly solved the song quota problem, one suspects that it was also partly born of The Beatles' pioneering desire to experiment with conventional formats and packaging&quot;.[4] The package was released in the UK on 8 December, in time for the Christmas market, at the sub Â£1 price of 19s 6d[3] (equivalent to Â£13 today).\n\nIn the US, EPs were not popular at the time so (and against The Beatles' wishes) Capitol Records decided to release the soundtrack as an LP by adding tracks from that year's non-album singles.[3] The first side of the LP was the film soundtrack (like earlier British Beatles soundtrack albums), and the second side was all the A-side and B-sides released in 1967, with three of the five songs - &quot;Penny Lane&quot;, &quot;Baby, You're a Rich Man&quot; and &quot;All You Need Is Love&quot; - presented in duophonic, fake &quot;processed&quot; stereo sound.[3][5]\n\n&quot;I Am the Walrus&quot; is in true-stereo only part way through, after which the sound becomes fake stereo, on all stereo releases of both packages.\n\n2009 STEREO REMASTER\n\n01. \t&quot;Magical Mystery Tour&quot;   \tMcCartney \t2:48\n02. \t&quot;The Fool on the Hill&quot;   \tMcCartney \t3:00\n03. \t&quot;Flying&quot;  \t(Instrumental) \t2:16\n04. \t&quot;Blue Jay Way&quot; (Harrison) \tHarrison \t3:50\n05. \t&quot;Your Mother Should Know&quot;   \tMcCartney \t2:33\n06. \t&quot;I Am the Walrus&quot;   \tLennon \t4:35\n07. \t&quot;Hello, Goodbye&quot;   \tMcCartney \t3:24\n08. \t&quot;Strawberry Fields Forever&quot;   \tLennon \t4:05\n09. \t&quot;Penny Lane&quot;   \tMcCartney \t3:00\n10. \t&quot;Baby, You're a Rich Man&quot;   \tLennon \t3:07\n11. \t&quot;All You Need Is Love&quot;   \tLennon \t3:57\n","torrent":{"xt":"urn:btih:1009647895caaf0ba50a7991b4bfe86f457b4f6d","amp;dn":"The+Beatles+-+Magical+Mystery+Tour+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1009647895caaf0ba50a7991b4bfe86f457b4f6d","infoHashBuffer":{"type":"Buffer","data":[16,9,100,120,149,202,175,11,165,10,121,145,180,191,232,111,69,123,79,109]},"announce":[],"urlList":[]}}