{"title":"Ivan's War Life and Death in the Red Army, 1939-1945 by Catherin","uid":9413277,"size":3109616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:11a68536cd4aaf80bed25013a886a88a3cbf139c&amp;dn=Ivan%27s+War+Life+and+Death+in+the+Red+Army%2C+1939-1945+by+Catherin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"420weedman","files":-1,"time":1388360857,"description":" A powerful, groundbreaking narrative of the ordinary Russian soldier's experience of the worst war in history, based on newly revealed sources \nOf the thirty million who fought, eight million died, driven forward in suicidal charges, shattered by German shells and tanks. They were the men and women of the Red Army, a ragtag mass of soldiers who confronted Europe's most lethal fighting force and by 1945 had defeated it. Sixty years have passed since their epic triumph, but the heart and mind of Ivan--as the ordinary Russian soldier was called--remain a mystery. We know something about hoe the soldiers died, but nearly nothing about how they lived, how they saw the world, or why they fought. \nDrawing on previously closed military and secret police archives, interviews with veterans, and private letters and diaries, Catherine Merridale presents the first comprehensive history of the Red Army rank and file. She follows the soldiers from the shock of the German invasion to their costly triumph in Stalingrad, where life expectancy was often a mere twenty-four hours. Through the soldiers' eyes, we witness their victorious arrival in Berlin, where their rage and suffering exact an awful toll, and accompany them as they return home full of hope, only to be denied the new life they had been fighting to secure. \nA tour de force of original research and a gripping history, Ivan's War reveals the singular mixture of courage, patriotism, anger, and fear that made it possible for these underfed, badly led troops to defeat the Nazi army. In the process Merridale restores to history the invisible millions who sacrificed the most to win the war.","torrent":{"xt":"urn:btih:11a68536cd4aaf80bed25013a886a88a3cbf139c","amp;dn":"Ivan%27s+War+Life+and+Death+in+the+Red+Army%2C+1939-1945+by+Catherin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11a68536cd4aaf80bed25013a886a88a3cbf139c","infoHashBuffer":{"type":"Buffer","data":[17,166,133,54,205,74,175,128,190,210,80,19,168,134,168,138,60,191,19,156]},"announce":[],"urlList":[]}}