{"title":"HTML5 and CSS3: Level Up with Today's Web Technologies [Second E","uid":9535364,"size":16069488,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1204d3b144279046e7f3970108624f4a2ca56c5c&amp;dn=HTML5+and+CSS3%3A+Level+Up+with+Today%27s+Web+Technologies+%5BSecond+E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"MucGar","files":-1,"time":1390920649,"description":"HTML5 and CSS3: Level Up with Today's Web Technologies [Second Edition]\n\n\nEnglish | ISBN: 1937785599 | 2013 | 300 pages | PDF, EPUB | 15 MB\n\nHTML5 and CSS3 are more than just buzzwords--they're the foundation for today's web applications. This book gets you up to speed on the HTML5 elements and CSS3 features you can use right now in your current projects, with backwards compatible solutions that ensure that you don't leave users of older browsers behind. This new edition covers even more new features, including CSS animations, IndexedDB, and client-side validations.\n\nHTML5 and CSS3 power today's web applications, with semantic markup, better forms, native multimedia, animations, and powerful APIs. You'll get hands-on with all the new features with practical example projects, and find what you need quickly with this book's modular structure. &quot;Falling Back&quot; sections show you how to create solutions for older browsers, and &quot;The Future&quot; sections at the end of each chapter get you excited about the possibilities when features mature. \n\nThis revised second edition walks you through new features such as IndexedDB, CSS Animations, SVG, and more, along with updated fallback solutions. You'll use HTML5's new markup to create better structure for your content and better interfaces for your forms. You'll work with new form controls and validations, and build interfaces that are accessible to assistive technology and mobile devices. You'll draw with the Canvas and SVG, do simple animations with pure CSS, work with advanced CSS selectors, and make audio and video play natively.\n\nYou'll bring your web apps to the next level as you use Web Storage and IndexedDB to save data on the client and make applications available offline. And you'll discover how to use web sockets, geolocation, cross-document messaging, and the History API to create even more interactive applications.\n\nToday, you have the flexibility that used to be only available through large JavaScript libraries or proprietary plugins. Get ready for today's web.\n\nWhat You Need:\n\nYou'll need the latest versions of Google Chrome, Firefox, Opera, and Internet Explorer, along with a text editor with good support for HTML5 and CSS3 syntax. Instructions for testing on older versions of Internet Explorer are included in the book.","torrent":{"xt":"urn:btih:1204d3b144279046e7f3970108624f4a2ca56c5c","amp;dn":"HTML5+and+CSS3%3A+Level+Up+with+Today%27s+Web+Technologies+%5BSecond+E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1204d3b144279046e7f3970108624f4a2ca56c5c","infoHashBuffer":{"type":"Buffer","data":[18,4,211,177,68,39,144,70,231,243,151,1,8,98,79,74,44,165,108,92]},"announce":[],"urlList":[]}}