{"title":"Relax Your Neck, Liberate Your Shoulders: The Ultimate Exercise ","uid":7243016,"size":20125677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12620842d94ced8d6b9cc528709b91116058c4a4&amp;dn=Relax+Your+Neck%2C+Liberate+Your+Shoulders%3A+The+Ultimate+Exercise+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"MANTESH","files":3,"time":1336185946,"description":"[img]http://ecx.images-amazon.com/images/I/51fORPM6gBL._SS500_.jpg[/img]\n[b][quote][color=Green]\n\nRelax your neck, liberate your shoulders - The ultimate exercise program for tension relief\n\nPublisher: Princeton Book Company\nEric Franklin\nEnglish \n2002\nISBN: 0871272482 \nPDF \n114 pages \n19 MB\n\n\nThis work, based on an established technique already used by athletes and teachers of dance called ideokinesis, is about how to transfer pain permanently into well-being. We're stressed out and have no time. And, once again, our necks are sore and our shoulders are tense. What can we do to become more permanently flexible, and to face daily challenges more calmly and without tension. The exercises in this book developed by Eric Franklin make it possible to become loose and relaxed in a playful way, and to discover increased lightness in both body and soul.\nThe exercises can be used to target specific problems, but are also very effective in transforming pain into well-being. Imagery and touch are the keys to this unique approach to eliminating stiffness and pain in the neck and shoulders, with simple and effective exercises that can be done at home, on the job, or while travelling. Experiment with the variety of techniques presented and choose those that work the best. Sufferers of upper body pain will learn how to detect and eradicate early signs of tension. Understand the connection between emotional states and tension. Survive stressful situations calmly and without tensing a muscle. Discover how improving the alignment of the head, neck and shoulders will ease the strain on muscles and joints and promote an aura of confidence and health.\n\n\n[/color][/quote][/b]\n\n\n\n\n\n\n\n[img]http://torrent-stats.info/c528/167032890.png[/img]\n","torrent":{"xt":"urn:btih:12620842d94ced8d6b9cc528709b91116058c4a4","amp;dn":"Relax+Your+Neck%2C+Liberate+Your+Shoulders%3A+The+Ultimate+Exercise+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12620842d94ced8d6b9cc528709b91116058c4a4","infoHashBuffer":{"type":"Buffer","data":[18,98,8,66,217,76,237,141,107,156,197,40,112,155,145,17,96,88,196,164]},"announce":[],"urlList":[]}}