{"title":"Randy Pausch - The Last Lecture - Audio Book","uid":10070432,"size":431300662,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:126d5781badec10d8df24bc8f42ad2badcb72e67&amp;dn=Randy+Pausch+-+The+Last+Lecture+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Big-Papi","files":-1,"time":1398842985,"description":"Skip Shuffle - If you have this audio book on your music player and shuffle songs none of these audio book tracks will play.\n\nRemember Position - If you hit the stop button when the track is resumed later it will begin to play where it left off. \n\nAlbum Display - When viewing this audio book in your music player you will see one album with cover art and 4 discs inside.\n\n\n\n\n\n\nBy Jesse Kornbluth\n\nOne of the staples of &quot;the college experience&quot; at many schools is the &quot;last lecture&quot; --- a beloved professor sums up a lifetime of scholarship and teaching as if he/she were heading out the door for the last time. It's the kind of tweed-jacket-with-elbow-patches talk that may or may not impart useful knowledge and lasting inspiration, but almost surely gives all present some warm and fuzzy feelings.\n\nBut a &quot;last lecture&quot; by Randy Pausch was different in every possible way. The professor of Computer Science, Human Computer Interaction, and Design at Carnegie Mellon University was just 46, and this really was his last lecture --- he was dying.\n\nAnd dying fast. In the summer of 2006, Pausch had been diagnosed with pancreatic cancer, a ferociously efficient killer. Only 4% of its victims are alive five years after diagnosis. Most die much faster. Think months, not years.\n\nPausch fought back. Surgery. Chemo. Progress. But in August of 2007, the cancer returned --- and now it had metastasized to his liver and spleen. The new prognosis: 3-6 months of relative health, then a quick dispatch to the grave, leaving behind a wife and three little kids.\n\nOn September 18, 2007 --- less than a month later --- Randy Pausch gave his last lecture.\n\nNo one would have faulted him for launching a blast about desperately seizing opportunities in an irrational universe. Instead, Pausch delivered a laugh-filled session of teaching stories about going after your childhood dreams and helping others achieve theirs and enjoying every moment in your life --- even the ones that break your heart. Pausch's philosophy, in brief: &quot;We cannot change the cards we are dealt, just how we play the hand.&quot;\n\nThe lecture was taped, and slapped up on YouTube. Jeffrey Zaslow wrote about it in The Wall Street Journal, and news shows made Pausch &quot;person of the week&quot; --- and soon Pausch had a book deal reported to be worth almost $7 million. Few expected him to be alive when it was published.\n\nOn February 19, I interviewed Randy Pausch for Reader's Digest. To the surprise of many --- including Pausch --- he was still his recognizable, energetic self. As I write (in early April, 2008), Pausch reports he's recovering from a standing eight count. But his good news doesn't deceive him. He notes that pancreatic cancer did to the photographer Dith Pran (&quot;The Killing Fields&quot;) what Pol Pot couldn't --- it buried him in three months.\n\nAnd now we have the book. It's two books, really, because it reads one way with the author still among us and will surely read differently when &quot;The Last Lecture&quot; is like the The Butterfly and the Diving Bell --- the record of a dead man, talking. The first book invites your support and gives you a wake-up call. The second, I suspect, is also a wake-up call but, between the lines, reminds you that even happiness can't save you from death.\n\nSomewhere in between --- in the quiet space where a book really lives --- is a document that accomplishes a lot in 200 pages. It's about paying attention to what you think is important (when asked how he got tenure early, Pausch replied, &quot;Call me at my office at 10 o'clock on Friday night and I'll tell you&quot;) and working hard and listening really well. It's easy to miss that last part of that in the emotion and the stories surrounding this book, but Pausch argues that hearing what other people say about you and your work is crucial to success and happiness. Because this is what you get: &quot;a feedback loop for life.&quot;\n\nSo, if you must, shed your tears for Randy Pausch. Imagine what it would be like if you or your dearest loved one drew the card called pancreatic cancer. And then put dying aside, and get on with your dreams. Amazing how many you can achieve if you want them badly enough. And how they have the power to cushion the pain when the bad stuff happens.\n\nSounds crazy, I know: Pollyanna in the cancer ward. But I talked with the guy. And we laughed and laughed. Of all the achievements in a life that's winding down, that's got to be up there.","torrent":{"xt":"urn:btih:126d5781badec10d8df24bc8f42ad2badcb72e67","amp;dn":"Randy+Pausch+-+The+Last+Lecture+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"126d5781badec10d8df24bc8f42ad2badcb72e67","infoHashBuffer":{"type":"Buffer","data":[18,109,87,129,186,222,193,13,141,242,75,200,244,42,210,186,220,183,46,103]},"announce":[],"urlList":[]}}