{"title":"A Visual Dictionary of Architecture - Second Edition","uid":7684932,"size":111409048,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1299d7fbdfd1563782a0604bbb55cf14552adea1&amp;dn=A+Visual+Dictionary+of+Architecture+-+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gr8gr8gr8","files":1,"time":1348878700,"description":"The classic, bestselling reference on architecture now revised and expanded!\n\nAn essential one-volume reference of architectural topics using Francis D.K. Ching's signature presentation. It is the only dictionary that provides concise, accurate definitions illustrated with finely detailed, hand-rendered drawings. From Arch to Wood, every concept, technology, material and detail important to architects and designers are presented in Ching's unique style.\n\n    Combining text and drawing, each term is given a minimum double-page spread on large format trim size, so that the term can be comprehensively explored, graphically showing relations between concepts and sub-terms\n    A comprehensive index permits the reader to locate any important word in the text.\n    This long-awaited revision brings the latest concepts and technology of 21st century architecture, design and construction to this classic reference work \n\nIt is sure to be by the side of and used by any serious architect or designer, students of architecture, interior designers, and those in construction.\n\n\n--------------------------------------------------------------------\n\nAuthor Information:\n\nFrancis D.K. Ching is Professor Emeritus of Architecture at the University of Washington. He is the author or coauthor of numerous architecture and design books, including Architectural Graphics; Architecture: Form, Space, and Order; A Global History of Architecture; Interior Design Illustrated; and Building Construction Illustrated, all from Wiley.","torrent":{"xt":"urn:btih:1299d7fbdfd1563782a0604bbb55cf14552adea1","amp;dn":"A+Visual+Dictionary+of+Architecture+-+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1299d7fbdfd1563782a0604bbb55cf14552adea1","infoHashBuffer":{"type":"Buffer","data":[18,153,215,251,223,209,86,55,130,160,96,75,187,85,207,20,85,42,222,161]},"announce":[],"urlList":[]}}