{"title":"KnockoutJS Web Development ( [PDF]~Storm~","uid":11795006,"size":2209622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:129c2b58713c369687f8ae69d286d06b66de8e6e&amp;dn=KnockoutJS+Web+Development+%28+%5BPDF%5D%7EStorm%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"steelballz","files":2,"time":1428103970,"description":"\nDescription\nKnockoutJS Web Development\nAuthor: Farrar, John\nPublisher and Published Date:Packt Publishing (Feb. 27 2015)\nISBN: 1782161023\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nimage\n\n\nDESCRIPTION\n\n\n\nKnockout is a jQuery-friendly library that helps you to create rich, responsive displays and editor user interfaces with a clean underlying data model.\n\nStarting with the installation and configuration of KnockoutJS, this book will describe the ins and outs of working with forms using arrays, nesting, and grids.\n\nYou will learn about event binding and context binding properties using JSON and AJAX. You will then explore the features of KnockoutJS like mapping and how to go about it using controller options. You will also learn how to use this feature for mapping multiple objects and managing them. This book provides an in-depth explanation of native templates, enhanced collection handling, and render event handling using third-party template engines.\n\nBy the end of the book, you will have knowledge of all the different functionalities KnockoutJS has to offer.\nAbout the Author\nJohn Farrar is a man who has a passion for pragmatic technology. He started working on computers in the late 70s and has watched the trends as closely as he watches the milestones. His work included programming on early computers, repairing military flight simulators in the navy, and working on web technology that helps people get business done. This work included building early commerce solutions for Apple, Brunswick Recreation, and Casio and working for a number of other companies along the letters of the alphabet. He is inspired and passionate about understanding the need before choosing the technology that answers the challenge. Over the years, John has worked on a couple of books for ColdFusion, multiple open source projects from early Fusebox, community participation with jQuery, and some frameworks he created on his own. He has spoken at about a dozen conferences over the years and worked on supporting local and online users as time has permitted. He has provided technical training from online courses, in person class instructions, and a number of great intern programmers that let him share their entrance into the world of writing software.\n\nProudly sourced and uploaded by [StormRG]","torrent":{"xt":"urn:btih:129c2b58713c369687f8ae69d286d06b66de8e6e","amp;dn":"KnockoutJS+Web+Development+%28+%5BPDF%5D%7EStorm%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"129c2b58713c369687f8ae69d286d06b66de8e6e","infoHashBuffer":{"type":"Buffer","data":[18,156,43,88,113,60,54,150,135,248,174,105,210,134,208,107,102,222,142,110]},"announce":[],"urlList":[]}}