{"title":"Dirt Showdown XBOX360-COMPLEX","uid":7290224,"size":8739294914,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:12db7a37e85d268561738398fe6c615435f56410&amp;dn=Dirt+Showdown+XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":8,"uploader":"boobsman","files":-1,"time":1337712115,"description":"THIS IS AN XGD3 ISO AND IS ONLY BE PLAYABLE WITH LT+2.0 or ABOVE!!!\n\nDirt Showdown XBOX360-COMPLEX\n\nDiRT Showdown is a brand new dive in and drive adrenaline rush of \nspeed, style and destruction from the creators of the multi-award \nwinning DiRT series. Players jump into a new world of arcade racing \nwith pick up and play controls, speeding, tricking and smashing their \nway to Showdown' finals to compete against rivals in front of \nthousands of fans in a vibrant festival atmosphere. \n\nThere are three broad categories to DiRT Showdown's stunning world of \naction-sport racing. Players will use nitrous to blast past rivals and \nnegotiate courses filled with ramps, multiple routes and obstacles in \nracing events. Gaming's most advanced damage engine is pushed to its \nlimits in demolition derby events, where players smash and crash their \nway to victory in jaw-dropping, bone-jarring style. Finally, in \nHoonigan events gamers can demonstrate their freestyle driving skill in \nhuge free-roaming stunt parks with new accessible controls. \n\nDiRT Showdown is Codemasters' most connected game ever - split-screen \nmultiplayer, eight player online racing, on and off-line quick-fire \nparty games, and YouTube integration all come as standard. Players can \nalso issue new Showdown Challenges' to compete with friends in on and \noff-line modes. \n\nIn the career mode, globe-trotting Showdown players will travel from \nMiami to San Francisco, London to Tokyo and other famous locations \nearning the adulation of the crowd at hyper-energised, frenzied, \nunsanctioned race events. Over 50 different events across four \nchampionships challenge gamers in a variety of conditions - sun, snow, \nand rain - through the day and under the floodlights at night. \n\nWith an exciting mix of licensed and bespoke cars and powered by the \nEGO Game Technology Platform for phenomenal graphical performance and \nstunning damage, DiRT Showdown will be the new standard for arcade \ndriving delirium. \n\nPlatform: XBOX360\nFormat XGD3\nRegion: Region Free\nSize: 1 DVD\nLanguage: English\nGenre: Racing\n &lt;a href=&quot;\nhttp://www.freeimage.us/image-7007_4FBBBEB6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-7007_4FBBBEB6.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://www.freeimage.us/image-626F_4FBBBEB6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.freeimage.us/image-626F_4FBBBEB6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:12db7a37e85d268561738398fe6c615435f56410","amp;dn":"Dirt+Showdown+XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12db7a37e85d268561738398fe6c615435f56410","infoHashBuffer":{"type":"Buffer","data":[18,219,122,55,232,93,38,133,97,115,131,152,254,108,97,84,53,245,100,16]},"announce":[],"urlList":[]}}