{"title":"Magazine - Secondhand Daylight [1979] [FLAC]","uid":8082055,"size":298366509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:12f47d955cafbb3d881c2967f2383ae5b1e6a468&amp;dn=Magazine+-+Secondhand+Daylight+%5B1979%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dickspic","files":12,"time":1359521020,"description":"MOJO Magazine: Buried Treasure &quot;Album That Time Forgot.&quot;\n\nArtist: Magazine\nRelease: Secondhand Daylight\nDiscogs: 262307\nReleased: 1979-03-30 / 1988-10-00\nLabel: Virgin\nCatalog#: V 2121 / CDV 2121\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, New Wave\n\nTracklisting:\n\n01. Feed The Enemy (5:45)\n02. Rhythm Of Cruelty (3:03)\n03. Cut-Out Shapes (4:43)\n04. Talk To The Body (3:34)\n05. I Wanted Your Heart (5:13)\n06. The Thin Air (4:10)\n07. Back To Nature (6:40)\n08. Believe That I Understand (4:00)\n09. Permafrost (5:25)\n\nSecondhand Daylight, the second Magazine album, sounds like it must have been made in the dead of winter. You can imagine the steam coming out of Howard Devoto's mouth as he projects lines like &quot;I was cold at an equally cold place,&quot; &quot;The voyeur will realize this is not a sight for his sore eyes,&quot; &quot;It just came to pieces in our hands,&quot; and &quot;Today I bumped into you again, I have no idea what you want.&quot; You can picture Dave Formula swiping frost off his keys and Barry Adamson blowing on his hands during the intro to &quot;Feed the Enemy,&quot; as guitarist John McGeoch and drummer John Doyle zip their parkas. From start to finish, this is a showcase for Formula's chilling but expressive keyboard work. Given more freedom to stretch out and even dominate on occasion, Formula seems to release as many demons as Devoto, whether it is through low-end synthesizer drones or violent piano vamps. Detached tales of relationships damaged beyond repair fill the album, and the band isn't nearly as bouncy as it is on Real Life or The Correct Use of Soap -- it's almost as if they were instructed to play with as little physical motion as possible. The drums in particular sound brittle and on the brink of piercing the ears. Despite the sub-zero climate, the lack of dance numbers, and the shortage of snappy melodies, the album isn't entirely impenetrable. It lacks the immediate impact of Real Life and The Correct Use of Soap, but it deserves just as much recognition for its compellingly sustained petulance. Even if you can't get into it, you have to at least marvel at &quot;Permafrost.&quot; The album's finale, it's an elegant five-minute sneer, and as far as late-'70s yearbook scribbles are concerned, &quot;As the day stops dead, at the place where we're lost, I will drug you and f*ck you on the permafrost&quot; is less innocuous than &quot;All we are is dust in the wind.&quot; (allmusic)\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:12f47d955cafbb3d881c2967f2383ae5b1e6a468","amp;dn":"Magazine+-+Secondhand+Daylight+%5B1979%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12f47d955cafbb3d881c2967f2383ae5b1e6a468","infoHashBuffer":{"type":"Buffer","data":[18,244,125,149,92,175,187,61,136,28,41,103,242,56,58,229,177,230,164,104]},"announce":[],"urlList":[]}}