{"title":"George Orwell - Animal Farm Audio Book (w/ Chapters for ipod)","uid":4689937,"size":91310818,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:136ca353d58b58029b9a18f116266be0a3e82355&amp;dn=George+Orwell+-+Animal+Farm+Audio+Book+%28w%2F+Chapters+for+ipod%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"morsels","files":2,"time":1233356955,"description":"George Orwell's Animal Farm\nhttp://en.wikipedia.org/wiki/Animal_farm\n\n\nI downloaded this from here:\nhttp://thepiratebay.se/torrent/4197792/Animal_Farm_-_George_Orwell\n\nI combined all files and added chapter recognition for your ipod.\nI used a mac script called &quot;ChapterTool&quot; to do this.\n\nTitle: Animal Farm  (unabridged)\nAuthor:  George Orwell\nNarrator: Timothy West\nPlay Time: 3 hours 8 minutes\n\n\nAn allegory intricately woven to near-perfection.  Not a word is wasted by this author who saw the rise of Stalinism and prophecied its failure.  It's &quot;Charlotte's Web,&quot;  The Who's &quot;Won't Get Fooled Again,&quot; and &quot;1984&quot; all rolled into one brief work.  \n\nHonestly, how many of you first read this book because it was the shortest book you could choose for a required report?  d:c)  -- fervor\n-------------------------------------------------------------------------\n\nSince its publication in 1946, George Orwell's fable of a workers' revolution gone wrong has rivaled Hemingway's The Old Man and the Sea as the Shortest Serious Novel It's OK to Write a Book Report About. (The latter is three pages longer and less fun to read.) Fueled by Orwell's intense disillusionment with Soviet Communism, Animal Farm is a nearly perfect piece of writing, both an engaging story and an allegory that actually works. When the downtrodden beasts of Manor Farm oust their drunken human master and take over management of the land, all are awash in collectivist zeal. Everyone willingly works overtime, productivity soars, and for one brief, glorious season, every belly is full. The animals' Seven Commandment credo is painted in big white letters on the barn. All animals are equal. No animal shall drink alcohol, wear clothes, sleep in a bed, or kill a fellow four-footed creature. Those that go upon four legs or wings are friends and the two-legged are, by definition, the enemy. Too soon, however, the pigs, who have styled themselves leaders by virtue of their intelligence, succumb to the temptations of privilege and power. &quot;We pigs are brainworkers. The whole management and organisation of the farm depend on us. Day and night, we are watching over your welfare. It is for your sake that we drink that milk and eat those apples.&quot; While this swinish brotherhood sells out the revolution, cynically editing the Seven Commandments to excuse their violence and greed, the common animals are once again left hungry and exhausted, no better off than in the days when humans ran the farm. Satire Animal Farm may be, but it's a stony reader who remains unmoved when the stalwart workhorse, Boxer, having given his all to his comrades, is sold to the glue factory to buy booze for the pigs. Orwell's view of Communism is bleak indeed, but given the history of the Russian people since 1917, his pessimism has an air of prophecy. --Joyce Thompson","torrent":{"xt":"urn:btih:136ca353d58b58029b9a18f116266be0a3e82355","amp;dn":"George+Orwell+-+Animal+Farm+Audio+Book+%28w%2F+Chapters+for+ipod%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"136ca353d58b58029b9a18f116266be0a3e82355","infoHashBuffer":{"type":"Buffer","data":[19,108,163,83,213,139,88,2,155,154,24,241,22,38,107,224,163,232,35,85]},"announce":[],"urlList":[]}}