{"title":"A Frequency Dictionary of Dutch","uid":12075542,"size":5799281,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13786a998ddaf347645410c76adc75ad1ccd7fe7&amp;dn=A+Frequency+Dictionary+of+Dutch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":2,"time":1435629866,"description":"A Frequency Dictionary of Dutch is a valuable tool for all learners of Dutch, providing a list of the 5,000 most frequently used words in the language. Based on a 290 million word corpus which includes both written and spoken material from a wide range of sources, this dictionary presents Dutch core vocabulary in a detailed and clearly arranged manner: each of the 5,000 entries includes English equivalents and a sample sentence showing language in use.\n\nUsers can access the top 5,000 words either through the main frequency listings or an alphabetical index. Throughout the frequency listings there are thematically organized lists featuring the top words from a variety of key topics such as animals, food and other areas of daily and cultural life. Words specific to Dutch in Belgium (Belgian Dutch) are also included.\n\nAn engaging and efficient resource, A Frequency Dictionary of Dutch will enable students of all levels to get the most out of their study.\n\nThis book was prepared in association with the Instituut voor Nederlandse Lexicologie (INL, Institute of Dutch Lexicology)","torrent":{"xt":"urn:btih:13786a998ddaf347645410c76adc75ad1ccd7fe7","amp;dn":"A+Frequency+Dictionary+of+Dutch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13786a998ddaf347645410c76adc75ad1ccd7fe7","infoHashBuffer":{"type":"Buffer","data":[19,120,106,153,141,218,243,71,100,84,16,199,106,220,117,173,28,205,127,231]},"announce":[],"urlList":[]}}