{"title":"Phil Collins - But Seriously (1989) 2013 HDtracks 24-192-FLAC","uid":11174514,"size":2287573934,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:137bc7ac32e88c29b1879678d410fdb830c6379e&amp;dn=Phil+Collins+-+But+Seriously+%281989%29+2013+HDtracks+24-192-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"hal4000","files":-1,"time":1412761235,"description":"Philip David Charles &quot;Phil&quot; Collins, LVO (born 30 January 1951), is an English musician, singer-songwriter, multi-instrumentalist, actor and writer. He gained fame as both drummer and lead vocalist for the rock group Genesis, and he gained worldwide fame as a solo artist. Collins is one of the most successful songwriters and performers of all time, singing the lead vocals on dozens of hit albums and singles in the United Kingdom and the United States between 1976 and 2010, either as a solo artist or with Genesis. His solo singles, sometimes dealing with lost love and often featuring his distinctive gated reverb drum sound, ranged from the atmospheric &quot;In the Air Tonight&quot;, dance-rock of &quot;Sussudio&quot;, piano-driven power ballad &quot;Against All Odds&quot;, to the political and religious connotations of &quot;Another Day in Paradise&quot;. AllMusic has described Collins as &quot;one of the most successful pop and adult contemporary singers of the '80s and beyond&quot;.\n\nSpawning four hit singles, But Seriously topped the charts on both sides of the Atlantic. While pursuing much of the same formula as on No Jacket Required, there was also a move toward more organic production as Collins abandoned some of the drum machines and prominent keyboards in the up-tempo numbers in favor of live instrumentation. The decision was a good one as there's no doubt that tracks such as &quot;Find a Way to My Heart&quot; and &quot;Hang in Long Enough&quot; have enough bite to outlast his more dated sounding mid-80s material. As usual, there are a bit too many generic ballads here, but when Collins moves out of his formula as on the dramatic gospel-influenced &quot;I Wish it Would Rain Down,&quot; featuring Eric Clapton, the results are staggering.\n\nHDTracks 24Bit-192Khz-FLAC","torrent":{"xt":"urn:btih:137bc7ac32e88c29b1879678d410fdb830c6379e","amp;dn":"Phil+Collins+-+But+Seriously+%281989%29+2013+HDtracks+24-192-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"137bc7ac32e88c29b1879678d410fdb830c6379e","infoHashBuffer":{"type":"Buffer","data":[19,123,199,172,50,232,140,41,177,135,150,120,212,16,253,184,48,198,55,158]},"announce":[],"urlList":[]}}