{"title":"Oxford Latin Course","uid":11443007,"size":219077466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:138657facc8abb677e968f99e1c9104f2be3f195&amp;dn=Oxford+Latin+Course+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"scientiaamantis","files":3,"time":1415831303,"description":"First I must say I am absolutely mortified for my last upload ! It was to be honest my first upload and I didn't know exactly for how long and when I should seed and believe me the numbers on the download page were a little tricky\nas I thought there were actually some people who had already downloaded the files and they could probably burden the task of seeding on my behalf !!! And I was wrong, so I am here to redress this fatuous mistake, as it was a true dishonor to a humble honorable man !!! :)\n\nOxford Latin Course_ Complete\n\nThis is the Oxford course series in Latin. All the three volumes are included. There are some websites available for extra practice and the answer keys and they are not very hard to find, just Google &quot;supplementary material for Oxford Latin Course''. \n\nThe textbooks are actually amazing. A little bit harder than the Cambridge series I suppose, they move on at a more gradual pace, but the targeted level of proficiency at the end of the course for both series are the same; you are hopefully going to be able to read unsimplified genuine text in Latin. The story is engaging and the grammatical points are clear and hopefully helpful. Enjoy it.\n\n\nI should confess I got the torrent formand I must say at least a simple mention is indeed in order since those guys are truly amazing.\n\nFriends please be patient, because I have a really slow connection and I am able to seed only for a limited period of time.\n\nBonam Fortunam","torrent":{"xt":"urn:btih:138657facc8abb677e968f99e1c9104f2be3f195","amp;dn":"Oxford+Latin+Course+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"138657facc8abb677e968f99e1c9104f2be3f195","infoHashBuffer":{"type":"Buffer","data":[19,134,87,250,204,138,187,103,126,150,143,153,225,201,16,79,43,227,241,149]},"announce":[],"urlList":[]}}