{"title":"Jim Marrs - The Rise of the Fourth Reich - The Secret Societies","uid":15449595,"size":3055272,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13ab667456f99773d8e2c9607bef649d84c2d971&amp;dn=Jim+Marrs+-+The+Rise+of+the+Fourth+Reich+-+The+Secret+Societies+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1469929713,"description":"https://extraimago.com/images/2016/07/31/189bdae2247b02101bed8c79e644f427-d.jpg\r\n\r\nJim Marrs - The Rise of the Fourth Reich - The Secret Societies That Threaten to Take Over America 2008\r\n\r\nThrow out everything you think you know about history. Close the approved textbooks, turn off the corporate mass media, and whatever you do, don't believe anything you hear from the government. The Rise of the Fourth Reich reveals the truth about American power.\r\n\r\nIn this explosive exposé, the legendary Jim Marrs explores the frighteningly real possibility that today, in the United States, an insidious ideology thought to have been vanquished more than a half century ago is actually flourishing. At the end of World War II, ranking Nazis, along with their young and fanatical protégés, used the loot of Europe to create corporate front companies in many countries, worming their way into corporate America. They brought with them miraculous weapons technology that helped win the space race. But they also brought their Nazi philosophy based on the authoritarian premise that the end justifies the means—including unprovoked wars of aggression and curtailment of individual liberties—which has since gained an iron hold in the &quot;land of the free.&quot;\r\n\r\nJim Marrs has gathered compelling evidence of the effort that has been under way for the past sixty years to bring a form of National Socialism to modern America, creating in essence a new empire-or &quot;Fourth Reich&quot;!","torrent":{"xt":"urn:btih:13ab667456f99773d8e2c9607bef649d84c2d971","amp;dn":"Jim+Marrs+-+The+Rise+of+the+Fourth+Reich+-+The+Secret+Societies+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13ab667456f99773d8e2c9607bef649d84c2d971","infoHashBuffer":{"type":"Buffer","data":[19,171,102,116,86,249,151,115,216,226,201,96,123,239,100,157,132,194,217,113]},"announce":[],"urlList":[]}}