{"title":"Amphiphilic Block Copolymers - Self Assembly And Applications","uid":12424204,"size":24677563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13b865cdeff0b4adf5041ff63ff97debe6b76307&amp;dn=Amphiphilic+Block+Copolymers+-+Self+Assembly+And+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"clouderone","files":1,"time":1442351035,"description":"Amphiphilic Block Copolymers - Self Assembly And Applications (Elsevier, 2000).pdf\n\nISBN 0-444-82441-3\n\nIt is the belief of the editors of this book that the recognition of block copolymers as being amphiphilic molecules and sharing common features with other well-studied amphiphiles will prove beneficial to both the surfactant and the polymer communities. An aim of this book is to bridge the two communities and cross-fertilise the different fields. To this end, leading researchers in the field of amphiphilic block copolymer self-assembly, some having a background in surfactant chemistry, and others with polymer physics roots, have agreed to join forces and contribute to this book. \nThe book consists of four entities. The first part discusses theoretical considerations behind the block copolymer self-assembly in solution and in the melt. The second part provides case studies of self-assembly in different classes of block copolymers (e.g., polyethers, polyelectrolytes) and in different environments (e.g., in water, in non-aqueous solvents, or in the absence of solvents). The third part presents experimental tools, ranging from static (e.g., small angle neutron scattering) to dynamic (e.g., rheology), which can prove valuable in the characterization of block copolymer self-assemblies. The fourth part offers a sampling of current applications of block copolymers in, e.g., formulations, pharmaceutics, and separations, applications which are based on the unique self-assembly properties of block copolymers","torrent":{"xt":"urn:btih:13b865cdeff0b4adf5041ff63ff97debe6b76307","amp;dn":"Amphiphilic+Block+Copolymers+-+Self+Assembly+And+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b865cdeff0b4adf5041ff63ff97debe6b76307","infoHashBuffer":{"type":"Buffer","data":[19,184,101,205,239,240,180,173,245,4,31,246,63,249,125,235,230,183,99,7]},"announce":[],"urlList":[]}}