{"title":"Computational Finance: An Introductory Course with R","uid":10402327,"size":5057891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13d386a063af01b87e44f1ce019e8cfc30479f04&amp;dn=Computational+Finance%3A+An+Introductory+Course+with+R&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"moneymakestheworldgoround","files":-1,"time":1403386291,"description":"ABOUT THIS BOOK\n-Teaches how to use the statistical tools and methods available in the free software R, for processing and analyzing real financial data\n-Numerous step-by-step examples of programming in R will teach the reader how to build forecasting models of price and volatility (e.g. ARMA, GARCH, machine learning models such as neural networks and support vector machines); clustering of financial time series; do all type of option valuation with Monte Carlo simulations; construct technical analysis indicators, fundamental analysis of business, and portfolio management\n-Provides an easy-to-read review of the basic principles of finance, and an introduction to the basic tools of professional investors (Technical and --Fundamental Analysis), hence making it partly accessible to a general audience (with mathematical and business inclinations)\n-Reviews the most fundamental optimization heuristics in finance, and some of the approximation algorithms for online portfolio selection that should motivate computer science students to research in Computational Finance\n\n\nThe book covers a wide range of topics, yet essential, in Computational Finance (CF), understood as a mix of Finance, Computational Statistics, and Mathematics of Finance. In that regard it is unique in its kind, for it touches upon the basic principles of all three main components of CF, with hands-on examples for programming models in R. Thus, the first chapter gives an introduction to the Principles of Corporate Finance: the markets of stock and options, valuation and economic theory, framed within Computation and Information Theory (e.g. the famous Efficient Market Hypothesis is stated in terms of computational complexity, a new perspective). Chapters 2 and 3 give the necessary tools of Statistics for analyzing financial time series, it also goes in depth into the concepts of correlation, causality and clustering. Chapters 4 and 5 review the most important discrete and continuous models for financial time series. Each model is provided with an example program in R. Chapter 6 covers the essentials of Technical Analysis (TA) and Fundamental Analysis. This chapter is suitable for people outside academics and into the world of financial investments, as a primer in the methods of charting and analysis of value for stocks, as it is done in the financial industry. Moreover, a mathematical foundation to the seemly ad-hoc methods of TA is given, and this is new in a presentation of TA. Chapter 7 reviews the most important heuristics for optimization: simulated annealing, genetic programming, and ant colonies (swarm intelligence) which is material to feed the computer savvy readers. Chapter 8 gives the basic principles of portfolio management, through the mean-variance model, and optimization under different constraints which is a topic of current research in computation, due to its complexity. One important aspect of this chapter is that it teaches how to use the powerful tools for portfolio analysis from  the  RMetrics R-package. Chapter 9 is a natural continuation of chapter 8 into the new area of research of online portfolio selection. The basic model of the universal portfolio of Cover and approximate methods to compute are also described.","torrent":{"xt":"urn:btih:13d386a063af01b87e44f1ce019e8cfc30479f04","amp;dn":"Computational+Finance%3A+An+Introductory+Course+with+R","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13d386a063af01b87e44f1ce019e8cfc30479f04","infoHashBuffer":{"type":"Buffer","data":[19,211,134,160,99,175,1,184,126,68,241,206,1,158,140,252,48,71,159,4]},"announce":[],"urlList":[]}}