{"title":"Criticism of the Bible - Collection 23 (The Dead Sea Scrolls)","uid":7610676,"size":187271695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13dd564372f8afdb5a8af18c45d09762fc8a7159&amp;dn=Criticism+of+the+Bible+-+Collection+23+%28The+Dead+Sea+Scrolls%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"moman73","files":22,"time":1347053350,"description":"Criticism of the Bible - Collection 23 (The Dead Sea Scrolls):\n\n\nThe discovery of the Dead Sea Scrolls in Qumran about 65 years ago was a sensational incident that has great historical and religious significance because the Qumran documents included perhaps the earliest known surviving copies of biblical and extra-biblical documents. The biblical texts make about 23% of the Qumran documents, and they contain parts of all of the Old Testaments (OT) except the Book of Esther. \n\nWhile some manuscripts are nearly identical to the traditional Hebrew text of  OT, some manuscripts exhibit dramatic differences both in language and content. For example, there were several copies of the Book of Genesis in the Qumran documents; comparing the Qumran  Genesis with Genesis in the modern Bible we find the following chapters missing from Qumran Genesis: 7-16, 25, 28-33, 38, 44, 46 and 50.\n\nSince the Qumran documents are much older than the three main sources of the OT (the Latin Vulgate, the Septuagint, and the Masoretic text), big questions are now being raised concerning the process of transmission and canonization of the Bible and the reliability of the Bible. \n\nWe have 22 titles in this upload:\n\n-  Campbell - Deciphering the Dead Sea Scrolls, 2nd ed. (2002)\n\n-  Charlesworth (Ed.) - The Bible and the Dead Sea Scrolls, Vols. 1-3 (2006)\n\n-  Clements &amp; Sharon - The Orion Center Bibliography of the Dead Sea Scrolls and Associated Literature 2000-2006 (2007)\n\n-  Cryer &amp; Thompson (Eds.) - Qumran between the Old and New Testaments (1998)\n\n-  Ego (Eds.) - Biblia Qumranica; Minor Prophets (2005)\n\n-  Elledge - The Bible and the Dead Sea Scrolls (2005)\n\n-  Encyclopedia of the Dead Sea Scrolls (2000)\n\n-  Evans &amp; Flint (Ed.) - Eschatology, Messianism, and the Dead Sea Scrolls (1997)\n\n-  Fitzmyer - The Dead Sea Scrolls and Christian Origins (2000)\n\n-  Flint (Ed.) - The Bible at Qumran; Text, Shape, and Interpretation (2001)\n\n-  Knohl - The Messiah before Jesus; the Suffering Servant of the Dead Sea Scrolls (2000)\n\n-  Lange (Ed.) - The Dead Sea Scrolls in Context (2011)\n\n-  Lim - The Dead Sea Scrolls; a Very Short Introduction (2005)\n\n-  Machiela - The Dead Sea Genesis Apocryphon (2009)\n\n-  Martinez &amp; Popovic (Eds.) -  Defining Identities; We, You, and the Other in the Dead Sea Scrolls (2008)\n\n-  Martinez &amp; Tigchelaar (Eds.) - The Dead Sea Scrolls Study Edition, 2e (1999)\n\n-  Peters - Noah Traditions in the Dead Sea Scrolls; Conversations and Controversies of Antiquity (2008)\n\n-  Roitman (Ed.) - The Dead Sea Scrolls and Contemporary Culture; Proc. of the Int. Conf., Jerusalem, 2008 (2011)\n\n-  Shanks (Ed.) - Understanding the Dead Sea Scrolls; a Reader from the Biblical Archaeology Review (1992)\n\n-  Vermes - The Complete Dead Sea Scrolls in English, revised edition (2004)\n\n-  Vermes - The Story of the Scrolls; the Miraculous Discovery and True Significance of the Dead Sea Scrolls (2010)\n\n-  Washburn - A Catalog of Biblical Passages in The Dead Sea Scrolls (2003)\n\n\n","torrent":{"xt":"urn:btih:13dd564372f8afdb5a8af18c45d09762fc8a7159","amp;dn":"Criticism+of+the+Bible+-+Collection+23+%28The+Dead+Sea+Scrolls%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13dd564372f8afdb5a8af18c45d09762fc8a7159","infoHashBuffer":{"type":"Buffer","data":[19,221,86,67,114,248,175,219,90,138,241,140,69,208,151,98,252,138,113,89]},"announce":[],"urlList":[]}}