{"title":"Kill Chain: The Rise of the High-Tech Assassins (2015) epub","uid":11773073,"size":817405,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13f85ba0aa194367bcfff68800ff54975a509083&amp;dn=Kill+Chain%3A+The+Rise+of+the+High-Tech+Assassins+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bookzilla","files":1,"time":1427151224,"description":"An essential and page-turning narrative on the history of drone warfare by the acclaimed author of Rumsfeld, exploring how this practice emerged, who made it happen, and the real consequences of targeted killing\n\n Assassination by drone is a subject of deep and enduring fascination. Yet few understand how and why this has become our principal way of waging war. Kill Chain uncovers the real and extraordinary story; its origins in long-buried secret programs, the breakthroughs that made drone operations possible, the ways in which the technology works and, despite official claims, does not work. Taking the reader inside the well-guarded world of national security, the book reveals the powerful interests - military, CIA and corporate - that have led the drive to kill individuals by remote control. Most importantly of all, the book describes what has really happened when the theories underpinning the strategy -- and the multi-billion dollar contracts they spawn -- have been put to the test. Drawing on sources deep in the military and intelligence establishments, Andrew Cockburn's Kill Chain unveils the true effects, as demonstrated by bloody experience, of assassination warfare, a revelation that readers will find surprising as well as shocking","torrent":{"xt":"urn:btih:13f85ba0aa194367bcfff68800ff54975a509083","amp;dn":"Kill+Chain%3A+The+Rise+of+the+High-Tech+Assassins+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13f85ba0aa194367bcfff68800ff54975a509083","infoHashBuffer":{"type":"Buffer","data":[19,248,91,160,170,25,67,103,188,255,246,136,0,255,84,151,90,80,144,131]},"announce":[],"urlList":[]}}