{"title":"Marvel NOW! Week 2 (darkhomr) [TPB]","uid":7848083,"size":125241236,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:140eeb7aa27defcab7db7aeae0d884ae26cc4a1f&amp;dn=Marvel+NOW%21+Week+2+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dadrkhomr","files":6,"time":1353522903,"description":"Starting the week of 11/21/2012 I will be posting the ongoing adventures in the Marvel NOW! storyline.  Each week I will be posting the current week's Marvel NOW titles.  \n\nThis means that I will be releasing five packs a week including:\n\nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Thursday, based on scanners release times)\nZero Day (Marvel, DC and Independent comics, released between Saturday night and Sunday afternoon)\nIndependent Scanners (from scanners not affiliated with groups, released on Mondays)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\nIncluded in the current week:\n\n\nCaptain America #1 (CBR 11/21/2012)\n\nThrust into a bizarre, inhospitable world far from home, the all-new, high-adventure, mind-melting, tough-as-nails, sci-fi, pulp-fantasy era of Captain America is NOW!  With no country and no allies, what's left for the Sentinel of Liberty to protect? The Saga of Dimension Z begins here! \n\nDeadpool #2 (CBR 11/21/2012)\n\nDead former United States presidents, from George Washington to Gerald Ford have been resurrected, and that's BAD. The Marvel heroes can't be the ones to stop them, someone is needed with the reputation, skills and plausible deniability to take out these com-monsters in chiefs...NOW! is the time for Deadpool In Wade We Trust! \n\nIndestructible Hulk #1 (CBR 11/21/2012)\n\nHulk - Indestructible force more weapon than man. Banner - smartest man alive. Combined they are the Strongest, Smartest Weapon on the planet! And NOW! the INDESTRUCTIBLE HULK is an Agent of S.H.I.E.L.D.!\n\nIron Man #2 (CBR 11/21/2012)\n\nTony's hunt for the rogue Extremis Units takes him to the island of NEW CAMELOT! Introducing THE CIRCLE, a mysterious high-tech brotherhood of mech-knights! IRON MAN vs. the secret Russian Black Exoskeleton Academy's greatest pilot!\n\nWolverine and the X-Men #21 (CBR 11/21/2012)\n\nSTORM joins the faculty of the Jean Grey School! Wolverine is a clown? Iceman is a fire swallower? Rachel Grey a fortune teller? Frankenstein's Murder Circus comes to town! \n\n","torrent":{"xt":"urn:btih:140eeb7aa27defcab7db7aeae0d884ae26cc4a1f","amp;dn":"Marvel+NOW%21+Week+2+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"140eeb7aa27defcab7db7aeae0d884ae26cc4a1f","infoHashBuffer":{"type":"Buffer","data":[20,14,235,122,162,125,239,202,183,219,122,234,224,216,132,174,38,204,74,31]},"announce":[],"urlList":[]}}