{"title":"FABLES Volume 1 to 3 (2002-2004) (Vertigo) (Digital) (Nahga-Empi","uid":9218500,"size":759927310,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1468a9422d1f4307b430433e1e4ba1d6ecca84d7&amp;dn=FABLES+Volume+1+to+3+%282002-2004%29+%28Vertigo%29+%28Digital%29+%28Nahga-Empi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"STFmaryville","files":-1,"time":1384900808,"description":"Once upon a time, a beautiful princess cared for seven amiable dwarves and waited anxiously for her Prince, so they could live happily ever aft -- oh, get real! Ms. White is no kept woman! She dumped that two-timing Prince Charming ages ago. Now she's trying to avoid her attraction to the Big Bad Wolf. And don't get her started on how much time she's wasting bailing out her anarchist sister Rose Red and trying to keep the Three Little Pigs off the picket line. It's all in a day's work since she became Mayor of Fabletown...\n\nFables chronicles the world's most beloved fairy tale characters hiding out in a magically hidden neighborhood within Manhattan. Run out of their happily-ever-after homeworlds by a mighty conqueror known only as The Adversary, these universally recognized princes, princesses, talking animals, heroes, and villains now face a new challenge: adapting to a modern world filled with sex, violence, and lots of moral ambiguity. \n\nMixing mystery, action, humor, and more, Fables follows these cherished characters' war against The Adversary and their ongoing struggle to survive alongside one another in the modern world. But who is this Adversary that has rocked their lives?\n","torrent":{"xt":"urn:btih:1468a9422d1f4307b430433e1e4ba1d6ecca84d7","amp;dn":"FABLES+Volume+1+to+3+%282002-2004%29+%28Vertigo%29+%28Digital%29+%28Nahga-Empi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1468a9422d1f4307b430433e1e4ba1d6ecca84d7","infoHashBuffer":{"type":"Buffer","data":[20,104,169,66,45,31,67,7,180,48,67,62,30,75,161,214,236,202,132,215]},"announce":[],"urlList":[]}}