{"title":"Symphobia 2 AudioP2P","uid":8223342,"size":19639680526,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1493a18151d2713bc94a88031f99dbaefbfd94a2&amp;dn=Symphobia+2+AudioP2P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Zadek01","files":103,"time":1362526941,"description":"                                Tested by Me 100% Working\n\nKEY FEATURES\nReal tutti recordings of symphonic ensembles\nIndustry-first legato ensembles with real legato transitions\nExtensive, multi-articulation patches\nNew and inspiring symphonic effects\n33 GB 44.1/24 library pool (uncompressed)\n2 Mic sets (concert stage and close mic) switchable from interface\nBrand-new custom interface\nNI Kontakt Player 4 included with native 64-bit support\nKontakt background loading\nKontakt compressed sample storage (20 GB)\nNEW ARTICULATIONS\nIf you own the original SYMPHOBIA, SYMPHOBIA 2 will greatly expand your possibilities. To name a few, the SYMPHOBIA 2 string section adds minor and major DXF trills, different lengths of crescendo-decrescendo, new crescendos and new spiccatos. The full orchestra section has powerful new sustain and staccato articulations, and a beautiful Wide Octaves articulation with modwheel control. The separate horn section in the original SYMPHOBIA has been expanded with a blockbuster 8-player horn ensemble.\n\nNEW EFFECTS\nIf you liked the effects in the original SYMPHOBIA, you are going to love the ones in SYMPHOBIA 2! Having covered the basis, we could explore the world of orchestral effects further and look for interesting new sounds and more specific techniques. There are now effects banks entirely dedicated to ponticello, flageolet or other playing techniques. You will also find beautiful looped textures that can be triggered in different keys. These phrases will instantly give your production a realism boost, but leave enough room to add your own personal touches.\n\nLEGATO ENSEMBLES\nAn industry-first: real legato transitions for orchestrated sets of instruments. Various differently arranged ensembles were captured performing legato intervals, playing in unison or octaves, and were meticulously edited and scripted. A great example is the noble sounding Horns Violins Violas set, which offers real legato performance of French horns, violins and violas playing in unison. No layering was used whatsoever. The legatos, transitions and orchestrations you hear are all real.\nEach of the sets has been recorded in a specific range and dynamic, dictated by the orchestration and the musical context of the orchestration. Apart from the LEGATO ENSEMBLES we also included a number of legato solo instruments. [Hear a demo now]\n\nDYSTOPIA VOLUME 3\nOur popular DYSTOPIA section is back and is better than ever! Explore the dark side of SAM with processed hits, spheres, scapes and risers, based on the recordings of SYMPHOBIA 2 and some of our other libraries. Also be sure to check out the SYMPHOBIAN DRUMS. [Dystopia screenshot]\n\nBRAND-NEW INTERFACE\nSYMPHOBIA 2 is powered by Kontakt 4.1 and comes with a brand-new interface. In the centre are the instrument and articulation displays. The left half of the interface contains all the switchable options such as Master EQ, release trails and microphone mode. The right half of the interface has all the controllable options such as instant ADSR, reverb and DSP effects.\n\nSWITCHABLE MIC MODE\nLike the original SYMPHOBIA, SYMPHOBIA 2 was recorded in a beautiful concert hall environment and has been edited and programmed in two microphone sets: close and stage. Each program now contains both microphone sets and has a convenient switch button to choose which mic set you wish to use. Both mic sets have been carefully mixed to instantly fall into place in your mix. When switching mics, the samples for the unused mic will be purged from RAM.\n\nOUR BEST MULTIS EVER\nThe LEGATO ENSEMBLES opened up exciting new possibilities for creating MULTIS. We created MULTIS that allow you to play two, even three legato instruments simultaneously as well as various combinations of polyphonic articulations and a legato instrument.\nWith names such as &quot;Make It So&quot; and &quot;When All Hope Is Lost&quot; it's easy to find the MULTI that best matches your project or scene","torrent":{"xt":"urn:btih:1493a18151d2713bc94a88031f99dbaefbfd94a2","amp;dn":"Symphobia+2+AudioP2P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1493a18151d2713bc94a88031f99dbaefbfd94a2","infoHashBuffer":{"type":"Buffer","data":[20,147,161,129,81,210,113,59,201,74,136,3,31,153,219,174,251,253,148,162]},"announce":[],"urlList":[]}}