{"title":"The Perfect Maths Lesson [PDF] [StormRG]","uid":11257946,"size":1008660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14c149f442026d0cf35bcf515f22993bc48aed9d&amp;dn=The+Perfect+Maths+Lesson+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"krystine","files":-1,"time":1413925773,"description":"The Perfect Maths Lesson\nAuthor: Ian Loynd\nPublished: 2014\nPublisher: Independent Thinking Press\nISBN: 9781781351376\nFormat: Retail PDF\n\nPM IF YOU NEED HELP WITH THE TORRENT :)\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\n\n\nThe Perfect Maths Lesson recognizes that teaching is hard and that, although no teacher is perfect, their lessons can be. Drawing on his experience as a secondary maths teacher and assistant head teacher, Ian Loynd provides practical ideas and common-sense methods that can help every teacher to be outstanding, with the main focus on independent learning.\nThe lessons supplied offer a great mix of activities where the responsibility is placed on the pupils learning and progressing, rather than the teacher leading all the time. In addition, it shows how to use Assessment for Learning approaches to check progress rather than continued summative strategies. It concludes with a useful checklist ensuring that teachers are able to deliver perfect math lessons, which are relevant for teachers at all stages of education. Key subjects include: Relationships for learning and emotional wisdom Engaging learners and sparking creativity Challenging learners and 'failing better' Independent learners and student leadership Assessment of, for and as learning","torrent":{"xt":"urn:btih:14c149f442026d0cf35bcf515f22993bc48aed9d","amp;dn":"The+Perfect+Maths+Lesson+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14c149f442026d0cf35bcf515f22993bc48aed9d","infoHashBuffer":{"type":"Buffer","data":[20,193,73,244,66,2,109,12,243,91,207,81,95,34,153,59,196,138,237,157]},"announce":[],"urlList":[]}}