{"title":"Book Yourself Solid","uid":8807303,"size":834318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14d31f16c4dd243139208127bbba395e07b2843e&amp;dn=Book+Yourself+Solid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"livhre","files":-1,"time":1376369386,"description":"Format: ePub\n\nThe new edition of the bestselling business development guide\nBook Yourself Solid, Second Edition reveals why self-promotion is a critical factor to success, giving you a unique perspective that makes this guide much more than an ordinary &quot;how to&quot; manual for getting more clients and raising a business profile.\n\nBook Yourself Solid, Second Edition enables you to adopt the right promotional perspective and provides the strategies, techniques, and skills necessary to get more clients and increase profits. Through verbal and written exercises, you'll discover the keys to developing a strong marketing plan and brand image.\n\nFeatures unique, personalized, updated social media marketing strategies for service professionals\nProvides new pricing models and sales strategies for simpler selling\nDelivers fresh networking and outreach strategies guaranteed to take only minutes a day\nOffers new solid product launch strategies and tactics for creating instant awareness\nAuthor a New York Times bestseller, TV personality, and highly recognized professional speaker\nGet the proven tools you can put into effect today with Book Yourself Solid, Second Edition, and watch your business grow exponentially!\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. ","torrent":{"xt":"urn:btih:14d31f16c4dd243139208127bbba395e07b2843e","amp;dn":"Book+Yourself+Solid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d31f16c4dd243139208127bbba395e07b2843e","infoHashBuffer":{"type":"Buffer","data":[20,211,31,22,196,221,36,49,57,32,129,39,187,186,57,94,7,178,132,62]},"announce":[],"urlList":[]}}