{"title":"Encyclopedia of Fish Physiology - From Genome to Environment","uid":15568309,"size":73248875,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14efeca0e1685d1527cec5a78adf58584657d9fc&amp;dn=Encyclopedia+of+Fish+Physiology+-+From+Genome+to+Environment&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"clouderone","files":1,"time":1471229285,"description":"Encyclopedia of Fish Physiology - From Genome to Environment - Anthony P. Farrell (AP, 2011).pdf\r\n\r\nFish form an extremely diverse group of vertebrates. At a conservative estimate at least 40% of the world's vertebrates are fish. On the one hand they are united by their adaptations to an aquatic environment and on the other they show a variety of adaptations to differing environmental conditions - often to extremes of temperature, salinity, oxygen level and water chemistry. They exhibit an array of behavioural and reproductive systems. Interesting in their own right, this suite of adaptive physiologies provides many model systems for both comparative vertebrate and human physiologists.\r\n\r\nThis four volume encyclopedia covers the diversity of fish physiology in over 300 articles and provides entry level information for students and summary overviews for researchers alike.\r\n\r\nBroadly organised into four themes, articles cover Functional, Thematic, and Phylogenetic Physiology, and Fish Genomics\r\n\r\nFunctional articles address the traditional aspects of fish physiology that are common to all areas of vertebrate physiology including: Reproduction, Respiration, Neural (Sensory, Central, Effector), Endocrinology, Renal, Cardiovascular, Acid-base Balance, Osmoregulation, Ionoregulation, Digestion, Metabolism, Locomotion, and so on.\r\n\r\nThematic Physiology articles are carefully selected and fewer in number. They provide a level of integration that goes beyond the coverage in the Functional Physiology topics and include discussions of Toxicology, Air-breathing, Migrations, Temperature, Endothermy, etc.\r\n\r\nPhylogenetic Physiology articles bring together information that bridges the physiology of certain groupings of fishes where the knowledge base has a sufficient depth and breadth and include articles on Ancient Fishes, Tunas, Sharks, etc.\r\n\r\nGenomics articles describe the underlying genetic component of fish physiology and high light their suitability and use as model organisms for the study of disease, stress and physiological adaptations and reactions to external conditions.\r\n\r\nWinner of a 2011 PROSE Award Honorable Mention for Multivolume Science Reference from the Association of American Publishers\r\nThe definitive encyclopedia for the field of fish physiology\r\nThree volumes which comprehensively cover the entire field in over 300 entries written by experts\r\nDetailed coverage of basic functional physiology of fishes, physiological themes in fish biology and comparative physiology amongst taxonomic Groups\r\nDescribes the genomic bases of fish physiology and biology and the use of fish as model organisms in human physiological research\r\nIncludes a glossary of terms\r\nAvailable online in indexed searchable format","torrent":{"xt":"urn:btih:14efeca0e1685d1527cec5a78adf58584657d9fc","amp;dn":"Encyclopedia+of+Fish+Physiology+-+From+Genome+to+Environment","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14efeca0e1685d1527cec5a78adf58584657d9fc","infoHashBuffer":{"type":"Buffer","data":[20,239,236,160,225,104,93,21,39,206,197,167,138,223,88,88,70,87,217,252]},"announce":[],"urlList":[]}}