{"title":"Encyclopedia of the Eye - 1st Ed (4 Vol Set) (2010).pdf Gooner","uid":12193155,"size":103833424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15157edb3048522e9fafd0600884f0f34a829dd9&amp;dn=Encyclopedia+of+the+Eye+-+1st+Ed+%284+Vol+Set%29+%282010%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1438695403,"description":"Publisher: Academic Press; 1 edition (July 8, 2010)\nLanguage: English\nISBN-10: 012374198X\nISBN-13: 978-0123741981\n\nAs the first comprehensive reference for the eye, its support structures, diseases, and treatments, Encyclopedia of the Eye is an important resource for all visual scientists, ophthalmologists, and optometrists, as well as researchers in immunology, infectious disease, cell biology, neurobiology and related disciplines. This four-volume reference is unique in its coverage of information on all tissues important for vision, including the retina, cornea and lens. It also covers the physiological and pathophysiologic processes that affect all eye tissues.\n\nThis Encyclopedia is invaluable for graduate students and postdoctoral fellows who are seeking an introduction to an area of eye research. Each chapter explains the basic concepts and provides references to relevant chapters within the Encyclopedia and more detailed articles across the wider research literature. The Encyclopedia is also particularly useful for visual scientists and practitioners who are researching a new area, seeking deeper understanding of important research articles in fields adjacent to their own, or reviewing a grant outside their immediate area of expertise.\n\nWritten by experts at a level that permits students to grasp key elements of a specific subject\nProvides an entryway into the major features of current eye research\nNo other source puts this much information, so well-indexed and with so many helpful full color figures and graphics, in the hands of the ophthalmic scientist","torrent":{"xt":"urn:btih:15157edb3048522e9fafd0600884f0f34a829dd9","amp;dn":"Encyclopedia+of+the+Eye+-+1st+Ed+%284+Vol+Set%29+%282010%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15157edb3048522e9fafd0600884f0f34a829dd9","infoHashBuffer":{"type":"Buffer","data":[21,21,126,219,48,72,82,46,159,175,208,96,8,132,240,243,74,130,157,217]},"announce":[],"urlList":[]}}