{"title":"Winclone 3.0.4","uid":7485116,"size":5985687,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:15565d3e2fc2a086f0da29252152cc3cc8e2be7b&amp;dn=Winclone+3.0.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"openarena","files":-1,"time":1343559151,"description":"Winclone allows you to clone your Boot Camp partition, and now includes Vista cloning!\n\nNew Machine Setup a breeze - If you are in charge of setting up a bunch of machines with both Mac OS X and Boot Camp, Winclone will make your job a breeze. Simply create an image as your would for a backup, and Winclone will create the Windows partition and restore the OS and data onto the new partition.\n\nQuick Lab Deployment - Deploy images with ARD: Using the included script and the image created with Winclone, you can easily send a new winclone image to a group of Intel Macs, imaging the entire lab in minutes.\n\nFeatures:\n\nClone Windows XP or Windows Vista with ease.\nClone to your Boot Camp partition either on a separate drive or on the same that contains your Mac OS X partition.\nCreates image documents that can be stored on any media and double-clicked to open in WinClone.\nVerbose logging so you know what is going on.\nBuilt on the open source ntfstools, which are included in Winclone, so you don't have to install anything else.\nFast: Restore a 10 GB image in less than 10 minutes.\nCreate a Boot Camp partition from within Winclone.\nDo it all from the boot drive: You don't need to boot from a Firewire drive to clone the Windows partition.\nClean and uncomplicated interface\n\nRequirements\nIntel, Mac OS X 10.6 or later \n\n","torrent":{"xt":"urn:btih:15565d3e2fc2a086f0da29252152cc3cc8e2be7b","amp;dn":"Winclone+3.0.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15565d3e2fc2a086f0da29252152cc3cc8e2be7b","infoHashBuffer":{"type":"Buffer","data":[21,86,93,62,47,194,160,134,240,218,41,37,33,82,204,60,200,226,190,123]},"announce":[],"urlList":[]}}