{"title":"Medical Terminology and Anatomy for ICD-10 Coding [PDF] [StormRG","uid":9835942,"size":59563919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:15d5a7a8decf0adc1382e1eeeacf5b92102563de&amp;dn=Medical+Terminology+and+Anatomy+for+ICD-10+Coding+%5BPDF%5D+%5BStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":-1,"time":1395911397,"description":"Author: Betsy J. Shiland\nPaperback: 792 pages\nPublisher: Mosby; 1 edition (January 4, 2012)\nLanguage: English\nISBN-10: 1455707740\nISBN-13: 978-1455707744\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nWhether you're new to medical coding or transitioning from ICD-9-CM to ICD-10-CM/PCS, Medical Terminology and Anatomy for ICD-10 Coding helps you prepare to code accurately and effectively using the ICD-10-CM/PCS code set with a complete understanding of relevant medical terminology and anatomy. Coding certified (CCS, CPC) and approved AHIMA ICD-10-CM/PCS Academy Trainer Betsy Shiland makes unfamiliar medical language more approachable, and carefully sequenced medical terminology lessons help you understand the vastly increased anatomy necessary for accurate coding, including the locations of hundreds of arteries, muscles, nerves, and other anatomy. This unique resource also includes engaging in-book exercises and interactive online resources, giving you the review and practice you need to reinforce your comprehension and confidently prepare for the coding workforce.\n\nTerminology coverage specific to ICD-10-CM/PCS familiarizes you with the terms and definitions you'll encounter most frequently in coding practice.\nAnatomy and physiology content helps you accurately interpret medical reports to code effectively in ICD-10-CM/PCS.\nPathology terms are organized by disease and disorder classification so you can practice locating information just as you will when coding with ICD-10-CM.\nICD codes provided for pathology terms and signs/symptoms help you associate diagnoses with related codes.\nIn-book exercises test your understanding as you learn.\nPathology and procedure terminology tables challenge you to decode terms by word origins and definitions.\nRoot operation information is incorporated into procedure tables to familiarize you with the associated common suffixes.\nElectronic medical record format familiarizes you with documentation commonly used in healthcare settings.\nGuideline Alert! boxes link terminology to relevant ICD-10-CM/PCS information at a glance.\nBe Careful! boxes alert you to similar and potentially confusing word parts and terms.","torrent":{"xt":"urn:btih:15d5a7a8decf0adc1382e1eeeacf5b92102563de","amp;dn":"Medical+Terminology+and+Anatomy+for+ICD-10+Coding+%5BPDF%5D+%5BStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15d5a7a8decf0adc1382e1eeeacf5b92102563de","infoHashBuffer":{"type":"Buffer","data":[21,213,167,168,222,207,10,220,19,130,225,238,234,207,91,146,16,37,99,222]},"announce":[],"urlList":[]}}