{"title":"The Upperfloor--tUF-37592 Veruca James, Sabrina Banks and Karlo ","uid":11794988,"size":766755152,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:165dcc521fbbdf9ba651ccb14e2ab738a90e75b8&amp;dn=The+Upperfloor--tUF-37592+Veruca+James%2C+Sabrina+Banks+and+Karlo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"merzedes","files":1,"time":1428103524,"description":"Twin Set of Raven Haired Slaves Service Brunch Guests\n\nApr 3, 2015 - Performers: Karlo Karrera ,  Veruca James  and  Sabrina Banks \n\n\nHi MP4 only.\n\n\nElegant head slave Veruca James guides her slave trainee Sabrina Banks in how to please a crowd of brunch guests using grace, humor, and relentless orgasms. One special guest is to have his massive cock entertained, and our submissive slave girls set to work with well trained blow jobs, strenuous cowgirl fucking, and anal in strict rope bondage. \n\nFirst scene places Veruca and Sabrina in a orgasm competition of the worst kind. Placed in metal bondage with no escape, vibrators latched firmly on their pussies, the slave girls scream for relief and pour sweat and orgasms as our guests cheer them on and enjoy their champagne. Thoroughly wrecked, Veruca comes out victorious and is carried to the lounge for her reward: Karlo's thick cock deep in her ass.\n\nVeruca makes good use of her trainee Sabrina's face, using it first to wet her ass and pussy, then to get Karlo's dick rock hard. Sabrina's obediently plays fluffer as Veruca takes a hard pounding tied firmly in place, suffering through several more orgasms until Karlo is satisfied. Meanwhile, guests have become more than rowdy and come alive in a kinky orgy of tight rope suspensions, electrical play, blow jobs, wrestling and corporal. \n\nIt is time for Veruca to show her ability to train a new girl, and she mounts her charge on Karlo's hard dick for disciplined reverse cowgirl fuck. The crowd finds this show very appealing, and gather around to encourage and tease Sabrina as her thighs weaken and her pussy cums under threat of electrical torment by Veruca's hand. Veruca shows her sadistic side with a gleeful grin, and is rewarded by being thrown face down on the couch and covered in cum with her trainee. \n\nScreens &lt;a href=&quot;\nhttp://www.theupperfloor.com/site/shoot/37592-Twin-Set-of-Raven-Haired-Slaves-Service-Brunch-Guests.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.theupperfloor.com/site/shoot/37592-Twin-Set-of-Raven-Haired-Slaves-Service-Brunch-Guests.html&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n17 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n  \n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:165dcc521fbbdf9ba651ccb14e2ab738a90e75b8","amp;dn":"The+Upperfloor--tUF-37592+Veruca+James%2C+Sabrina+Banks+and+Karlo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"165dcc521fbbdf9ba651ccb14e2ab738a90e75b8","infoHashBuffer":{"type":"Buffer","data":[22,93,204,82,31,187,223,155,166,81,204,177,78,42,183,56,169,14,117,184]},"announce":[],"urlList":[]}}