{"title":"Geoff Ryman - Air","uid":11929226,"size":380839988,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:16cfc816e89e35b1d3acd6294f16e556a7972b12&amp;dn=Geoff+Ryman+-+Air&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Cybotage","files":57,"time":1431761343,"description":"As pervasive technology ensures the rapid spread of pop culture and information access, few corners of the planet remain untouched. One of those few is Kizuldah, Karzistan, a tiny rice-farming village, predominantly Chinese Buddhist but with a strong Muslim presence, among whom sharply intelligent though illiterate Mae Chung, a self-styled fashion expert guiding the village women in dress, make-up and hairstyling, is an informal leader. Chung Mae is the only connection her small farming village has to culture of a wider world beyond the fields and simple houses of her village.\n\nA new communications technology is sweeping the world and promises to connect everyone, everywhere without power lines, computers, or machines. This technology is Air.\n\nWhen the UN decides to test the radical new technology Air, Mae is boiling laundry and chatting with elderly Mrs Tung. The massive surge of Air energy swamps them, and when the test is finished, Mrs Tung is dead, and Mae has absorbed her 90 years of memories.\n\nRocked by the unexpected deaths and disorientation, the UN delays fully implementing Air, but Mae sees at once that her way of life is ending. Half-mad, struggling with information overload, the resentment of much of the village, and a complex family situation, she works fiercely to learn what she needs to ride the tiger of change.\n\nRead by Rachel Atkins\nFormat: MP3\nBitrate: 56 Kbps\nUnabridged","torrent":{"xt":"urn:btih:16cfc816e89e35b1d3acd6294f16e556a7972b12","amp;dn":"Geoff+Ryman+-+Air","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16cfc816e89e35b1d3acd6294f16e556a7972b12","infoHashBuffer":{"type":"Buffer","data":[22,207,200,22,232,158,53,177,211,172,214,41,79,22,229,86,167,151,43,18]},"announce":[],"urlList":[]}}