{"title":"Rainlendar Pro v2.12.2 Multilingual (64-Bit) Incl. Keymaker-ZWT","uid":10445047,"size":16823834,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:170d7c55a867fc89e236edbd738859838afdd576&amp;dn=Rainlendar+Pro+v2.12.2+Multilingual+%2864-Bit%29+Incl.+Keymaker-ZWT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"AtomTPB","files":-1,"time":1403942436,"description":"Description:\nRainlendar is a customizable calendar application which stays out of your way\nbut keeps all your important events and tasks always visible on your desktop.\nRainlendar is a full of features calendar tool which is quite simple to use and doesn't take much space on your desktop. The application is platform independent so you can run it both on Windows and on Linux. The appearance can be customized with skins and you can even mix different skins together. \n\nIt is possible to use Rainlendar with other calendar applications too. Rainlendar uses the standard iCalendar format to store its events and tasks so you can easily transfer them between applications.\nYou can also subscribe to online calendars and see your Outlook appointments directly in Rainlendar. \nRainlendar is an unicode application that supports localization so you can use it on your own language.\n\n\nFeatures:\nEvents and Tasks\nRainlendar supports events and tasks which both are kept in separate lists. This helps you to keep your life better organized and makes it easier to see what are the upcoming things you need to do.\n\nAlarms\nGet notified in advanced before the event is due so that you don't forget your important events. It is also possible to snooze the alarm if you want to get reminded about it later.\n\nStandards Based\nAll the data is stored in the standard iCalendar format (RFC2445) which is supported by most calendar applications. This makes it easy to transfer the events between applications.\n\nHighly Customizable\nThe look and feel of the calendar can be changed with skins. You can also mix the skins together and have as many windows visible as you want.\n\nLocalized\nRainlendar has been translated to over 50 different languages so you can use it in your native language. It's also possible to use any language when entering the events.\n\nPlatform Independent\nThe application works in all major operating systems: Windows, Mac OS X and Linux. All the data, skins, languages and scripts are the same in all platforms so you can easily migrate between them.\n\nShared &amp; 3rd Party Calendars\nWith Rainlendar Pro you can subscribe to online calendars and share your events with other computers. You can also see and edit your Outlook appointments and tasks in Rainlendar.\n\n\nWhat's New:\n-Updated the libical library which should fix the crash problem with Google Calendar.\n\n\nSystem Requirements:\n-OS: Windows 8, 7, Vista, XP \n-500 MHz or higher processor clock speed recommended\n-10 MB of available hard disk space\n-512 MB of RAM or higher recommended\n-A display card capable of showing transparent windows","torrent":{"xt":"urn:btih:170d7c55a867fc89e236edbd738859838afdd576","amp;dn":"Rainlendar+Pro+v2.12.2+Multilingual+%2864-Bit%29+Incl.+Keymaker-ZWT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"170d7c55a867fc89e236edbd738859838afdd576","infoHashBuffer":{"type":"Buffer","data":[23,13,124,85,168,103,252,137,226,54,237,189,115,136,89,131,138,253,213,118]},"announce":[],"urlList":[]}}