{"title":"Jonathan Riley-Smith - The Oxford History of the Crusades [2000]","uid":10502219,"size":6275398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:17b38347bf3eaafd2640fffd6bc133081377903b&amp;dn=Jonathan+Riley-Smith+-+The+Oxford+History+of+the+Crusades+%5B2000%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1404720645,"description":"Description\nProduct Details\nBook Title: The Oxford History of the Crusades\t\nBook Author: Jonathan Riley-Smith (Editor)\nPaperback: 488 pages\nPublisher: Oxford University Press (November 4, 1999)\nLanguage: English\nISBN-10: 0192803123\nISBN-13: 978-0192803122\n\n===================================================================================\nBook Description\nPublication Date: November 4, 1999\nIn this collection of essays, the story of the Crusades is told as never before in an engrossing and comprehensive history that ranges from the preaching of the First Crusade in 1095 to the legacy of crusading ideals and imagery that continues today. Here are the ideas of apologists, propagandists, and poets about the Crusades, as well as the perceptions and motives of the crusaders themselves and the means by which they joined the movement.\nThe book's coverage ranges from the elaborate social and civic systems that arose to support the Crusades to in-depth and vivid descriptions of the battles themselves. The contributors provide keen and insightful commentary on the reactions of the Muslims to a Christian holy war. Also included are studies of crusades outside the eastern Mediterranean region as well as post-medieval crusades.\nBy describing the combat and homefront conditions, by evaluating the clash (and coalescence) of many cultures, by tracing a legacy that continues in our conflict-ridden present, and by documenting the enduring artistic and social changes that the Crusades wrought, A History of the Crusades offers an unsurpassed panorama of one of the great movements in western history. All students of medieval culture, religion, politics, and/or history will find in these pages a highly useful, thorough, and contemporary account of that movement.\n\n===================================================================================\nReviews\n&quot;Review from previous edition makes the results of the recent academic study of the Crusades accessible to a wide section of the general public and succeeds in conveying that this is a living and developing subject, which has far from exhausted its potential&quot;--THES\n\n&quot;fascinating ... a comprehensive history of the wars&quot;--History Today\n\n===================================================================================\nAbout the Author\nProfessor Jonathan Riley-Smith is Dixie Professor of Ecclesiastical History at Cambridge University and has been a Fellow of Emmanuel College, Cambridge, since 1994. He has published widely on medieval history and the Crusades and his books include What were the Crusades? (1977), The Crusades: idea and reality (1981), The First Crusade and the Idea of Crusading (1986), and The Atlas of the Crusades (1991). He was President of the Society for the Study of the Crusades and the Latin East from 1990 to 1995.\n===================================================================================","torrent":{"xt":"urn:btih:17b38347bf3eaafd2640fffd6bc133081377903b","amp;dn":"Jonathan+Riley-Smith+-+The+Oxford+History+of+the+Crusades+%5B2000%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17b38347bf3eaafd2640fffd6bc133081377903b","infoHashBuffer":{"type":"Buffer","data":[23,179,131,71,191,62,170,253,38,64,255,253,107,193,51,8,19,119,144,59]},"announce":[],"urlList":[]}}