{"title":"Edgerunner (Stardock) Multiplicity 3.0.00055","uid":10304571,"size":10987069,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:17e54eea4f38ff0c94327039205954186d6da70b&amp;dn=Edgerunner+%28Stardock%29+Multiplicity+3.0.00055&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"JUHAX69X","files":-1,"time":1402021664,"description":"Edgerunner (Stardock) Multiplicity 3.0.00055\n \n \nMultiplicity enables you to control up to 9 PCs with only one keyboard and mouse. You can\ncopy, paste, drag and drop files between PCs and centralize audio from all PCs to one PC.\nMultiplicity's data encryption ensures your data is always secure.\n \n \nEliminate Extra Keyboards:\nMultiplicity gives you the ability to control and quickly switch between multiple computers with\none keyboard and mouse, reducing complexity and freeing up desk space for more efficient uses.\n \nCentralized Audio:\nCentralize audio from all of your PCs to a single PC ensure you never miss an email, chat or stock price alert. This capability is perfect for stock trading environments and call centers.\n\nTransfer Data Between Your PCs:\nCopy and paste any content between your PCs. Multiplicity even retains text formatting.\nMultiplicity also supports drag and drop of files and folders between your machines for quick\ntransfers. Even large files like videos and images are transferred quickly between PCs.\n \nSend Keyboard Inputs to All Computers:\nPress CTRL three times and Multiplicity starts sending all keyboard input to all connected PCs.\nMultiplicity also enables you to lock all of your PCs at once.\n \nData Security:\nUser data is encrypted for additional security in sensitive work environments like financial\ninstitutions and emergency management centers. Multiplicity's settings can also be locked to\nprevent non-administrative users from altering the configuration.\n  \nHomepage: http://edgerunner.com/multiplicity\n \n \nIf You like this upload, please share it with others by seeding. Thank You.","torrent":{"xt":"urn:btih:17e54eea4f38ff0c94327039205954186d6da70b","amp;dn":"Edgerunner+%28Stardock%29+Multiplicity+3.0.00055","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17e54eea4f38ff0c94327039205954186d6da70b","infoHashBuffer":{"type":"Buffer","data":[23,229,78,234,79,56,255,12,148,50,112,57,32,89,84,24,109,109,167,11]},"announce":[],"urlList":[]}}