{"title":"The Easybeats - Friday On My Mind (1967)","uid":4711860,"size":127173140,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:186a5391358e270d31821e4a6c00af583c47e81c&amp;dn=The+Easybeats+-+Friday+On+My+Mind+%281967%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Iron_Horse","files":22,"time":1234057395,"description":"The Easybeats - Friday On My Mind (1967)\nMP3 320 mbit/s\nIncluded: CD Covers and this Info\n\nFriday on My Mind, produced by Shel Talmy and recorded in England, captures the Easybeats at just about their peak, combining all of the best elements in the evolution of their sound under one cover. The Easybeats were still one of the most energetic outfits in rock music, with a raw, highly animated guitar attack, but they were trying (and largely succeeding with) ever more complex vocal harmony parts and some staccato guitar harmony as well that was pretty impressive, and at this stage they were working with a brace of gorgeous Harry Vanda/George Young originals. The ubiquitous title track is in excellent company, surrounded by an array of mid- to late-60's British rock treasures: a killer garage punk rendition of &quot;River Deep, Mountain High,&quot; with a superb performance by Stevie Wright and what sounds almost like a sitar buried somewhere in the midst of the crisp electric guitars; &quot;Do You Have a Soul,&quot; with its abrupt tempo changes, cascading choruses, chiming guitars, and hooks that seem to flow into each other effortless; &quot;Saturday Night,&quot; with more sitar-like sounds beneath the radiant choruses and rhythm guitar hooks; the dramatic, angst-ridden &quot;You Me, We Love,&quot; on which Vanda's guitar playing becomes as intense as Wright's wrenching vocal performance; &quot;Pretty Girl,&quot; with its crunchy rhythm guitar sound and catchy lyric hooks and choruses; and &quot;Made My Bed Gonna Lie in It,&quot; a punk anthem nearly as catchy and well-played as &quot;I'm Not Like Everybody Else.&quot; Not everything on this album is as successful as these cuts, but it is all good listening, even the eerie, original album finale, &quot;See Line Woman.&quot; In fact, only the rendition of Leiber and Stoller's &quot;Hound Dog&quot; may be out of place, and even it works as a change of pace. The label of &quot;Australia's Beatles&quot; may have proved an overstatement to some, but one can get a good look at its basis on this album -- it's loaded with actual and potential hit singles, yet it doesn't come off as lightweight in any way. The 1992 Repertoire Records re-release features six bonus cuts that adds significantly to the value of an already good release: &quot;Heaven and Hell,&quot; the long version of &quot;Do You Have a Soul&quot; (from the US release of the song), &quot;You Me, We Love,&quot; and &quot;Lisa,&quot; all of which fit nicely into the ornate and quasi-psychedelic but completely rocking mood of the original album, while &quot;Woman (Make You Feel Alright)&quot; is a chugging little rock &amp; roll number that sounds like it was a choice leftover from their very first album.\n\nThe band's line-up exemplified the influence of post-war migration on Australian society. All five founding members were from families who had migrated to Australia from Europe: lead singer Stevie Wright and drummer Gordon &quot;Snowy&quot; Henry Fleet were from England; rhythm guitarist George Young was from Scotland; lead guitarist Harry Vanda and bassist Dick Diamonde were from The Netherlands.\n\nTracklist:\n01_River Deep, Moutain High\n02_Do You Have A Soul (Edited LP Version)\n03_Saturday Nigh\n04_You Me, We Love\n05_Pretty Girl\n06_Friday On My Mind\n07_Happy Is The Man\n08_Hound Dog \n09_Who'll Be The One\n10_Made My Bed Gonna Lie In It\n11_Remember Sam\n12_See Line Woman\n13_Heaven And Hell\n14_Do You Have A Soul (Long Version)\n15_Women (Make You Feel Alright)\n16_All Gone By (Different Mix)\n17_You Me, We Love (Different Mix)\n18_Lisa (Different Mix)\n","torrent":{"xt":"urn:btih:186a5391358e270d31821e4a6c00af583c47e81c","amp;dn":"The+Easybeats+-+Friday+On+My+Mind+%281967%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"186a5391358e270d31821e4a6c00af583c47e81c","infoHashBuffer":{"type":"Buffer","data":[24,106,83,145,53,142,39,13,49,130,30,74,108,0,175,88,60,71,232,28]},"announce":[],"urlList":[]}}