{"title":"Unsolved Mysteries Disc 7","uid":5389859,"size":4700373039,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:189d35debf65e0aa2cca558d8ba2e8546ad01b3f&amp;dn=Unsolved+Mysteries+Disc+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"slasherman","files":-1,"time":1267029596,"description":"[IMG]http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_001-2.jpg[/IMG]\n[IMG]http://i33.photobucket.com/albums/d54/slasherman1971/dask/PDVD_003-4.jpg[/IMG]\n\n[url]http://www.imdb.com/title/tt0094574/[/url]\n\nOnly murder, wanted and unexplained deaths..real crime stuff.\nThe quality is very poor. Old vhs tapes which has been compressed into small file size. Typical vhs noise on most.\n\nTime: About 6 hours\n\nHow to burn:\nI have chosen .iso file this time.\nIf you use ImgBurn: WRITE IMAGE FILE TO DISC\nI tested it at 6x write speed and it worked perfectly...\nRemember to keep the .iso file on your pc so you can seed.\n\n[color=Red]Disc 7[/color]\n- John Martin - Police chief is murdered and was able to give a brief description of the killer before he died. Looking for him.\n- Salvatore Caruana - Narcotics smuggler with ties to the mob is wanted by police.\n- Ricardo Caputo - A serial killer who police believe has killed at least 5 women whom he was acquainted with. Searching for him.\n- Brad Bishop - A Government worker kills his family and flees. Has been on the run for years and there have been reported sightings of him all around the world.\n- Joseph Maloney - Was arrested for murdering his estranged wife. Was being held in Ireland before he was released. Police are searching for him.\n- &quot;Tyler&quot; - Is found wandering in the Nevada desert and has no idea who he is. Searching for his family and his true identity. Update.\n- Poloma Martin - She was kidnapped by her non-custodial mother who appears to be mentally unbalanced. Searching for them.\n- Veronica (Tina) Jefferson - A young professional is raped and murdered and found in a schoolyard. Police searching for her killer.\n- Rachael Raver &amp; Warren Fulton - A young couple are both murdered. - - - Police have discovered their murder is linked to another unsolved homicide profiled on a very early UM.\n- David Hurley - Was shot by an unknown motorist driving a gold Honda Prelude after a minor traffic accident. David was able to be interviewed by police but later died at the hospital. Police searching for the road rage driver who killed him.\n- Home Improvement Scam - Heartless conmen who prey on the elderly on the ruse of doing home improvements and charging outrageous fees.\n- Charles Horvath - A young man was hitchhiking across Canada and to meet up with his family in Hong Kong. He never arrived and is missing. There are a lot of conflicting clues as to whether he met with foul play or left on his own.\n- John Burns - (from Pre-Stack Specials) Is wanted for killing his ex-girlfriend Eleanor Farber. Police are looking for him but have no clue what his true identity is.\n- Kay Hall - Was run over and killed the day she came into a sizeable inheritance. Police suspect her husband.\n- Mike Emert - Real estate agent is murdered while showing a home by an unknown man with a cane. Searching for who and why.\n- Magic Rock - Family finds a rock with mysterious markings on it and claim to come into good luck afterwards.\n- Dick Hansen - He was out on a date with a friend when an unknown motorist started to taunt them. When Hansen confronted him the driver seemed to take offense at the 49er's license plate and shot and killed Hansen. Searching for him.\n- Live From The Telecenter - A live 90 minute broadcast (only aired once) where UM tried to solve cases on the air. Profiles several wanted fugitives, lost loves and missing persons.\n- Leyzhan Williams - Was kidnapped and his mother murdered in what was made to look like a house fire. He is the infant son of young rapper - - Lathan &quot;Young Lay&quot; Williams. He is searching for his son and those responsible for his girlfriend's murder.\n- Stuart Heaton - Is in jail convicted of the murder of Crystal Nabb. He claims he is innocent and the dna used to convict him is flawed.\n- Diane Shawcroft &amp; Jennifer Lueth - Best friends were murdered. Police trying to find out who killed them and why.\n- Lauren Jackson - Young girl went missing from her front yard. Some people suspect the mother gave her away but she maintains her innocence.\n- Robert Corrado - Was wanted for running a massive auto theft ring as well as drug charges. He left a suicide note and his car near a bridge before his trial. Police think he's on the run and didn't kill himself.\n- Scott Rossiter - Canadian policeman who was shot in the line of duty. \n- Police believe David O'Neill is the murderer and are looking for him.\n- Woody Kelly - Investment counselor abruptly disappeared while out on his boat. Police later learned he was stealing from his clients and suspect he staged his disappearance.\n- John &amp; Linda Sohus - They disappeared abruptly while mysterious postcards were sent to their family from other countries. Police don't know whether they met with foul play at the hands of their tenant or disappeared willingly.\n- Craig Williamson - Never returned home after a business trip. His wife has worked tirelessly to find him and believe he may have amnesia.\n- Charlie Anderson - Sheriff's Deputy was shot &amp; killed while returning to his home late one night. Caller may have info as to who killed him and police would like him to call back.\n- Tony Lombardi - Was found dead in his bed of a gunshot wound. Police think it was suicide but family insist he was murdered.\n- Duane McCorkendale - Trucker, was shot and killed for a few dollars while at a pay phone. Police searching for this cold hearted killer.\n- Computers - Three cases are profiled where computers are used in an effort to help catch criminals.\n\nVideo Attributes:\n  Video compression mode: MPEG-1\n  TV system: 525/60 (NTSC)\n  Aspect Ratio: 4:3\n  Source picture resolution: 352x240 (525/60)\n  Frame Rate: 30.00\n  Bitrate: 4.11Mbps\t\t\n\nIf you need more information or want to discuss the cases you can do it on this excellent forum [url]http://www.sitcomsonline.com/boards/forumdisplay.php?f=322[/url] \nSpecial thanks to crystaldawn who is a UM genius.","torrent":{"xt":"urn:btih:189d35debf65e0aa2cca558d8ba2e8546ad01b3f","amp;dn":"Unsolved+Mysteries+Disc+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"189d35debf65e0aa2cca558d8ba2e8546ad01b3f","infoHashBuffer":{"type":"Buffer","data":[24,157,53,222,191,101,224,170,44,202,85,141,139,162,232,84,106,208,27,63]},"announce":[],"urlList":[]}}