{"title":"The Taste of Northern India - Shira Barak","uid":12144774,"size":1803167,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18c326fbcf539557c72b97187c50755dafbec5f6&amp;dn=The+Taste+of+Northern+India+-+Shira+Barak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1437442962,"description":"This book will take you on a culinary journey through recipes and landscape and will give you a deeper glance of Northern India \nThe 50 best recipes of the region gathered especially for you as collected by the author during the years of culinary journey throughout north India. \n \nThis is not a regular Indian cookbook; this book gathers 50 AUTHENTIC north Indian recipes divided by different categories. \nWhile most of eastern cookbooks are either inaccessible to the common western reader or it becomes &quot;Americanized&quot; in a way that the ingredients are being replaced with western industrial ingredients, making the recipes very different from its source. \n \nThe author choose to keep the recipes AUTHENTIC as she got them from the local people of north India. Along with that she attached an Indian-western ingredients dictionary- explaining about each ingredient and suggesting a reasonable, natural substitute in case one of the ingredient is missing, Doing so, this cookbook will be great for all level of Foodies. \n \nThis book decently provides delicious tastes, smells and sights for the body &amp; soul, takes you on a journey through the coulter and landscapes of north India and provides you an easy way to enjoy tasty north Indian dishes at home","torrent":{"xt":"urn:btih:18c326fbcf539557c72b97187c50755dafbec5f6","amp;dn":"The+Taste+of+Northern+India+-+Shira+Barak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c326fbcf539557c72b97187c50755dafbec5f6","infoHashBuffer":{"type":"Buffer","data":[24,195,38,251,207,83,149,87,199,43,151,24,124,80,117,93,175,190,197,246]},"announce":[],"urlList":[]}}