{"title":"Biodamage and Biodegradation of Polymeric Materials","uid":12427700,"size":3181365,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:198bc724c66888c7c1d6cf64320064a49c289149&amp;dn=Biodamage+and+Biodegradation+of+Polymeric+Materials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1442409465,"description":"Biodamage and Biodegradation of Polymeric Materials - New Frontiers (Smithers Rapra, 2012).pdf\n\nISBN 978-1-84735-751-9\n\nThe issue of biodamages comprises a wide range of scientific and practical tasks associated with protection of raw materials and products against damage by bacteria, fungi, insects and rodents during long-term storage, production, transportation and operation. The first objective of this book is to provide detailed information on the three interrelated parts: bacteria and fungi (the source of biodamages); insects and rodents (materials and products depredators); and materials and products damaged by living organisms. The most modern data on morphology and physiology of biodegrading microorganisms are presented. The second objective of this book is to provide the reader with a systematisation of biological degradation on both natural and synthetic materials and products (plastics, textile, fibres, leather and fur, wood and so on). Problems of utilisation of polymeric wastes using microorganisms are discussed and main protection methods and technology for raw materials and semi-products against biodamages are shown. Practical recommendation for struggle against biodamage of materials by insects (moth, leather beetles, wood-fretters, cockroaches and termites) and rodents (mice and rats) are given. The final objective of this book is to illustrate that the problem of biodamages is very real today because it is relevant to many aspects of our everyday lives. This volume is intended to be a practical guide on biodamage and biodegradation of polymeric materials and a quick reference to students and researchers from academia and the industry","torrent":{"xt":"urn:btih:198bc724c66888c7c1d6cf64320064a49c289149","amp;dn":"Biodamage+and+Biodegradation+of+Polymeric+Materials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"198bc724c66888c7c1d6cf64320064a49c289149","infoHashBuffer":{"type":"Buffer","data":[25,139,199,36,198,104,136,199,193,214,207,100,50,0,100,164,156,40,145,73]},"announce":[],"urlList":[]}}