{"title":"New York Times Best Sellers - Fiction - 20 October 2013 (MOBI+Ep","uid":9059799,"size":49609596,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19ead71ea8aa6e675c7e0e6e3364e49278328aec&amp;dn=New+York+Times+Best+Sellers+-+Fiction+-+20+October+2013+%28MOBI%2BEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"KaavaBoT","files":70,"time":1382023966,"description":"New York Times Best Sellers - Fiction - 20 October 2013 (MOBI+Epub) LittleFairyRG\n &lt;a href=&quot;\nhttp://i.imgur.com/Rn4jAfM.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/Rn4jAfM.jpg&lt;/a&gt;\n\nNew York Times Best sellers - Fiction\n\nThe New York Times best selling Fiction print/eBook of October 20, 2013\n\nThis weeks New editions (1, 4, 7, 10, 11, 13, 20, 22, 24, 25, +Bonus)\n\n1 - GONE - James Patterson and Michael Ledwidge\nDetective Michael Bennett, living with his 10 adopted children on a California farm, is pursued by the head of a Mexican drug cartel he once put in jail.\n2- DOCTOR SLEEP - Stephen King\nNow grown up, Dan, the boy with psycho-intuitive powers in  The Shining,  helps another child with a spectacular gift.\nBonus: Book 1 - The Shining\n3 - THE LONGEST RIDE - Nicholas Sparks\nThe lives of two couples converge unexpectedly.\n4 - SILENCING EVE - Iris Johansen\nThe final book of a trilogy about the forensic sculptor Eve Duncan.\nSee August 4, 2013 Collection for Books 1 &amp; 2\n5- THE HUSBAND'S SECRET - Liane Moriarty\nA woman reads a letter from her husband, very much alive, that was intended to be opened only after his death.\n6 - NEVER GO BACK - Lee Child\nJack Reacher is thrown into jail on trumped-up charges and must clear his name.\n7 - THE SIGNATURE OF ALL THINGS - Elizabeth Gilbert\nA 19th-century botanist s love of knowledge takes her to Tahiti; by the author of  Eat, Pray, Love.  \n8 - THE RACKETEER - John Grisham\nAn imprisoned ex-lawyer schemes to exchange information about who murdered a judge for his freedom.\n9 - W IS FOR WASTED - Sue Grafton\nA homeless man inexplicably leaves $600,000 to Kinsey Millhone.\n10 - THE OCTOBER LIST - Jeffery Deaver\nA woman innocently finds herself in possession of a list that makes her the target of ruthless criminals. (Novel is told in reverse order)\n11 - THE TRAINING - Tara Sue Me\nIn the conclusion to the Submissive trilogy, Abby King's relationship with Nathaniel West, the millionaire C.E.O. and New York's most eligible dominant, becomes more intimate.\nBonus Books: 1 - The Submissive &amp; 2 - The Dominant\n12 - ENDER'S GAME - Orson Scott Card\nGovernment agencies breed child geniuses and train them as soldiers.\n13 - POSSESSION - J.R. Ward\nBook 5 of the Fallen Angels paranormal romance series.\n14 - THE LOWLAND - Jhumpa Lahiri\nAfter his radical brother is killed, an Indian scientist brings his widow to join him in America.\n15 - THE QUEST - Nelson DeMille\nAn elderly priest, recently escaped from an Ethiopian jail, is joined by two journalists in a search for a holy relic.\n16 - DEADLINE - Sandra Brown\nA journalist becomes a murder suspect as he pursues a story.\n17 - THE CUCKOO'S CALLING - Robert Galbraith\nThe struggling detective Cormoran Strike investigates a supermodel s suicide; by J.K. Rowling, writing pseudonymously.\n18 - THANKLESS IN DEATH - J. D. Robb\nLt. Eve Dallas searches for a young man who murdered his parents; by Nora Roberts, writing pseudonymously.\n19 - THE FINAL CUT - Catherine Coulter and J.?T. Ellison\nA Scotland Yard chief inspector teams up with two special agents from the F.B.I. to hunt for an international jewel thief.\n20- WELCOME TO THE WORLD, BABY GIRL! - Fannie Flagg\nThe pleasures and problems of the rising star of a 1970s television show. Originally published in 1998.\n21 - INFERNO - Dan Brown\nThe symbologist Robert Langdon, on the run in Florence, must decipher a series of codes created by a Dante-loving scientist.\n22 - TORN - Kim Karr\nSomeone from Dahlia London's past resurfaces, and her rock star boyfriend River Wilde's secrets come to light. Can their relationship withstand this turmoil? Book 2 of the Connections series.\nBonus: Book 1 - Connected\n23 - GONE GIRL - Gillian Flynn\nA woman disappears on the day of her fifth anniversary; is her husband a killer?\n24 - CARVED IN BONE - Jefferson Bass\nWhen the forensic anthropologist Bill Brockton is called to examine a mummified corpse discovered in an isolated community, long-hidden secrets and feuds come to light. Originally published in 2006.\n25 - THE WAGER - Rachel Van Dyken\nThe Seattle millionaire Jake Titus begins to fall for the TV reporter Char Lynn, whom he once dropped after a one-night stand. Can he convince her that he's serious this time? Book 2 of The Bet series.\n\nBonus title from Hardcover list\n- BASTION - Mercedes Lackey\nMags and his friends leave Collegium - the heart of Valdemar - for Bastion, the hidden spot in the hills that had once been the headquarters of a powerful band of raiders that had held him and his parents prisoner. Fifth book in the Valdemar: Collegium Chronicles series.\nBonus Books 1-4 of the Collegium Chronicles (Foundation, Intrigues, Changes, Redoubt)\n\nAuthors: Various\nQuantity: 26\nFormats: Epub+MOBI\nFolder Size: 47.3 MB\n\nIf you download our uploads, please make sure you seed them till atleast 1:1 ratio. We all work very hard to get this stuff. We'll all greatly appreciate some help.\n","torrent":{"xt":"urn:btih:19ead71ea8aa6e675c7e0e6e3364e49278328aec","amp;dn":"New+York+Times+Best+Sellers+-+Fiction+-+20+October+2013+%28MOBI%2BEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19ead71ea8aa6e675c7e0e6e3364e49278328aec","infoHashBuffer":{"type":"Buffer","data":[25,234,215,30,168,170,110,103,92,126,14,110,51,100,228,146,120,50,138,236]},"announce":[],"urlList":[]}}