{"title":"By Gaslight - Steven Price [EN EPUB] [ebook] [p_s]","uid":15679111,"size":1190655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a02f03b5bd80e43d5c47c2b6aa4f322154aac34&amp;dn=By+Gaslight+-+Steven+Price+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"perfect_stan","files":2,"time":1472288190,"description":"By Gaslight by Steven Price\r\nEnglish | 2016 | Historical Mystery | 1.2 MB\r\n\r\n\r\nA literary tour de force of a detective’s ceaseless hunt for an elusive criminal\r\nLondon, 1885. Three years before the Whitechapel killings, London is a city of fog and darkness. A severed head is dredged from the Thames; ten miles away, a woman’s body is discovered on Edgeware Road. The famed American detective William Pinkerton is summoned by Scotland Yard to investigate. The dead woman fits the description of a grifter Pinkerton had been pursuing for a long time–someone he believed would lead him to a man he has been hunting since his father’s death.\r\nEdward Shade is an industrialist without a past, a fabled con, a thief of other men’s futures–he seems a ghost, a man of smoke. The obsessive hunt for him that began in the last days of the Civil War becomes Pinkerton’s inheritance. What follows is an epic journey of secrets, deceit, and betrayals. Above all, it is the story of the most unlikely of bonds: between Pinkerton, the greatest detective of his age, and Shade, the one criminal he cannot outwit.\r\nSteven Price’s By Gaslight is a riveting, atmospheric portrait of a man on the brink. Moving from the diamond mines of South Africa to the fog-enshrouded streets of Victorian London, the novel is a journey into a cityscape of grief, trust, and its breaking, where what we share can bind us even against our better selves.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:1a02f03b5bd80e43d5c47c2b6aa4f322154aac34","amp;dn":"By+Gaslight+-+Steven+Price+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a02f03b5bd80e43d5c47c2b6aa4f322154aac34","infoHashBuffer":{"type":"Buffer","data":[26,2,240,59,91,216,14,67,213,196,124,43,106,164,243,34,21,74,172,52]},"announce":[],"urlList":[]}}