{"title":"Peter Watson - Ideas: A History of Thought and Invention, From F","uid":8996908,"size":3068466,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a05da5c7e71471329283478b5b4e242204a725b&amp;dn=Peter+Watson+-+Ideas%3A+A+History+of+Thought+and+Invention%2C+From+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"epub_888","files":-1,"time":1380885956,"description":"In this hugely ambitious and exciting book Peter Watson tells the history of ideas from prehistory to the present day, leading to a new way of telling the history of the world. The book begins over a million years ago with a discussion of how the earliest ideas might have originated. Looking at animal behaviour that appears to require some thought - tool-making, territoriality, counting, language (or at least sounds), pairbonding - Peter Watson moves on to the apeman and the development of simple ideas such as cooking, the earliest language, the emergence of family life. All the obvious areas are tackled - the Ancient Greeks, Christian theology, the ideas of Jesus, astrological thought, the soul, the self, beliefs about the heavens, the ideas of Islam, the Crusades, humanism, the Renaissance, Gutenberg and the book, the scientific revolution, the age of discovery, Shakespeare, the idea of Revolution, the Romantic imagination, Darwin, imperialism, modernism, Freud right up to the present day and the internet.","torrent":{"xt":"urn:btih:1a05da5c7e71471329283478b5b4e242204a725b","amp;dn":"Peter+Watson+-+Ideas%3A+A+History+of+Thought+and+Invention%2C+From+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a05da5c7e71471329283478b5b4e242204a725b","infoHashBuffer":{"type":"Buffer","data":[26,5,218,92,126,113,71,19,41,40,52,120,181,180,226,66,32,74,114,91]},"announce":[],"urlList":[]}}