{"title":"Everything you ever wanted to know about art materials","uid":11789970,"size":21579396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a853e85da278eec6eb510e12f1fef4c39fc6986&amp;dn=Everything+you+ever+wanted+to+know+about+art+materials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":1,"time":1427901495,"description":"Pdf / English / 2000 / 144 pages / ISBN 10 1581800827 / 20.5 MB\n\nI was exceptionally pleased with this book, which was well-organized with much information on most art materials. Of course, like any book titled &quot;everything you ever wanted to know about...&quot; it's not as comprehensive as the title boasts. I enjoy scratchboard art, and there is no mention of that medium in the book, and I'm sure there are others, but that one stood out to me. I'm not disappointed enough to take a star away from it though.\n\nOverall, each section discusses some of the history behind the medium discussed, as well as techniques, common manufacturers, and innovations. The author gives recommendations and caveats for each medium, and reasons for both, which I like, because I not only want to know the good and bad, but I want to know why. I find it easier to remember that way.\n\nI was surprised at how conversational the book's writing was. I had expected to pick it up and look things up, like I would a dictionary or encyclopedia. Amazingly, I started reading at the beginning, and read all through it. Well-designed and well-written, this book should be assigned reading to beginning art students. It would take the mystery out of some media very quickly, and allow art instructors to get on to more important matters without having to focus on petty details about materials.\n\nAmazon","torrent":{"xt":"urn:btih:1a853e85da278eec6eb510e12f1fef4c39fc6986","amp;dn":"Everything+you+ever+wanted+to+know+about+art+materials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a853e85da278eec6eb510e12f1fef4c39fc6986","infoHashBuffer":{"type":"Buffer","data":[26,133,62,133,218,39,142,236,110,181,16,225,47,31,239,76,57,252,105,134]},"announce":[],"urlList":[]}}