{"title":"Sharon Van Etten - Are We There [2014][EAC/FLAC]","uid":10228727,"size":279036110,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1a9332f8b72ffdc74612ed1ca442cee572c146e2&amp;dn=Sharon+Van+Etten+-+Are+We+There+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"dickspic","files":15,"time":1401119740,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Jagjaguwar #JAG 255CD\nCountry: USA\nYear: May 27, 2014\nGenre: Pop,Rock\nFormat: CD,Album\n\n\n01. Afraid of Nothing (4:05)\n02. Taking Chances (3:50)\n03. Your Love Is Killing Me (6:18)\n04. Our Love (3:53)\n05. Tarifa (4:51)\n06. I Love You But I'm Lost (4:19)\n07. You Know Me Well (4:32)\n08. Break Me (4:01)\n09. Nothing Will Change (3:16)\n10. I Know (3:36)\n11. Every Time the Sun Comes Up (4:23)\n\n\nBrooklyn singer/songwriter Sharon Van Etten's transfixing voice and often heart-wrenching songs come through in an odd mixture of pain and flourishing inspiration on the best moments of her fourth album, Are We There. The album, produced by Van Etten herself with some help from New York-based producer Stewart Lerman (Elvis Costello, Sophie B. Hawkins), follows her 2012 outing Tramp and trades up on some of the crushed indie templates of that album for new stylistic territory. From her first hushed demo-like recordings, Van Etten's songs have more often than not found their lyrical core stemming from painful relationships and hard times, culminating in Tramp's tales of homelessness, uncertainty, and desperation. Are We There's 11 selections also mine her harrowed heart for inspiration, be it the slow-burning portrait of a toxic love/hate romance in &quot;Your Love Is Killing Me&quot; or the obsessed fixation on an absent lover in &quot;Break Me.&quot; While there's still a fair amount of heartbreak and pain in the subject matter of the songs, the folky strums and indie rock clatter of Tramp and earlier records have been expanded upon with more inventive musical approaches, leaving the album feeling much brighter, even in its darkest moments. &quot;Taking Chances&quot; is guided by an unexpectedly slinking bassline and minimal drum machine clicks, Van Etten's voice melting like honey over their laid-back foundations before introducing rawkus guitars on the chorus. Similar instrumentation shows up on &quot;Our Love,&quot; a steady drum machine and lonely organ drone setting the stage for the brilliantly arranged multi-tracked harmonies and an indie take on the sophisticated tones of '80s quiet storm R&amp;B. Even when tending toward more familiar rock sounds, the arrangements on Are We There are more considered, colorful, and ornate than ever before. Where previous albums felt a little too anchored to Van Etten's samey guitar changes, here tracks like &quot;Tarifa&quot; explode with sure-footed horn sections, nostalgic Hammond organ, and spirals of anthemic vocal harmonies. Quieter songs like &quot;I Know&quot; and &quot;I Love You But I'm Lost&quot; are driven by piano, leaving lots of space for the vocals to soar, while the cinematic textures and haunted guitar twang of &quot;You Know Me Well&quot; could almost draw comparisons to Lana Del Rey in her more Twin Peaks moments. The more inventive arrangements and advances in songwriting are an undeniable step forward for Van Etten. While still immersed in songs of emotional ravagement and betrayal, the confidence of her performances and spectrum of sounds represented here suggest a complete graduation from troubled, uncertain roots into a place where she can deliver her songs with a powerful, borderless command.","torrent":{"xt":"urn:btih:1a9332f8b72ffdc74612ed1ca442cee572c146e2","amp;dn":"Sharon+Van+Etten+-+Are+We+There+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a9332f8b72ffdc74612ed1ca442cee572c146e2","infoHashBuffer":{"type":"Buffer","data":[26,147,50,248,183,47,253,199,70,18,237,28,164,66,206,229,114,193,70,226]},"announce":[],"urlList":[]}}