{"title":"History Begins at Sumer - 27 Firsts in Mans Recorded History","uid":11816981,"size":48918841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1adf7db89fceda057171c720da164134498984ba&amp;dn=History+Begins+at+Sumer+-+27+Firsts+in+Mans+Recorded+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":1,"time":1429132029,"description":"English / Pdf / 300 pages / ISBN 10\t0385094051 / 1973 Doubleday / 46.6 MB\n\nThe very beginnings of man's history are recorded in the strange wedge-shaped marks inscribed upon the tablets of Sumer. Unearthed about a century ago from the mounds in Mesopotamia where they had lain for more than three thousand years, and deciphered only after decades of painstaking work, the tablets tell the story of a civilization long forgotten, where culture as we know it was born. In this book, which won an award as the best foreign book of the year when it was published in France in 1957, Dr. Samuel Noah Kramer, America's foremost Sumerologist, describes twenty-seven &quot;firsts&quot; in human history and in this way constructs an intimate and vivid picture of everyday public and private life five thousand years ago. Ancient man's schools, his hymns and epics, the earliest social reforms, the first recorded political, religious, and ethical ideas are here recounted, side by side with less important but equally entertaining beginnings, such as the world's first recorded tax reduction and the earliest experiment with shade-tree gardening in history. In this colorful account of life in one of the world's oldest societies, modern man can read of the origins of his culture and the beginning of all civilization","torrent":{"xt":"urn:btih:1adf7db89fceda057171c720da164134498984ba","amp;dn":"History+Begins+at+Sumer+-+27+Firsts+in+Mans+Recorded+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1adf7db89fceda057171c720da164134498984ba","infoHashBuffer":{"type":"Buffer","data":[26,223,125,184,159,206,218,5,113,113,199,32,218,22,65,52,73,137,132,186]},"announce":[],"urlList":[]}}