{"title":"Wu-Tang Clan - Enter the Wu-Tang (36 Chambers) [24 bit FLAC] vin","uid":9405968,"size":1080747781,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1b38abecb6fb255eb6ec8eaf59701ee8f80124c9&amp;dn=Wu-Tang+Clan+-+Enter+the+Wu-Tang+%2836+Chambers%29+%5B24+bit+FLAC%5D+vin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"politux","files":-1,"time":1388158076,"description":"\n  Wu-Tang Clan - Enter the Wu-Tang (36 Chambers) [24 bit FLAC] vinyl\n\n  Genre: Hip-Hop\n  Styles: East Coast Rap, Hardcore Rap\n  Source: RCA MOVLP215 vinyl\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Bring Da Ruckus\n  02 Shame on a Nigga\n  03 Clan in Da Front\n  04 Wu-Tang 7th Chamber\n  05 Can It Be All So Simple\n  06 Protect Ya Neck (Intermission)\n  07 Da Mystery of Chessboxin'\n  08 Wu-Tang Clan Ain't Nuthing Ta Fuck Wit\n  09 C.R.E.A.M.\n  10 Method Man\n  11 Tearz\n  12 Wu-Tang 7th Chamber Part II (Conclusion)\n\n  Technical info: (Not my rip)\n\n  &quot;Lin. Recorded with Adobe Soundbooth cs5\n  Each song was hand recorded @ 32/96 float saved as 24 /96 wav\n  Then converted to flac \n  Added id tag info in foobar artwork with dbp\n  No effects were added \n  Cart: Carl Cox numark cs 1 \n  Turntable: Numark TTusb\n  Soundcard: M-Audio Delta 44 preamped in rca by Kenwood reciver\n  Virgin Vinyl ..opened to record&quot;\n    \n  Along with Dr. Dre's The Chronic, the Wu-Tang Clan's debut, Enter the Wu-Tang (36 Chambers), was one of the most influential rap albums of the '90s. Its spare yet atmospheric production -- courtesy of RZA -- mapped out the sonic blueprint that countless other hardcore rappers would follow for years to come. It laid the groundwork for the rebirth of New York hip-hop in the hardcore age, paving the way for everybody from Biggie and Jay-Z to Nas and Mobb Deep. Moreover, it introduced a colorful cast of hugely talented MCs, some of whom ranked among the best and most unique individual rappers of the decade. Some were outsized, theatrical personalities, others were cerebral storytellers and lyrical technicians, but each had his own distinctive style, which made for an album of tremendous variety and consistency. Every track on Enter the Wu-Tang is packed with fresh, inventive rhymes, which are filled with martial arts metaphors, pop culture references (everything from Voltron to Lucky Charms cereal commercials to Barbra Streisand's &quot;The Way We Were&quot;), bizarre threats of violence, and a truly twisted sense of humor. Their off-kilter menace is really brought to life, however, by the eerie, lo-fi production, which helped bring the raw sound of the underground into mainstream hip-hop. Starting with a foundation of hard, gritty beats and dialogue samples from kung fu movies, RZA kept things minimalistic, but added just enough minor-key piano, strings, or muted horns to create a background ambience that works like the soundtrack to a surreal nightmare. There was nothing like it in the hip-hop world at the time, and even after years of imitation, Enter the Wu-Tang still sounds fresh and original. Subsequent group and solo projects would refine and deepen this template, but collectively, the Wu have never been quite this tight again.","torrent":{"xt":"urn:btih:1b38abecb6fb255eb6ec8eaf59701ee8f80124c9","amp;dn":"Wu-Tang+Clan+-+Enter+the+Wu-Tang+%2836+Chambers%29+%5B24+bit+FLAC%5D+vin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b38abecb6fb255eb6ec8eaf59701ee8f80124c9","infoHashBuffer":{"type":"Buffer","data":[27,56,171,236,182,251,37,94,182,236,142,175,89,112,30,232,248,1,36,201]},"announce":[],"urlList":[]}}