{"title":"ARLO GUTHRIE-Alice's Restaurant","uid":3459336,"size":33269742,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1bcf22fa317c9f830a53c849a1bf205265ca19bb&amp;dn=ARLO+GUTHRIE-Alice%5C%27s+Restaurant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"made-of-technetium","files":7,"time":1142723544,"description":"Although he&amp;#039;d been a fixture on the East Coast folk circuit for several years, Arlo Guthrie did not release this debut album until mid-1967. A majority of the attention directed at Alice&amp;#039;s Restaurant focuses on the epic 18-plus-minute title track, which sprawled over the entire A-side of the long-player. However, it is the other half-dozen Guthrie compositions that provide an insight into his uniformly outstanding -- yet astoundingly overlooked -- early sides on Warner Bros.. Although arguably 100 percent factual, &quot;Alice&amp;#039;s Restaurant Massacree&quot; -- which was recorded in front of a live audience -- is rooted in a series of real incidents. This decidedly anti-establishment saga of garbage dumps closed on Thanksgiving, good ol&amp;#039; Officer Obie, as well as Guthrie&amp;#039;s experiences with the draft succeeds not only because of the unusual and outlandish situations that the hero finds himself in; it is also his underdog point of view and sardonic delivery that maximize the effect in the retelling. After decades of refusing to perform the work in concert, he trotted it back out in the late &amp;#039;80s, adding fresh perspectives and side stories about the consequences that the song has had, such as the uncanny role that the track played in the Watergate tape cover-up. In terms of artistic merit, the studio side is an equally endowed effort containing six decidedly more traditional folk-rock compositions. Among the standouts are the haunting &quot;Chilling of the Evening,&quot; which is given an arrangement perhaps more aptly suited to a Jimmy Webb/Glen Campbell collaboration. There is a somewhat dated charm in &quot;Ring-Around-a-Rosie-Rag,&quot; a sly, up-tempo, and hippie-friendly bit of jug band nostalgia. &quot;I&amp;#039;m Going Home&quot; is an underrated minor-chord masterpiece that is not only reminiscent of Roger McGuinn&amp;#039;s &quot;Ballad of Easy Rider,&quot; but also spotlights a more sensitive and intricate nature to Guthrie&amp;#039;s craftsmanship. Also worth mentioning is the first installment of &quot;Motorcycle Song&quot; -- which was updated and discussed further on the live self-titled follow-up release Arlo (1968) -- notable for the extended discourse on the &quot;significance of the pickle.&quot; None of the performances on this disc were used in for the Alice&amp;#039;s Restaurant (1969) film. However, the soundtrack -- which was issued on CD by Rykodisc in 1998 -- contains a full-length studio version of the &quot;Massacree.&quot; In 1995 Guthrie marked the 30th anniversary of the original Thanksgiving Day incident which sparked the need for a Massacree in the first place. He re-recorded this entire album to uniformly superior results. Alice&amp;#039;s Restaurant: 30th Anniversary Edition is a fun update as well as a stirring reminder of what a national treasure Guthrie&amp;#039;s music and lyrics really are. ~ Lindsay Planer, All Music Guide","torrent":{"xt":"urn:btih:1bcf22fa317c9f830a53c849a1bf205265ca19bb","amp;dn":"ARLO+GUTHRIE-Alice%5C%27s+Restaurant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bcf22fa317c9f830a53c849a1bf205265ca19bb","infoHashBuffer":{"type":"Buffer","data":[27,207,34,250,49,124,159,131,10,83,200,73,161,191,32,82,101,202,25,187]},"announce":[],"urlList":[]}}