{"title":"THE FRENCH REVOLUTION - HISTORY CHANNEL - DUBLADO PT-BR","uid":4250003,"size":501443590,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c81724dd446d47f9b5850950ab01c120178cddc&amp;dn=THE+FRENCH+REVOLUTION+-+HISTORY+CHANNEL+-+DUBLADO+PT-BR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"fjtheo","files":1,"time":1213966861,"description":"Lancado em 2005\n &lt;a href=&quot;\nhttp://www.amazon.com/French-Revolution-History-Channel/dp/B0007GP836&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/French-Revolution-History-Channel/dp/B0007GP836&lt;/a&gt;\n\nEm julho de 1789, uma mafia de zangados parisienses invadiu e destrui a Bastilha, um ato que foi ao longo do tempo ( devido a impotencia do Estado de seu Rei, Louis XVI )  deflagrar uma das revolucoes mais sangrentas da historia.  Liderados por Robespierre e outros homens do Iluminismo, o que comecou como uma luta contra uma monarquia ineficaz  terminou como uma fase na historia conhecida como o Terror.  O suspeitos de traicao a revolucao eram mortos pela lamina da guilhotina, incluindo o Rei e sua Rainha, Maria Antonieta.  Quando o derramamento de sangue do Terror tinha cessado definitivamente, Robespierre ele proprio havia caido pela guilhotina e o povo da Franca foi capaz de se adaptar a um novo governo, sem o receio de perder a cabeca. Assim, Napoleao Bonaparte encontrou o seu caminho para Poder.\n\nO History Channel faz um trabalho muito bom de relatar a Revolucao Francesa.  O filme tem uma narracao por Edward Herrmann, bem como comentarios de varios historiadores franceses e americanos.  Trata-se nao so da Revolucao ao Terror, mas da ascencao e morte de Louis XVI e de seu casamento com Maria Antonieta e como sua incompetencia como um governante levou diretamente a queda da Bastilha e todos os que lhe seguiram. Tambem aborda as diferentes faccoes no seio dos revolucionarios e como um grupo que escreveu Os Direitos do Homem caiu para endossar um Estado totalitario, em que ninguem foi capaz de manter estes direitos.  Enquanto nao ha tempo para a abundancia de detalhes, este documentario apresenta uma solida descricao do que aconteceu e e uma boa base para estudar os pormenores da Revolucao Francesa.\n\nOn July 14 1789 a mob of angry Parisians stormed the Bastille and seized the King\\\\\\&amp;#039;s military stores. A decade of idealism war murder and carnage followed bringing about the end of feudalism and the rise of equality and a new world order.THE FRENCH REVOLUTION is a definitive feature-length documentary that encapsulates this heady (and often headless) period in Western civilization. With dramatic reenactments illustrations and paintings from the era plus revealing accounts from journals and expert commentary from historians THE FRENCH REVOLUTION vividly unfurls in a maelstrom of violence discontent and fundamental change. King Louis XVI Marie Antoinette Maximilien Robespierre and Napoleon Bonaparte lead a cast of thousands in this essential program from THE HISTORY CHANNELÃƒ??.Narrated by Edward Herrmann (The Aviator Gilmore Girls) THE FRENCH REVOLUTION explores the legacy that--now more than ever--stands as both a warning and a guidepost to a new millennium. \n","torrent":{"xt":"urn:btih:1c81724dd446d47f9b5850950ab01c120178cddc","amp;dn":"THE+FRENCH+REVOLUTION+-+HISTORY+CHANNEL+-+DUBLADO+PT-BR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c81724dd446d47f9b5850950ab01c120178cddc","infoHashBuffer":{"type":"Buffer","data":[28,129,114,77,212,70,212,127,155,88,80,149,10,176,28,18,1,120,205,220]},"announce":[],"urlList":[]}}