{"title":"Critical Failures - Robert Bevan","uid":11635212,"size":232627463,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1c9b4ec11bc8d9dd9199ddeed56182a819447b97&amp;dn=Critical+Failures+-+Robert+Bevan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"captainelliotspencer","files":22,"time":1417723462,"description":"\n\nTim and his friends find out the hard way that you shouldn't question the game master, and you shouldn't make fun of his cape.\n\nOne minute, they're drinking away the dreariness of their lives, escaping into a fantasy game and laughing their asses off. The next minute, they're in a horse-drawn cart surrounded by soldiers pointing crossbows at them.\n\nTim now has the voice and physique of a prepubescent girl. Dave finds that while he lost a foot or two in height, he somehow acquired a suit of armor and a badass beard. Julian's ears have grown ridiculously long and pointy. And Cooper... well Cooper has gotten himself a set of tusks, a pair of clawed hands, and a bad case of the shits. He also finds that he's carrying a bag with a human head in it - a head that he had chopped off when they were still just playing a game.\n\nShit just got real, and if they want to survive, these four friends are going to have to tap into some baser instincts they didn't even know existed in their fast-food and pizza delivery world.\n\nIt's fight, flight, or try to convince the people who are trying to kill them that they don't really exist.\n\nMeanwhile, a sadistic game master sits back in the real world eating their fried chicken.\n\nWritten by \nRead by Jonathan Sleep\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\n----------------------------------\nVisit us for this and loads more:\n\nwww.audiobookvault.ws","torrent":{"xt":"urn:btih:1c9b4ec11bc8d9dd9199ddeed56182a819447b97","amp;dn":"Critical+Failures+-+Robert+Bevan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c9b4ec11bc8d9dd9199ddeed56182a819447b97","infoHashBuffer":{"type":"Buffer","data":[28,155,78,193,27,200,217,221,145,153,221,238,213,97,130,168,25,68,123,151]},"announce":[],"urlList":[]}}