{"title":"VA - Hot summer hit in your car (2014)","uid":10487328,"size":951236232,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1cdd1000b167b361a25abb1d82374acf21347814&amp;dn=VA+-+Hot+summer+hit+in+your+car+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"RoffeTheCoolMan","files":-1,"time":1404492778,"description":"Audio: 256 kbps\n\n01. Alex MORPH feat. Zara Taylor - Human (Original Mix)\n02. 4 Strongs feat. Neev Kennedy - This Heart Is Yours\n03. Aurosonic and Frainbreeze feat. Katty Heath - All I Need (Club Mix)\n04. 3LAU feat. Bright Lights - How You Love Me\n05. Radio Killer - Kill The Lights (Extended Version)\n06. Dj Antoine vs. Mad Mark - Crazy World (Extended Mix)\n07. Bob Sinclar - Cinderella\n08. Season Lovers feat. Fabiola Tommaseo - Give Me The Night (Marco Veneziano Rmx)\n09. Benny Benassi - Back To The Pump (Original Mix)\n10. Spyne &amp; Palmieri feat. Kenny Ray - Out Of Bounds (Blanco &amp; Baj Remix)\n11. Beyonce - Pretty Hurts (R3hab Radio Edit)\n12. TBA - She's Got Nothin 'On (But The Radio) (Dave Dee! Remix)\n13. Evelyn - La Vida Loca (Mike Candys Mix)\n14. N-Trigue &amp; Play 'N' Skillz feat. Pitbull &amp; Natasha - Scream\n15. Miss Caramelle feat. Yaneena - Higher (Radio Mix)\n16. Season Lovers feat. Fabiola Tommaseo - Give Me The Night (Ale Oh Oh Ale) (Andrea Flash Remix)\n17. K-Klass feat. Bobbi Depasois - Ask (Club Mix)\n18. Ian Rodriguez feat. Anixua &amp; Hiurma - Shake That Body (Extended Mix)\n19. Dada feat. Sandy Rivera &amp; Trix - Spring Mood (Najim Hassas Rmx)\n20. Armin Van Buuren - Save My Night (Original Mix)\n21. Dj Stardust &amp; Benjamin Zane feat. Pit Bailay - Famous (Original Club Mix)\n22. Johan K feat. Tony T &amp; Alba Kras - Summer Summer (Club Mix)\n23. Dart Rayne and Y. Moonlight feat. Neev Kennedy - Way Too Much\n24. Groove Cocktail feat. Nathalia - One Love (Jonny Montana &amp; Craig Stewart Remix)\n25. Alex B and Judith - Sound Of Summer (Club Mix)\n26. Tom Enzy - Night Life (Original Mix)\n27. DubVision - Hollow (Original Mix)\n28. Mat Zo feat. Rachel K Collier - Only For You (Maor Levi Remix)\n29. Illuminor - Misplaced Me\n30. Marco Polo - Dancing All The Night (Last Dance Mix)\n31. Italoproducerz - Happiness (SOS) (Dance Rocker Remix)\n32. Kristina Maria - Move Like A Soldier (Adam Rickfors Extended Club Remix)\n33. Britney Spears - Work Bitch (Dank Remix)\n34. Somna and Yang feat. Michele C. - Chasing Stars\n35. Ayda - Resurrection (Original Mix)\n36. Fernand Rolex and Edjus Sema feat. Morgana - Come Close To Me (Extended Mix)\n37. Jenaux Ft Jared Lee - Turn Your World Around (Laidback Luke Edit)\n38. Kristina Maria - Move Like A Soldier (Adam Rickfors Extended Club Remix)\n39. Solarstone feat. Lemon - Lovers (Giuseppe Ottaviani Remix)\n40. Bodybangers - Are You Ready (Radio Edit)\n41. La Familia Loca feat. Daniel And Dawe - El Coco (Dj Samuel Kimko Rumba Extended)\n42. Basement Jaxx - Never Say Never (Extended Mix)\n43. Martin Dee Angelo - Try Too Show (DJ LoKKo Remix)\n44. Adam Clay, Jonathan Carey, Dani B - People Are Rising (People Are Rising (Extended Mix)\n45. Cher - I Walk Alone (Dan Slater Radio Edit)\n46. Bogdan - Love Is In The Air (Dorian Oswin Electric Pulse Remix)\n47 . Rudy Rox - Chase Your Dream (Original Mix)\n48. Alexandra Badoi feat. Denis Kenzo - Lifetime Change (Club Radio Edit)\n49. Katherine Ellis and Hugo Kalfon and Rio Dela Duna - Are You Out There\n50. Manufactured Superstars feat. Fingazz - Voyager\n51. Dj Storm - Narcos (Radio Edit)\n52. Proyal feat. Ai Takekawa - The Orbit (Biotones and Max Farewell Remix)\n53. Kaskade feat. Joslyn - Sweet Love (Original Mix)\n54. LTN and Cathy Burton - You Promised (Original Mix)\n55. Tritonal &amp; Paris Blohm feat. Sterling Fox - Colors (Original Mix)\n56. Tiesto feat. Christian Burns - Shimmer\n57. Havana Brown - Warrior (Fluke Remix)\n58. Jewelz &amp; Scott Sparks feat. Quilla - Unless We Forget (Original Mix)\n59. Glenn Morrison feat. Islove - Goodbye (Shane Halcon Remix)\n60. Paul Vax &amp; Ultrabazz - Infected (Original Mix)\n61. Naughty Boy - La La La (White Panda X Gazzo Remix)\n62. DJ Vic Celigan &amp; Ben Dv feat. Mandy - Nothing (Radio Edit)\n63. Morvan feat. Sopheary - Won't Be Broken\n64. Don Diablo &amp; Matt Nash vs. Otto Knows - Starlight (Could You Be Mine) (Asalto Remake)\n65. Flo Rida - How I Feel (Special Features Remix)\n66. Mia Martina - Latin Moon (Anthony Pippaz Remix)\n67. Markus Schulz feat. Adina Butar - Muse\n68. Myon and Shane 54 feat. Amy Pearson - Hurricane (Timur Shafiev Remix)\n69. Tiesto feat. Krewella - Set Yourself Free\n70. Yuri Kane feat. Melissa Loretta - Saved You\n71. Borgeous - Wildfire (Original Mix)\n72. Keypro - In Your Eyes (Extended)\n73. Aruna - Start A Fire (Johan Malmgren Original Mix)\n74. L-Siska - We Want To Dance (Club Mix)\n75. Mark Bester feat. Love Dimension - Love Is Good (Original Mix)\n76. Boney M. - Rasputin (Ser Twister Remix)\n77. Jessie J - Thunder (Erik Arbores Remix)\n78. Ted Newtone feat. Ben - Feeling (Radio Mix)\n79. Ferry Tayle feat. Poppy - The Way Back Home (Original Mix)\n80. Rouge feat. In-Grid - J'adore (Extended Mix)\n81. A-Roma feat. Flo Rida and Shawn Lewis - A Prayer (E-Partment Short Mix)\n82. Rimini Project feat. Jodz and Jackson - Drinks On Me (Guenta K Remix)\n83. David Gravell - Nighthawk (Original Mix)\n84. Stefano Pain &amp; Maury Lobina feat. Jonny Rose - Take Me Back (Original Mix)\n85. Samantha Jade - Up (7th Heaven Club Mix)\n86. Audio Playground - Hands Up In The Air (Simone Bresciani Club Mix)\n87. R3hab And Nervo And Ummet Ozcan - Revolution (Chocolate Puma Remix)\n88. DJ Antoine - Light it Up (Bodybangers Radio Edit)\n89. Dart Rayne and Yura Moonlight feat. Katty Heath - Stole The Sun\n90. Katrin Moro - Love Surrounds Me\n91. Marvin feat. Karly and Kenny Ray - Good Life\n92. Bastille - Of The Night (Kove Remix)\n93. Joanna Rays - Not Enough (Original Radio Mix)\n94. Tritonal feat. Phoebe Ryan - Now Or Never (Estiva &amp; Juventa Remix)\n95. Aron Tanie feat. Jesse Brown - Road To Salvation (Original Mix)\n96. Nick Otronic &amp; High Level feat. Sofia Robert - What It Feels Like (Summer Mix)\n97. Nicole Scherzinger - Your Love (Cahill Radio Edit)\n98. Sasha Lopez feat. Radio Killer - Perfect Day (Andrew Beat Remix)\n99. Marco Van Bassken feat. Ida Berg - Apollo (Extended Mix)\n100. Johan K feat. Tony T And Alba Kras - Summer Summer (Club Edit) ","torrent":{"xt":"urn:btih:1cdd1000b167b361a25abb1d82374acf21347814","amp;dn":"VA+-+Hot+summer+hit+in+your+car+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cdd1000b167b361a25abb1d82374acf21347814","infoHashBuffer":{"type":"Buffer","data":[28,221,16,0,177,103,179,97,162,90,187,29,130,55,74,207,33,52,120,20]},"announce":[],"urlList":[]}}