{"title":"Imperfect.Samples.Fazioli.Ebony.Concert.Grand.Complete.Edition.M","uid":8152141,"size":14197536811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d9703b5e82a24745d2739a4712ece7a6accae5c&amp;dn=Imperfect.Samples.Fazioli.Ebony.Concert.Grand.Complete.Edition.M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":5,"uploader":"daedalus__","files":73,"time":1361067276,"description":"################################################################################################\n#     Imperfect.Samples.Fazioli.Ebony.Concert.Grand.Complete.Edition.MULTIFORMAT-AudioP2P      #\n################################################################################################\n#                                  General Release Information                                 #\n################################################################################################\n# Type.................: SAMPLES                                                               #\n# Platform.............: HYBRID                                                                #\n# Audio Format.........: EXS NKI WAV                                                           #\n# Product WebSite......: www.imperfectsamples.com/website/samples/fazioliconcertgrand/index.php#\n# Release..............: 512                                                                   #\n# Release Title........: ap-isfecgce.rar                                                       #\n# Prepared.............: 12-30-2010                                                            #\n# CRC &amp; File Counts....: ap-isfecgce.sfv                                                       #\n# Supplier.............: AudioP2P                                                              #\n################################################################################################\n#                                      General Description                                     #\n################################################################################################\n\nImperfect Samples FAZIOLI Ebony Concert Grand is the World's Largest* sampled grand piano.\nCommanding a powerful and magnificent sound, this imposing hand-made Fazioli ten foot Grand\nPiano was created by the makers of world's most expensive grand pianos, and is considered by\nmany to be the Elite of all grands.\n\nFinally, an epic grand piano has been imperfectly sampled with warmth, without sterility. Most\ngrand piano libraries tend towards having a sterile sound. The Fazioli Concert Grand offers an\nimperfectly sampled epic sound, with a raw warm, and rich tone not heard in other commercial\ngrand piano sample libraries. The sound of this piano is deep, full, and epic, with real\nperformance elements that can't be simulated using synthesis or modelling. The Fazioli Ebony\nConcert Grand is desirable for situations where you want the grand, expensive sound of a real\ngrand piano.\n\nThis grand piano sample library is intended for use in pop, rock, orchestral, film, classical,\njazz, and almost any other genre. The microphone perspectives have been specifically recorded\nto cater for various genres and acoustic mix spaces. For example, perspective 3 was recorded\nfar from the piano, with more natural room reverb, and a rich tone suitable for orchestral\nwork. Perspective 5 has a dry, bright and thin sound suitable for busy rock mixes. Perspective\n1 was recorded by the piano keys, with a beautiful and imperfect sound character suited to\nsolo work. \n\nThe Fazioli Ebony Concert Grand is provided in 24-bit audio fidelity with a dry mic\nperspective, wet room perspective, player, close-mic'd, and internal perspective, all with\nimperfectly and perfectly sampled instruments, the Ebony Concert Grand is essentially 10 high\nresolution grand pianos in one package. This sampled grand piano is intended to contain an\nepic piano sound for every situation\n\nThe Fazioli Ebony Concert Grand (complete) contains 3 microphone perspectives with up to 14\nvelocity layers, release samples, true staccato, picked strings, piano effects and performance\nsounds. As with all imperfect samples, natural performance elements are included, such as the\nsounds of the fingers touching the keys. No robots or sampling machines were used here.\nProvided at full 24-bit audio fidelity, this grand piano sample library totals 30GB of data\nand over 8000 unique samples. This is essentially three distinct grand pianos in one package.\nMicrophone perspective 1 was recorded 2 inches from the sound-board, for an organic warm\nsound, perspective 2 was recorded directly inside the instrument, for a clean sound, and\nperspective 3 was recorded 2 metres away from the piano for a &quot;wet&quot; room sound. Treat this\nsampled piano library like a live instrument; mix the perspectives like you would a live\nrecording. This piano library uses direct-from-disc technology, which means it has a RAM\nfootprint of only about 350MB.  \n\nHere at imperfect samples it is believed that the key to getting a decent sample library is\ndown to the sound, not specifications on paper. Sound is an ineffable quality that that\ndoesn't come down to quantifiable methods such as number of velocity layers. However, if 14\nvelocity layers in each perspective isn't enough to satisfy your appetite, an (extreme)\npackage is available, with even more velocity layers and mic perspectives. \n\nThis library supports the following formats: VST, AU, EXS24, Kontakt 4 (or higher)*\n\n################################################################################################","torrent":{"xt":"urn:btih:1d9703b5e82a24745d2739a4712ece7a6accae5c","amp;dn":"Imperfect.Samples.Fazioli.Ebony.Concert.Grand.Complete.Edition.M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9703b5e82a24745d2739a4712ece7a6accae5c","infoHashBuffer":{"type":"Buffer","data":[29,151,3,181,232,42,36,116,93,39,57,164,113,46,206,122,106,204,174,92]},"announce":[],"urlList":[]}}