{"title":"Kenrick Cleveland &amp; Harlan Kilstein -Unconscious Persuasion","uid":12936280,"size":1011730755,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1dc38f2821a2d39a20c1f4ed0d837ef625edf017&amp;dn=Kenrick+Cleveland+%26amp%3B+Harlan+Kilstein+-Unconscious+Persuasion&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"acer47x","files":18,"time":1449585758,"description":"You deserve some history. When John Grinder and Richard Bandler developed NLP, before they even had that name, they modeled people in different professions. Of course, everyone knows that they modeled Virginia Satir, the family therapist, and Milton Erickson MD, the legendary Hypnotherapist. But they modeled people in many other professions.\r\n\r\nIt was their intent to publish these other models in other books until they split up and these models were lost forever.\r\n\r\nThey modeled a number of the most highly effective salespeople in the world to elicit their core patterns. This master, who shuns publicity and enjoys retirement, was one of those Bandler and Grinder modeled.\r\n\r\nBut, because what he did defied structure and challenged some of their beliefs, they never included his teachings in NLP. And there they were forgotten and abandoned... until now.\r\n\r\nWe Broke the Code and Now We Are Taking It To The Next Level...And Beyond\r\n\r\nAfter hours of observation and hundreds of hours on the phone and in person, my friend and I broke this teacher's code. No code breaker at the NSA or the CIA ever felt more satisfaction when we were able to replicate these teachings to others.\r\n\r\nAnd let me tell you something. No matter how good you are, these secrets are a whole new level. When you employ these totally unconscious techniques in your sales presentation, you will close more sales","torrent":{"xt":"urn:btih:1dc38f2821a2d39a20c1f4ed0d837ef625edf017","amp;dn":"Kenrick+Cleveland+%26amp%3B+Harlan+Kilstein+-Unconscious+Persuasion","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dc38f2821a2d39a20c1f4ed0d837ef625edf017","infoHashBuffer":{"type":"Buffer","data":[29,195,143,40,33,162,211,154,32,193,244,237,13,131,126,246,37,237,240,23]},"announce":[],"urlList":[]}}