{"title":"49 Books on Quantum Mechanics","uid":4725420,"size":532777611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ded70cc77d233418f717c611f5ce3e189a6af4d&amp;dn=49+Books+on+Quantum+Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1234724216,"description":"The following torrent contains:\n\nIntroduction To Quantum Mechanics- David Griffiths\n\nVisual Quantum Mechanics- B.Thaller\n\nTopics in Advanced Quantum Mechanics- C. Callan\n\nThe Theory of Groups and Quantum Mechanics- H. Weyl\n\nThe Nonlinear Schroedinger Equations Self-Focusing and Wave Collapse- Catherine Sulem Pierre-Loui\n\nThe Grand Unified Theory of Quantum Classical Mechanics- Mills R.L\n\nSupersymmetry in Quantum and Classical Mechanics- B.K.Bagchi\n\nSpeakable And Unspeakable In Quantum Mechanics- J. Bell\n\nSome Novel Thought Experiments- Foundations of Quantum Mechanics Thesis- O. Akhavan\n\nSolutions to Sakurai's Problems. in Quantum Mechanics- B. Brinne\n\nSolutions to Problems in Sakurai's Quantum Mechanics- P. Saltsidis B. Brinne\n\nSchaum's Outline of theory and problems of Quantum  Mechanics- Peleg Pinni and Zaarur\n\nScattering Theory The Quantum Theory of Nonrelativistic Collisions - John R. Taylor\n\nRelativistic Quantum Mechanics. Wave Equations  3r d ed. - W. Greiner\n\nQuantum theory of scattering processes - Farina J.E.G\n\nQuantum statistical mechanics - Kadanoff  L.P.  Baym  G\n\nQuantum Mechanics in Hilbert Space - E. Prugovecki\n\nQuantum Mechanics And Path Integrals - R. Feynman  A. Hibbs\n\nQuantum Mechanics - Vol 1 - Cohen-Tannoudji\n\nQuantum Mechanics - Symmetries 2nd ed. - W. Greiner  B. Muller\n\nQuantum Mechanics - Modern Mevelopment 4ed - A. Rae\n\nQuantum Mechanics - L. Schiff\n\nQuantum Mechanics - J. Norbury\n\nQuantum Mechanics - Concepts and Applications - T. Biswas\n\nQuantum Mechanics - an Introduction  4th ed. - W. Greiner\n\nQuantum Mechanics - A Modern Development - L. Ballentine\n\nQuantum Mechanics - A Conceptual Approach - H. Hameka\n\nQuantum Information Theory and the Foundations of  Quantum Mechanics  thesis  - C. Timpson\n\nPrinciples of Quantum Mechanics 2nd ed. - R. Shankar\n\nOperator Algebras and Quantum Statistical Mechanic s Vol 2 - 2ed - Bratelli\n\nOperator Algebras and Quantum Statistical Mechanic s Vol 1 - 2ed - Bratelli\n\nNotes on Quantum Mechanics - K. Schulten\n\nMolecular Quantum Mechanics 4th ed - P Atkins  R. Friedman\n\nModern Quantum Mechanics and solutions for the exe rcices - J. Sakurai\n\nMatrix Quantum Mechanics and 2-D String Theory  thesis  - S. Alexandrov\n\nMathematical Methods in Quantum Mechanics - G. Teschl\n\nLocalising Relational Degrees of Freedom in Quantu m Mechanics  thesis  - H. cable\n\nLecture Notes on C-algebras and Quantum Mechanics   jnl article  - N. Lamdsman\n\nIrreversibilities in Quantum Mechanics - B. Fain\n\nIntroduction to Quantum Mechanics - A. Phillip\n\nIntroduction to Optical Waveguide Analysis Solving  Maxwell s Equation and the Schrdinger Equation\n\nFundamentals of Quantum Mechanics for Solid State  Electronics  Optics - C. Tang\n\nCourse of Theoretical Physics - Vol 3 Quantum Mechanics - nonrelativistic theory 3rd ed.- L. Landau\n\nClassical and Quantum Mechanics of the Damped Harm onic Oscillator - Dekker\n\nCavity Quantum Electrodynamics The Strange theory of Light In a Box - Dutra S\n\nCanonical Structures in Potential Theory - S.S. Vinogradov  P. D. Smith  E.D. Vinogradova\n\nBibliographic Guide to Foundations of Quantum Mechanics - A. Cabello\n\nAn Elementary Approach To The Quantum Theory of Scattering By a Potential\n\nQuantum Mechanics - Vol 2 - Cohen-Tannoudji\n\nIncluded is a program which allows you to the DJVU files (basically an awkward version of PDF files).\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:1ded70cc77d233418f717c611f5ce3e189a6af4d","amp;dn":"49+Books+on+Quantum+Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ded70cc77d233418f717c611f5ce3e189a6af4d","infoHashBuffer":{"type":"Buffer","data":[29,237,112,204,119,210,51,65,143,113,124,97,31,92,227,225,137,166,175,77]},"announce":[],"urlList":[]}}