{"title":"Terry Reid-11 album","uid":4988738,"size":996089200,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e0993d05dcddcb504827acd109944cc027112cc&amp;dn=Terry+Reid-11+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"SecondOpinion","files":-1,"time":1246919013,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nTerry Reid (born 13 November 1949, Huntingdon, England) is a rock singer and guitarist.\nAfter leaving school at the age of 15, Reid joined Peter Jay's Jaywalkers after being spotted by the band's drummer, Peter Jay. At the time Reid was playing for a local band, The Redbeats. His public profile was enhanced in 1966 when The Jaywalkers were named as a support act for The Rolling Stones for their concert at the Royal Albert Hall. Graham Nash of The Hollies became friends with Reid at that concert and suggested The Jaywalkers sign up with Columbia Records to record with producer John Burgess. Their first single, the Soul-inspired &quot;The Hand Don't Fit the Glove,&quot; was a minor hit in 1967, but by then The Jaywalkers had already decided to disband.\nReid came to the attention of hits producer Mickie Most, who became his manager. His first single with Most, &quot;Better By Far,&quot; became a radio favourite, but the album, Bang Bang, You're Terry Reid, was not a commercial success. A 1968 tour of the United States with Cream did much to gain Reid a loyal following. His final performance of the tour at the Miami Pop Festival garnered positive reviews from the music press. In 1969, Reid supported various British tours, notably Jethro Tull and Fleetwood Mac.\nYardbirds guitarist Jimmy Page became interested in Reid's work, and when The Yardbirds disbanded, Page wanted Reid to fill the vocalist spot for his proposed new group, the New Yardbirds, which was to become Led Zeppelin. Reid had already committed to go on the road with the Rolling Stones (as an opening act on the 1969 US Tour). So he suggested to Page that he consider a young Birmingham singer, Robert Plant, instead, having previously seen Plant's Band of Joy as a support act at one of his concerts. Reid later turned down an offer to join Deep Purple when they decided to replace singer Rod Evans; Ian Gillan was given the position instead.\nTerry Reid's second album, Terry Reid (1969), is regarded by critics as his best work. Reid toured the United States again when he opened for The Rolling Stones on their 1969 American Tour. He did not appear at the infamous Rolling Stones concert at Altamont Music Festival. In December 1969 Reid had a falling out with producer Mickie Most, who wanted Reid to become a balladeer, and to strictly follow his own formula; the same problem the Yardbirds had experienced with Most years earlier. Reid then left England and settled in California to sit out the remainder of his contract with Most, making only sporadic live performances during that period. In 1970, he returned briefly to England to perform at the Isle of Wight Festival. Reid is filmed performing in Glastonbury Fayre, the 1971 film by David Puttnam. In 1973, Reid returned with a new contract with Atlantic Records and a new album entitled River. Produced by Yes's Eddie Offord, the album received favourable reviews, but was a commercial flop.\nOver the next decade, Reid switched to different labels in search of a winning formula; Seed of Memory released by ABC Records in 1976 (produced by Graham Nash), and Rogue Waves released by Capitol Records in 1979. He retired his solo career in 1981 to concentrate on session work, appearing on albums by Don Henley, Jackson Browne, UFO High Stakes &amp; Dangerous Men and Bonnie Raitt. In 1991, Reid returned with former Yes producer Trevor Horn, on the album The Driver. The album featured a cover version of the Spencer Davis Group classic, &quot;Gimme Some Lovin'&quot;, which had earlier appeared on the Days of Thunder soundtrack. &quot;The Whole of the Moon&quot;, written by Mike Scott, was released as a single and received considerable airplay. Reid has since been playing occasional live gigs with a band which has included Brian Auger. In the 90s he also toured in the US and Hong Kong with ex-Rolling Stones guitarist Mick Taylor.\nIn late 2005, Reid returned to the UK for his first tour in years. It is understood that the 'magic shone through'. One venue billed him as 'The Man With A Hell Of A Story To Tell'. That same year, three of his songs, Seed of Memory, To Be Treated Rite, and Brave Awakening, appeared in the movie The Devil's Rejects (2005), directed by Rob Zombie. Also, his song Faith To Arise was in the 2003 film Wonderland. In July/August 2007 Reid returned for another six week UK tour being backed by The Cosmic American Derelicts, a band out of northern New Jersey and Southern New York.\nOn June 26th, 2009, Terry Reid appeared with Comic American Derelicts guitarist Eddie to perform at ex-band mate Peter Jay's Great Yarmouth club The Residence. Terry started the night by performing an impromptue version of 'Season of the Witch' with UK blues band Second hand blues, a video of this is now being circulated on the video sharing siteDuring his set Terry was joined onstage by ex-Jaywalkers drummer Peter Jay to perform a cover of the Beach Boys song 'Don't Worry Baby'.\nOn June 28th, 2009, Terry Reid and his band performed on The Park stage at the Glastonbury Festival to a sparse but appreciative audience.\n\n","torrent":{"xt":"urn:btih:1e0993d05dcddcb504827acd109944cc027112cc","amp;dn":"Terry+Reid-11+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e0993d05dcddcb504827acd109944cc027112cc","infoHashBuffer":{"type":"Buffer","data":[30,9,147,208,93,205,220,181,4,130,122,205,16,153,68,204,2,113,18,204]},"announce":[],"urlList":[]}}