{"title":"Gun Machine - Warren Ellis","uid":12085785,"size":201339540,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1e13793556861bdce5d55fdfd1da079c469fb3d9&amp;dn=Gun+Machine+-+Warren+Ellis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gbgarista","files":37,"time":1435898433,"description":"Written by Warren Ellis\nRead by Reg E. Cathey\nFormat: MP3\nUnabridged\n\nAfter a shootout claims the life of his partner in a condemned tenement building on Pearl Street, Detective John Tallow unwittingly stumbles across an apartment stacked high with guns. When examined, each weapon leads to a different, previously unsolved murder. Someone has been killing people for 20 years or more and storing the weapons together for some inexplicable purpose.\n\nConfronted with the sudden emergence of hundreds of unsolved homicides, Tallow soon discovers that he's walked into a veritable deal with the devil. An unholy bargain that has made possible the rise of some of Manhattan's most prominent captains of industry. A hunter who performs his deadly acts as a sacrifice to the old gods of Manhattan, who may, quite simply, be the most prolific murderer in New York City's history.\n\nWarren Ellis's body of work has been championed by Wired for its &quot;merciless action&quot; and &quot;incorruptible bravery&quot;, and steadily amassed legions of diehard fans. His newest audiobook builds on his accomplishments like never before, announcing Ellis as one of today's most daring thriller writers. This is 21st-century suspense writ large. This is Gun Machine.\n\nThis is a bizarre, hilarious novel. Worth listening to, more than once","torrent":{"xt":"urn:btih:1e13793556861bdce5d55fdfd1da079c469fb3d9","amp;dn":"Gun+Machine+-+Warren+Ellis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e13793556861bdce5d55fdfd1da079c469fb3d9","infoHashBuffer":{"type":"Buffer","data":[30,19,121,53,86,134,27,220,229,213,95,223,209,218,7,156,70,159,179,217]},"announce":[],"urlList":[]}}