{"title":"ACDC - Rock Or Bust mp3 320k (2014)","uid":11560647,"size":106638205,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e1e588f1f922d5eec2d5089476763067ff91577&amp;dn=ACDC+-+Rock+Or+Bust+mp3+320k+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"analogkid6103","files":11,"time":1416876765,"description":"\tAC/DC - Rock Or Bust (2014) Uploade Speaks- See I said you would have it in your hands soon,now is good, enjoy and seed thankx\n\n\n\nINFO:\n\nAC/DC's mammoth power chord roar became one of the most influential hard rock sounds of the '70s, and is now one of the defining sounds of rock and metal.\nIn its own way, it was a reaction against the pompous art rock and lumbering arena rock of the early '70s. AC/DC's rock was minimalist -- no matter how huge and bludgeoning their guitar chords were, there was a clear sense of space and restraint. Combined with Bon Scott's larynx-shredding vocals, the band spawned countless imitators over the next two decades and enjoyed commercial success well into the 2000s, scoring their biggest hits after Brian Johnson replaced the departed Scott.\n\nAC/DC were formed in 1973 in Australia by guitarist Malcolm Young after his previous band, the Velvet Underground, collapsed (Young's band has no relation to the seminal American group). With his younger brother Angus serving as lead guitarist, the band played some gigs around Sydney. Angus was only 15 years old at the time and his sister suggested that he should wear his school uniform on-stage; the look became the band's visual trademark. While still in Sydney, the original lineup featuring singer Dave Evans cut a single called &quot;Can I Sit Next to You,&quot; with ex-Easybeats Harry Vanda and George Young (Malcolm and Angus' older brother) producing.\n\nThe band moved to Melbourne the following year, where drummer Phil Rudd (formerly of the Coloured Balls) and bassist Mark Evans joined the lineup. The band's chauffeur, Bon Scott, became the lead vocalist when singer Dave Evans refused to go on-stage. Previously, Scott had been vocalist for the Australian prog rock bands Fraternity and the Valentines. More importantly, he helped cement the group's image as brutes -- he had several convictions on minor criminal offenses and was rejected by the Australian Army for being &quot;socially maladjusted.&quot; And AC/DC were socially maladjusted. Throughout their career they favored crude double entendres and violent imagery, all spiked with a mischievous sense of fun.\n\nThe group released two albums -- High Voltage and T.N.T. -- in Australia in 1974 and 1975. Material from the two records comprised the 1976 release High Voltage in the U.S. and U.K.; the group also toured both countries. Dirty Deeds Done Dirt Cheap followed at the end of the year. In the fall of 1977, AC/DC released Let There Be Rock, which became their first album to chart in the U.S. Mark Evans left the band soon after, with Cliff Williams taking his place. Powerage, released in spring of 1978, expanded their audience even further, thanks in no small part to their dynamic live shows (which were captured on 1978's live If You Want Blood You've Got It). What really broke the doors down for the band was the following year's Highway to Hell, which hit number 17 in the U.S. and number eight in the U.K., becoming the group's first million-seller.\n\nAC/DC's train was derailed when Bon Scott died on February 19, 1980. The official coroner's report stated he had &quot;drunk himself to death.&quot; In March, the band replaced Scott with Brian Johnson. The following month, the band recorded Back in Black, which would prove to be its biggest album, selling over ten million copies in the U.S. alone. For the next few years, the band was one of the largest rock bands in the world, with For Those About to Rock We Salute You topping the charts in the U.S. In 1983, Rudd left the band after the recording of Flick of the Switch; he was replaced by Simon Wright.\n\nWith Flick of the Switch, AC/DC's commercial standing began to slip, and they weren't able to reverse their slide until 1990's The Razor's Edge, which spawned the hit &quot;Thunderstruck.&quot; While not the commercial powerhouse they were during the late '70s and early '80s, the 1990s saw AC/DC maintain their status as a top international concert draw. In the fall of 1995, their 16th album, Ballbreaker, was released. Produced by Rick Rubin, the album received some of the most positive reviews of AC/DC's career; it also entered the American charts at number four and sold over a million copies in its first six months of release. Stiff Upper Lip followed in early 2000 with similar results. AC/DC signed a multi-album deal with Sony the following year that resulted in a slew of reissues and DVDs, and they returned to the studio in 2008 for Black Ice, an all-new collection of songs that was followed by the group's first world tour since 2001. Two years later, the band's music was featured heavily in the action movie Iron Man 2, and a compilation was released in conjunction with the film under the title Iron Man 2. In 2014, AC/DC began work a new album, their first without Malcolm Young, who left the band due to health problems; his nephew Stevie Young took his place at the recording sessions. ~ Stephen Thomas Erlewine\n\n\n\nTRACKLIST:\n\n01. Rock or Bust\n02. Play Ball\n03. Rock The Blues Away\n04. Miss Adventure\n05. Dogs of War\n06. Got Some Rock &amp; Roll Thunder\n07. Hard Times\n08. Baptism By Fire\n09. Rock The House\n10. Sweet Candy\n11. Emission Control\n\n\nGenre:\tRock\nSubgenre:\tHard Rock / Heavy Metal\nBitrate:\t320 k\nSize:\t101.70 MB\nShow/Hide Files: \t\n11 files","torrent":{"xt":"urn:btih:1e1e588f1f922d5eec2d5089476763067ff91577","amp;dn":"ACDC+-+Rock+Or+Bust+mp3+320k+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1e588f1f922d5eec2d5089476763067ff91577","infoHashBuffer":{"type":"Buffer","data":[30,30,88,143,31,146,45,94,236,45,80,137,71,103,99,6,127,249,21,119]},"announce":[],"urlList":[]}}