{"title":"Pornochic 27: Superstars (2016/WEBRip/HD)","uid":15710325,"size":2030316492,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1ef1d65d92d4d7e30c5714ad63b224cd0d952494&amp;dn=Pornochic+27%3A+Superstars+%282016%2FWEBRip%2FHD%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"ImgSnaps","files":1,"time":1472562107,"description":"Pornochic 27: Superstars (2016/WEBRip/HD)\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57c567ad6180a.html\r\n \nhttp://imgsnaps.com/img2-57c567ad6598d.html\r\n\r\n\r\nNikita Bellucci, Samantha Bentley, Ariel Rebel, Mia Malkova, Lucia Love, Apolonia Lapiedra, Juan Lucho, Pascal White, Luke Hardy, Alberto Blanco, Kristof Cale, Billy King\r\nQuand son businessman de mari part travailler, la voluptueuse Lucia Love aime exhiber ses seins et ses jolies fesses bien rondes a ses deux voisins qui l'observent fascines, lointaine et aguicheuse derriere sa baie vitree. Jusqu'au jour ou la belle allumeuse decide de sonner chez eux, ses dessous chics de dentelle noire seulement caches sous un trench. Sans un mot, elle prend les deux hommes en bouche et suce leurs deux sexes avec gourmandise. Quand l'un la prend en levrette, elle continue de lecher le sexe de l'autre avant qu'il la sodomise sauvagement. Pour les remercier de l'avoir prise tous les deux, elle leur sourira quand ils offriront leur sperme a ses seins. Le soir, c'est un couple de jeunes parisiens beaux et terriblement pervers qui va se livrer a tous ses fantasmes dans un club chic de la capitale. Tandis que la superbe Ariel se laisse aller sous les doigts et les sextoys de la plantureuse Samantha Bentley, son homme suit la sulfureuse Nikita dans le salon des vices. Il lui faudra trois hommes pour assouvir ses fantasmes les plus secrets. En dessous chics et talons vertigineux, la belle brune leur offrira sa bouche, puis sa petite chatte et son anus dans un plaisir sans limite. La belle Apolonia, elle, prefere la chambre du superbe loft de Kristof Cale pour gouter sa queue d'abord avec sa langue puis dans son sexe. C'est un delice d'admirer la jeune femme a la peau doree jouir sous les coups de boutoir de l'etalon. Enfin, une brune et une blonde s'occuperont du sexe d'un beau male tres en forme devant le regard concupiscent d'une rousse accoudee au bar. Avec un casting international de superstars du X, la serie Pornochic continue son exploration des desirs de la jeunesse chic parisienne avec ces scenes torrides ou beaute, plaisir et perversite sont reunies pour de purs moments d'orgasme","torrent":{"xt":"urn:btih:1ef1d65d92d4d7e30c5714ad63b224cd0d952494","amp;dn":"Pornochic+27%3A+Superstars+%282016%2FWEBRip%2FHD%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ef1d65d92d4d7e30c5714ad63b224cd0d952494","infoHashBuffer":{"type":"Buffer","data":[30,241,214,93,146,212,215,227,12,87,20,173,99,178,36,205,13,149,36,148]},"announce":[],"urlList":[]}}