{"title":"Beirut - March Of The Zapotec - Holland [mp3-vbr-2009]","uid":4670034,"size":55604030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1fe3d03ab401928af358967af8bae78683b9efdd&amp;dn=Beirut+-+March+Of+The+Zapotec+-+Holland+%5Bmp3-vbr-2009%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"trfkad","files":-1,"time":1232702361,"description":"\n1. El Zocalo\n2. La Llorona\n3. My Wife\n4. The Akara\n5. On a Bayonet\n6. The Shrew\n7. My Night With the Prostitute From Marseille\n8. My Wife, Lost in the World\n9. Venice\n10. The Concubine\n11. No Dice\n\n\nTitle: March of the Zapotec/Realpeople Holland\nArtist: Beirut\nStore Date: 16 feb 2009\nUpload Date: 23 jan 2009\nLabel: Pompeii Records\nGenre: ethno-folk-pop\nCover: front\nBitrate: vbr kb/s, joint stereo\n\n\nAfter the widely acclaimed 2007 album The Flying Club Cup, which hit many album of the year lists including the NME, Uncut, Q, The Sun and The Telegraph, the extremely talented young songwriter and musician Zach Condon returns with his third record under the guise of Beirut. The full-length album entitled March Of The Zapotec is comprised of two EPs. The first, and album namesake, is a foray into Mexican folk music with the help of an obscure small-town Mexican funeral band. The second is Holland, a bedroom electro-synth pop wonder, originally an idea for Zach s previous incarnation before Beirut, when he went by the name of Realpeople. For the past year, Beirut has alternated between touring and writing new material, Zach recording in any style that struck his fancy. Some early discussions about doing some soundtrack recording for a film being shot in Mexico morphed into a new idea... What about hiring a local Mexican band to help record some songs based on new material? After finding the band through a friend s mother, hiring a translator, and catching a plane down to Oaxaca, Zach made his way out to the tiny weaver village of Teotitlan del Valle, where he met the nineteen members of The Jimenez Band. Combined, these two EPs in the shape of an album represent the totality of Zach Condon's work over the past year. It is further testament towards the inventiveness and intimacy he creates as Beirut, a band which started as one person sounding like twelve and has developed over the past few years to distinguish itself with a particular style and sound. No matter what inspirations jumpstart one song to the next, the undercurrent that continues to emerge is the realization that Zach Condon is indeed a singular artist creating his very own vision of the world s sound. And whether he's being inspired by Balkan folk, French chanteuse, Mexican troubadour, '80s synth pop or '90s house, the common thread remains Zach's ability to make a simple melody sound both artistically unique and endlessly familiar. March of the Zapotec marks the continuing emergence of a musician who has only shown an inkling of where he is headed. And while the road may be long, every stop along the way is filled with its own treats.\n","torrent":{"xt":"urn:btih:1fe3d03ab401928af358967af8bae78683b9efdd","amp;dn":"Beirut+-+March+Of+The+Zapotec+-+Holland+%5Bmp3-vbr-2009%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fe3d03ab401928af358967af8bae78683b9efdd","infoHashBuffer":{"type":"Buffer","data":[31,227,208,58,180,1,146,138,243,88,150,122,248,186,231,134,131,185,239,221]},"announce":[],"urlList":[]}}