{"title":"Gang of Four - Discography 1979-2011 [FLAC]","uid":10119062,"size":5665460544,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1fef3552603d23ece3e9647768808ec5447b795a&amp;dn=Gang+of+Four+-+Discography+1979-2011+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"rudown78","files":386,"time":1399648972,"description":"Gang of Four - Discography 1979-2011 [FLAC]\n\n\nFormed in 1977 by Leeds University students Jon King (vocals), Andy Gill (guitar), Dave Allen (bass), and Hugo Burnham (drums), Gang of Four (along with the Fall, Mekons, and Liliput) produced some of the most exhilarating and lasting music of the early English post-punk era of 1978-1983. Fueled by the fury of punk rock and radical political theory, Gang of Four successfully welded the two in an inspired display of polemics and music that addressed the vagaries of life in the modern world (including love and romance) as matters of political inquiry. Despite the fact that this sounds rife with the potential for being long on rhetoric and short on groove, such was not the case. What made Gang of Four's polemical clang'n'roll so compelling was that it worked as harsh, bracing, and ultimately liberating rock &amp; roll. With Allen and Burnham combining as a formidable and frequently very funky rhythm section, Gill didn't play guitar as much as emit thick wads of semi-tuneful distortion, while King &quot;sang&quot; in a dry, declamatory fashion similar to that of the Fall's Mark E. Smith. The rhythms were stripped down and jagged; at times Gill would dispense with guitar solos entirely and &quot;play&quot; non-solos, which were (surprise!) silence. Song titles sounded like the titles of radical political essays: &quot;At Home He's a Tourist,&quot; &quot;Damaged Goods,&quot; &quot;It's Her Factory,&quot; &quot;Anthrax,&quot; &quot;To Hell with Poverty,&quot; all of it openly challenging the audience's preconceived notions about rock music, performance, the cult of celebrity, and the nature of politics. And in doing so, GOF conveyed rage, confusion, and loss of identity as well as any band of their time.\n\nAfter three consecutive sensational albums, as well as a handful of EPs and singles, Allen left in 1982 to form the more danceable and less overtly political Shriekback, while Gill, King, and Burnham recorded the misguided &quot;radical soul/R&amp;B&quot; record Hard with veteran American producers Ron and Howard Albert (who'd previously worked with Stephen Stills' Manassas and Firefall). A near total disaster, Hard signaled that the end was nigh. Gill and King, who by this point had final say-so on the band's musical and political direction, sacked Burnham, and the now &quot;Gang of Two&quot; released a so-so live album (At the Palace) and called it quits in 1984. But legends die hard, and Gang of Four experienced a mini-renaissance in the early '90s with the release of two excellent collections (A Brief History of the Twentieth Century and The Peel Sessions Album). Gill and King put together a new Gang of Four and released the tepid but not disgraceful Mall in 1991. Another reunion, from 1995, yielded Shrinkwrapped. Three years later, a double-disc compilation -- 100 Flowers Bloom -- surfaced on Rhino, and the original lineup reconvened in 2004 to tour extensively and release 2005's Return the Gift, featuring re-recordings of their early material. Gill and King continued with a new rhythm section and released 2011's Content with financial support from their fans. They have always remained, to the ears of those opened wide by punk rock, an extremely important band. \n\n\n1979 - Entertainment! [1995 Remaster]\n1979 - Entertainment! [2005 Remaster]\n1982 - Songs of the Free [2008 Remaster]\n1983 - Hard [2008 Remaster]\n1990 - A Brief History of the Twentieth Century\n1990 - The Peel Sessions Album\n1991 - Mall\n1995 - Shrinkwrapped\n1995 - Solid Gold &amp; Another Day_Another Dollar\n1998 - 100 Flowers Bloom\n2003 - Hard/Solid Gold [2 LPs on 1 CD]\n2005 - Return the Gift [2-CD Limited Edition]\n2009 - Second Life [CD-Single]\n2011 - Content\n\n\nAll albums contain artwork and rip logs. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:1fef3552603d23ece3e9647768808ec5447b795a","amp;dn":"Gang+of+Four+-+Discography+1979-2011+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fef3552603d23ece3e9647768808ec5447b795a","infoHashBuffer":{"type":"Buffer","data":[31,239,53,82,96,61,35,236,227,233,100,119,104,128,142,197,68,123,121,90]},"announce":[],"urlList":[]}}