{"title":"David Allen Coe - 11 X-Rated Greats","uid":3543700,"size":41044219,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1ff0425c3e05e99f432c8a30ce5afd2ea48133b4&amp;dn=David+Allen+Coe+-+11+X-Rated+Greats&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"splattergod","files":12,"time":1161495626,"description":"David Allen Coe - 11 X-Rated Greats\n\nTracks:\n\n1)  The Asshole Song\n2)  Cum Stains on the Pillow\n3)  Dear Penis\n4)  I Just Want to Fuck You One More Time\n5)  I Made Linda Lovelace Gag\n6)  Fuckin&amp;#039; in the Butt\n7)  Pick&amp;#039;em, Lick&amp;#039;em Stick&amp;#039;em\n8)  Little Susie Shallow Throat\n9)  Masterbation Blues\n10) The Rodeo Song\n11) Nigger Fucker\n\n\nDavid Allen Coe BIO:\nA life-long renegade, singer/songwriter David Allan Coe was one of the most colorful \nand unpredictable characters in country music history. One of the pioneering artists \nof the outlaw country movement of the &amp;#039;70s, he didn&amp;#039;t have many big hits -- only \nthree of his singles hit the Top Ten -- but he was among the biggest cult figures in \ncountry music throughout his career. Born in Akron, OH, Coe first got into trouble \nwith the law at age nine. As a result, he was sent to reform school. For the next 20 \nyears, he never spent more than a handful of months outside of a correctional \nfacility -- he spent much of his twenties in the Ohio State Penitentiary. Released \nfrom prison in 1967, the wild-haired, earring-wearing, heavily tattooed Coe went \nstraight for Nashville, where he lived in a hearse that he parked in front of the old \nRyman Auditorium, the home of the Grand Ole Opry. Although he didn&amp;#039;t conform to \nNashville&amp;#039;s professional standards, he soon gained the attention of the independent \nlabel Plantation Records, which released his debut album, Penitentiary Blues, in \n1968. Followed within a year by a second volume, all of the songs on these albums \nwere based on his prison experiences. Coe then toured with Grand Funk Railroad, a \nsignal that he drew as much from rock&amp;#039;s traditions as he did from country. Soon, he \nbegan performing in a rhinestone suit given to him by Mel Tillis, as well as a Lone \nRanger mask, and began calling himself the &quot;Masked Rhinestone Cowboy.&quot; Coe&amp;#039;s concerts \nbecame notorious for their unpredictability -- frequently he would roar up on-stage \nastride his enormous Harley, swearing at the audience. He cultivated a large cult \nfollowing with his act, but he couldn&amp;#039;t break into the mainstream. However, other \nartists found success with his songs -- in 1972, Billie Jo Spears had a minor hit \nwith his &quot;Souvenirs &amp; California Mem&amp;#039;rys,&quot; and in 1973, Tanya Tucker had a number one \nhit with Coe&amp;#039;s &quot;Would You Lay With Me (In a Field of Stone).&quot; After Tucker&amp;#039;s hit, Coe \nsuddenly became one of Nashville&amp;#039;s hottest songwriters; some of the biggest country \nartists -- including Willie Nelson, George Jones, and Tammy Wynette -- recorded his \ntunes, leading to his own contract with Columbia Records. Coe&amp;#039;s first two singles for \nColumbia didn&amp;#039;t come close to the country Top 40, but his 1975 cover of Steve \nGoodman&amp;#039;s &quot;You Never Even Called Me by My Name&quot; cracked the Top Ten. Although a \nstring of moderate hits followed, he rarely cracked the country Top 40, although in \n1977 Johnny Paycheck took Coe&amp;#039;s &quot;Take This Job and Shove It&quot; to number one. During \nhis 13-year association with Columbia, Coe released 26 albums, including the \ndouble-album set For the Record: The First 10 Years (1984), 1986&amp;#039;s Son of the South \n(featuring Willie, Waylon, Jessi Colter, and other &quot;outlaws&quot;), and the highly \nregarded A Matter of Life and Death (1987). Although Coe had a successful career, it \nwas one plagued with many setbacks. The conservative Nashville music industry \nfrequently snubbed him and he had tax problems with the IRS; at one time, they seized \nhis Key West home, and he went to live in a Tennessee cave until he got back on his \nfeet. Toward the end of the &amp;#039;80s, Coe remarried and began to settle down. Throughout \nthe &amp;#039;90s, he was a popular concert attraction in America and Europe. In addition to \nhis musical career, he also acted in a few movies, including The Last Days of Frank \nand Jesse James. He also published a novel, -Psychopath, and an autobiography. The LP \nRecommended for Airplay was issued in 1999. The new millennium saw the release of \nLong Haired Country Boy in 2000; Songwriter of the Tear appeared on Cleveland the \nfollowing year. ~ Sandra Brennan, All Music Guide","torrent":{"xt":"urn:btih:1ff0425c3e05e99f432c8a30ce5afd2ea48133b4","amp;dn":"David+Allen+Coe+-+11+X-Rated+Greats","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ff0425c3e05e99f432c8a30ce5afd2ea48133b4","infoHashBuffer":{"type":"Buffer","data":[31,240,66,92,62,5,233,159,67,44,138,48,206,90,253,46,164,129,51,180]},"announce":[],"urlList":[]}}