{"title":"Need For Speed:  High Stakes PC","uid":4902077,"size":737998915,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:20c6b895153f98534b16ac9782747507e9fbaf41&amp;dn=Need+For+Speed%3A++High+Stakes+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ngp2789","files":3,"time":1242686682,"description":"The fourth game in the Need For Speed series.  High Stakes was released in 1999 and improves on Need For Speed III:  Hot Pursuit by offering new cars, tracks, and better police pursuits.\n\nThe image files are in .bin/.cue like my other torrents and can be burned to a CD for your own personal copy.\n\nPLEASE NOTE:  From here on out in the Need For Speed series, Electronic Arts decided to implement copy protection into their game discs!  Because of this, the game will not run if you simply burn it to a blank CD.  To get around this you must either find a NO-CD crack OR use CD Protection emulating software such as DAEMON tools or Alcohol 120.  I did not provide a No-CD patch for the game because I wanted to preserve the original discs integrity.  If you need a No-CD crack to run this game, they can be found here:\n\n(The pirate bay will not let me link to them either in the comments or here, just go to google and type &quot;Need For Speed High Stakes No-CD Patch&quot; and results should come up).\n\nThis is my first time doing a game that requires a No-CD crack so I will see how the community fares with dealing with them.  Of course I will be around to provide help for this game just like all the others  :D .  If you have any problems running this game, let me know in the comments and I will assist you as soon as I can.\n\nNGP2789","torrent":{"xt":"urn:btih:20c6b895153f98534b16ac9782747507e9fbaf41","amp;dn":"Need+For+Speed%3A++High+Stakes+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20c6b895153f98534b16ac9782747507e9fbaf41","infoHashBuffer":{"type":"Buffer","data":[32,198,184,149,21,63,152,83,75,22,172,151,130,116,117,7,233,251,175,65]},"announce":[],"urlList":[]}}