{"title":"Eats, Shoots &amp; Leaves by Lynne Truss","uid":8495203,"size":549126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20d016260864f4403aa43b8b79873fafdab9c8c8&amp;dn=Eats%2C+Shoots+%26amp%3B+Leaves+by+Lynne+Truss&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"trekky623","files":-1,"time":1369122063,"description":"In 2002 Lynne Truss presented Cutting a Dash, a well-received BBC Radio 4 series about punctuation, which led to the writing of Eats, Shoots &amp; Leaves. The book became a runaway success in the UK, hitting number one on the bestseller lists and prompting extraordinary headlines such as Grammar Book Tops Bestseller List (BBC News). With more than 500,000 copies of her book in print in her native England, Lynne Truss is ready to rally the troops on this side of the pond with her rousing cry, Sticklers unite!\n\nThrough sloppy usage and low standards on the Internet, in e-mail, and now text messages, we have made proper punctuation an endangered species. In Eats, Shoots &amp; Leaves, former editor Lynne Truss dares to say, in her delightfully urbane, witty and very English way, that it is time to look at our commas and semicolons and see them as the wonderful and necessary things they are. If there are only pedants left who care, then so be it. This is a book for people who love punctuation and get upset when it is mishandled. From George Orwell shunning the semicolon, to New Yorker editor Harold Ross's epic arguments with James Thurber over commas, this lively history makes a powerful case for the preservation of a system of printing conventions that is much too subtle to be mucked about with.","torrent":{"xt":"urn:btih:20d016260864f4403aa43b8b79873fafdab9c8c8","amp;dn":"Eats%2C+Shoots+%26amp%3B+Leaves+by+Lynne+Truss","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20d016260864f4403aa43b8b79873fafdab9c8c8","infoHashBuffer":{"type":"Buffer","data":[32,208,22,38,8,100,244,64,58,164,59,139,121,135,63,175,218,185,200,200]},"announce":[],"urlList":[]}}