{"title":"Simone McGrath - Coconut Oil for Health and Beauty (2014).","uid":10287404,"size":8044325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21132551b0e17a196de96159b90f69cbe595ee86&amp;dn=Simone+McGrath+-+Coconut+Oil+for+Health+and+Beauty+%282014%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"SectorVector","files":-1,"time":1401808040,"description":"\nCoconut Oil for Health and Beauty: Uses, Benefits, and Recipes for Weight Loss,\nAllergies, and Healthy Skin and Hair,\n\nby Simone McGrath.\n  \n\n# ISBN-13: 9781628737523 \n# Publisher: Skyhorse Publishing\n# Publication year: 2014\n# Pages: 192\n# Format: epub\n\nCoconut oil is an  amazing substance that has many health  benefits - it helps\nwith weight  loss, allergies,  skin and  health issues, and  much more.  It is\nrecommended in  many health programs and  diets, especially the Paleo  and raw\nfood diets,  and many  people are discovering  that it is  better to  use than\nother oils in cooking.\n\n\nIt can  be overwhelming to figure  out all of  the great uses of  this magical\noil, but  this comprehensive handbook  can help. With detailed  information on\neverything  to  do with  coconut  oil  --  the  benefits, uses,  recipes,  and\ninsightful facts  -- this  guide will  teach you all  about this  healthy oil,\nincluding:\n\n\nCoconut Oil for Health and Beauty includes all the information you'll need for\ncooking with this healthy oil and using it for health and beauty, including:\n\n  - How coconut oil is made\n  - How to make it at home\n  - Skin care recipes for face and body\n  - Hair care recipes for damaged, dry, or flaky hair\n  - Dietary benefits\n  - Coconut oil as medicine\n  - Common misconceptions\n    and much more...\n\nMore and  more people are learning  about the wealth of  benefits that coconut\noil brings, and this handbook will explain all of them.\n\n\nAuthor\n======\nSimone McGrath is the mother of two children whom she has healed of allergies and eczema through the use of healing nutritious foods. She has an extensive knowledge in health and nutrition and has always maintained that if you feed your body only nourishing, clean foods, you will feel vibrant, healthy, and happy, and you will live your best life! She specializes in all areas of health and has a special interest in the areas of detoxing, allergies, and digestive health.\n\nShe is currently studying with the Institute for Integrative Nutrition and lives in Sydney, Australia.\n\nAmazon rating: 5/5\n\n-_-\n","torrent":{"xt":"urn:btih:21132551b0e17a196de96159b90f69cbe595ee86","amp;dn":"Simone+McGrath+-+Coconut+Oil+for+Health+and+Beauty+%282014%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21132551b0e17a196de96159b90f69cbe595ee86","infoHashBuffer":{"type":"Buffer","data":[33,19,37,81,176,225,122,25,109,233,97,89,185,15,105,203,229,149,238,134]},"announce":[],"urlList":[]}}