{"title":"fr_windows_7_ultimate_with_sp1_x64_dvd_u_677299.iso","uid":6471077,"size":3252740096,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:213a325ab25ff9e4b8f12af623c7790251b2a96d&amp;dn=fr_windows_7_ultimate_with_sp1_x64_dvd_u_677299.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Tyr3ll","files":1,"time":1308143916,"description":"Hi there\nanother new great stuff for all French speakers .\nThis is the new iso from MSDN/Technet as DVD retail.\nThis new version of Windows 7 SP1 x86 French is normaly the &quot;Ultimate&quot; edition\nThis explain why this file is still named : ultimate.\nHowever like my previous torrent about,i removed the &quot;ei.cfg&quot; from the source folder from the DVD itself .\nThat means you will be able to choose between all edition except &quot;Enterprise&quot; edition then.\nHome Basic/Home Premium/Pro/Ultimate\nExcept this change i made about,this file is absolutely untouched.\nOriginal iso directly from MSDN/Technet and dated from April 12\nand delivered such as.\nit is the second edition of this file;\nfirst edition of this file was from 21 November 2010.(see my previous torrent)\n\nfor now more details about this torrent :\n\nOriginal file...\n\nSHA1 : 5370BB44F497E1B19114C7CF70F5CDEF9F3A2582\n\nISO/CRC : 4AA2D9BB\n\nfile name : fr_windows_7_ultimate_with_sp1_x64_dvd_u_677299.iso\n\nupdated version from : 2011/04/12___________12 mai 2011\n\nFinal version then.\n\n\nThis media refresh includes the installation hotfix described in KB Article 2534111. No other changes have been made to the product.  &lt;a href=&quot;\nhttp://support.microsoft.com/kb/2534111&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://support.microsoft.com/kb/2534111&lt;/a&gt;\n\nAs usual use fast up speed,please ! i work better in cooperative mod with that.\nAll peers with an ip starting by 41. must use utorrent 2.2.1 only if possible.\nAvoid utorrent 3 as it often seems make too much congestion on my torrent network \nto Algerian peers : set your up speed to 0 = unlimited or anyway give speed up enough,please !\nmost of you have a quite slow connection so give max up speed then.\nSaw only 5 real good peers from your country...\nBe more cooperative please !\nmore your internet connection is slow more you will have to give max up speed.\nAfrican peers must follow these tips as well like any other slow peers from any country.\nI repeat : i cannot make some miracles so if you won't be cooperative it will be\nmore difficult for you as well.\nLinux users :\nI often have hard problems with most of you except 4-5 peers maximum\nAvoid absolutely libtorrent who does not give very good results and make huge congestion.\n75 % of libtorrent users have bad results...\nno up in most cases and a very very poor down speed...\n...\nWhy insisting in vain so ?\nTry and switch to another torrent client then !\nTorrent is more difficult to tweak on linux and i suggest to most of you to use KTorrent by far so.\nplease,use KTorrent or Deluge client if you can,ty !\nI saw so much peers on utorrent v 3 with crap results also...\ntry to use older version,please !\nOr i well fear you will get nothing at all...\navoid to use any proxy : crap...\nVPN connection are slower,don't forget that !!!\navoid to filtering too much your ip or mask it so much...\nIn certain cases this will not help at all.\nNo crack or serial or loader is uncluded.\nYou can easily find all you need there on tpb.\nBe patient as i don't have more than 1 meg up speed.\nthis may take a while for few of you to get it but don't worry it will be your soon :) \n100 % clean trustworthy and reliable. No hidden bullshits inside .\nBtw,the &quot;ei.cfg&quot; file can be restored at anytime as well.\nbe sure you have enabled : forced encryption in your torrent client !!!\nSome of you cannot connect sometimes to my torrents...\nThis is due to hard conflicts between several peers.\nBe sure to be righly connected and up at the same time as well.\nwithout giving up speed enough your chance to finish your torrent will be near of 25 % max...\nWhy waste your time without respecting this important tip so ?\nUp is extremely important when you are downloading any torrent.\nNormaly : you must finish it with a minimum ratio of 0.5\nbest peers finish with a ratio near of 0.75 or 1.0 or more\nremember : i see that about all peers who are connected to my seed\ntherefore i know who is egoist and who's not...\nLearn how to righly set your client with your internet connection\nmake a speed test also to be sure anyway.\n...\nthis file is quite hard to grab and find,that's why i give you the nice and rare opportunity to get it.\nThis way i hope you'll really enjoy it .\nPS: when you'll get this file check if &quot;ei.cfg&quot; is present again on &quot;source&quot; folder inside of your iso.In case it will be still present : remove it to get all edition then.\nseed with me asap mates and help the other peers as well...\nBig thx by advance to all seeders who will help me for.\nTy for understanding\nTy for your fidelity and trust\nA nice day to all\nbest regards\t\t","torrent":{"xt":"urn:btih:213a325ab25ff9e4b8f12af623c7790251b2a96d","amp;dn":"fr_windows_7_ultimate_with_sp1_x64_dvd_u_677299.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"213a325ab25ff9e4b8f12af623c7790251b2a96d","infoHashBuffer":{"type":"Buffer","data":[33,58,50,90,178,95,249,228,184,241,42,246,35,199,121,2,81,178,169,109]},"announce":[],"urlList":[]}}