{"title":"FAUST- FAUST IV (Classic krautrock album 1973)","uid":3390815,"size":115135537,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:21854781d63a489952d4439287cfc4a2258161c5&amp;dn=FAUST-+FAUST+IV+%28Classic+krautrock+album+1973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"bergmanwasa","files":12,"time":1128202699,"description":"FAUST- FAUST IV\nVirgin Records 1973\n\n@320 kbps (artwork included)\n\nA classic krautrock album!\n\n1. Krautrock 11.47\t\t\n2. The Sad Skinhead 2.43\t\n3. Jennifer 7.11\n4. Just A Second (Starts Like That!) 3.35\t\n5. Picnic On A Frozen River, Deuxieme Tableux 7.45\n6. La&amp;uuml;ft...Heisst Das Es La&amp;uuml;ft Oder Es Kommt Bald...La&amp;uuml;ft 4.28\n7. Run 3.40\t\n8. It's A Bit Of A Pain 3.08 *\n\n* Listen carefully (about 1,38 min)! A female voice explains (in swedish): &quot;The simple truth is that some men are hairy and some are not. Some women have a lot of hair and some have not. And different races have different patterns along ---(?). The most virile of all human beings,the young male negroe have practically no body hair&quot;. (A free translation.)  :-)\n\nNOTE: Several tracks are mistitled on the sleeve. \nTrack 6 is listed as &quot;Giggy Smile&quot; on the sleeve. \nTrack 7 is listed &quot;La&amp;uuml;ft...Heisst Das Es La&amp;uuml;ft Oder Es Kommt Bald...La&amp;uuml;ft&quot;\n\nSee http://www.faust-pages.com/records/faustiv.html#Tracks\n\n\n&quot;Formed in 1971, Faust were not the first German band to assert their \nown voice on the international stage, but they were by far the most radical. Holed up in the studios with an enlightened and encouraging producer, \nUwe Nettlebeck, and a cache of new tech, they produced electro-acoustic experiments that were savage and uncompromising, and with precious few \nreference points to rock music from either side of the atlantic. \nThe Velvet Underground may have provided some initial inspiration, \nbut they junked their appreciation od noise-as-aesthetic after John Cale \nleft them in 1968. Faust's third album, &quot;The Faust Tapes&quot; (their first for Virgin), compiled from the band's library of private tapes may also have \nalluded to Zappa with its brusque collage effects, but the link is tenuous \nat best.\n\nThe pieces on &quot;Faust IV&quot;, like the bands first two albums for Polydor \n(&quot;Faust&quot; and &quot;So Far&quot;) are allowed the time and space to develop fully as streams-of-consciousness. It would be pushing things to call them 'Songforms' although Faust were happy to utilise popular forms: the pre-dub experiments \non &quot;So Far&quot; give way here to a more conventional, jocular stab at reggae with &quot;The Sad Skinhead&quot;, whilst &quot;It's a Bit of a Pain&quot; is a lyrical acoustic number rudely thrown off balance by retching electronic sounds. Contrast these with the opener, &quot;Krautrock&quot;, with its trance rhythms and searing electronic noise nodding \nin the direction of the post-John Cage generation of 'systems' composers (especially Philip Glass).\n\nCalculatingly, Faust's influence on contemporary music is far easier. British avant-rockers Henry Cow and the later This Heat, who similarly tested the definition of rock music to near breaking point, owe them a sizeable debt, \nwhilst the generation of industrialists which followed - everyone from \nThrobbing Gristle to Controlled Bleeding - would have been much the poorer without Faust's trailblazing inventions.\n\nFaust IV was not as ruthlessly avant-garde as its predecessors, although as a more conventionally polished product it's probably the best place for the uninitiated to start. It wasn't the last recording they made, although it was \nthe last to be released during the band's lifetime.\n\nThe last of their albums to make it on to CD, &quot;Faust IV&quot; is simply one chapter \nin the life of an extraordinary group. Pop it into your CD player, crank the volume up to maximum and let this classic music roar into your head.\n\nDavid Ilic, September 1992&quot;\n\n-From the liner notes to Faust IV","torrent":{"xt":"urn:btih:21854781d63a489952d4439287cfc4a2258161c5","amp;dn":"FAUST-+FAUST+IV+%28Classic+krautrock+album+1973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21854781d63a489952d4439287cfc4a2258161c5","infoHashBuffer":{"type":"Buffer","data":[33,133,71,129,214,58,72,153,82,212,67,146,135,207,196,162,37,129,97,197]},"announce":[],"urlList":[]}}