{"title":"The Devil in the White City by Erik Larson","uid":7694269,"size":2164260,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21bf27047d558341dc2028cfae731dc4dba72e35&amp;dn=The+Devil+in+the+White+City+by+Erik+Larson&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"azizex666","files":-1,"time":1349310402,"description":"            The Devil in the White City: Murder, Magic, and \n               Madness at the Fair that Changed America\n\nAuthor Erik Larson imbues the incredible events surrounding the 1893 Chicago World's Fair with such drama that readers may find themselves checking the book's categorization to be sure that 'The Devil in the White City' is not, in fact, a highly imaginative novel. Larson tells the stories of two men: Daniel H. Burnham, the architect responsible for the fair's construction, and H.H. Holmes, a serial killer masquerading as a charming doctor.\n\nBurnham's challenge was immense. In a short period of time, he was forced to overcome the death of his partner and numerous other obstacles to construct the famous &quot;White City&quot; around which the fair was built. His efforts to complete the project, and the fair's incredible success, are skillfully related along with entertaining appearances by such notables as Buffalo Bill Cody, Susan B. Anthony, and Thomas Edison.\n\nThe activities of the sinister Dr. Holmes, who is believed to be responsible for scores of murders around the time of the fair, are equally remarkable. He devised and erected the World's Fair Hotel, complete with crematorium and gas chamber, near the fairgrounds and used the event as well as his own charismatic personality to lure victims.\n\n\n\n\n                              Format 1 - .ePUB\n\n                              Format 2 - .Mobi\n\n\n             **Support Your Favorite Authors By Buying Their Books**\n\n               Check out all my Magazine and ebook uploads here.\n\n                     &lt;a href=&quot; https://thepiratebay.se/user/azizex666/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/azizex666/&lt;/a&gt;","torrent":{"xt":"urn:btih:21bf27047d558341dc2028cfae731dc4dba72e35","amp;dn":"The+Devil+in+the+White+City+by+Erik+Larson","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21bf27047d558341dc2028cfae731dc4dba72e35","infoHashBuffer":{"type":"Buffer","data":[33,191,39,4,125,85,131,65,220,32,40,207,174,115,29,196,219,167,46,53]},"announce":[],"urlList":[]}}