{"title":"If I Had A Million - 1932 - W.C. Fields","uid":5992022,"size":1062663648,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:223483fb614a57ed857da2bc3bf5eedc9ead33bb&amp;dn=If+I+Had+A+Million+-+1932+-+W.C.+Fields&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"timelyone","files":-1,"time":1290917886,"description":"If I Had A Million - 1932\n\nDying industrial tycoon John Glidden (Richard Bennett) cannot decide what to do with his wealth. He despises his money-hungry relatives and believes none of his employees is capable of running his various companies. Finally, he decides to give a million dollars each to eight people picked at random from a telephone directory before he passes away, so as to avoid his will being contested. (The first name selected is John D. Rockefeller, which is swiftly rejected.)\n\nChina Shop (directed by Norman Z. McLeod)\n\nHenry Peabody (Charles Ruggles) is unhappy, both at work and at home. A bookkeeper promoted to salesman in a china shop, Henry keeps breaking the merchandise, meaning his &quot;raise&quot; brings home less money than before, something his nagging wife (Mary Boland) is quick to notice. After Glidden gives him a certified check, Henry shows up late for work and then proceeds to gleefully wreak destruction on the wares.\n\nViolet (directed by Stephen Roberts)\n\nBarroom prostitute Violet Smith (Wynne Gibson) checks into the most expensive hotel suite she can find and goes to bed ... alone.\n\nThe Forger (H. Bruce Humberstone)\n\nEddie Jackson (George Raft) narrowly avoids arrest for trying to cash a forged check. With his prior record, if he is caught, it will mean a life sentence in prison. When Glidden presents him with his check, Eddie is delighted ... at first. However, he does not dare show his face in a bank, and none of his criminal associates believes the check is genuine. Frantic to leave town and desperately needing to sleep, the penniless man gives the check as security for a 10 cent bed in a flophouse. The manager secretly calls the police to take away what he thinks is a lunatic, and uses the check to light his cigar.\n\nRoad Hogs (Norman Z. McLeod)\n\nEx-vaudeville performer Emily La Rue (Alison Skipworth) is very content with her life, running her tea room with the help of her partner, ex-juggler Rollo (W. C. Fields). Only one thing is lacking to make her satisfaction complete, and it is delivered that very day: a brand new car. However, when they take it out for a drive, it is wrecked when another driver ignores a stop signal. The heartbroken woman returns to her tea room, where Glidden finds her.\n\nShe comes up with an inventive way to spend part of her great windfall. She and Rollo purchase eight used cars and hire drivers. They all take to the road in a long procession. When they encounter an inconsiderate road hog, Emily and Rollo immediately set off in pursuit and crash into the offender's automobile. They then switch to one of their spare cars and repeat the process, until they run out of automobiles. At the end of the day, Emily purchases another new car, but it too is destroyed in a collision with a truck. No matter. Emily tells Rollo it has been &quot;a glorious day&quot;.\n\nDeath Cell (James Cruze)\n\nPrisoner John Wallace (Gene Raymond) has been condemned to the electric chair for killing someone during a robbery. After a tearful conversation with his wife Mary (Frances Dee), he is visited in his cell by Glidden. John is certain that his new-found wealth will save him, but it is too late. He is executed that same day, despite his protests.\n\nThe Clerk (Ernst Lubitsch)\n\nWhen clerk Phineas V. Lambert (Charles Laughton) receives his check in the mail, he shows little emotion. He merely leaves his desk, calmly climbs the stairs to the office of first the secretary of the president of the company, then to the office of the private secretary, and finally knocks on the door of the president himself. When he is admitted, Phineas blows a raspberry at his former boss and leaves.\n\nThe Three Marines (William A. Seiter)\n\nGlidden finds U.S. Marine Steve Gallagher (Gary Cooper) and his good buddies Mulligan (Jack Oakie) and O'Brien (Roscoe Karns) in the stockade for striking their sergeant. However, when Glidden gives Gallagher the check, Gallagher notices it is April Fools Day and assumes it is a joke.\n\nWhen the three men are released, they immediately head for a nearby lunch stand to see Marie (Joyce Compton), the pretty waitress. They all want to take her to the carnival, but none of them has any money. Then Gallagher remembers his check and that Zeb, the stand's owner, is illiterate. He tells Zeb that the check is for $10 and gets Zeb to cash it. He and Marie head off to the carnival, but Gallagher cannot shake his pals. Then Mulligan becomes embroiled in a fight, his comrades join in, and the trio end up right back in the stockade. Through the bars, they watch dumbfounded as a fancily-dressed Zeb steps out of a limousine, escorting an equally well-garbed Marie.\n\nGrandma (Stephen Roberts)\n\nThe last beneficiary is Mary Walker (May Robson), one of many unhappy elderly women consigned to a rest home run by Mrs. Garvey (an uncredited Blanche Friderici). Mrs. Garvey is a petty tyrant who enforces her rules rigorously, to the displeasure of her charges, especially a defiant Mary. Mary uses her money to turn the tables. She pays Mrs. Garvey and the rest of the staff just to sit in rocking chairs while she and the other residents have a wonderful time partying and dancing with their gentleman friends.\n\nMary's spirit even reinvigorates John Glidden. Glidden ignores his doctor and looks forward to spending time with Mary.\n[edit] Cast (in credits order)\n\n    * Gary Cooper as Steve Gallagher\n    * Charles Laughton as Phineas V. Lambert\n    * George Raft as Eddie Jackson\n    * Jack Oakie as Private Mulligan\n    * Richard Bennett as John Glidden\n    * Charles Ruggles as Henry Peabody\n    * Alison Skipworth as Emily La Rue\n    * W.C. Fields as Rollo La Rue\n    * Mary Boland as Mrs Peabody\n    * Roscoe Karns as Private O'Brien\n    * May Robson as Mrs Mary Walker\n    * Wynne Gibson as Violet Smith\n    * Gene Raymond as John Wallace\n    * Frances Dee as Mary Wallace\n    * Lucien Littlefield as Zeb - Hamburger Stand Owner\n    * Joyce Compton as Marie - Waitress\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5950948/Declaration_of_ACORF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5950948/Declaration_of_ACORF&lt;/a&gt;","torrent":{"xt":"urn:btih:223483fb614a57ed857da2bc3bf5eedc9ead33bb","amp;dn":"If+I+Had+A+Million+-+1932+-+W.C.+Fields","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223483fb614a57ed857da2bc3bf5eedc9ead33bb","infoHashBuffer":{"type":"Buffer","data":[34,52,131,251,97,74,87,237,133,125,162,188,59,245,238,220,158,173,51,187]},"announce":[],"urlList":[]}}