{"title":"RSGB Radio Communication Handbook - Ham","uid":10474913,"size":684174140,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2251dc95e0caa1afacd64d28c5285433011c695a&amp;dn=RSGB+Radio+Communication+Handbook+-+Ham&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"shemyaza","files":-1,"time":1404319552,"description":"RSGB Radio Communication Handbook - CD Version\n\n11th edition\n\nEdited by Mike Dennison, G3XDV and John Fielding, ZS5JF\n\nFully updated and revised the RSGB Radio Communication Handbook is massive 864 pages of the very latest amateur radio technology. This is the special CD version of the original book plus bonus chapters and amateur radio software\n\nThe Radio Communication Handbook has everything you need to build or understand amateur radio equipment. There is enough theory to give you a good grounding, but the main emphasis is learning by doing so the book includes a huge number of practical circuits. Receivers are explained from the simplest crystal set right up to ultra-modern DSP radios. There are practical antenna projects for all amateur bands, together with advice on erecting masts and measuring performance. For the portable operator there are details of light-weight equipment and power sources - even waterproof log books and walking sticks that double as an antenna mast. Projects are included that cover frequencies literally from audio to light, with an emphasis on the popular amateur bands. Computers are shack essentials nowadays and chapters deal with how to make the best use of them, and what data mode is most effective on what band.\n\nThis edition of the Radio Communication Handbook contains significantly expanded chapters covering HF Transmitters and Receivers, LF, Microwaves, VHF/UHF Antennas, Computers and whole lot more. There is major new material covering transmitting SSB on light frequencies and long distance transmission and reception below 10kHz. It does not stop there either with more digital theory, IF amplifiers, back ground noise, ceramic filters, antennas and much more than can be listed here.\n\n\n","torrent":{"xt":"urn:btih:2251dc95e0caa1afacd64d28c5285433011c695a","amp;dn":"RSGB+Radio+Communication+Handbook+-+Ham","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2251dc95e0caa1afacd64d28c5285433011c695a","infoHashBuffer":{"type":"Buffer","data":[34,81,220,149,224,202,161,175,172,214,77,40,197,40,84,51,1,28,105,90]},"announce":[],"urlList":[]}}