{"title":"Coraline (2009) DvD Rip","uid":4916557,"size":730560512,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:22610eaf75ad14cfe4ee3592cf75b9fd048d20b1&amp;dn=Coraline+%282009%29+DvD+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"wolf003227","files":1,"time":1243452995,"description":"Running Time:  1 hr. 40 min.\n\nRelease Date:  February 6th, 2009 \n\nRating: PG-13 for thematic elements, scary images, some language and suggestive humor.\n\nProduction Status: Released\n\nDETAILS: Coraline Jones is a girl of 11 who is feisty, curious, and adventurous beyond her years. She and her parents have just relocated from Michigan to Oregon. Missing her friends and finding her parents to be distracted by their work, Coraline tries to find some excitement in her new environment. She is befriended--or, as she sees it, is annoyed--by a local boy close to her age, Wybie Lovat and visits her older neighbors, eccentric British actresses Miss Spink and Forcible as well as the arguably even more eccentric Russian Mr. Bobinsky. After these encounters, Coraline seriously doubts that her new home can provide anything truly intriguing to her, but it does; she uncovers a secret door in the house. Walking through the door and then venturing through an eerie passageway, she discovers an alternate version of her life and existence. On the surface, this parallel reality is similar to her real life--only much better. The adults, including the solicitous Other Mother, seem much more welcoming to her. Coraline is more the center of attention there--even from the mysterious Cat. She begins to think that this Other World might be where she belongs. But when her wondrously off-kilter, fantastical visit turns dangerous and Other Mother schemes to keep her there, Coraline musters all of her resourcefulness, determination, and bravery to get back home--and save her family.\n","torrent":{"xt":"urn:btih:22610eaf75ad14cfe4ee3592cf75b9fd048d20b1","amp;dn":"Coraline+%282009%29+DvD+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22610eaf75ad14cfe4ee3592cf75b9fd048d20b1","infoHashBuffer":{"type":"Buffer","data":[34,97,14,175,117,173,20,207,228,238,53,146,207,117,185,253,4,141,32,177]},"announce":[],"urlList":[]}}