{"title":"How to Build a Small Budget Recording Studio from Scratch","uid":11555988,"size":17669607,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:227de891c7e797c44e68dd74bd8e6c515dbb768a&amp;dn=How+to+Build+a+Small+Budget+Recording+Studio+from+Scratch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1416827558,"description":"\nHow to Build a Small Budget Recording Studio from Scratch, 4th Edition (2012)\n\nHow to Build a Small Budget Recording Studio from Scratch, Fourth Edition gives you detailed plans (including 12 studio designs with 23 constructed, tested, and acoustically tuned rooms from renowned acoustician, F. Alton Everest), and other resources for making your own professional-grade recording studio.\n\nStart from scratch with techniques, practical advice, and scientific know-how that guide you on how to construct everything from floor to ceiling and wall to wall. \n\nYou'll get expert recommendations on materials and equipment, how to test and adjust the finished facility for frequency response and reverberation time; mathematical formulas and simple explanations of key scientific principles; and everything else a musician, sound engineer, producer, filmmaker, or hobbyist could possibly want.\n\nCoverage includes:\n* Plans for purpose-specific studios (residential, commercial, instructional)\n\n* How each music instrument creates sound -- and how to best record acoustical instruments\n\n* Testing, measurement, and how to read acoustic specifications\n\n* Premanufactured acoustic remedies\n\n* Noise control (from HVAC equipment and other sources)\n\n* Comes with exclusive bonus online content, including mathematical equations for acoustics, reverberation, music tempo, and pitch; listings of manufacturers of acoustic materials and test equipment; directions for how to read blueprints; and much more!","torrent":{"xt":"urn:btih:227de891c7e797c44e68dd74bd8e6c515dbb768a","amp;dn":"How+to+Build+a+Small+Budget+Recording+Studio+from+Scratch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"227de891c7e797c44e68dd74bd8e6c515dbb768a","infoHashBuffer":{"type":"Buffer","data":[34,125,232,145,199,231,151,196,78,104,221,116,189,142,108,81,93,187,118,138]},"announce":[],"urlList":[]}}