{"title":"Power Generation Operation and Control 2nd ed","uid":12149279,"size":19880251,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22e3dcdeaea0f09c3ec41194348676e26953b905&amp;dn=Power+Generation+Operation+and+Control+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1437565108,"description":"Power Generation Operation and Control 2nd ed - Allen J. Wood, Bruce F. Wollenberg (Wiley, 1996).pdf\n\nISBN 0471586994\n\nA comprehensive text on the operation and control of power generation and transmission systems\n\nIn the ten years since Allen J. Wood and Bruce F. Wollenberg presented their comprehensive introduction to the engineering and economic factors involved in operating and controlling power generation systems in electric utilities, the electric power industry has undergone unprecedented change. Deregulation, open access to transmission systems, and the birth of independent power producers have altered the structure of the industry, while technological advances have created a host of new opportunities and challenges.\n\nIn Power Generation, Operation, and Control, Second Edition, Wood and Wollenberg bring professionals and students alike up to date on the nuts and bolts of the field. Continuing in the tradition of the first edition, they offer a practical, hands-on guide to theoretical developments and to the application of advanced operations research methods to realistic electric power engineering problems. This one-of-a-kind text also addresses the interaction between human and economic factors to prepare readers to make real-world decisions that go beyond the limits of mere technical calculations","torrent":{"xt":"urn:btih:22e3dcdeaea0f09c3ec41194348676e26953b905","amp;dn":"Power+Generation+Operation+and+Control+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22e3dcdeaea0f09c3ec41194348676e26953b905","infoHashBuffer":{"type":"Buffer","data":[34,227,220,222,174,160,240,156,62,196,17,148,52,134,118,226,105,83,185,5]},"announce":[],"urlList":[]}}