{"title":"Miss Evers Boys (1997) TV Eng","uid":5063223,"size":1027492275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:22fbd5989d30453f9c8c6d055c52af30b00a93db&amp;dn=Miss+Evers+Boys+%281997%29+TV+Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"johnefp","files":-1,"time":1250801747,"description":"Produced for the HBO cable network, this docudrama explores the social and ethical issues at the heart of the infamous Tuskegee Study of Untreated Blacks With Syphilis. From 1932 through 1972, the U.S. Public Health Service studied 600 poor African-American sharecroppers in Macon County, AL -- 399 chronic syphilitics and a 201-man healthy control group. Doctors treated the men with placebos, hid the true nature of their research, and withheld penicillin even after it became the standard and highly effective treatment for the disease in the mid-'40s. Although the experiment was hardly a secret, it was not until the early '70s that a public outcry developed; by then, all but 127 of the original study group had died. A class-action lawsuit obtained modest financial reparations for the participants and their descendants, but it was not until 1997 that President Bill Clinton offered an official government apology for the study. Framed as a series of flashbacks during the 1971 congressional hearings about the experiment, the film employs the viewpoint of Eunice Evers (Alfre Woodard), a local nurse who knew of the study's true nature, but devoted her life to caring for the men as they suffered horrifying physical and mental debilities and eventually died. The film charts her warm personal relationships with many of the participants -- the title refers to a singing and dancing troupe named in her honor -- and her failed romance with Caleb Humphries (Laurence Fishburne), an experimental subject who obtained penicillin from a military doctor and left the study to fight in World War II. Miss Evers' Boys was adapted from the play by David Feldshuh, which was itself based on the book Bad Blood: The Tuskegee Syphilis Experiment by James H. Jones. Although fictionalized, the title character is based on the real-life Eunice Rivers. The film won three Emmy Awards, including top acting honors for Woodard. \n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119679/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119679/&lt;/a&gt;\n\n\n\n\nAwards:\nWon Golden Globe. Another 16 wins &amp; 15 nominations\n\n\n\n\nDirector:\nJoseph Sargent\n\n\n\n\n        Alfre Woodard\t ... \tEunice Evers, R.N.\n\n\tLaurence Fishburne... \tCaleb Humphries\n\n\tCraig Sheffer\t... \tDr. Douglas\n\tJoe Morton\t... \tDr. Sam Brodus\n\n\tObba BabatundÃƒÂ©\t... \tWillie Johnson\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 01:57:59\nMovie complete : Yes\n\n[Video]\nResolution : 704x480\nCodec : XviD MPEG-4 codec\nFPS : 29,97\nBitRate : 1033 Kbps\nQuality Factor : 0,10 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps","torrent":{"xt":"urn:btih:22fbd5989d30453f9c8c6d055c52af30b00a93db","amp;dn":"Miss+Evers+Boys+%281997%29+TV+Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22fbd5989d30453f9c8c6d055c52af30b00a93db","infoHashBuffer":{"type":"Buffer","data":[34,251,213,152,157,48,69,63,156,140,109,5,92,82,175,48,176,10,147,219]},"announce":[],"urlList":[]}}