{"title":"50Plus MILFs #5 (2013 The Score Group) [DVDRip]","uid":8919833,"size":712052968,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2302a9adea9e9d2c7705725ce7c1f2d98eba6da4&amp;dn=50Plus+MILFs+%235+%282013+The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"chkm8te","files":1,"time":1379225762,"description":"50Plus MILFs #5 (2013 The Score Group) [DVDRip]\n\nPerformer : Persia Monir, Rita Daniels, Demi La Rue, Joanna Storm, Shana DuPlae, Sunny Ray \n\nThe Fifth edition of 50Plus MILFs is nothing like the previous four because the ladies are unlike any you've ever seen before. Busty 54-year-old Persia has the hairiest MILF pussy ever, and it gets fucked deep and hard. 51-year-old first-timer Jenna has inch-long nipples! Latina newcomer Lori has a ginormous ass! Plus, little Nicky White takes a huge cock, small-town mom Carrie gets a facial and Karen Kougar enjoys cock and cum in her ass. What A Show!\n\n50plus MILFS GET Creamed Cunts, ASSHOLES AND FACES!\n\nPersia Monir, 54, is an exotic brunette with big tits and one of the hairiest pussies we've ever seen. Persia That Bush Gets fucked by A Big, Black Cock and Lets her stud cream her cunt.\n\nBusty Redhead Karen Kougar, 50, swallows a cock while getting her asshole fingered. Then, after offering up her old pussy for a big cock, she spreads her asshole wide and gets dicked there, too. And where does the guy cum? Deep Inside Karen's asshole!\n\nHuge-assed Latina Lori Suarez, 50, is a wife who loves big cocks. For her first scene, she gets a big one from a guy half her age, and when she gets fucked from behind, her big ass ripples. &quot;Oh, fuck me!&quot; Lori moans. Then she Gets A Big load of cum All over her Big bottom.\n\nNicky White, A 51-year-old divorcee, gets her mouth stuffed with giant cock then lies back for a deep dicking in her first XXX movie. She pulls her stocking-Covered legs Way back so the Dick can go Deeper, and Finishes by eating her stud's load.\n\nDirty-talking Carrie Walters, A 50-year-old horny housewife from Illinois, loves to suck dick and does it well. Also she married her Gets Pussy fucked hard before her Mouth Opening for A giant load of cum.\n\nJenna Covelli, 51, lies back for a pussy eating, and she has a giant clit! She also has huge, inch-long nipples that she loves to have sucked. Jenna and her guy 69 so she can suck his cock while getting her pussy eaten. She gets dicked hard while keeping up a steady stream of fuck talk.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=skpomhhgaj7np6xqeybh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=skpomhhgaj7np6xqeybh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5bhnhood3r1sgbwopp79.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5bhnhood3r1sgbwopp79.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2302a9adea9e9d2c7705725ce7c1f2d98eba6da4","amp;dn":"50Plus+MILFs+%235+%282013+The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2302a9adea9e9d2c7705725ce7c1f2d98eba6da4","infoHashBuffer":{"type":"Buffer","data":[35,2,169,173,234,158,157,44,119,5,114,92,231,193,242,217,142,186,109,164]},"announce":[],"urlList":[]}}