{"title":"Stealth Jihad - Robert Spencer","uid":11727054,"size":3949275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:23263fac209625f2e8b1cb551c1941b1457180a0&amp;dn=Stealth+Jihad+-+Robert+Spencer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"starxteel","files":2,"time":1425112653,"description":"\nDoes America face a jihadist threat that's even bigger than terrorism?\nWhile our homeland security efforts are focused on preventing terrorist attacks, another jihadist threat is growing right here in America--in plain sight.\n\nIn Stealth Jihad, Islam expert and New York Times bestselling author Robert Spencer blows the whistle on a long-term plot by Islamic jihadists to undermine the United States. This effort aims not to bring America to its knees through attacks with guns or bombs, but to subvert the country from within--by gradually Islamizing America. The ultimate goal, the stealth jihadists themselves declare, is nothing less than the adoption of Islamic law in the United States.\nDescribing the disturbing ease with which stealth jihadists have already become ensconced in the American political and media landscapes, Spencer exposes the full modus operandi of the movement as revealed in a stunning document unveiled in a recent terrorism funding trial. In this unsettling book, he explains:\n\n* Which Islamic fundamentalist organization is behind the stealth jihad\n* How stealth jihadists have reinvented themselves as mainstream civil rights activists--despite their many past declarations of Islamic supremacism\n* How stealth jihadists played a key role in formulating U.S. government guidelines for the War on Terror\n* How insistence on &quot;accommodating&quot; Islamic cultural and religious practices in America is part of a calculated strategy to achieve a dangerous larger agenda\n* The effort by stealth jihadists to whitewash the teaching of Islam in schools\n* What can be done to defeat the stealth jihad and preserve America's liberty\n\nAmerica, Spencer demonstrates, is all but oblivious to a new kind of threat presented by a loosely organized movement whose activists are well funded, highly motivated, and relentless in pursuit of their agenda. This book is a wake-up call for a country so focused on foreign threats that it has left itself vulnerable to a growing danger much closer to home.\n\n\nAbout the author:\nRobert Spencer is the director of Jihad Watch, a program of the David Horowitz Freedom Center, and the author of eight books on Islam and jihad. Spencer is a weekly columnist for Human Events and the website Front-Page Magazine, and has led seminars on Islam and jihad for the United States Central Command, United States Army Command and General Staff College, the Joint Terrorism Task Force, and the U.S. intelligence community","torrent":{"xt":"urn:btih:23263fac209625f2e8b1cb551c1941b1457180a0","amp;dn":"Stealth+Jihad+-+Robert+Spencer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23263fac209625f2e8b1cb551c1941b1457180a0","infoHashBuffer":{"type":"Buffer","data":[35,38,63,172,32,150,37,242,232,177,203,85,28,25,65,177,69,113,128,160]},"announce":[],"urlList":[]}}