{"title":"Time-Saver Standards for Architectural Design Data (Malestrom)","uid":5114985,"size":142357237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2334fcd91edf184c89889d6a1b4e044f387ff999&amp;dn=Time-Saver+Standards+for+Architectural+Design+Data+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1255015544,"description":" &lt;a href=&quot;http://bayimg.com/baeFEAacf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/baeFEAacf&lt;/a&gt;\n\n&quot;Time-Saver Standards for Architectural Design Data&quot;\nMcgraw-Hill | 7th edition | 1997 | ISBN: 0070685061 | 1072 pages | PDF | RAR \n\nThe standard reference in architecture and building construction, this Seventh Edition has been completely rewritten and revised with new contributions by over eighty world authorities and specialists. Now in a convenient single volume, it reflects essential changes and new knowledge in the field of architecture since the last edition 15 years ago. Part I contains new reference articles on the fundamentals of architecture and design. Part II contains design data on all aspects of architectural design and building construction, including substructure, superstructure, building shell, interiors, and services, and is formatted according to the Uni-format II classification system. First published in 1946, McGraw-Hill's Time-Saver Standards is one of the world's most widely consulted and respected references on architectural design and building construction fundamentals and data.\n\nAn important edition of an architectural classic. A ``knowledge guide'--a comprehensive overview of the fundamental knowledge and technology required for exemplary architectural practice. The standard reference for every professional and student in architecture and building construction, this Seventh Edition is completely rewritten and revised with new contributions by over eighty world authorities and specialists. This convenient single volume reflects the essential changes and new knowledge in the field of architecture since the last edition 15 years ago. \n\nPart I contains reference articles on fundamentals of architecture and design, including universal and Accessible design, architectural ethics, bio climatic design, day lighting, environmentally responsible design, indoor air quality, acoustics, construction material technology, intelligently building systems, economics and life cycle costing, specifications, design-build, building commissioning, and building performance evaluation. Part II contains design data on all aspects of architectural design and building construction, including substructure, superstructure, building shell, interiors, and services. This section is formatted according to the Uni-format II classification system, providing a logical way for architects to access information for preliminary design and specification by building component, assembly, and place in the system of construction. The Appendix includes tables and references, classic reference articles from former editions of Time-Saver Standards, and an introduction and complete reference to metrification and SI units of measurement.\n\nMore to follow!","torrent":{"xt":"urn:btih:2334fcd91edf184c89889d6a1b4e044f387ff999","amp;dn":"Time-Saver+Standards+for+Architectural+Design+Data+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2334fcd91edf184c89889d6a1b4e044f387ff999","infoHashBuffer":{"type":"Buffer","data":[35,52,252,217,30,223,24,76,137,136,157,106,27,78,4,79,56,127,249,153]},"announce":[],"urlList":[]}}