{"title":"Paradise Lost 1 and 2 [1996] [2000] West Mamphis Three","uid":5873685,"size":1474018130,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:23eb10aa7c4250ab7cd390ec76b96da937c65304&amp;dn=Paradise+Lost+1+and+2+%5B1996%5D+%5B2000%5D+West+Mamphis+Three&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1286530047,"description":" &lt;a href=&quot;http://bayimg.com/FapmpAacK&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/FapmpAacK&lt;/a&gt;\n\nThe West Memphis 3 is the name given to three teenagers who were tried and convicted of the murders of three children in West Memphis, Arkansas, United States in 1993. Damien Echols was sentenced to death. Jessie Misskelley, Jr., was sentenced to life in prison, plus 40 years (he received two 20-year sentences in addition to the life sentence). Jason Baldwin was sentenced to life imprisonment.\n\nThe case has received considerable attention. Their supporters believe the arrests and convictions were a miscarriage of justice and that the defendants were wrongfully convicted during a period of intense media scrutiny. The defendants remain imprisoned, but legal proceedings are ongoing.\n\nParadise Lost: The Child Murders at Robin Hood Hills (1996) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0117293/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0117293/&lt;/a&gt;\n\nParadise Lost: The Child Murders at Robin Hood Hills is a 1996 documentary film directed by Joe Berlinger and Bruce Sinofsky about the trials of three teenage boys in West Memphis, Arkansas for the murder and sexual mutilation of three prepubescent boys. The boys on trial for the crime are: Jessie Misskelley, Damien Echols and Jason Baldwin, also known as the West Memphis 3.\n\nParadise Lost 2: Revelations (TV) (2000) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0239894/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0239894/&lt;/a&gt;\n\nParadise Lost 2: Revelations is the 2000 sequel to the documentary film Paradise Lost: The Child Murders at Robin Hood Hills, about the trial and conviction of three teenagers accused of murdering three young boys in a Satanic ritual abuse. In Paradise Lost 2, Bruce Sinofsky and Joe Berlinger visit support groups for Damien Wayne Echols, sentenced to lethal injection in the first film, and revisit Mark Byers, who is facing gossip about his possible involvement with the murder of his son. Echols is appealing his sentence and his defense attorney notices what he believes to be bite marks in a photograph of the face of one of the victims; the prosecution argues that the marks are from a belt buckle and not teeth.\n","torrent":{"xt":"urn:btih:23eb10aa7c4250ab7cd390ec76b96da937c65304","amp;dn":"Paradise+Lost+1+and+2+%5B1996%5D+%5B2000%5D+West+Mamphis+Three","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23eb10aa7c4250ab7cd390ec76b96da937c65304","infoHashBuffer":{"type":"Buffer","data":[35,235,16,170,124,66,80,171,124,211,144,236,118,185,109,169,55,198,83,4]},"announce":[],"urlList":[]}}