{"title":"Active@ Kill Disk Professional Suite 5 0 [h33t] [dinguskull]","uid":4653378,"size":136231827,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:24485a30344b0da1bd728329aaff74094f2caa7f&amp;dn=Active%40+Kill+Disk+Professional+Suite+5+0+%5Bh33t%5D+%5Bdinguskull%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Payback001","files":-1,"time":1232127183,"description":"Active@ Kill Disk - Hard Drive Eraser\n\nActive@ KillDisk - Hard Drive Eraser is powerful and compact software that allows you to destroy all data on hard and floppy drives completely, excluding any possibility of future recovery of deleted files and folders. It's a hard drive and partition eraser utility.\n\nIf you use FDISK, FORMAT utilities, or DELETE standard operating system command for data removal, there is always a chance to recover deleted files (using undelete file or some data recovery software) and use against the owner's will. We highly recommend you to run this FREE utility for the hard and floppy drives you want to dispose of, recycle, re-use, sell or donate to somebody.\n\nActive@ KillDisk conforms to US Department of Defense clearing and sanitizing standard DoD 5220.22-M. The most secure Gutmann's data destruction method is also implemented. You can be sure that once you clean up with Active@ KillDisk, sensitive information is purged out forever.\n\nWhat?s new in version 5.0 (Windows application):\n\n1. New Wipe function that wipes out all unused space on existing drives, not touching existing data.\n2. Professional package now includes Windows Vista-based Bootable Disk Creator that allows you to boot Windows Vista from CD/DVD, and to erase or wipe out your disks in Windows environment. USB Plug'n'Play devices are supported.\n3. The FREE application can be registered with a registration key without re-installation to be able to erase data using DoD 5220.22-M and other methods.\n\nWhat?s new in version 4.1 (DOS application):\n\n1. New Wipe function that wipes out all unused space on existing drives, not touching existing data.\n2. Package now includes an additional REAL-MODE application (KD_REAL.EXE) which is more compatible with different types of hardware and more compact in size.\n\nThis is security software for unrecoverable data elimination for any computer capable of booting in DOS mode from floppy drive. It uses access to the drive?s data on a physical level via BIOS bypassing logical drive structure organization, thus it does not matter what operating systems and file systems located on the machine.\n\nIt can work with DOS, Windows Vista, Windows XP / 2000 / NT / XP Professional x64 / XP Home x64/ 2003 Server x64, Linux, Unix for PC etc...\n\nIMG=\nhttp://bayimg.com/pAONlAAbD\nhttp://bayimg.com/aAOOEaABD\nhttp://bayimg.com/AaoOFaaBd\nhttp://bayimg.com/aAoOgaABd\nhttp://bayimg.com/Aaoohaabd\n\n\n\n\n\n\n\nThanks for making this.....","torrent":{"xt":"urn:btih:24485a30344b0da1bd728329aaff74094f2caa7f","amp;dn":"Active%40+Kill+Disk+Professional+Suite+5+0+%5Bh33t%5D+%5Bdinguskull%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24485a30344b0da1bd728329aaff74094f2caa7f","infoHashBuffer":{"type":"Buffer","data":[36,72,90,48,52,75,13,161,189,114,131,41,170,255,116,9,79,44,170,127]},"announce":[],"urlList":[]}}