{"title":"Roberts - History of the World, 6th edn. (2013)","uid":8212394,"size":3566792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:245b4f6bcbf4698447a9d1664e98d7d7a9ef5eb3&amp;dn=Roberts+-+History+of+the+World%2C+6th+edn.+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":-1,"time":1362266152,"description":"J. M. Roberts and O. A. Westad: The History of the World, 6th edition. Oxford University Press, 2013.\n\nISBN 978-0199936762 | 1280 pages | PDF\n\nPublication Date: April 2013\n\nJ.M. Roberts's renowned History of the World is widely considered the finest available one-volume survey of the major events, developments, and personalities of the known past, offering generations of readers a tour of the vast landscape of human history.\n\nIn this new edition, Bancroft Prize-winning historian Odd Arne Westad has completely revised this landmark work to bring the narrative up to the twenty-first century, including the 9/11 attacks and the wars in the Middle East. Westad utilizes the remarkable gains in scholarship in recent decades to enhance the book's coverage of early human life and vastly improve the treatment of India and China, Central Eurasia, early Islam, and the late Byzantine Empire, as well as the history of science, technology, and economics. The result is a truly remarkable work of compression and synthesis, sweeping through thousands of years of history, weaving the stories of empires, art, religion, economics, and science into a lucid and engaging narrative. Ranging from the early hominids and the emergence of Mesopotamian civilizations and ancient Egypt, the book illuminates such topics as the Roman Empire, the explosive arrival of Islam, the rise and fall of samurai rule in Japan, the medieval kingdoms of sub-Saharan Africa, the Mongol conquests, and the early modern expansion of Europe across the globe; also covered are the struggle for American independence, the French Revolution, the colonial empires, Japan's startling modernization, and the World Wars.\n\nPlease note: This PDF is missing the maps and index that will be included in the final published edition.\n","torrent":{"xt":"urn:btih:245b4f6bcbf4698447a9d1664e98d7d7a9ef5eb3","amp;dn":"Roberts+-+History+of+the+World%2C+6th+edn.+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"245b4f6bcbf4698447a9d1664e98d7d7a9ef5eb3","infoHashBuffer":{"type":"Buffer","data":[36,91,79,107,203,244,105,132,71,169,209,102,78,152,215,215,169,239,94,179]},"announce":[],"urlList":[]}}