{"title":"EXPLOITED COLLEGE GIRLS - Penny - Amazing Boobs 720p *NEW*","uid":11334720,"size":2044725914,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:246205ead0639704c133b5b8c9b6588944b0e383&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Penny+-+Amazing+Boobs+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":6,"uploader":"beta2008x","files":1,"time":1414717232,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=004q8_pey.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=004q8_pey.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=npkuz_ecg_14_10_30_penny_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=npkuz_ecg_14_10_30_penny_s.jpg&lt;/a&gt;\n\n\nYou ever heard that old joke, &quot;What's 5'10&quot;, has D cup tits, sweats like a landscaper in July and sucks dick like there's a prize inside?&quot; Wait, that's no joke at all, it's Penny, the tall, busty star of this week's Ex Co Gi update.\n\nPenny turns out to be one of the most pleasant surprises we've had in a long time. During her interview she comes off as a, what's the right word? Bitch, that's it. She comes off as a bitch, but a fine looking, tall, sexy bitch so she gets a little slack. It turns out, however, that she's actually a horny, fun nympho packed into a 5'10&quot; bitch package! When Jay gets her naked, she can hardly keep her hands of her huge tits or out from between her thighs.\n\nAs the action gets started, Jay uses his fingers on Penny and to his (and our) pleasant surprise in no time at all she's writhing and panting as her first orgasm overtakes her. Jay switches to a vibrator and might have teased another O out of her - you'll have to watch the tape closely to be sure because there are at least six over the course of the hour.\n\nEventually Penny gets to her knees to take care of Jay with a blowjob and really gets into it. This is girl who is an 8 or a 9 and sucks dick like a sightly overweight 5. A lot of times we get email from guys asking if they can audition for Jay's job - pretty much any guy with a decent sized dick thinks he has what it takes to shoot a little porn. We always say no. Why? Watch this scene - this beautiful, big titty nympho goes takes Jay's cock on a nonstop flight to Slobber Town and he films the entire thing without losing wood or busting a nut. We're willing to be half the guys just WATCHING this scene popped in their pants.\n\nAnyway, it just gets better until the big finish. Jay pounds Penny into the bed in every position he can think of until she sucks and jacks him to a huge suicide facial which she takes with a smile. Nope, this girl is no joke at all","torrent":{"xt":"urn:btih:246205ead0639704c133b5b8c9b6588944b0e383","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Penny+-+Amazing+Boobs+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246205ead0639704c133b5b8c9b6588944b0e383","infoHashBuffer":{"type":"Buffer","data":[36,98,5,234,208,99,151,4,193,51,181,184,201,182,88,137,68,176,227,131]},"announce":[],"urlList":[]}}