{"title":"The Book of the Bizarre: Freaky Facts and Strange Stories","uid":12178280,"size":987651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:246e85269fa28e75776352be8480fe3069e8de7d&amp;dn=The+Book+of+the+Bizarre%3A+Freaky+Facts+and+Strange+Stories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"mdusanjay","files":1,"time":1438361312,"description":"Varla Ventura, &quot;The Book of the Bizarre: Freaky Facts and Strange Stories&quot;\n\nISBN: 1578634377 | 2008 | EPUB | 304 pages | 964 KB\n\nDid you know duck dander is hallucinogenic? Or that Katherine Hepburn had a phobia of dirty hair? Have you ever wondered about the Magickal Skull of Doom or contemplated the mysterious Transylvanian Tablets? The Book of the Bizarre is a veritable treasure trove of startling and stranger-than-? ction trivia that spans history, continents, even worlds. Never before have so many truly frightful facts been gathered together in one place. Teeming with the strange, the shocking, and the downright fantastic, The Book of the Bizarre's thirteen chapters include: Something Wicked: Mysterious Objects &amp; Haunted Homes, Tender Murderers and Malevolent Males: Killingly Good Tales of Terror, and Morbid Writers and Tortured Artists: From Edgar Allan Poe to Vincent Van Gogh. Terrifying topics range from Corpses on Campus to Strange Rock and Roll Stories to Medical Maladies, Conspiracy Theories, Superstitions, Hexes, and even UFO's. The Book of the Bizarre is designed for the depraved, outlandish enough for the eccentric, and freaky enough for even the hardest trivia nut","torrent":{"xt":"urn:btih:246e85269fa28e75776352be8480fe3069e8de7d","amp;dn":"The+Book+of+the+Bizarre%3A+Freaky+Facts+and+Strange+Stories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"246e85269fa28e75776352be8480fe3069e8de7d","infoHashBuffer":{"type":"Buffer","data":[36,110,133,38,159,162,142,117,119,99,82,190,132,128,254,48,105,232,222,125]},"announce":[],"urlList":[]}}