{"title":"Max Brooks - World War Z - An Oral History of the Zombie Wars","uid":5044158,"size":6675373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24c7984db1d7d38f5c170b606e0c9c704d4480ba&amp;dn=Max+Brooks+-+World+War+Z+-+An+Oral+History+of+the+Zombie+Wars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"lsoearth","files":-1,"time":1249542218,"description":"World War Z: An Oral History of the Zombie War (abbreviated WWZ) is a 2006 horror, post-apocalyptic novel by Max Brooks. World War Z is a follow-up to his previous book, The Zombie Survival Guide (2003). Rather than a grand overview or a single perspective, World War Z is a collection of individual accounts in the form of interviews of the characters by the author. Brooks plays the role of an agent of the United Nations Postwar Commission who published the novel a decade after the Zombie War in this fictional future after the United Nations left out much of his work from the official report, as it chose to focus on the facts and figures of the war rather than the human aspects he included. The novel charts a decade-long war against zombies from the view point of many different people and nationalities. In addition, the personal accounts describe the changing religious, geo-political, and environmental aftermath of the Zombie War.\n\nWorld War Z was inspired by the The Good War, an oral history of World War II by Studs Terkel, and by the works of George Romero, the famous zombie film director. Brooks used World War Z to provide social commentary on topics such as government ineptitude and American isolationism, while also covering the themes of survivalism and uncertainty. Critics have praised the novel for reinventing the zombie genre and the audiobook version, complete with a full cast, won a Audie Award in 2007. A film based upon the book is in development, being produced by Plan B Entertainment, directed by Marc Forster and screenplay written by J. Michael Straczynski. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/World_War_Z&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/World_War_Z&lt;/a&gt;\n\n**This is a GOOD PDF formatted copy that I built from a .lit file**\n\nThis is my second torrent, so please comment and let me know how it goes.\n\nPLEASE SEED!!!\n\nI will seed through tonight, and then off and on through the weekend. I may be loosing my internet by Monday, but that story is in the help.txt","torrent":{"xt":"urn:btih:24c7984db1d7d38f5c170b606e0c9c704d4480ba","amp;dn":"Max+Brooks+-+World+War+Z+-+An+Oral+History+of+the+Zombie+Wars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24c7984db1d7d38f5c170b606e0c9c704d4480ba","infoHashBuffer":{"type":"Buffer","data":[36,199,152,77,177,215,211,143,92,23,11,96,110,12,156,112,77,68,128,186]},"announce":[],"urlList":[]}}