{"title":"Kansas - Point Of Know Return [1977][2002][320 KBPS][RMSTD]","uid":8292342,"size":137352850,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:251907058b58ceb516b21aeae43caf5f9453f221&amp;dn=Kansas+-+Point+Of+Know+Return+%5B1977%5D%5B2002%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"LameDuck69","files":21,"time":1364074871,"description":"Kansas - Point Of Know Return [1977][2002][Japan Remaster]\n\n\n\n\n\n\n01. Point Of Know Return \n02. Paradox  \n03. The Spider  \n04. Portrait (He Knew)  \n05. Closet Chronicles  \n06. Lightning's Hand  \n07. Dust In The Wind  \n08. Sparks Of The Tempest  \n09. Nobody's Home  \n10. Hopelessly Human\n11. Point Of Know Return [Live]\n12. Portrait (He Knew)[Remix]\n\n\n\n\n\n320 KBPS\n\nCover Art  \n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nKansas is an American progressive rock band that became popular in the 1970s initially on album-oriented rock charts, and later with hit singles such as &quot;Carry On Wayward Son&quot; and &quot;Dust in the Wind&quot;. They currently tour in North America and Europe.\n\n-----------------------------------------------------------------------------------\n\nPoint of Know Return is the fifth album by American progressive rock band Kansas, released in 1977. The album was reissued in remastered format on CD in 2002.\n\nThe huge success of Kansas's previous effort, Leftoverture, brought a new kind of pressure. While they were no longer desperately poor and starving for a hit, the band wondered whether they would be able to build on or, at least, maintain the level of achievement the years of recording and touring had brought them. The sessions for their follow-up LP, Point of Know Return, were filled with tension as singer/songwriter Steve Walsh, who had always been uncomfortable with the artistic direction of the band, left the group briefly. Years later, Walsh would admit in an interview with nationally-syndicated radio host Redbeard on the weekly rockumentary series In the Studio with Redbeard (edition #849, week of 9/27/04 and again on the 30th Anniversary Episode for Point of Know Return in 2007) that he had been something of a prima donna at this point. The other members of the group talked him into returning and the sessions continued. As with the previous album, it was a last-minute addition to the track line-up that would prove to be a huge success.\n\nThe album marked the commercial peak of the band. A subsequent tour brought them to the largest venues in the country, such as Madison Square Garden (which was sold out resulting in a second show at the newly constructed nearby Nassau Coliseum on Long Island) and the LA Forum (on New Year's Eve 1977). Marketing efforts were escalated at that point, including a tour book featuring an essay about the band by then Rolling Stone contributor Cameron Crowe. The band became a staple on FM radio at this point, and during this period was one of the most popular rock acts in the country.\n\n\n\nPersonnel:\n\n\nPhil Ehart - drums, timpani, chimes, additional percussion\n\nDave Hope - bass\n\nKerry Livgren - synthesizers, piano, electric and acoustic guitars, additional percussion\n\nRobby Steinhardt - violins, viola, backing vocals, lead vocals on &quot;Lightning's Hand&quot;, &quot;Sparks of the Tempest&quot; and &quot;Hopelessly Human&quot;\n\nSteve Walsh - organ, synthesizers, vibraphone, piano, lead vocals (except on &quot;Lightning's Hand and &quot;Sparks of the Tempest&quot;), backing vocals, additional percussion\n\nRich Williams - electric and acoustic guitars, pedals\n\n\n** Note: The album's performing credits listed one joke &quot;instrument&quot; for each band member, such as &quot;chain-driven gong,&quot; &quot;autogyro,&quot; &quot;Rinaldo whistling machine&quot; and &quot;Peabody chromatic inverter.&quot;\n\n","torrent":{"xt":"urn:btih:251907058b58ceb516b21aeae43caf5f9453f221","amp;dn":"Kansas+-+Point+Of+Know+Return+%5B1977%5D%5B2002%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"251907058b58ceb516b21aeae43caf5f9453f221","infoHashBuffer":{"type":"Buffer","data":[37,25,7,5,139,88,206,181,22,178,26,234,228,60,175,95,148,83,242,33]},"announce":[],"urlList":[]}}