{"title":"Ghost in the Wires (2011) (Pdf, Epub, Mobi) Gooner","uid":12046036,"size":7627764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:252f0f8d78c47df1d0f0a2dfb72e55610e1e328e&amp;dn=Ghost+in+the+Wires+%282011%29+%28Pdf%2C+Epub%2C+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"GoonerTPB","files":3,"time":1434900135,"description":"Publisher: Little, Brown and Company; 1 edition (August 15, 2011)\nLanguage: English\nISBN-10: 0316037702\nISBN-13: 978-0316037709\n\nKevin Mitnick was the most elusive computer break-in artist in history. He accessed computers and networks at the world's biggest companies--and however fast the authorities were, Mitnick was faster, sprinting through phone switches, computer systems, and cellular networks. He spent years skipping through cyberspace, always three steps ahead and labeled unstoppable. But for Kevin, hacking wasn't just about technological feats-it was an old fashioned confidence game that required guile and deception to trick the unwitting out of valuable information.\n\nDriven by a powerful urge to accomplish the impossible, Mitnick bypassed security systems and blazed into major organizations including Motorola, Sun Microsystems, and Pacific Bell. But as the FBI's net began to tighten, Kevin went on the run, engaging in an increasingly sophisticated cat and mouse game that led through false identities, a host of cities, plenty of close shaves, and an ultimate showdown with the Feds, who would stop at nothing to bring him down. \n\nGhost in the Wires is a thrilling true story of intrigue, suspense, and unbelievable escape, and a portrait of a visionary whose creativity, skills, and persistence forced the authorities to rethink the way they pursued him, inspiring ripples that brought permanent changes in the way people and companies protect their most sensitive information.\n\nAbout the Author\n\nKevin Mitnick, the world's most famous (former) computer hacker, has been the subject of countless news and magazine articles, the idol of thousands of would-be hackers, and a one-time &quot;most wanted&quot; criminal of cyberspace, on the run from the bewildered Feds. Now a security consultant, he has spoken to audiences at conventions around the world, been on dozens of major national TV and radio shows, and even testified in front of Congress. He is the author of The Art of Deception and The Art of Intrusion.\n\nCo-author William Simon is a bestselling co-author of numerous books, including iCon (the biography of Steve Jobs) and Kevin Mitnick's previous two books. He has also written for USA Today and The Washington Post and been interviewed on CNBC, CNN, NPR and by The New York Times, The Wall Street Journal, BusinessWeek, Time, Newsweek, and many other publications","torrent":{"xt":"urn:btih:252f0f8d78c47df1d0f0a2dfb72e55610e1e328e","amp;dn":"Ghost+in+the+Wires+%282011%29+%28Pdf%2C+Epub%2C+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"252f0f8d78c47df1d0f0a2dfb72e55610e1e328e","infoHashBuffer":{"type":"Buffer","data":[37,47,15,141,120,196,125,241,208,240,162,223,183,46,85,97,14,30,50,142]},"announce":[],"urlList":[]}}