{"title":"Polymers for Energy Storage and Conversion","uid":12432257,"size":9303628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2610f11ca58dce206e833b03f8c0fffc86606a37&amp;dn=Polymers+for+Energy+Storage+and+Conversion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1442477277,"description":"Polymers for Energy Storage and Conversion (Polymer Science and Plastics Engineering)(Wiley-Scrivener, 2013).pdf\n\nISBN 9781118344545\n\nOne of the first comprehensive books to focus on the role of polymers in the burgeoning energy materials market\n\nPolymers are increasingly finding applications in the areas of energy storage and conversion. A number of recent advances in the control of the polymer molecular structure which allows the polymer properties to be more finely tuned have led to these advances and new applications. Polymers for Energy Storage and Conversion assimilates these advances in the form of a comprehensive text that includes the synthesis and properties of a large number of polymer systems for applications in areas such as lithium batteries, photovoltaics, and solar cells.\n\nPolymers for Energy Storage and Conversion:\n\nIntroduces the structure and properties of polymer hydrogel with respect to its applications for low to intermediate temperature polymer electrolyte-based fuel cells\nDescribes PVAc-based polymer blend electrolytes for lithium batteries\nReviews lithium polymer batteries based on ionic liquids\nProposes the concept of the solar cell with organic multiple quantum dots (MQDs)\nDiscusses solvent effects in polymer-based organic photovoltaic devices\nProvides an overview of the properties of the polymers that factor into their use for solar power, whether for niche applications or for large-scale harvesting\nReviews the use of macroporous organic polymers as promising materials for energy gas storage\n\nReadership:\nMaterials scientists working with energy materials, polymer engineers, chemists, and other scientists and engineers working with photovoltaics and batteries as well as in the solar and renewable energy sectors","torrent":{"xt":"urn:btih:2610f11ca58dce206e833b03f8c0fffc86606a37","amp;dn":"Polymers+for+Energy+Storage+and+Conversion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2610f11ca58dce206e833b03f8c0fffc86606a37","infoHashBuffer":{"type":"Buffer","data":[38,16,241,28,165,141,206,32,110,131,59,3,248,192,255,252,134,96,106,55]},"announce":[],"urlList":[]}}