{"title":"Lonely Planet Germany, Austria and Switzerland's Best Trips 2016","uid":14725622,"size":231830316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:262b2fef1fadf479848ba2a8fc0a5f80cf63fb14&amp;dn=Lonely+Planet+Germany%2C+Austria+and+Switzerland%27s+Best+Trips+2016&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1464557776,"description":"Lonely Planet - Germany, Austria &amp; Switzerland's Best Trips (Travel Guide) - 1st Edition (2016).epub Gooner\r\n\r\nPublisher: Lonely Planet; 1 edition (12 Feb. 2016)\r\nLanguage: English\r\nISBN-10: 1743606958\r\nISBN-13: 978-1743606957\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nDiscover the freedom of open roads while touring with Lonely Planet Germany, Austria and Switzerland's Best Trips, your passport to uniquely encountering this region by car. Featuring 30 amazing road trips, from 2-day escapes to 2-week adventures on which you can experience awe inspiring views of the Swiss Alps or Austrian Tyrol or the picturesque towns and castles of Southern Germany's Romantic Road, all with your trusted travel companion. Get to Europe, rent a car, and hit the road!\r\n\r\nInside Lonely Planet Germany, Austria and Switzerland's Best Trips:\r\n\r\n* Lavish colour and gorgeous photography throughout\r\n\r\n* Itineraries and planning advice to pick the right tailored routes for your needs and interests\r\n\r\n* Get around easily - easy-to-read, full-colour route maps, detailed directions\r\n\r\n* Insider tips to get around like a local, avoid trouble spots and be safe on the road - local driving rules, parking, toll roads\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, prices\r\n\r\n* Honest reviews for all budgets - eating, sleeping, sight-seeing, hidden gems that most guidebooks miss\r\n\r\n* Useful features - including Driving Problem Buster, Detours, and Link Your Trip\r\n\r\n* Covers Germany, Berlin, Munich, Dresden, Frankfurt, Dusseldorf, the Rhine, Romantic Road, Lake Constance, Switzerland, Swiss Alps, Lake Geneva, Zurich, Geneva, Austria, Tyrol, Vienna, Salzburg and more\r\n\r\nThe Perfect Choice: Lonely Planet Germany, Austria and Switzerland's Best Trips is perfect for exploring Germany, Austria and Switzerland via the road and discovering sights that are more accessible by car.\r\n\r\n* Planning a European trip sans a car? Lonely Planet's Germany, Austria or Switzerland guides, our most comprehensive country guides are perfect for exploring both top sights and lesser-known gems, or check out Discover Germany or Discover Switzerland, photo-rich guides to the countries' most popular attractions.\r\n\r\n* Looking for a guide focused on a specific German or Austrian city? Check out Lonely Planet's Berlin, Munich, Bavaria &amp; the Black Forest or Vienna guides for a comprehensive look at all these cities have to offer, or Pocket Berlin, a handy-sized guide focused on the can't-miss sights for a quick trip.\r\n\r\nThere's More in Store for You:\r\n\r\n* See more of Europe's picturesque country sides and have a richer, more authentic experience by exploring Europe by car with Lonely Planet's Best Trips guides to France, Italy, Ireland and Spain &amp; Portugal or Lonely Planet's Road Trips guides to Chateaux of the Loire Valley, Provence &amp; Southeast France and Normandy &amp; D-Day Beaches.\r\n\r\nAuthors: Written and researched by Lonely Planet\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveller community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves","torrent":{"xt":"urn:btih:262b2fef1fadf479848ba2a8fc0a5f80cf63fb14","amp;dn":"Lonely+Planet+Germany%2C+Austria+and+Switzerland%27s+Best+Trips+2016","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262b2fef1fadf479848ba2a8fc0a5f80cf63fb14","infoHashBuffer":{"type":"Buffer","data":[38,43,47,239,31,173,244,121,132,139,162,168,252,10,95,128,207,99,251,20]},"announce":[],"urlList":[]}}