{"title":"Real World Haskell 1st Edition 2008","uid":6600061,"size":5557788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:263a7aab766b5f204487421005aabf5b28207004&amp;dn=Real+World+Haskell+1st+Edition+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Blal0ck","files":1,"time":1313170085,"description":"This easy-to-use, fast-moving tutorial introduces you to functional programming with Haskell. You'll learn how to use Haskell in a variety of practical ways, from short scripts to large and demanding applications. Real World Haskell takes you through the basics of functional programming at a brisk pace, and then helps you increase your understanding of Haskell in real-world issues like I/O, performance, dealing with data, concurrency, and more as you move through each chapter. \n\nWith this book, you will:\n\nUnderstand the differences between procedural and functional programming\nLearn the features of Haskell, and how to use it to develop useful programs\nInteract with filesystems, databases, and network services\nWrite solid code with automated tests, code coverage, and error handling\nHarness the power of multicore systems via concurrent and parallel programming\nYou'll find plenty of hands-on exercises, along with examples of real Haskell programs that you can modify, compile, and run. Whether or not you've used a functional language before, if you want to understand why Haskell is coming into its own as a practical language in so many major organizations, Real World Haskell is the best place to start.","torrent":{"xt":"urn:btih:263a7aab766b5f204487421005aabf5b28207004","amp;dn":"Real+World+Haskell+1st+Edition+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"263a7aab766b5f204487421005aabf5b28207004","infoHashBuffer":{"type":"Buffer","data":[38,58,122,171,118,107,95,32,68,135,66,16,5,170,191,91,40,32,112,4]},"announce":[],"urlList":[]}}