{"title":"QuickTimeMPEG2.dmg","uid":3951087,"size":886834,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:268ac7e2ee320c99c29626837189f3102947be37&amp;dn=QuickTimeMPEG2.dmg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mongohasse","files":1,"time":1198859531,"description":"Support for MPEG-2\nThe QuickTime MPEG-2 Playback Component provides QuickTime users with the ability to import and play back MPEG-2 content, including both multiplexed (a.k.a. muxed, where the audio and video tracks are interleaved together into one track) and non-multiplexed (a.k.a. elementary) streams. It is perfectly suited for professional and semi-professional content creators with projects such as:\n\nProfessional content production\nThroughout the professional content production process, many approvals and progress checks are necessary. With QuickTime Player and the QuickTime MPEG-2 Playback Component, your clients and reviewers can view your MPEG-2 streams and provide feedback. This eliminates the need for frequent transcodes and allows your clients and reviewers to play back your work on any Macintosh or PC.\n\nTranscoding video content\nYour MPEG-2 video content can be imported into QuickTime and exported to other formats such as MPEG-4, the new international standard for Internet media, QuickTime Movie or DV Stream, to name a few. The QuickTime MPEG-2 Playback Component allows the transcode of MPEG-2 video from both multiplexed and elementary video streams(1). By converting your MPEG-2 video content into other formats, it can be used in new forums, such as on the web, on CD-ROM or on DV tape.","torrent":{"xt":"urn:btih:268ac7e2ee320c99c29626837189f3102947be37","amp;dn":"QuickTimeMPEG2.dmg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268ac7e2ee320c99c29626837189f3102947be37","infoHashBuffer":{"type":"Buffer","data":[38,138,199,226,238,50,12,153,194,150,38,131,113,137,243,16,41,71,190,55]},"announce":[],"urlList":[]}}