{"title":"The Guest Cat (2014) Takashi Hiraide (multi)","uid":9540515,"size":1087544,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:268a74ec0448909f9e0a726ca2e8660d308acf1e&amp;dn=The+Guest+Cat+%282014%29+Takashi+Hiraide+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"7","files":-1,"time":1391033571,"description":"The Guest Cat by Takashi Hiraide\n\n\nFormat: mobi/epub/azw3\nLength: 144 pages\nGenre: Contemporary Fiction\nDate: 21 January 2014\n\nA wonderful sui generis* novel about a visiting cat who brings joy into a couple's life in Tokyo.\n\nA bestseller in France and winner of Japan's Kiyama Shohei Literary Award, The Guest Cat, by the acclaimed poet Takashi Hiraide, is a subtly moving and exceptionally beautiful novel about the transient nature of life and idiosyncratic but deeply felt ways of living.\n\nA couple in their thirties live in a small rented cottage in a quiet part of Tokyo; they work at home, freelance copy-editing; they no longer have very much to say to one another. But one day a cat invites itself into their small kitchen. It leaves, but the next day comes again, and then again and again. Soon they are buying treats for the cat and enjoying talks about the animal and all its little ways. Life suddenly seems to have more promise for the husband and wife--the days have more light and color. The novel brims with new small joys and many moments of staggering poetic beauty, but then something happens...\n\nThe best novels are often the ones that change us. They speak to a void, sometimes quietly, other times loudly from the proverbial rooftop. When done right, they bring to the surface important questions and compel us to look inward. Over time, they stay with us - like small miracles.\n\n*Sui Generis: (Latin) Of its own kind/genre, unique.\n\nAuthor:\n\nTakashi Hiraide was born in Moji, Kitakyushu in 1950. He has published numerous books of poetry as well as several books of genre-bending essays, including one on poetics and baseball. He has also written a novel, A Guest Cat; a biography of Meiji poet Irako Seihaku; and a travelogue that follows the traces of Kafka, Celan, and Benjamin in Berlin. His poetry book, Postcards to Donald Evans, is published by the Tibor de Nagy Foundation.","torrent":{"xt":"urn:btih:268a74ec0448909f9e0a726ca2e8660d308acf1e","amp;dn":"The+Guest+Cat+%282014%29+Takashi+Hiraide+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"268a74ec0448909f9e0a726ca2e8660d308acf1e","infoHashBuffer":{"type":"Buffer","data":[38,138,116,236,4,72,144,159,158,10,114,108,162,232,102,13,48,138,207,30]},"announce":[],"urlList":[]}}