{"title":"12 Paleo Myths - Eat Better Than A Caveman - PDF+EPUB+MOBI","uid":9677493,"size":4885431,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26d9d01ffd0ce30cbdc9c0971377c71e87dd24c4&amp;dn=12+Paleo+Myths+-+Eat+Better+Than+A+Caveman+-+PDF%2BEPUB%2BMOBI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"AtomTPB","files":3,"time":1393547436,"description":"Pages: 236 pages\nPublisher: Archangel Ink (November 24, 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nISBN: 1490571507\nASIN: B008ZGBFOQ\nFormat: EPUB/MOBI/PD\n\nGot the Paleo blues? Eating the perfect diet for your genetic blueprint, but mysteriously feeling worse? Think it's because you're not trying hard enough? Think all these problems are due to the one croissant you had 6 months ago? \n\nThink again!\n\nThere are some serious flaws with the Paleo Diet. Sure, many people lose weight when they switch over to a boring diet of mostly meat and vegetables. Well, for the first few months before they start gaining it back that is. And many see health improvements - legitimate ones, as happens when the nutrition content of a diet goes up dramatically. Of course there are people who benefit from switching from a McDiet to something like Paleo!\n\nBut many get ravaged by it, and there are clear, obvious, and very basic physiological reasons for it. \n\nObvious signs that the Paleo Diet is inappropriate for you would be:\ncold hands and feet\nfrequent urination, nighttime urination, or night sweats\nsleep problems - particularly waking up between 3-4 am\nanxiety or panic attacks\nmuscle cramps\nirritability\nlack of energy\ndelayed stomach emptying and constipation\nbody odor and breath odor\ndark circles under your eyes\nappearance of allergies or autoimmune disease\nloss of sex drive, sexual function, or menstruation\ndry skin\npoor exercise performance and recovery\nmigraines, blurred vision, and countless others\nIf you suffer from these issues and you're on a Paleo Diet, you better make some adjustments! \n\n12 Paleo Myths: Eat Better than a Caveman goes into great detail about the physiology behind how the Paleo Diet, particularly one that is heavy in meat and fat and low in carbohydrates, affects us as human beings. For some, those affects might be highly favorable. But for others it's like throwing gasoline on a fire.\n\nThe book also includes a discussion of some of the most basic tenets of Paleo that are illogical or scientifically wrong, such as the belief that carbohydrate consumption causes blood sugar or insulin levels to become too high, or the belief that we are genetically identical to our Paleolithic forebears.\n\nAnd of course, it includes valuable information on how to overcome and reverse some of the problems you may have incurred or ceased to improve with your adherence to this latest peculiar, sciencey-sounding fad.\n\nThe book also includes 50 thick pages of stories from people who had miserable results trying to follow a Paleo diet - from insomnia and panic attacks to loss of menstruation and erectile dysfunction. \n\nRead the book now and start making sense of the problems you've experienced since you started eating the &quot;perfect human diet.&quot;","torrent":{"xt":"urn:btih:26d9d01ffd0ce30cbdc9c0971377c71e87dd24c4","amp;dn":"12+Paleo+Myths+-+Eat+Better+Than+A+Caveman+-+PDF%2BEPUB%2BMOBI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26d9d01ffd0ce30cbdc9c0971377c71e87dd24c4","infoHashBuffer":{"type":"Buffer","data":[38,217,208,31,253,12,227,12,189,201,192,151,19,119,199,30,135,221,36,196]},"announce":[],"urlList":[]}}