{"title":"Simon Schama - The Story of the Jews (PBS tie-in volume)","uid":9831805,"size":7000063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:273cd4879bad72fa48b5f28c0f554f21c9e4f46c&amp;dn=Simon+Schama+-+The+Story+of+the+Jews+%28PBS+tie-in+volume%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":-1,"time":1395851830,"description":"\nSimon Schama - The Story of the Jews, Vol. 1: Finding the Words, 1000 BCE - 1492 CE (Ecco, 2014).\n\nISBN: 978-0060539184 | 512 pages | ePUB + MOBI\n\n\nIn this magnificently illustrated cultural history -- the companion volume to the five-part PBS and BBC series THE STORY OF THE JEWS -- award-winning historian Simon Schama details the story of the Jewish people, tracing their experience across three millennia, from their beginnings as an ancient tribal people to the opening of the new world in 1492.  It is a story like no other: an epic of endurance in the face of destruction, of creativity in the face of oppression, joy amidst grief, the affirmation of life despite the steepest of odds.\n\nIt spans the millennia and the continents -- from India to Andalusia and from the bazaars of Cairo to the streets of Oxford.  It takes you to unimagined places: to a Jewish kingdom in the mountains of southern Arabia; a Syrian synagogue glowing with radiant wall paintings; the palm groves of the Jewish dead in the Roman catacombs.  And its voices ring loud and clear, from the severities and ecstasies of the Bible writers to the love poems of wine bibbers in a garden in Muslim Spain.\n\nIn THE STORY OF THE JEWS, the Talmud burns in the streets of Paris, massed gibbets hang over the streets of medieval London, a Majorcan illuminator redraws the world; candles are lit, chants are sung, mules are packed, ships loaded with gems and spices founder at sea. And a great story unfolds. Not, as often imagined, of a culture apart, but of a Jewish world immersed in and imprinted by the peoples among whom they have dwelled, from the Egyptians to the Greeks, from the Arabs to the Christians.  Which makes the story of the Jews everyone's story, too.\n\nPlease note: The second and concluding volume, &quot;When Words Fail: 1492 to the Present&quot;, is scheduled for publication in September 2014.\n\n\nReviews\n\n&quot;Schama writes history from below, and from the middle and other unexpected angles, resurrecting the unrecorded and long-forgotten, and analyzing the social and cultural forces that shaped his subjects' lives. . . [He] has pulled it off with opinionated flair and literary grace.&quot; -- New York Times Book Review\n\n&quot;[This] is exemplary popular history. It's engaged, literate, alert to recent scholarship and, at moments, winningly personal.&quot; -- New York Times\n\n&quot;A multifaceted story artfully woven by an expert historian.&quot; -- Kirkus Reviews\n\n&quot;Schama has written an unconventional but masterful and deeply felt history of his people.&quot; -- Booklist\n\n&quot;In his brilliant new history of the Jews, the unconventional scholar somehow manages to be simultaneously sentimental and subversive, consensual and contrarian -- and we readers are the beneficiaries.&quot; -- Haaretz\n\n&quot;An energetic cascade of prose and erudition, rife with pointillist detail and witty colloquialisms.&quot; -- Chicago Tribune\n","torrent":{"xt":"urn:btih:273cd4879bad72fa48b5f28c0f554f21c9e4f46c","amp;dn":"Simon+Schama+-+The+Story+of+the+Jews+%28PBS+tie-in+volume%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"273cd4879bad72fa48b5f28c0f554f21c9e4f46c","infoHashBuffer":{"type":"Buffer","data":[39,60,212,135,155,173,114,250,72,181,242,140,15,85,79,33,201,228,244,108]},"announce":[],"urlList":[]}}