{"title":"Richard Dawkins - Brief Candle in the Dark - My Life in Science","uid":12562244,"size":403511286,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2771579f5fe07f093868be5af4cf12c1d9a4c07d&amp;dn=Richard+Dawkins+-+Brief+Candle+in+the+Dark+-+My+Life+in+Science&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Cybotage","files":17,"time":1444727321,"description":"In this hugely entertaining sequel to the New York Times bestselling memoir An Appetite for Wonder, Richard Dawkins delves deeply into his intellectual life spent kick-starting new conversations about science, culture, and religion and writing yet another of the most audacious and widely read books of the twentieth century—The God Delusion.\r\n\r\nCalled &quot;one of the best nonfiction writers alive today&quot; (Stephen Pinker) and a &quot;prize-fighter&quot; (Nature), Richard Dawkins cheerfully, mischievously, looks back on a lifetime of tireless intellectual adventure and engagement. Exploring the halls of intellectual inquiry and stardom he encountered after the publication of his seminal work, The Selfish Gene; affectionately lampooning the world of academia, publishing, and television; and studding the pages with funny stories about the great men and women he's known, Dawkins offers a candid look at the events and ideas that encouraged him to shift his attention to the intersection of culture, religion, and science. He also invites the reader to look more closely at the brilliant succession of ten influential books that grew naturally out of his busy life, highlighting the ideas that connect them and excavating their origins.\r\n\r\nOn the publication of his tenth book, the smash hit, The God Delusion, a &quot;resounding trumpet blast for truth&quot; (Matt Ridley), Richard Dawkins was catapulted from mere intellectual stardom into a circle of celebrity thinkers dubbed, &quot;The New Atheists&quot;—including Christopher Hitchens, Sam Harris, and Daniel Dennett.\r\n\r\nThroughout A Brief Candle in the Dark, Dawkins shares with us his infectious sense of wonder at the natural world, his enjoyment of the absurdities of human interaction, and his bracing awareness of life's brevity: all of which have made a deep imprint on our culture.\r\n\r\nThe complete list of narrators includes: Mitch Albom, Roger McGuinn, Ingrid Michaelson, John Pizzarelli, Paul Stanley, George Guidall, Mike Hodge, Robin Miles, Christian Baskous, Tony Chiroldes, Kevin O'Neil, and Adriana Sananes, Ken Brown, and Sarab Kamoo.\r\n\r\n\r\n\r\nRead by Richard Dawkins, others\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged\r\n\r\nLength: 13 hrs and 57 mins\r\nUnabridged Audiobook\r\nRelease Date:09-30-15","torrent":{"xt":"urn:btih:2771579f5fe07f093868be5af4cf12c1d9a4c07d","amp;dn":"Richard+Dawkins+-+Brief+Candle+in+the+Dark+-+My+Life+in+Science","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2771579f5fe07f093868be5af4cf12c1d9a4c07d","infoHashBuffer":{"type":"Buffer","data":[39,113,87,159,95,224,127,9,56,104,190,90,244,207,18,193,217,164,192,125]},"announce":[],"urlList":[]}}