{"title":"Clinical Nursing Skills &amp; Techniques, 8E Perry, Potter [PDF]","uid":11517845,"size":151597261,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27867ba0ec1d52805fec5c5413122bb876e7f810&amp;dn=Clinical+Nursing+Skills+%26amp%3B+Techniques%2C+8E+Perry%2C+Potter+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"0xmovva","files":2,"time":1416458908,"description":"TITLE/EDITIONClinical Nursing Skills and Techniques, 8th Edition \nAuthor: Anne Griffin Perry (Author), Patricia A. Potter (Author), Wendy Ostendorf (Author)\nPaperback: 1216 pages\nPublisher: Mosby; 8th edition (February 28, 2013)\nLanguage: English\nISBN-10: 0323083838\nISBN-13: 978-0323083836\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nKnown for its clear, comprehensive coverage of over 200 evidence-based skills, Clinical Nursing Skills &amp; Techniques is today's leading nursing skills reference. It features nearly 1,000 full-color photographs and drawings, a nursing process framework, step-by-step instructions with rationales, and a focus on critical thinking and evidence-based practice. This edition includes new coverage of patient-centered care and safety guidelines, an emphasis on QSEN core competencies, and links to valuable online resources. Written by the trusted author team of Anne Griffin Perry and Patricia A. Potter, and now joined by new author Wendy Ostendorf, this reference helps you perform nursing skills with confidence.\n\nCoverage of QSEN core competencies includes delegation and collaboration, guidelines for reporting and recording, and pediatric, geriatric, home care, and teaching considerations.\nUnique! Using Evidence in Nursing Practice chapter covers the entire process of conducting research, including collecting, evaluating, and applying evidence from published research.\nComprehensive coverage includes 212 basic, intermediate, and advanced nursing skills.\nClinical Decision Points within skills address key safety issues or possible skill modifications for specific patient needs.\nIcons indicate video clips related to skills and procedures in the book and related lessons in Nursing Skills Online.\nRationales for each skill step explain why steps are performed in a specific way, including their clinical significance and benefit, and incorporate the latest research findings.\nThe five-step nursing process provides a framework for the description of skills within overall client care.\nUnique! Unexpected outcomes and related interventions alert you to what might go wrong and how to appropriately intervene.\nOnline checklists and video clips may be downloaded to mobile devices.\nNEW Patient-Centered Care sections address issues unique to people of specific cultural, ethnic, and demographic backgrounds - a QSEN core competency.\nNEW Safety Guidelines sections cover the global recommendations on the safe execution of skill sets - also a QSEN core competency.\nUPDATED Adverse Event Reporting (AER) procedural guideline covers the correct response to Serious Event Reporting within the healthcare facility.\nNEW! Safe Transfer to a Wheel Chair procedural guideline focuses on the safety aspect of this common maneuver.\nNEW! Communicating with the Cognitively Impaired Patient skill provides the understanding and protocol for dealing with patients who are unable to communicate in a typical manner.\nNEW! Assessing the Genitalia and Rectum skill includes complete information and rationales.\nNEW! Caring for Patients with Multi-Drug Resistant Organisms (MDRO) and C. difficili skill covers this growing challenge to patient welfare and to healthcare providers","torrent":{"xt":"urn:btih:27867ba0ec1d52805fec5c5413122bb876e7f810","amp;dn":"Clinical+Nursing+Skills+%26amp%3B+Techniques%2C+8E+Perry%2C+Potter+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27867ba0ec1d52805fec5c5413122bb876e7f810","infoHashBuffer":{"type":"Buffer","data":[39,134,123,160,236,29,82,128,95,236,92,84,19,18,43,184,118,231,248,16]},"announce":[],"urlList":[]}}