{"title":"Tinklebell Visual Novel Collection","uid":4500275,"size":7923862315,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:2798e64f15af235d0002bcb7930cda298aa1accc&amp;dn=Tinklebell+Visual+Novel+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Funkbot4","files":188,"time":1226365648,"description":"If you're here you know what you're looking for you nasty people you :p I had a hard time finding all these so I decided to be nice and upload all of them in one torrent so anyone can get them easy. Keep in mind that these are only the visual novels (as of 11/10/08) and not the card games or the small flash games that were released, but they should hold your attention for more than enough time.\n\nHere's the official site: http://www.tinklebell.jp\n\nSorry mac users (without Bootcamp) this is PC only. You guys are missing out ;p\n\nContents:\n\n- Punyupuri SP ~Yamiyo no Miko Shokushu ni Otsu~\n\n- Rondo ~ Punyupuri Joshikouhen~\n\n- Tsun Dere! ~Punyupuri EX~\n\n- Tsun Dere! II ~Tsukiakari no Raspberry~ PunyupuriEXE\n\n- Punyupuri XX ~Yamiyo to Hoshi no Meidokan~\n\n\n\nEnjoy the tasty moving pictures, Mmmmm :)\n\n\nInfo from the Readme.txt:\n\n\nTorrent uploaded By Funkbot4 on The Pirate Bay.\n\n*For the ones that seem like they have multiple setup files click the installer without any numbers next to it. To get the games running after they're installed (Rondo ~ Punyupuri Joshikouhen~ and Punyupuri SP ~Yamiyo no Miko Shokushu ni Otsu~ do not need to be installed but tunning them is the same) click the icon with the girls face.\n\nThe install file for Tsun Dere! II ~Tsukiakari no Raspberry~ PunyupuriEXE is an ISO disk image just so you know. If you don't already they basically function like CDs without actually having the tangible counterpart and if you try to run it normally it won't work, so you have to mount it to a disk drive or, more simply put, trick your computer into thinking you have a CD . Here's how:\n\n1. Go here http://www.daemon-tools.cc/dtcc/download.php\n\n2. Download Daemon tools (the site is clean no worries about viruses and blah). It should be the first thing on list list of availible downloads.\n\n3. Install Daemon Tools\n\n4. After doing whatever the installer says and having the install done there should be an icon that looks like a thunderbolt going through a CD in your taskbar. That's the Daemon Tools icon. Click it and it should say something like &quot;Device 0: [X:]Empty&quot;. This just means that your CD drive is empty. I'm not sure if it has to be but it would be safest to remove anything from the CD drive you plan on using.\n\n5. Click the &quot;Device 0: [X:]Empty&quot; thing and it will prompt you to select an image file. Select the Tsun Dere! II ~Tsukiakari no Raspberry~ PunyupuriEXE ISO and the installation should begin.\n\n6. Enjoy :)\n\nDon't forget to unmount the ISO image after you finish installing, I don't think you can use your CD drive normally if there's an image mounted to it.","torrent":{"xt":"urn:btih:2798e64f15af235d0002bcb7930cda298aa1accc","amp;dn":"Tinklebell+Visual+Novel+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2798e64f15af235d0002bcb7930cda298aa1accc","infoHashBuffer":{"type":"Buffer","data":[39,152,230,79,21,175,35,93,0,2,188,183,147,12,218,41,138,161,172,204]},"announce":[],"urlList":[]}}