{"title":"Piezoelectric Materials - Toshio Ogawa","uid":15681947,"size":74536699,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:27b5c00570fa58ee7fb63be67281a9fe05b50c3d&amp;dn=Piezoelectric+Materials+-+Toshio+Ogawa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1472330757,"description":"Piezoelectric Materials - Toshio Ogawa (ExLi4EvA, 2016).pdf\r\n\r\nThe purpose of this book is focused on the latest reports in piezoelectric materials such as lead-free ceramics, single crystals, and thin films from viewpoints of piezoelectric materials, piezoelectric science, and piezoelectric applications. \r\n\r\nThe science and technology in the area of piezoelectric ceramics are extremely progressing, especially the materials research, measurement technique, theory and applications, and furthermore, demanded to fit social technical requests such as environmental problems. While they had been concentrated on piezoelectric ceramics composed of lead-containing compositions, such as lead zirconate titanate (PZT) and lead titanate, at the beginning because of the high piezoelectricity, recently lead water pollution by soluble PZT of our environment must be considered. Therefore, different new compositions of lead-free ceramics in order to replace PZT are needed. \r\nUntil now, there have been many studies on lead-free ceramics looking for new morphotropic phase boundaries, ceramic microstructure control to realize high ceramic density, including composites and texture developments, and applications to new evaluation techniques to search for high piezoelectricity","torrent":{"xt":"urn:btih:27b5c00570fa58ee7fb63be67281a9fe05b50c3d","amp;dn":"Piezoelectric+Materials+-+Toshio+Ogawa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27b5c00570fa58ee7fb63be67281a9fe05b50c3d","infoHashBuffer":{"type":"Buffer","data":[39,181,192,5,112,250,88,238,127,182,59,230,114,129,169,254,5,181,12,61]},"announce":[],"urlList":[]}}