{"title":"Dr. Feelgood: The Shocking Story of the Doctor Who May Have Chan","uid":15367924,"size":310840881,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:27fd7553e8d3b9e17af0b558b3e9532bfe5cba4c&amp;dn=Dr.+Feelgood%3A+The+Shocking+Story+of+the+Doctor+Who+May+Have+Chan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Kane_krit","files":68,"time":1469097654,"description":"Dr. Feelgood: The Shocking Story of the Doctor Who May Have Changed History by Treating and Drugging JFK, Marilyn, Elvis, and Other Prominent Figures - Richard A. Lertzman &amp; William J. Birnes\r\n\r\nAn exposé of the mysterious doctor who changed the course of history, Dr. Max Jacobson, whom the Secret Service under President John F. Kennedy code named Dr. Feelgood, developed a unique &quot;energy formula&quot; that altered the paths of some of the twentieth century's most iconic figures, including the President and Jackie Kennedy, Marilyn Monroe, Frank Sinatra, and Elvis Presley. JFK received his first injection (a special mix of &quot;vitamins and hormones,&quot; according to Jacobson) just before his first debate with Vice President Richard Nixon. The shot into JFK's throat not only cured his laryngitis, but diminished the pain in his back, allowed him to stand up straighter, and invigorated the tired candidate. Kennedy demolished Nixon in that first debate and turned a tide of skepticism about Kennedy into an audience that appreciated his energy and crispness. What JFK didn't know then was that the injections were actually powerful doses of a combination of highly addictive liquid methamphetamine and steroids. Author and researcher Rick Lertzman and New York Times bestselling author Bill Birnes reveal heretofore unpublished material about the mysterious Dr. Feelgood. Through well-researched prose and interviews with celebrities including George Clooney, Jerry Lewis, Yogi Berra, and Sid Caesar, the authors reveal Jacobson's vast influence on events such as the assassination of JFK, the Cuban Missile Crisis, the Kennedy-Krushchev Vienna Summit, the murder of Marilyn Monroe, the filming of the C. B. Demille classic The Ten Commandments, and the work of many of the great artists of that era. Jacobson destroyed the lives of several famous patients in the entertainment industry and accidentally killed his own wife, Nina, with an overdose of his formula.\r\n\r\nLength: 5 hours 15 minutes\r\n \nhttp://www.booktopia.com.au/dr-feelgood-richard-a-lertzman/prod9781629145662.html","torrent":{"xt":"urn:btih:27fd7553e8d3b9e17af0b558b3e9532bfe5cba4c","amp;dn":"Dr.+Feelgood%3A+The+Shocking+Story+of+the+Doctor+Who+May+Have+Chan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27fd7553e8d3b9e17af0b558b3e9532bfe5cba4c","infoHashBuffer":{"type":"Buffer","data":[39,253,117,83,232,211,185,225,122,240,181,88,179,233,83,43,254,92,186,76]},"announce":[],"urlList":[]}}