{"title":"Sycamore Row By John Grisham","uid":9088144,"size":3889442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2813c5ab766a36712c089490b85de1e35a01aa1e&amp;dn=Sycamore+Row+By+John+Grisham&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"maxdesolate","files":4,"time":1382534988,"description":"John Grisham's A Time to Kill is one of the most popular novels of our time. Now we return to that famous courthouse in Clanton as Jake Brigance once again finds himself embroiled in a fiercely controversial trial-a trial that will expose old racial tensions and force Ford County to confront its tortured history.\n\nSeth Hubbard is a wealthy man dying of lung cancer. He trusts no one. Before he hangs himself from a sycamore tree, Hubbard leaves a new, handwritten, will. It is an act that drags his adult children, his black maid, and Jake into a conflict as riveting and dramatic as the murder trial that made Brigance one of Ford County's most notorious citizens, just three years earlier.\n\nThe second will raises far more questions than it answers. Why would Hubbard leave nearly all of his fortune to his maid? Had chemotherapy and painkillers affected his ability to think clearly? And what does it all have to do with a piece of land once known as Sycamore Row?\n\nIn Sycamore Row, John Grisham returns to the setting and the compelling characters that first established him as America's favorite storyteller. Here, in his most assured and thrilling novel yet, is a powerful testament to the fact that Grisham remains the master of the legal thriller, nearly twenty-five years after the publication of A Time to Kill.\n\nEPUB AND MOBI. ENJOY AND SEED! ","torrent":{"xt":"urn:btih:2813c5ab766a36712c089490b85de1e35a01aa1e","amp;dn":"Sycamore+Row+By+John+Grisham","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2813c5ab766a36712c089490b85de1e35a01aa1e","infoHashBuffer":{"type":"Buffer","data":[40,19,197,171,118,106,54,113,44,8,148,144,184,93,225,227,90,1,170,30]},"announce":[],"urlList":[]}}