{"title":"Grant Morrison's Batman (Complete With Extras)","uid":8777868,"size":2481689591,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:284c1f5b796abab2f0884858c32191342d39da18&amp;dn=Grant+Morrison%27s+Batman+%28Complete+With+Extras%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Ahlat","files":-1,"time":1375605341,"description":"Grant Morrison's Complete Batman Run (2006-2013)\n\nGrant Morrison first wrote Batman in the graphic novel Arkham Asylum: A Serious House on a Strange Earth in 1989. He then returned in 1990 to write a 5 issue arc (Gothic) in Legends of the Dark Knight. In 2006 he returned to write Batman, but this time instead of a single story, he came to write an entire epic in only the way Grant Morrison can. He took Batman on a wild ride, through many twists and turns, finally ending it after seven years in 2013.\n\nThis run includes everything Batman related that Grant Morrison wrote for his run. I've also included some extras such as: Resurrection of Ra's al Ghul (A crossover for which Morrison wrote the prologue and part 4; the other writer for this crossover are Peter Milligan, Fabian Nicieza and Paul Dini), Final Crisis (which was an event for the whole DCU but was major for Morrison's Batman), Battle for the Cowl (it deals with the aftermath of Final Crisis for the Bat-family and is written by Tony Daniel) and Batman Incorporated #11 (a filler issue written by Chris Burnham). I've also included Morrison's earlier Batman work not related to his seven year long run and The Black Casebook. The Black Casebook contain earlier Batman issues which influenced Morrison's run and at the end there are excerpts from 52 of all Batman related content from that series which serve as a prologue to Morrisson's run.\n\nI don't have a fast uploading speed so I ask you to be patient. I will finish seeding this and continue to seed it for a long while.\t","torrent":{"xt":"urn:btih:284c1f5b796abab2f0884858c32191342d39da18","amp;dn":"Grant+Morrison%27s+Batman+%28Complete+With+Extras%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284c1f5b796abab2f0884858c32191342d39da18","infoHashBuffer":{"type":"Buffer","data":[40,76,31,91,121,106,186,178,240,136,72,88,195,33,145,52,45,57,218,24]},"announce":[],"urlList":[]}}