{"title":"Slapshock 5 Albums","uid":4888923,"size":372246632,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:28602987ab7f6dba7760d89248d2cdec855c29a3&amp;dn=Slapshock+5+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Criptor","files":17,"time":1241829718,"description":"Music : Metal : MP3/128Kbps\nSlapshock Albums\n\n4th Degree Burn\nHeadtrip\nProject 11-41\nNovena\nSilence\n\nhope you enjoy it, this band is one of the best from the Philippines that sings in mostly English. Most of them in this torrent are zipped up, except for Novena, which I downloaded each track individually and thus didn't zip em up. Yes I'm Lazy but at least you got the songs.\n\nEnjoy\n\nCriptor\n\nBackground\n\nThe group was formed on 14 February, 1997 by several students at UP Diliman, with original vocalist Reynold Munsayac; he was soon replaced with guitarist Jerry Basco's cousin, Jamir Garcia.[1] Heavily influenced by American East Coast rap, they played in clubs in Manila in the 1990s before signing to EMI Philippines and releasing their debut album, 4th Degree Burn, in 1999. The group has released five albums and been met with sustained commercial success in the Philippines, particularly with their third album, Project 11-41.[1] They were nominated for Band of the Year at the NU107 Rock Awards in 2001 and 2002, and in 2003 were nominated for Best Artist by MTV Asia. Bassist Lee Nadela was also named Bassist of the Year at the 2001 NU107 Rock Awards. The band also played at the Mapua Metal Fest, a foundation week festival held at the last day of the foundation week inside the Mapua Institute of Technology Intramuros campus.","torrent":{"xt":"urn:btih:28602987ab7f6dba7760d89248d2cdec855c29a3","amp;dn":"Slapshock+5+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28602987ab7f6dba7760d89248d2cdec855c29a3","infoHashBuffer":{"type":"Buffer","data":[40,96,41,135,171,127,109,186,119,96,216,146,72,210,205,236,133,92,41,163]},"announce":[],"urlList":[]}}