{"title":"The Cave Singers -  No Witch","uid":7967061,"size":59873988,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:28f9b7c65993d6a448230c2f2bddff4241ab540d&amp;dn=The+Cave+Singers+-++No+Witch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mr_Kurtz","files":-1,"time":1356710071,"description":"The Cave Singers -  No Witch (2011)\n\n\nThe Cave Singers will always be associated with the Northwest. And with roots music. Even though they dont necessarily connect with either one. Doesnt matter.\n \nTheyve got beards, they sing over rootsy beats and finger-picked guitars. They make crooning cool again. Their albums have a bunch of pine trees on the cover and they just sound like they live in a moss-covered cave in the Olympic Peninsulas rainforest. Or at least, thats how they used to be.\n \nThe Cave Singers spend a good deal of time beyond the darkened edges of Seattle, in the mist and mystic, among the wolves and redwoods. And their songs, at least on record, have always been like beautiful, faded grayscale photos of this hinterland. Now, these photos are injected with hot blood and technicolor, a ferocity and bite weve yet to see from the band. \n\nBy all accounts, No Witch is The Cave Singers rock record. Laid to tape with dark wizard producer Randall Dunn (Black Mountain, Sunn O, Boris), No Witch is grander and more lush than The Cave Singers previous efforts. Its also a nervier, scrappier affair, greasy guitars buck and rear up. Eastern-influenced blues snake through songs, gospel choirs rise up like tidal waves. There are big, grinning nods to Beggars Banquet-era Stones, the best of Mellencamp (Clever Creatures) and the juke joint legends of Mississippi like Junior Kimbrough and R.L. Burnside (Black Leaf and No Prosecution If We Bail). Of course, its all filtered through that particular, magical Cave Singers formula: Pete Quirks reedy, behind-the-beat delivery and existential wordplay, Derek Fudescos lyrical guitar runs and drummer Marty Lunds no nonsense rhythms.\n\nNo Witch is a newfound sheen to the aura that made The Cave Singers music so special to begin with. All told, theres treasure to be found here for the biker gang weekender, the double rainbow chaser and all that falls in the valley between them.","torrent":{"xt":"urn:btih:28f9b7c65993d6a448230c2f2bddff4241ab540d","amp;dn":"The+Cave+Singers+-++No+Witch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28f9b7c65993d6a448230c2f2bddff4241ab540d","infoHashBuffer":{"type":"Buffer","data":[40,249,183,198,89,147,214,164,72,35,12,47,43,221,255,66,65,171,84,13]},"announce":[],"urlList":[]}}