{"title":"Improbable War: China, The US and Logic of Power Conflict(2015)","uid":11673786,"size":870809,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29106b2717e9bd58508bf1dc0ce4969b3f89a26b&amp;dn=Improbable+War%3A+China%2C+The+US+and+Logic+of+Power+Conflict%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":1,"time":1422757268,"description":"The Improbable War: China, The United States and Logic of Great Power Conflict\n\n2015 pdf\n\nThe Improbable War explains why conflict between the USA and China cannot be ruled out. In 1914 war between the Great Powers was considered unlikely, yet it happened. We learn only from history, and popular though the First World War analogy is, the lessons we draw from its outbreak are usually mistaken. Among these errors is the tendency to over-estimate human rationality.\n\n All major conflicts of the past 300 years have been about the norms and rules of the international system. In China and the US the world confronts two 'exceptional' powers whose values differ markedly, with China bidding to challenge the current order. The 'Thucydidean Trap' - when a conservative status quo power confronts a rising new one - may also play its part in precipitating hostilities. To avoid stumbling into an avoidable war both Beijing and Washington need a coherent strategy, which neither of them has.\n\n History also reveals that war evolves continually. The next global conflict is likely to be played out in cyberspace and outer space and like all previous wars it will have devastating consequences. Such a war between the United States and China may seem improbable, but it is all too possible, which is why we need to discuss it now","torrent":{"xt":"urn:btih:29106b2717e9bd58508bf1dc0ce4969b3f89a26b","amp;dn":"Improbable+War%3A+China%2C+The+US+and+Logic+of+Power+Conflict%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29106b2717e9bd58508bf1dc0ce4969b3f89a26b","infoHashBuffer":{"type":"Buffer","data":[41,16,107,39,23,233,189,88,80,139,241,220,12,228,150,155,63,137,162,107]},"announce":[],"urlList":[]}}