{"title":"Packed Tower Design and Applications","uid":12100982,"size":40653160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29f1de139e23b8055f371a33d6738996d14bd25c&amp;dn=Packed+Tower+Design+and+Applications&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"clouderone","files":1,"time":1436295587,"description":"Packed Tower Design and Applications - Random and Structured Packings 2nd ed -  Ralph F. Strigle, Jr. (Gulf Publishing, 1994).pdf\n\nISBN 0884151794\n\nDuring the last 25 years, significant changes have taken place in both the design of tower packings and the application of packed columns. Increasingly, concerns have turned from capacity to energy efficiency and the environmental impact of processing operations. This new edition has been retitled and updated throughout to reflect these changes and the expanded uses for structured packages. It provides basic information on the operation mechanism of packed columns, as well as practical methods for designing such columns, proven methods that have been used over the last decade to design columns as large as 46 feet in diameter and for separations requiring as many as 128 theoretical stages. The procedures presented are based on the author's practical experience acquired over 40 years, and have in many cases been developed as a result of real-life modifications. The numerous and varied major applications of packed columns are reviewed, so that their advantages as compared to other mass transfer devices can be determined. Particular characteristics of a system that need to be considered to ensure successful column operation are discussed","torrent":{"xt":"urn:btih:29f1de139e23b8055f371a33d6738996d14bd25c","amp;dn":"Packed+Tower+Design+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29f1de139e23b8055f371a33d6738996d14bd25c","infoHashBuffer":{"type":"Buffer","data":[41,241,222,19,158,35,184,5,95,55,26,51,214,115,137,150,209,75,210,92]},"announce":[],"urlList":[]}}