{"title":"My.Kitchen.Rules.s06e02.WS.PDTV.x264.BF1.mkv","uid":11678267,"size":625391588,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2af17e5ef343152859e6828a700b8da9c14ce076&amp;dn=My.Kitchen.Rules.s06e02.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"bigfish5","files":1,"time":1422968701,"description":"My Kitchen Rules Australia Series 6 Episode 2\n\nThe pressure is on for engaged WA couple Kat and Andre who are hoping their seaside Instant Restaurant will be enough to impress the judges. But will their big personalities get in the way?\n\n Kat and Andre Western Australia\nWe are pretty volatile people. \nThey call themselves 'The Kat and Andre Show' because there's never a dull moment when this couple are around.\n&quot;We love entertaining at home, that's what we love doing. And we love cooking for our friends,&quot; says Kat.\n&quot;Kat is very funny, she makes me laugh all the time,&quot; adds Andre.\nHaving dabbled in stand-up comedy, Kat exudes confidence and charisma and is up for giving anything a go once. Except, perhaps, offal.\n&quot;I'm not really cool with offal. Like I can't even eat pate. It freaks me out and I know it's really uncool to say that because everyone's like, 'Pate is fancy' but it's just like it's eww.&quot;\nShe will, however, close her eyes and try it for the sake of the competition.\nWhile they might be having fun most of the time, when things do go awry expect some fireworks.\n&quot;We are pretty volatile people,&quot; says Kat.\n&quot;We tend to be quite reactionary. But we sort things out really quickly afterwards.\nWe've never worked together before so we're learning a lot about each other.&quot;\nOne of the things that can divide Kat and Andre is their differing attitudes to cleaning the kitchen and organisation.\n&quot;Andre is super organised and I'm super not organised,&quot; says Kat.\nHe adds: &quot;I like to clean as I go and not just in the kitchen, but in general.&quot;\nClean Andre has even banished Kat's clothing into a separate room in their house, where she keeps it in a 'floordrobe'.\n&quot;It's like my wardrobe has just thrown up. He calls it my cess pit. I wish I could organise myself,&quot; she confesses.\nSo they leave the organisation in the kitchen up to Andre. As a former sales manager turned car salesman he's good at devising plans, whereas Kat has the food knowledge.\n&quot;Kat's skill set is definitely better in the kitchen than mine for sure. She knows flavours and techniques and many bigger words than I do,&quot; admits Andre.\nMad into their fishing, seafood is their speciality. But they delve into modern Australian, Italian and Asian cuisines along the way.\n&quot;I'd say our signature dish is our butterflied lamb with crispy potatoes - just simple things like that,&quot; says Andre.\nMaking homemade pasta is a favourite pastime, as is jarring olives from their olive tree.\n&quot;We love the idea of getting into pickling things and that kind of stuff. We haven't got there yet but all that kind of stuff interests us,&quot; says Kat, who also loves fossicking for old jam jars at school fetes.\nBut their biggest love is their two-year-old staffy Max","torrent":{"xt":"urn:btih:2af17e5ef343152859e6828a700b8da9c14ce076","amp;dn":"My.Kitchen.Rules.s06e02.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2af17e5ef343152859e6828a700b8da9c14ce076","infoHashBuffer":{"type":"Buffer","data":[42,241,126,94,243,67,21,40,89,230,130,138,112,11,141,169,193,76,224,118]},"announce":[],"urlList":[]}}