{"title":"Total.War.ROME.II.Emperor.Edition-RELOADED","uid":11050798,"size":12685876956,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2c72c0d263ff9d026fba75ecd9f36d504829b124&amp;dn=Total.War.ROME.II.Emperor.Edition-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"Taker009","files":-1,"time":1411025440,"description":" Total.War.ROME.II.Emperor.Edition-RELOADED\n\n\n\n\n  nERv   \n\n                 Total War : ROME II - Emperor Edition (c) Sega\n\n        09/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam+CEG\n              1 :.......... DISC(S) .. GAME.TYPE ........: Strategy\n\n\n  NOTE:\n  ----\n  This release includes full game with all DLCs available for the game.\n  We thought it was inapropriate to release a 9 GB dox so we decided to make\n  it standalone. Since this game is now complete, you can delete all old packs.\n\n  About Total War: ROME II - Emperor Edition:\n\n  Emperor Edition is the definitive edition of ROME II, featuring an improved\n  politics system, overhauled building chains, rebalanced battles and improved\n  visuals in both campaign and battle.\n\n  In addition, Emperor Edition includes all content and feature updates made\n  available for ROME II since its launch in September 2013. These include\n  Twitch.TV integration, touchscreen controls, new playable factions and units,\n  and Mac compatibility.\n  The Imperator Augustus Campaign Pack and all Emperor Edition content and\n  features are free, via automatic update, to all existing ROME II owners.\n\n  About the Imperator Augustus Campaign Pack\n\n  The Imperator Augustus Campaign Pack is a new playable campaign for ROME II,\n  which rivals the original ROME II Grand Campaign in both scope and scale.\n  This campaign comes as part of Total War: ROME II  Emperor Edition and is\n  available as a free, automatic update to existing owners of Total War: ROME\n  II.\n  The Imperator Augustus Campaign Pack is set in 42 BC during the chaotic\n  aftermath of Caesar's grisly murder. The republic remains whole, but its soul\n  is divided as three great men, the members of the Second Triumvirate, hold\n  the future of Rome in the palms of their hands.\n\n  Octavian, Caesar's adoptive son and the heir to his legacy.\n\n  Marc Antony, Caesar's loyal friend and most trusted lieutenant.\n\n  Lepidus, Pontifex Maximus of Rome and the man who secured Caesar's\n  dictatorship.\n\n  With the territories of The Republic divided between them and the military\n  might of Rome at their beck-and-call, the members of The Second Triumvirate\n  are each in a position to make a bid for leadership, and rule Rome as its\n  first  and only  emperor.\n\n  However, external forces are on the move, looking to exploit the instability\n  of Rome and expand their own territories. Will you fight as a defender of\n  Rome and defeat the other members of the Triumvirate? Or lead another faction\n  on a campaign of conquest and expansion, and take advantage of the chaos as\n  the Roman civil war rages?\n\n  Playable Factions\n\n  Players may embark on a new Campaign as one of the following playable\n  factions:\n  Marc Antony\n  Lepidus\n  Octavian\n  Pompey\n  Iceni\n  Marcomanni\n  Dacia\n  Egypt\n  Parthia\n  Armenia (also now playable in the ROME II Grand Campaign).\n\n  How far will you go for Rome?\n\n  The award-winning Total War series returns to Rome, setting a brand new\n  quality benchmark for Strategy gaming. Become the world's first superpower\n  and command the Ancient world's most incredible war machine. Dominate your\n  enemies by military, economic and political means. Your ascension will bring\n  both admiration and jealousy, even from your closest allies.\n\n  Will you suffer betrayal or will you be the first to turn on old friends?\n  Will you fight to save the Republic, or plot to rule alone as Emperor?\n\n  Plan your conquest of the known world in a massive sandbox turn-based\n  campaign mode (supporting additional 2-player cooperative &amp; competitive\n  modes). Conspiracies, politics, intrigue, revolts, loyalty, honour, ambition,\n  betrayal. Your decisions will write your own story.\n\n  Build vast armies and take to the battlefield in real-time combat mode. Put\n  your tactical skills to the test as you directly control tens of thousands of\n  men clashing in epic land and sea battles.\n\n  Play for the glory of Rome as one of three families or take command of a\n  huge variety of rival civilisations  each offers a notably different form of\n  gameplay experience with hundreds of unique units from siege engines and\n  heavy cavalry to steel-plated legionaries and barbarian berserkers.\n\n  See exotic ancient cities and colossal armies rendered in incredible detail,\n  as jaw-dropping battles unfold. Detailed camera perspectives allow you to see\n  your men shout in victory or scream in pain on the frontline, while a new\n  tactical cam allows a god's eye view of the carnage to better inform your\n  strategic decisions.\n\n  Extremely scalable experience, with gameplay and graphics performance\n  optimised to match low and high-end hardware alike.\n\n  1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy over the cracked content from the /Crack directory on the image to\n     your game install directory.\n  5. Play the game.\n  6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:2c72c0d263ff9d026fba75ecd9f36d504829b124","amp;dn":"Total.War.ROME.II.Emperor.Edition-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c72c0d263ff9d026fba75ecd9f36d504829b124","infoHashBuffer":{"type":"Buffer","data":[44,114,192,210,99,255,157,2,111,186,117,236,217,243,109,80,72,41,177,36]},"announce":[],"urlList":[]}}