{"title":"Android Phones For Dummies, 2nd Edition","uid":10184878,"size":42033998,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c8f7ea7c425cce2607ffe5fcaf3c8ac4bb42f4e&amp;dn=Android+Phones+For+Dummies%2C+2nd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"wildturkey00","files":2,"time":1400564832,"description":"Everything you need to know about your Android smartphone?in full color!Eager to learn the ins and outs of your exciting, new Android phone? Then this is the book you need! Written in the typical fun and friendly For Dummies style, this full-color guide covers the basics of all the features of Android phones without weighing you down with heavy technical terms or jargon. Veteran world-renowned author Dan Gookin walks you through everything from getting started with setup and configuration to making the most of your phone's potential with texting, e-mailing, accessing the Internet and social networking sites, using the camera, synching with a PC, downloading apps, and more. Covers all the details of the operating system that applies to every Android phone, including Motorola Droids, HTC devices, Samsung Galaxy S phones, to name a few Walks you through basic phone operations while also encouraging you to explore your phone's full potential Serves as an ideal guide to an inexperienced Android newbie who is enthusiastic about getting a handle on everything an Android phone can do Android Phones For Dummies helps you get smarter with your Android smartphone.","torrent":{"xt":"urn:btih:2c8f7ea7c425cce2607ffe5fcaf3c8ac4bb42f4e","amp;dn":"Android+Phones+For+Dummies%2C+2nd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c8f7ea7c425cce2607ffe5fcaf3c8ac4bb42f4e","infoHashBuffer":{"type":"Buffer","data":[44,143,126,167,196,37,204,226,96,127,254,95,202,243,200,172,75,180,47,78]},"announce":[],"urlList":[]}}