{"title":"V.E. Schwab, Victoria Schwab - A Darker Shade of Magic (A Darker","uid":13476715,"size":336517120,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2cd4ac34b52aef2e9d93a52677001ff853a80198&amp;dn=V.E.+Schwab%2C+Victoria+Schwab+-+A+Darker+Shade+of+Magic+%28A+Darker&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Cybotage","files":60,"time":1455017677,"description":"V.E. Schwab, Victoria Schwab - A Darker Shade of Magic (A Darker Shade of Magic #1)\r\n\r\n\r\nKell is one of the last Travelers—rare magicians who choose a parallel universe to visit.\r\n\r\nGrey London is dirty, boring, lacks magic, ruled by mad King George. Red London is where life and magic are revered, and the Maresh Dynasty presides over a flourishing empire. White London is ruled by whoever has murdered their way to the throne. People fight to control magic, and the magic fights back, draining the city to its very bones. Once there was Black London—but no one speaks of that now.\r\n\r\nOfficially, Kell is the Red Traveler, personal ambassador and adopted Prince of Red London, carrying the monthly correspondences between royals of each London. Unofficially, Kell smuggles for those willing to pay for even a glimpse of a world they’ll never see. This dangerous hobby sets him up for accidental treason. Fleeing into Grey London, Kell runs afoul of Delilah Bard, a cut-purse with lofty aspirations. She robs him, saves him from a dangerous enemy, then forces him to another world for her 'proper adventure'.\r\n\r\nBut perilous magic is afoot, and treachery lurks at every turn. To save all of the worlds, Kell and Lila will first need to stay alive—trickier than they hoped.\r\n\r\n\r\nFormat: MP3\r\nUnabridged","torrent":{"xt":"urn:btih:2cd4ac34b52aef2e9d93a52677001ff853a80198","amp;dn":"V.E.+Schwab%2C+Victoria+Schwab+-+A+Darker+Shade+of+Magic+%28A+Darker","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cd4ac34b52aef2e9d93a52677001ff853a80198","infoHashBuffer":{"type":"Buffer","data":[44,212,172,52,181,42,239,46,157,147,165,38,119,0,31,248,83,168,1,152]},"announce":[],"urlList":[]}}