{"title":"The Terrorist's Dilemma - Jacob N. Shapiro","uid":15617763,"size":1583262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cf4294c8724ea02f3ec3e70c26dc079bbcc9de8&amp;dn=The+Terrorist%27s+Dilemma+-+Jacob+N.+Shapiro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"mr_mando","files":2,"time":1471848630,"description":"How do terrorist groups control their members? Do the tools groups use to monitor their operatives and enforce discipline create security vulnerabilities that governments can exploit? \r\n\r\nThe Terrorist's Dilemma is the first book to systematically examine the great variation in how terrorist groups are structured. Employing a broad range of agency theory, historical case studies, and terrorists' own internal documents, Jacob Shapiro provocatively discusses the core managerial challenges that terrorists face and illustrates how their political goals interact with the operational environment to push them to organize in particular ways.\r\n\r\nShapiro provides a historically informed explanation for why some groups have little hierarchy, while others resemble miniature firms, complete with line charts and written disciplinary codes. Looking at groups in Africa, Asia, Europe, and North America, he highlights how consistent and widespread the terrorist's dilemma--balancing the desire to maintain control with the need for secrecy--has been since the 1880s. Through an analysis of more than a hundred terrorist autobiographies he shows how prevalent bureaucracy has been, and he utilizes a cache of internal documents from al-Qa'ida in Iraq to outline why this deadly group used so much paperwork to handle its people. Tracing the strategic interaction between terrorist leaders and their operatives, Shapiro closes with a series of comparative case studies, indicating that the differences in how groups in the same conflict approach their dilemmas are consistent with an agency theory perspective.\r\n\r\nThe Terrorist's Dilemma demonstrates the management constraints inherent to terrorist groups and sheds light on specific organizational details that can be exploited to more efficiently combat terrorist activity","torrent":{"xt":"urn:btih:2cf4294c8724ea02f3ec3e70c26dc079bbcc9de8","amp;dn":"The+Terrorist%27s+Dilemma+-+Jacob+N.+Shapiro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf4294c8724ea02f3ec3e70c26dc079bbcc9de8","infoHashBuffer":{"type":"Buffer","data":[44,244,41,76,135,36,234,2,243,236,62,112,194,109,192,121,187,204,157,232]},"announce":[],"urlList":[]}}