{"title":"[DvdRip-Xvid-Ita-AC3]Harry Potter E Il Prigioniero Di Azkaban[su","uid":5113807,"size":1467498496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2cfc2ba0041164f935bc4caff46c41c7d023568a&amp;dn=%5BDvdRip-Xvid-Ita-AC3%5DHarry+Potter+E+Il+Prigioniero+Di+Azkaban%5Bsu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"mitimex","files":2,"time":1254952638,"description":"\n\nHarry Potter torna a Hogwarts e si riunisce agli amici Ron Weasley e Hermione Granger. Hagrid ÃƒÂ¨ diventato l'insegnante di Cura delle creature magiche mentre il nuovo professore di Difesa contro le Arti Oscure ÃƒÂ¨ Remus Lupin. Durante l'arrivo a scuola, Harry viene a sapere dell'evasione di Sirius Black dalla prigione di Azkaban e scopre inoltre che ÃƒÂ¨ coinvolto nella morte dei suoi genitori. La scuola viene messa sotto stretta sorveglianza, dato che si crede che Black si stia recando ad Hogwarts, probabilmente per finire il lavoro e uccidere lo stesso Harry. Inoltre il ragazzo ÃƒÂ¨ preso di mira dai Dissenatori, le guardie carcerarie di Azkaban che dovrebbero proteggere la scuola ma che in realtÃƒÂ  creano solo problemi. Hagrid rischia il licenziamento quando una delle sue creature, Fierobecco, un ippogrifo, ferisce Draco Malfoy. Seguendo il topo di Ron, Crosta, i ragazzi scoprono che l'animale ÃƒÂ¨ in realtÃƒÂ  Peter Minus, un tempo amico dei Potter -era uno dei quattro malandrini- che dopo essersi alleato con Lord Voldemort li tradisce per paura e vengono cosÃƒÂ¬ assassinati. Inoltre Harry, Ron e Hermione scoprono che Lupin ÃƒÂ¨ un lupo mannaro, che Sirius ÃƒÂ¨ un suo vecchio amico e che in realtÃƒÂ  non ÃƒÂ¨ stato Sirius a tradire i genitori di Harry. Mentre cercano di catturare Minus per svelare la veritÃƒÂ , Lupin subisce la trasformazione in lupo mannaro e si azzuffa con Sirius che rimane ferito gravemente. Mentre Harry prova a soccorrerlo, vengono raggiunti dai Dissennatori che cercano di ucciderli ma l'intervento di un Incanto Patronus li salva entrambi. Minus riesce a scappare e Sirius viene rinchiuso nella torre di Hogwarts in attesa di essere di nuovo trasferito ad Azkaban. Harry ed Hermione cercano di rimettere tutto a posto grazie all'intervento di Silente che suggerisce ad Hermione di usare il suo giratempo oggetto magico con il quale la ragazza era riuscita a frequentare piÃƒÂ¹ lezioni contemporaneamente. I due ragazzi rivivono le ultime ore riuscendo cosÃƒÂ¬ salvare la situazione, salvando anche Hagrid dal licenziamento e Fierobecco dalla condanna a morte che pendeva su di lui dopo l'aggressione a Draco Malfoy. Riescono infine a far scappare Sirius che si allontana in groppa all'ippogrifo, divenendo da quel momento un ricercato latitante.\n","torrent":{"xt":"urn:btih:2cfc2ba0041164f935bc4caff46c41c7d023568a","amp;dn":"%5BDvdRip-Xvid-Ita-AC3%5DHarry+Potter+E+Il+Prigioniero+Di+Azkaban%5Bsu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cfc2ba0041164f935bc4caff46c41c7d023568a","infoHashBuffer":{"type":"Buffer","data":[44,252,43,160,4,17,100,249,53,188,76,175,244,108,65,199,208,35,86,138]},"announce":[],"urlList":[]}}