{"title":"Something Corporate - Discography (2001-2010) [FLAC]","uid":8366518,"size":2312595466,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d063a01ff356f34331701f1669db00ffb9784cb&amp;dn=Something+Corporate+-+Discography+%282001-2010%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"politux","files":-1,"time":1365784939,"description":"\n  Something Corporate - Discography (2001-2010) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock, Emo, Punk-Pop\n  Source: CD\n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps \n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n \n  2001 Ready...Break\n  2002 Leaving Through the Window (UK bonus)\n  2003 North\n  2003 Songs for Silent Movies\n  2003 Filmore Theater November 5, 2003\n  2010 Played in Space (2 Disc)\n\n  Of the myriad young alt-rock bands to arise in the early 2000s, Something Corporate stood out with their piano-fueled songcraft and crossover potential. On one hand, the bandmembers were barely out of high school when Drive-Thru Records signed them, which helped Something Corporate connect with a large audience of West Coast teenage hipsters looking for a band to claim as their own. On the other hand, the band didn't play punk rock; they played polished, literate, radio-ready alt-rock -- a marketable sound that MCA recognized just before connecting with the band for a debut EP, Audioboxer. Released in late 2001, Audioboxer featured only six songs yet showcased the band's promise as it synthesized alt-rock guitar crunch with a bit of impassioned, emo-styled songwriting. It also didn't hurt that the band boasted a bona fide poster boy in songwriter/pianist/vocalist Andrew McMahon, a blossoming talent who would later launch his own act, Jack's Mannequin.\n\n  Before the Orange County band became Something Corporate, McMahon, drummer Brian Ireland, and bassist Clutch played in a different ground that they'd formed for a high-school &quot;battle of the bands&quot; competition. Although they won the battle, the band didn't last very long. McMahon then met guitarist Josh Partington at a high-school party; with a renewed sense of enthusiasm, the teens started jamming together as Something Corporate. They soon added guitarist William Tell and began playing local clubs, which eventually lead to one-off gigs opening for bands like Sugar Ray and Better Than Ezra.\n\n  Drive-Thru noticed the buzz and came knocking. Even though the label was known primarily as a youth punk label -- and Something Corporate were far from that -- the partnership made sense; Drive-Thru recognized the band's potential as a crossover act and Something Corporate recognized the label's reputation as a respected indie. MCA then came into the picture primarily as a distributor, though the major label did use its clout to market the band. Their summer-tinged debut album, Leaving Through the Window, shared both label's logos and appeared in spring 2002. Subsequent touring followed before the group's somewhat darker sophomore effort, North, was issued in October 2003.\n\n  Guitarist William Tell amicably left the group in early 2004 to work on solo material, shortly before Something Corporate headed out on a nationwide co-headlining tour with Yellowcard. Bob Anderson (formerly of River City High) replaced Tell on the tour, allowing the band to replicate many of the album's vocal harmonies in a live setting. A concert DVD entitled Live at the Ventura Theater was released in November 2004, featuring the band's revised lineup.\n\n  A hiatus followed, during which McMahon returned to California and launched his solo project, Jack's Mannequin. The first Mannequin record came out in mid-2005, but a supporting tour was canceled after McMahon was diagnosed with acute lymphoblastic leukemia in June. He went through treatment; by the year's end, he had recovered from a successful bone marrow transplant from his sister. McMahon then turned his full attention to the Jack's Mannequin project, whose debut album, Everything in Transit, had broken into the Billboard Top 40. Another Jack's Mannequin album arrived in 2008, leaving Something Corporate's future undecided, although the band did return in 2010 with a brief reunion tour.","torrent":{"xt":"urn:btih:2d063a01ff356f34331701f1669db00ffb9784cb","amp;dn":"Something+Corporate+-+Discography+%282001-2010%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d063a01ff356f34331701f1669db00ffb9784cb","infoHashBuffer":{"type":"Buffer","data":[45,6,58,1,255,53,111,52,51,23,1,241,102,157,176,15,251,151,132,203]},"announce":[],"urlList":[]}}