{"title":"T. Carmi, ed. - The Penguin Book of Hebrew Verse","uid":10558271,"size":29822228,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2d9f0e83cb971f5320fdf9e1bde78c7e12a82f65&amp;dn=T.+Carmi%2C+ed.+-+The+Penguin+Book+of+Hebrew+Verse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1405383612,"description":"\nThe Penguin Book of Hebrew Verse (Viking, 1981 / Penguin Classics, 2006).  Hebrew-English bilingual edition.  Translated and edited by T. Carmi.\n\nISBN: 9780140424676 | 608 pages | PDF\n\n\nThis unique chronological anthology gathers together the riches of Hebrew poetry from &quot;The Song of Deborah&quot; to contemporary Israeli writings.  Verse written up to the tenth century show the development of &quot;piyut&quot;, or liturgical poetry, and retell episodes from the Bible and exalt the glory of God.  Medieval works introduce secular ideas in love poems, wine songs and rhymed narratives, as well as devotional verse for specific religious rituals.  Themes such as the longing for the homeland run through the ages, especially in verse written after the rise of the Zionist movement, while poems of the last century marry Biblical references with the horrors of the Holocaust.\n\nEdited and translated by the Israeli poet T. Carmi (1925-1994), this selection was the first of its kind produced in either English or Hebrew.  It features the original Hebrew version of each poem next to its English translation, and includes a lengthy historical introduction, bibliography, glossary, and indexes.\n\nTHE PENGUIN BOOK OF HEBREW VERSE is an excellent introduction to a rich and varied culture spanning 3,000 years.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                         &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:2d9f0e83cb971f5320fdf9e1bde78c7e12a82f65","amp;dn":"T.+Carmi%2C+ed.+-+The+Penguin+Book+of+Hebrew+Verse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d9f0e83cb971f5320fdf9e1bde78c7e12a82f65","infoHashBuffer":{"type":"Buffer","data":[45,159,14,131,203,151,31,83,32,253,249,225,189,231,140,126,18,168,47,101]},"announce":[],"urlList":[]}}