{"title":"Plympton - I Married a Strange Person! - vost FR - 1997","uid":4847995,"size":733395161,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e090bd58c9874f8e6022acd92e6262e0be03eab&amp;dn=Plympton+-+I+Married+a+Strange+Person%21+-+vost+FR+-+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ibookmac","files":1,"time":1239759809,"description":"\nFrom The New Yorker\nBill Plympton's special brand of dementia-faces imploding, elongated tongues wrapping around heads, cigarettes being smoked from every orifice-has been a staple of animation festivals for the past ten years. Here he stretches out to feature length, and the results are mixed. The plot kicks off with a freak accident involving orgasmic birds, a satellite dish, and a guy named Grant, who suddenly gains the power to make his every weird thought take shape; in other words, he turns into an animator. A battle with a power-mad television mogul ensues, and it's not very interesting. But along the way, the Plympton trademarks-fine drawing, unexpected perspectives, inspired perversions bursting through a civilized veneer-are on gross, glorious view. There's a great sequence in which Grant and his wife are having sex, and their house and everything in it-the flower and the vase, the comb and the brush, the wing tip and the pump-get it on in sybaritic sympathy. -Ken Marks\nCopyright Ã‚Â© 2006 The New Yorker\n\n=====\n\nL'impitoyable lune de miel\t\n\t\nDeux oiseaux decident de s'accoupler sur le toit de la maison de Grant et Kerry Boyer, un couple de jeunes maries. Ils envoient d'etranges radiations sur la partie inferieure du cerveau de Grant qui regardait la television. Un lobe apparait sur sa nuque, qui lui donne le pouvoir de transformer ses desirs en realite. Mais il s'avere que c'est le debut de ses problemes et non la fin. Grant devra faire preuve de beaucoup d'imagination pour echapper a l'appetit vorace de ceux qui veulent lui derober son lobe pour des raisons peu avouables.\n &lt;a href=&quot;\nhttp://www.allocine.fr/film/fichefilm_gen_cfilm=18903.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allocine.fr/film/fichefilm_gen_cfilm=18903.html&lt;/a&gt;","torrent":{"xt":"urn:btih:2e090bd58c9874f8e6022acd92e6262e0be03eab","amp;dn":"Plympton+-+I+Married+a+Strange+Person%21+-+vost+FR+-+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e090bd58c9874f8e6022acd92e6262e0be03eab","infoHashBuffer":{"type":"Buffer","data":[46,9,11,213,140,152,116,248,230,2,42,205,146,230,38,46,11,224,62,171]},"announce":[],"urlList":[]}}