{"title":"East Vs. West: A Hearts of Iron Game","uid":10583842,"size":716346407,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2e35f104e766f3dbd23957ff09d85ca506d65b7c&amp;dn=East+Vs.+West%3A+A+Hearts+of+Iron+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"TsarBomba88","files":1,"time":1405724540,"description":"Yes, this is the game. It was leaked about a month ago on 4chan, I figured since nobody else has uploaded it here to share with you guys, I would.\n\nEast vs. West, like many of its predecessors in the Hearts of Iron series, would have allowed for the player to take control of and manage a country including its political, diplomatic, espionage, economic, military, and technological aspects. In contrast to previous installments in the Hearts of Iron series, the game was to be set in the Cold War Era, and not focus mainly on large-scale warfare. The use of nuclear weapons in game would have been possible, but limited by a nation's state of emergency.\n\nConfirmed features included:\n\nNew espionage system utilizing &quot;spy cards&quot; \nAn extended political module. \nA Doomsday Clock indicating how close the in game world is to total destruction.\nThe presence of the United Nations to intervene in global events.\nThe ability to customize ships. \nNuclear arms race and warfare is expanded by a nuclear mapmode, uranium as a resource, factories (centrifuges) to produce enriched fission material, ICBMs that can be launched from silos, nuclear submarines and a red button. \nThe game was scheduled to retain many features included in Hearts of Iron III, such as control over the armed forces, the strategic warfare system, user mods-friendliness, and a multiplayer system with up to 32 players\n\n\nI have tested it and it does work. I have yet to experience a crash or anything of the sort but I'm sure some people might, due to it being so early in DEV, and barely finished(probably the reason for cancellation). Anywho, just unrar and play via EvW. \n\n\nIf you guys like it, BUY A PARADOX GAME. They're a great company and many of their games go on sale quite a bit on steam, they also have nonsteam options. They have a great fanbase. SUPPORT EM' AND SEED. ","torrent":{"xt":"urn:btih:2e35f104e766f3dbd23957ff09d85ca506d65b7c","amp;dn":"East+Vs.+West%3A+A+Hearts+of+Iron+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e35f104e766f3dbd23957ff09d85ca506d65b7c","infoHashBuffer":{"type":"Buffer","data":[46,53,241,4,231,102,243,219,210,57,87,255,9,216,92,165,6,214,91,124]},"announce":[],"urlList":[]}}