{"title":"The Mammoth Book of Historical Whodunnits - Mike Ashley","uid":11963602,"size":2059603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e40e5363c45027b5935dba75d12363fcc24cb49&amp;dn=The+Mammoth+Book+of+Historical+Whodunnits+-+Mike+Ashley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":9,"time":1432609633,"description":"The Mammoth Book of Historical Whodunnits Volume 1 - Mike Ashley\n\n\n\nDivided into three main sections, &quot;The Ancient World&quot;, &quot;The Middle Ages&quot; and &quot;Regency and Gaslight&quot;, The Mammoth Book of Historical Whodunnits includes:\n\n? The Thief versus Rhampsinitus by Herodotus - probably the earliest detective story ever written.\n\n? The Locked Tomb Mystery, set in ancient Egypt, by Elizabeth Peters.\n\n? A new story by John Maddox Roberts featuring the young Roman detective Decius Metellus.\n\n? Robert van Gulik's ingenious He Came With the Rain featuring Judge Dee, a real-life character who lived inseventh-century China.\n\n? A new story by Peter Tremayne, set in seventh-century Ireland and featuring Sister Fidelma.\n\n? Ellis Peters' Brother Cadfael story The Price of Light.\n\n? Paul Harding's The Confession of Brother Athelstan.\n\n? A classic locked-room mystery featuring Lillian de la Torre's popular detective Sam Johnson.\n\n? A story by Michael Harrison featuring August Dupin, the detective created by Edgar Allan Poe and the inspiration behind Sherlock Holmes.\n\n? John Dickson Carr's acclaimed The Gentleman from Paris.\n\n...and many more!\n\nThe Mammoth Book of Historical Whodunnits Volume 2 - Mike Ashley\n\n\n\nAn all-new collection of exciting murder-mysteries with historical settings\n\nThis new volume of historical murder and mystery contains over 20 specially commissioned stories ranging in period from Ancient Rome to the reign of Good Queen Bess. It features original stories from such masters as Steven Saylor, Peter Tremayne, Philip Gooden, Susanna Gregory, Kate Ellis, Michael Jecks, Edward D. Hoch and Marilyn Todd.\n\n? In Steven Saylor's Roman tale, Poppy and the Poisoned Cake, Gordianus the Finder feels his latest assignment is suspiciously easy to solve.\n\n? Edward D. Hoch puts a novel twist on the locked-room mystery by setting it on a &quot;locked ship&quot; - Christopher Columbus's, in fact!\n\n? In Flibbertigibbet Paul Finch unleashes a deranged serial killer on Elizabethan London.\n\n? Falstaff 's successor Sir Johan de Mandeville turns sleuth in Keith Taylor's Bene?t of Clergy.\n\n? Sister Fidelma must solve the mystery of a murdered Celtic monk in Death of an Icon by Peter Tremayne.\n\n? A pig provides the key to Michael Jecks's latest Sir Baldwin mystery.-\n\n? Cherith Baldry turns Geoffrey Chaucer into a secret agent in her version of The Pilgrim's Tale.\n\n? Anarchy and murderous intent rule when the Romans leave the British Isles in Richard Butler's The Last Legion.\n\n. . . plus many more tales of dark age murder and mayhem!\n\nThe Mammoth Book of Historical Whodunnits Volume 3 - Mike Ashley\n\n\n\nThe third new collection of historical murder and mystery stories A brilliant new collection of thirty stories of mystery and intrigue spread over three thousand years, from Ancient Egypt to spies on the Titanic. Selected by bestselling editor Mike Ashley, the stories include brand new contributions as well as rare reprints, from writers such as Ian Rankin, Lynda Robinson, Sharan Newman, Gail Frazer, Gillian Linscott and Peter Tremayne. Among the characters featured are the Queen of Sheba, Attila the Hun, Hildegarde of Bingen, Geoffrey Chaucer, Henry the Navigator and Benjamin Franklin. And with settings as far-ranging as Botany Bay and ancient Pisa, New Amsterdam and old Edinburgh, ancient Greece and the court of Kublai Khan","torrent":{"xt":"urn:btih:2e40e5363c45027b5935dba75d12363fcc24cb49","amp;dn":"The+Mammoth+Book+of+Historical+Whodunnits+-+Mike+Ashley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e40e5363c45027b5935dba75d12363fcc24cb49","infoHashBuffer":{"type":"Buffer","data":[46,64,229,54,60,69,2,123,89,53,219,167,93,18,54,63,204,36,203,73]},"announce":[],"urlList":[]}}