{"title":"XTC Singles Collection 77-92","uid":3280306,"size":188358667,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e4c736f2efc832c4d020fdbffc0766511af1424&amp;dn=XTC+Singles+Collection+77-92&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"KingStar","files":33,"time":1106353376,"description":"Fossil Fuel: The XTC Singles 1977-1992 is a splendid double-disc set that runs through every one of the group's 31 A-sides, from the nervy &quot;Science Friction&quot; to the lush, sighing &quot;Wrapped in Grey.&quot; Between those two songs, XTC's craftsmanship grows remarkably fast -- based on the edgy pop of their new wave singles &quot;Statue of Liberty,&quot; &quot;This Is Pop,&quot; &quot;Are You Receiving Me?,&quot; and &quot;Life Begins at the Hop,&quot; it's hard to believe that they would later write the subtle, near-pastoral Beatles, Kinks, and Beach Boys pastiches of &quot;Love on a Farmboy's Wages,&quot; &quot;Great Fire,&quot; and &quot;Grass.&quot; And those songs just scratch the surface of the terrific pop singles available on Fossil Fuel -- &quot;Making Plans for Nigel,&quot; &quot;Ten Feet Tall,&quot; &quot;Generals and Majors,&quot; &quot;Towers of London,&quot; &quot;Respectable Street,&quot; &quot;Sense Working Overtime,&quot; &quot;This World Over,&quot; &quot;Dear God,&quot; &quot;The Mayor of Simpleton,&quot; &quot;King for a Day,&quot; and &quot;The Ballad of Peter Pumpkinhead&quot; are wonderful songs and forgotten classics. Although XTC continually made carefully constructed albums, they were a dynamite singles band, releasing songs that were tightly constructed and impossibly catchy. They never had hits, because their unabashed pop was never in fashion; plus, Andy Partridge's voice was too pinched and his lyrics frequently too cerebral. But XTC's music stands as some of the best and most influential pop of their era, and nowhere is that more evident than on Fossil Fuel.","torrent":{"xt":"urn:btih:2e4c736f2efc832c4d020fdbffc0766511af1424","amp;dn":"XTC+Singles+Collection+77-92","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e4c736f2efc832c4d020fdbffc0766511af1424","infoHashBuffer":{"type":"Buffer","data":[46,76,115,111,46,252,131,44,77,2,15,219,255,192,118,101,17,175,20,36]},"announce":[],"urlList":[]}}