{"title":"Jim Marrs - Above Top Secret - Uncover the Mysteries of the Digi","uid":15477387,"size":3154183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e4d92663d8bf6a2c3f2abfb86ad360d8bb4c193&amp;dn=Jim+Marrs+-+Above+Top+Secret+-+Uncover+the+Mysteries+of+the+Digi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"roflcopter2110","files":1,"time":1470201497,"description":"https://extraimago.com/images/2016/08/03/2f98791797766a61abb09f97b6012b45-d.jpg\r\n\r\nJim Marrs - Above Top Secret - Uncover the Mysteries of the Digital Age 2008\r\n\r\nJim Marrs can justifiably be considered the world's leading conspiracy author, with multimillion bestsellers like Alien Agenda, Rule by Secrecy, and the book that Oliver Stone used as a basis for his JFK movie, Crossfire: The Plot That Killed Kennedy.\r\n\r\nNow Marrs has allied with the web's most popular conspiracy forum to investigate everything from chemtrails to the Nazis' Antarctic base, moon landing hoaxes to UFOs, God as an alien to the end of the world in 2012.\r\n\r\nAboveTopSecret is the Internet's largest and most popular discussion board community, with more than twelve million page views per month. It is dedicated to the intelligent exchange of ideas and debate on a wide range of &quot;alternative topics&quot; such as conspiracies, UFOs, paranormal, secret societies, political scandals, new world order, terrorism, and dozens of related topics. AboveTopSecret's popular podcast is downloaded tens of millions of times per month.\r\n\r\nMarrs brings his rigorous journalist's credentials to bear on these topics and more, asking (and often answering) the essential who, what, when, where, why, and how questions in compelling, page-turning fashion","torrent":{"xt":"urn:btih:2e4d92663d8bf6a2c3f2abfb86ad360d8bb4c193","amp;dn":"Jim+Marrs+-+Above+Top+Secret+-+Uncover+the+Mysteries+of+the+Digi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e4d92663d8bf6a2c3f2abfb86ad360d8bb4c193","infoHashBuffer":{"type":"Buffer","data":[46,77,146,102,61,139,246,162,195,242,171,251,134,173,54,13,139,180,193,147]},"announce":[],"urlList":[]}}