{"title":"Anatomy for Runners: Unlocking Your Athletic Potential for Healt","uid":8597023,"size":16058084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e6021ea66a9f677ce6bb5a00868d1130b0b6cf5&amp;dn=Anatomy+for+Runners%3A+Unlocking+Your+Athletic+Potential+for+Healt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1371778849,"description":"Jay Dicharry, &quot;Anatomy for Runners: Unlocking Your Athletic Potential for Health, Speed, and Injury Prevention&quot;\nISBN: 1620871599 | 2012 | EPUB | 320 pages | 15 MB\n\nRunning has become more and more popular in recent years, with thousands of people entering marathons, buying new running shoes with the latest technology, and going for a daily jog, whether on the track or on a treadmill. Unfortunately, with running comes injuries, as a result of wrong information and improper training.\n\nAuthor Jay Dicharry was tired of getting the same treatments from doctors that didn't heal his joint and muscle pain from running, so he decided to combine different fields of clinical care, biomechanical analysis, and coaching to help you avoid common injuries and become the best runner you can be. Along with clear and thorough explanations of how running influences the body, and how the body influences your running, this book answers many of the common questions that athletes have: Do runners need to stretch? What is the best way to run? What causes injuries? Which shoes are best for running? Is running barefoot beneficial? The mobility and stability tests will assess your form, and the corrective exercises, along with step-by-step photos, will improve your core and overall performance, so that you can train and run with confidence, knowing how to avoid injuries!\n","torrent":{"xt":"urn:btih:2e6021ea66a9f677ce6bb5a00868d1130b0b6cf5","amp;dn":"Anatomy+for+Runners%3A+Unlocking+Your+Athletic+Potential+for+Healt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e6021ea66a9f677ce6bb5a00868d1130b0b6cf5","infoHashBuffer":{"type":"Buffer","data":[46,96,33,234,102,169,246,119,206,107,181,160,8,104,209,19,11,11,108,245]},"announce":[],"urlList":[]}}