{"title":"The Woman in Black - Susan Hill","uid":7825832,"size":524828,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e96c24a4c8f628f293e62ada9eb7f467b8a830d&amp;dn=The+Woman+in+Black+-+Susan+Hill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"acidr0p","files":2,"time":1352924965,"description":"What real reader does not yearn, somewhere in the recesses of his or her heart, for a really literate, first-class thriller: one that chills the body with foreboding of dark deeds to come, but warms the soul with perceptions and language at once astute and vivid? In other words, a ghost story by Jane Austen.\nAusten we cannot, alas, give you, but Susan Hill's remarkable Woman In Black comes as close as the late twentieth century is likely to provide. Set on the obligatory English moor, on an isolated causeway, the story's hero is Arthur Kipps, an up-and-coming young solicitor who has come north to attend the funeral and settle the estate of Mrs. Alice Drablow of Eel Marsh House. The routine formalities he anticipates give way to a tumble of events and secrets more sinister and terrifying than any nightmare: the rocking chair in the nursery of the deserted Eel Marsh House, the eerie sound of pony and trap, a child's scream in the fog, and, most dreadfully, and for Kipps most tragically, the woman in black.\n\nThe Woman In Black is both a brilliant exercise in atmosphere and controlled horror and a delicious spine-tingler-proof positive that that neglected genre, the ghost story, isn't dead after all.","torrent":{"xt":"urn:btih:2e96c24a4c8f628f293e62ada9eb7f467b8a830d","amp;dn":"The+Woman+in+Black+-+Susan+Hill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e96c24a4c8f628f293e62ada9eb7f467b8a830d","infoHashBuffer":{"type":"Buffer","data":[46,150,194,74,76,143,98,143,41,62,98,173,169,235,127,70,123,138,131,13]},"announce":[],"urlList":[]}}