{"title":"Bruce Schneier - Cryptography Engineering .djvu","uid":5638549,"size":5359703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2f26b6f55d72b5df68cd649303e03804c91edb1f&amp;dn=Bruce+Schneier+-+Cryptography+Engineering+.djvu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"ivap38","files":-1,"time":1276986260,"description":"Cryptography Engineering (300dpi, OCR)\n\nNiels Ferguson, Bruce Schneier, and Tadayoshi Kohno\n\nJohn Wiley &amp; Sons, March 15, 2010\nISBN: 9780470474242\n\nLearn to build cryptographic protocols that work in the real world\n\nKnowing how a camera works does not make you a great photographer. Knowing what cryptographic designs are and how existing cryptographic protocols work does not give you proficiency in using cryptography. You must learn to think like a cryptographer.\n\nThat is what this book will teach you. Dive deeply into specific, concrete cryptographic protocols and learn why certain decisions were made. Recognize the challenges and how to overcome them. With this book, which is suitable for both classroom and self-study, you will learn to use cryptography effectively in real-world systems.\n\n    * Understand what goes into designing cryptographic protocols\n    * Develop an understanding of the interface between cryptography and the surrounding system, including people, economics, hardware, software, ethics, policy, and other aspects of the real world\n    * Look beyond the security protocol to see weaknesses in the surrounding system\n    * Thwart the adversary by understanding how adversaries think\n    * Learn how to build cryptography into new products \n\nNiels Ferguson is a cryptographer for Microsoft who has designed and implemented cryptographic algorithms,protocols, and large-scale security infrastructures. Bruce Schneier is an internationally renowned security technologist whose advice is sought by business, government, and the media. He is the author of Applied Cryptography, Secrets and Lies, and Schneier on Security. Tadayoshi Kohno is a professor at the University of Washington. He is known for his research and for developing innovative new approaches to cryptography and computer security education.\n\nA fully updated version of the bestselling Practical Cryptography.","torrent":{"xt":"urn:btih:2f26b6f55d72b5df68cd649303e03804c91edb1f","amp;dn":"Bruce+Schneier+-+Cryptography+Engineering+.djvu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f26b6f55d72b5df68cd649303e03804c91edb1f","infoHashBuffer":{"type":"Buffer","data":[47,38,182,245,93,114,181,223,104,205,100,147,3,224,56,4,201,30,219,31]},"announce":[],"urlList":[]}}