{"title":"Hardtied--Bush Barrel  Roxanne Rae High","uid":15543010,"size":3113469467,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:2f9832a9110fc4a82d672ad9ec31526d0f8ce52a&amp;dn=Hardtied--Bush+Barrel++Roxanne+Rae+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"merzedes","files":1,"time":1470938997,"description":"\nBush Barrel | Roxanne Rae \r\n\r\nAugust 10, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nSubmissive Begs to Cum and Gets More Than She Bargained For \r\n \r\nRoxanne Rae isn't sure how she ended up where she is, bound in rope hanging from the ceiling as a strange man plays with her body. More than that, she can't tell if she likes it or not. He toys with and bites her long hair and runs his hands along her curves. He runs a crotch rope through her legs, then, when he realizes he can't reach every inch of her body he wants to touch, he cuts off her panties. Roxanne is scared but excited. While she moves away when he goes to bite her hair and tickle her, the little moans and sighs she lets out when he slaps her tits and touches her pussy give away the fact that she's having at least a little fun.\r\n\r\nRoxanne thinks she is getting as rough a treatment as she can get having O.T. play with her but not get her off. She whines and wails as she is tied to the ceiling with one leg raised and has a hitachi placed squarely on her clit. She begs him to let her cum but every time she comes close he pulls the vibrator away. She should be more careful with what she wishes for.\r\n\r\nO.T. moves her and ties her up so that her legs and her ass are spread and he can give Roxanne what she has been begging for. This time he uses the celebrator to vibrate her pussy since it's smaller and can be more directly applied to her clit. Then he sticks a metal pussy hook inside her and fucks her so that she cums over and over again. He has her arching backward screaming in ecstasy. She is so thoroughly used by the end that she can barely form words.  \r\n \r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=08_10rrae&amp;u=Hardtied-Roxanne-Rae-Bush-Barrel\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:2f9832a9110fc4a82d672ad9ec31526d0f8ce52a","amp;dn":"Hardtied--Bush+Barrel++Roxanne+Rae+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f9832a9110fc4a82d672ad9ec31526d0f8ce52a","infoHashBuffer":{"type":"Buffer","data":[47,152,50,169,17,15,196,168,45,103,42,217,236,49,82,109,15,140,229,42]},"announce":[],"urlList":[]}}