{"title":"Complete Pimsleur Korean I + II","uid":4961015,"size":815013573,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2fe8cb4b2749c0cd48adc7190bb39f915f3646f2&amp;dn=Complete+Pimsleur+Korean+I+%2B+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"faitswulff","files":62,"time":1245310600,"description":"Comprehensive Korean includes 30 lessons of essential grammar and vocabulary -- 16 hours of real-life spoken practice sessions -- plus an introduction to reading.\n\nUpon completion of this Level I program, you will have functional spoken proficiency with the most-frequently-used vocabulary and grammatical structures. You will be able to:\n\n* initiate and maintain face-to-face conversations,\n\n* deal with every day situations -- ask for information, directions, and give basic information about yourself and family,\n\n* communicate basic information on informal topics and participate in casual conversations,\n\n* avoid basic cultural errors and handle minimum courtesy and travel requirements,\n\n* satisfy personal needs and limited social demands,\n\n* establish rapport with strangers in foreign countries,\n\n* begin reading and sounding out items with native-like pronunciation. \n\nComprehensive Korean II includes 30 additional lessons (16 hrs.), plus Readings, which build upon the language skills acquired in Level I. Increased spoken and reading language ability.\n\nLevel II will double your vocabulary and grammatical structures while increasing your spoken proficiency exponentially. Upon completion of a Level II, you will be able to:\n\n* engage in fuller conversations involving yourself, your family, daily activities, interests and personal preferences,\n\n* combine known elements into increasingly longer sentences and strings of sentences,\n\n* create with language and function in informal situations,\n\n* deal with concrete topics in the past, present, and future,\n\n* meet social demands and limited job requirements,\n\n* begin reading for meaning.\n\n\n\nNOTE:  The reading materials are not included.  However, a vast majority of the lessons don't use them.","torrent":{"xt":"urn:btih:2fe8cb4b2749c0cd48adc7190bb39f915f3646f2","amp;dn":"Complete+Pimsleur+Korean+I+%2B+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fe8cb4b2749c0cd48adc7190bb39f915f3646f2","infoHashBuffer":{"type":"Buffer","data":[47,232,203,75,39,73,192,205,72,173,199,25,11,179,159,145,95,54,70,242]},"announce":[],"urlList":[]}}