{"title":"Dusan Makavejev - Sweet Movie (1974)","uid":3539247,"size":734939136,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3073ac141c1bab020ff1298bb2784ca26d08fc2f&amp;dn=Dusan+Makavejev+-+Sweet+Movie+%281974%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"kegir","files":1,"time":1160852918,"description":"English Title: Sweet Movie\nDirector: Dusan Makavejev\nYear: 1974\nLanguage: English, French\nSubtitles: English (hardsubs)\nSourse: VHS (quality is OK and this film is not avalible on DVD)\n\nFile Name .............: Sweet Movie - Dusan Makavejev.avi\nFile Size (in bytes) ..: 734,939,136 bytes\nRuntime (# of frames) .: 01:37:44 (140585 frames)\n\nVideo Codec ...........: DivX 5.0\nFrame Size ............: 640x480 () [=] [=1.333]\nFPS ...................: 23.976\nVideo Bitrate .........: 860 kb/s\nBits per Pixel ........: 0.117 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[N-VOP]...[]...[GMC]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 134 kb/s [2 channel(s)] VBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\n\nPlot Synopsis from allmovie.com\n\nLike his WR: Mysteries of the Organism, Dusan Makavejev\\&amp;#039;s controversial 1974 feature Sweet Movie is firmly rooted in the principles of psychoanalyst Wilhelm Reich. In cinematic terms, this means bombarding the audience with an onset of imagery so visceral, disgusting and repellent that it \\&quot;awakens\\&quot; the viewer in a Brechtian manner by \\&quot;short-circuiting\\&quot; the audience\\&amp;#039;s reactions. Sweet Movie interweaves two narratives. One begins with a trip to the \\&quot;Miss World Virginity Contest,\\&quot; whose winner, Miss Monde 1984 (Carole Laure) is auctioned off to Mr. Kapital (Animal House\\&amp;#039;s John Vernon), a Texas oil billionaire with an odd perversion. Instead of deflowering her on her wedding night, he sterilizes the terrified girl\\&amp;#039;s body with rubbing alcohol and showers her in urine with his massive gold-plated penis, while an audience watches bemusedly through his bedroom window. She later escapes from her bridegroom, in a suitcase, and winds up at a wild Viennese commune whose participants indulge in public defecation and a food orgy that wraps with a massive display of gurgling, yakking, and vomiting. At the tale\\&amp;#039;s conclusion, Miss Monde shoots a television commercial that involves writhing and masturbating in a giant vat of chocolate, with which she is completely drenched from head to toe, as the cameras roll. The second story involves a woman, Anna Planeta (Anna Prucnal) piloting a candy-filled boat down a river, with a massive papier-mache head of Lenin on the prow and a lover in-tow who is a refugee from the Battleship Potemkin. She eventually does a seductive striptease and seduces a pack of children, then makes love to her paramour in a vat of sugar and stabs him through the heart. Throughout the film, Makavejev includes shock cuts to Nazi autopsy footage and medical experimentation footage, some of which involves physical abuse of infants under the guise of \\&quot;baby gymnastics.\\&quot; Although it has its admirers, Sweet Movie is something of an acquired taste. And that\\&amp;#039;s putting it kindly.\n\nThanks to newda for the upload at KG\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\nwww.freakyflicks.tk\n\n\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\&amp;#039;\n","torrent":{"xt":"urn:btih:3073ac141c1bab020ff1298bb2784ca26d08fc2f","amp;dn":"Dusan+Makavejev+-+Sweet+Movie+%281974%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3073ac141c1bab020ff1298bb2784ca26d08fc2f","infoHashBuffer":{"type":"Buffer","data":[48,115,172,20,28,27,171,2,15,241,41,139,178,120,76,162,109,8,252,47]},"announce":[],"urlList":[]}}