{"title":"The Hempcrete Book: Designing and Building with Hemp-Lime - Will","uid":11431696,"size":34963617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30b74efda312d149f9f9b42ca60f87b1e35a912e&amp;dn=The+Hempcrete+Book%3A+Designing+and+Building+with+Hemp-Lime+-+Will&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"MANTESH","files":-1,"time":1415729142,"description":"\nThe Hempcrete Book: Designing and Building with Hemp-Lime\n\nPublisher: Green Books; First edition\nWilliam Stanwix and Alex Sparrow\nLanguage: English\nISBN-10: 0857841203\nISBN-13: 978-0857841209\n2014 \n368 pages \nEPUB \n33 MB\n\n\nThe Hempcrete Book is a detailed practical manual for architects, surveyors, professional builders and self-builders. It explains how to source and mix hempcrete and how to use it in new builds and restoration. In colour throughout, fully illustrated with beautiful photographs, this book provides a full explanation of construction techniques, highlighting potential pitfalls and how to avoid them. It includes a comprehensive resources section and examples of completed builds, with design notes. Hempcrete is a building material with excellent properties. It's made from lime and hemp shivs (a waste product from hemp fibre growing) and can be used for walls, floors, and for roof insulation. Hempcrete is breathable, absorbing and emitting moisture; this helps regulate internal humidity, avoiding trapped moisture and mould growth, and creating healthier buildings. It provides excellent acoustic and thermal insulation and thermal mass. It's light-weight, reducing construction costs, and it's environmentally friendly: it locks up CO2 for the life of the building, and the hemp doesn't require agrochemicals or insecticides in its cultivation. The Hempcrete Book is a valuable tool for any eco-builder","torrent":{"xt":"urn:btih:30b74efda312d149f9f9b42ca60f87b1e35a912e","amp;dn":"The+Hempcrete+Book%3A+Designing+and+Building+with+Hemp-Lime+-+Will","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30b74efda312d149f9f9b42ca60f87b1e35a912e","infoHashBuffer":{"type":"Buffer","data":[48,183,78,253,163,18,209,73,249,249,180,44,166,15,135,177,227,90,145,46]},"announce":[],"urlList":[]}}