{"title":"Wii Party [PAL][Wii][Multi5][Spanish][www.consolasatope.com]","uid":5860497,"size":4699980130,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:30c36004409a7ef1a8ec0a529a36d10520f5c423&amp;dn=Wii+Party+%5BPAL%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"consolasatope","files":3,"time":1285948682,"description":"Plataforma: WII\nGÃƒÂ©nero: Minijuegos\nDesarrollo: Nintendo\nFormato: DVD Full\nVideo: PAL\nMandos Necesarios: Wiimote &amp; nunchak\nIdiomas: Multi-EspaÃƒÂ±ol incluido\nModificaciones: Ninguna-Release Oficial\nJuego Online: No\n\nResumen:\nLa mayorÃƒÂ­a de los videojuegos demanda la mÃƒÂ¡xima atenciÃƒÂ³n a la pantalla por parte de los jugadores. Ahora Nintendo la desplaza a la sala de estar con Wii Party, un tÃƒÂ­tulo que cambia radicalmente la forma en la que los jugadores interactÃƒÂºan entre sÃƒÂ­. Con 13 modos de fiesta diferentes y mÃƒÂ¡s de 70 minijuegos, Wii Party es un juego para toda la familia, tanto grandes como pequeÃƒÂ±os.\n\nCaracterÃƒÂ­sticas:\n\n* Algunos de los 13 modos distintos extienden la diversiÃƒÂ³n desde el televisor a la sala de estar. Los jugadores deben interactuar mutuamente en el mundo real para que los resultados deseados se reflejen en la partida. He aquÃƒÂ­ la dinÃƒÂ¡mica de algunos de los juegos:\n- Los jugadores colocan sobre una mesa cuatro mandos de Wii. Cada uno de estos emite un sonido de un animal diferente. GanarÃƒÂ¡ el primero que agarre el mando cuyo sonido se corresponda con el animal reflejado en la televisiÃƒÂ³n.\n- Jugar al escondite con los mandos de Wii. Mientras los demÃƒÂ¡s esperan fuera, uno de los jugadores se queda en la sala para esconder todos los mandos por la habitaciÃƒÂ³n. Cuando los demÃƒÂ¡s regresen, tienen que encontrarlos.\n* En Wii Party salen a escena los personajes Mii, que participarÃƒÂ¡n en minijuegos para un mÃƒÂ¡ximo de cuatro jugadores. Cada jugador usa ÃƒÂºnicamente el mando de Wii. Algunos de los modos de juego son cooperativos, tales como \\&quot;Balance Boat.\\&quot; Otros, en cambio, son de tinte competitivo, como \\&quot;Board Game Island\\&quot;.\n* En el modo Board Game Island, los jugadores ayudan a sus Miis a competir en mÃƒÂ¡s de 70 minijuegos diferentes:\n- Los personajes Mii se montan en una montaÃƒÂ±a rusa mientras los jugadores tratan de acertar a los globos flotantes con regalos en su interior.\n- Los jugadores emplean sus mandos de Wii para que los personajes Mii puedan jugar al corre que te pillo.","torrent":{"xt":"urn:btih:30c36004409a7ef1a8ec0a529a36d10520f5c423","amp;dn":"Wii+Party+%5BPAL%5D%5BWii%5D%5BMulti5%5D%5BSpanish%5D%5Bwww.consolasatope.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30c36004409a7ef1a8ec0a529a36d10520f5c423","infoHashBuffer":{"type":"Buffer","data":[48,195,96,4,64,154,126,241,168,236,10,82,154,54,209,5,32,245,196,35]},"announce":[],"urlList":[]}}