{"title":"FXhome PhotoKey 6 Pro 6.0.0021 (Win 64 bit) [ChingLiu]","uid":9553466,"size":120172488,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:30dd3065f4a3f3de2a68b530c100091feccaab87&amp;dn=FXhome+PhotoKey+6+Pro+6.0.0021+%28Win+64+bit%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Ching_Liu","files":-1,"time":1391309281,"description":"Portraits\n\nShooting portraits on a green screen is ideal for fashion, promotional and family photography. Keep your options open and give clients more choice.\n\nAdaptive color sampling - PhotoKey 6 Pro compensates for uneven green screens, which means faster shooting, easier keying and higher quality edge detail.\n\nSimplicity - PhotoKey removes the green screen instantly. You can then fine tune and choose a new background for your photo.\n\nQuality results - High quality photos of semi-transparent objects such as lace, glass and wispy hair create accurate results in PhotoKey 6 Pro.\n\nEvents\n\nTake the stress out of big events. PhotoKey 6 Pro handles the technical side so that you can focus on the photography.\n\nBatch processing - Choose your backgrounds, set up your canvas, then take your photographs. Hundreds of photos can be processed without requiring direct interaction with your computer.\n\nHot folder - Tether your camera to your computer and PhotoKey will begin processing your photos the moment you click the shutter.\n\n\nProducts\n\nIf you shoot products for catalogues or website stores, actors for movie posters or models for magazine advertisements, a clean subject layer keeps your options open and your clients happy.\n\nPhotoshop integration - Send a layer from Photoshop to PhotoKey for easy green screen removal, with the result sent straight back. No interruptions to your workflow.\n\nSuper fast processing - No more cutting people out manually or wrestling with the lasso tool. PhotoKey instantly prepares your images, ready for use in a catalogue or on a website.\n\nCreative\n\nPhotoKey is about more than just green screen removal. It's also packed with filters, effects and tools for creating original compositions.\n\nFilters &amp; effects - Blend your green screen photo into its new background and add additional elements such as shadows and depth of field.\n\nCombine layers - Incorporate extra graphical elements to create deep compositions or apply studio watermarks, captions and overlays.\n\nWindows system requirements\n\nOperating system: MicrosoftÂ® WindowsÂ® Vista (64-bit), 7 (64-bit), or 8 (64-bit) *\nProcessor: 1 GHz Intel Pentium 4 or AMD Athlon 64 **\nRAM: 1GB of RAM (2GB recommended)\nScreen resolution: 1024 x 768 in 32-bit color mode\nHard disk space: 165MB free disk space for program installation\nInternet connection: Access to the Internet is required to activate the software\nPhotoshop plug-in: Requires Adobe Photoshop CS5, CS6 or CC (64-bit only)\n\n* Please make sure you have the latest service packs from MicrosoftÂ® installed.\n** Intel 64-bit Itanium (IA64) enterprise class processors are NOT supported.\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://fxhome.com/photokey-6-pro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://fxhome.com/photokey-6-pro&lt;/a&gt;","torrent":{"xt":"urn:btih:30dd3065f4a3f3de2a68b530c100091feccaab87","amp;dn":"FXhome+PhotoKey+6+Pro+6.0.0021+%28Win+64+bit%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30dd3065f4a3f3de2a68b530c100091feccaab87","infoHashBuffer":{"type":"Buffer","data":[48,221,48,101,244,163,243,222,42,104,181,48,193,0,9,31,236,202,171,135]},"announce":[],"urlList":[]}}