{"title":"Adobe InDesign CS4 [EspaÃƒÂ±ol]","uid":4507828,"size":832242106,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:312f6066713f0ffe443c5cb090e3bfee6cecca3b&amp;dn=Adobe+InDesign+CS4+%5BEspa%C3%83%C2%B1ol%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mois20","files":1,"time":1226663044,"description":"DiseÃƒÂ±e composiciones profesionales para la ediciÃƒÂ³n digital e impresa\n\nEl software AdobeÃ‚Â® InDesignÃ‚Â® CS4 rompe las barreras que existen entre la ediciÃƒÂ³n en lÃƒÂ­nea y fuera de lÃƒÂ­nea. Cree atractivas composiciones para impresiÃƒÂ³n, contenido absorbente para la reproducciÃƒÂ³n en el tiempo de ejecuciÃƒÂ³n de Adobe FlashÃ‚Â® Player y documentos PDF interactivos.\n\nFunciones:\n\nComprobaciÃƒÂ³n preliminar interactiva Nuevo\nRealice la comprobaciÃƒÂ³n preliminar mientras diseÃƒÂ±a. La comprobaciÃƒÂ³n preliminar le advierte de problemas de producciÃƒÂ³n potenciales en tiempo real para que pueda abordar rÃƒÂ¡pidamente el problema, solucionarlo directamente en la composiciÃƒÂ³n y seguir trabajando.\n\nPanel VÃƒÂ­nculos personalizable Nuevo\nBusque, clasifique y gestione todos los archivos colocados en sus documentos en el panel VÃƒÂ­nculos personalizable. Vea los atributos mÃƒÂ¡s importantes para su flujo de trabajo como la escala, la rotaciÃƒÂ³n y la resoluciÃƒÂ³n.\n\nTransiciones de pÃƒÂ¡gina en archivos SWF y PDF Mejorada\nAplique transiciones de pÃƒÂ¡gina, como doblar, limpiar, disolver o suavizar, a pÃƒÂ¡ginas individuales o a todos los pliegos, y guÃƒÂ¡rdelas en formato SWF o PDF. Previsualice una transiciÃƒÂ³n de pÃƒÂ¡gina antes de aplicarla y experimente con la velocidad y direcciÃƒÂ³n para obtener un mayor control de diseÃƒÂ±o.\n\nTexto condicional Nuevo\nProduzca varias versiones de un documento para distintos usuarios desde un ÃƒÂºnico archivo de origen de InDesign. Oculte texto de pÃƒÂ¡rrafos, palabras e incluso caracteres sin depender de las capas. El texto restante y los objetos anclados se ajustan automÃƒÂ¡ticamente a la composiciÃƒÂ³n.\n\nExportaciÃƒÂ³n a Adobe Flash CS4 Professional (XFL) Nuevo\nExporte documentos al formato XFL y ÃƒÂ¡bralos en Adobe Flash CS4 Professional, conservando la fidelidad visual a la composiciÃƒÂ³n original de InDesign. Utilice Flash para aÃƒÂ±adir interactividad, animaciÃƒÂ³n y navegaciÃƒÂ³n sofisticadas a composiciones complejas y obtener asÃƒÂ­ una atractiva experiencia de lectura.\n\nReferencias cruzadas Nuevo\nSimplifique la redacciÃƒÂ³n, producciÃƒÂ³n y gestiÃƒÂ³n de documentos de gran tamaÃƒÂ±o gracias a las flexibles y potentes referencias cruzadas, que se actualizan dinÃƒÂ¡micamente a medida que el contenido cambia o se mueve dentro de un documento.\n\nGuÃƒÂ­as inteligentes Nuevo\nAlinee, espacie, gire y cambie el tamaÃƒÂ±o de uno o varios objetos rÃƒÂ¡pidamente con la ayuda de guÃƒÂ­as dinÃƒÂ¡micas. Las guÃƒÂ­as, las dimensiones de los objetos, los ÃƒÂ¡ngulos de rotaciÃƒÂ³n y las coordenadas X e Y aparecen dinÃƒÂ¡micamente para que pueda mover el borde de un objeto o su centro horizontal o vertical a otro objeto o borde de pÃƒÂ¡gina de la composiciÃƒÂ³n rÃƒÂ¡pidamente.\n\nDiseÃƒÂ±o de documentos interactivos mediante la exportaciÃƒÂ³n de archivos SWF Nuevo\nTransforme las composiciones de pÃƒÂ¡gina en archivos SWF dinÃƒÂ¡micos sin necesidad de trabajar en el entorno de creaciÃƒÂ³n de Adobe FlashÃ‚Â®. Cree documentos digitales gracias al uso de botones interactivos, hipervÃƒÂ­nculos y transiciones de pÃƒÂ¡gina ÃƒÂºnicas para reproducir en el tiempo de ejecuciÃƒÂ³n de Adobe Flash Player.\n\nRotaciÃƒÂ³n de pliego Nuevo\nRote temporalmente la vista de pliego sin girar fÃƒÂ­sicamente el monitor. Disfrute de las completas funciones de ediciÃƒÂ³n en ÃƒÂ¡ngulos de 90 y 180 grados para incluir fÃƒÂ¡cilmente en sus diseÃƒÂ±os elementos no horizontales.\n\nReflujo de texto inteligente Nuevo\nAÃƒÂ±ada automÃƒÂ¡ticamente pÃƒÂ¡ginas al final de un artÃƒÂ­culo, selecciÃƒÂ³n o documento cuando el texto se desborde utilizando esta nueva preferencia. El reflujo de texto inteligente trabaja conjuntamente con el texto condicional cuando las pÃƒÂ¡ginas se eliminan o se aÃƒÂ±aden automÃƒÂ¡ticamente al ocultarse o mostrarse el texto condicional en el documento.\n\n\nRequisitos del Sistema:\n\n* Procesador de 1,5 GHz o mayor velocidad\n* MicrosoftÃ‚Â® WindowsÃ‚Â® XP con Service Pack 2 (se recomienda Service Pack 3) o Windows VistaÃ‚Â® Home Premium, Business, Ultimate o Enterprise con Service Pack 1 (certificado para ediciones de Windows XP y Windows Vista de 32 bits)\n* 512 MB de RAM (se recomienda 1 GB)\n* 1,8 GB de espacio disponible en el disco duro para la instalaciÃƒÂ³n; se necesita espacio libre adicional durante la instalaciÃƒÂ³n (no se puede instalar en dispositivos de almacenamiento basados en flash)\n* ResoluciÃƒÂ³n de 1.024 x 768 (se recomienda 1.280 x 800) con tarjeta de vÃƒÂ­deo de 16 bits\n* Unidad de DVD-ROM\n* Software QuickTime 7 necesario para funciones multimedia\n* ConexiÃƒÂ³n a Internet de banda ancha necesaria para los servicios en lÃƒÂ­nea","torrent":{"xt":"urn:btih:312f6066713f0ffe443c5cb090e3bfee6cecca3b","amp;dn":"Adobe+InDesign+CS4+%5BEspa%C3%83%C2%B1ol%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"312f6066713f0ffe443c5cb090e3bfee6cecca3b","infoHashBuffer":{"type":"Buffer","data":[49,47,96,102,113,63,15,254,68,60,92,176,144,227,191,238,108,236,202,59]},"announce":[],"urlList":[]}}