{"title":"Creedence Clearwater Revival - Greatest Hits (2014) [FLAC]","uid":10294726,"size":224018806,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31708c32901c294f7d7395dcf581022c704538a2&amp;dn=Creedence+Clearwater+Revival+-+Greatest+Hits+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"politux","files":-1,"time":1401906112,"description":"\n  Creedence Clearwater Revival - Greatest Hits (2014) [FLAC]\n\n  Genre: Rock, Americana \n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Born on the Bayou (Single Edit)\n  02 Fortunate Son\n  03 Proud Mary\n  04 Down on the Corner\n  05 Green River\n  06 Bad Moon Rising\n  07 Travelin' Band\n  08 Have You Ever Seen the Rain\n  09 Up Around the Bend\n  10 Lodi\n  11 Hey Tonight\n  12 Lookin' Out My Back Door\n \n  There have been literally dozens of Creedence Clearwater Revival collections released since the band called it quits in 1972, and this is the fourth CCR compilation to go out with the title Greatest Hits. So is there anything new, different, or special about this particular item? Well, no. &quot;Born on the Bayou&quot; appears in an monophonic edited version created for its release as a single in 1969, and that's as close as this set gets to a rarity. The cover art is ordinary, the liner notes are minimal, and there are a mere 12 songs here, which adds up to a rather unambitious release. On the other hand, if you really are just looking for Creedence Clearwater Revival's greatest hits, this disc clearly lives up to the billing, and if you're hoping to support the argument that there was no better American rock band between 1969 and 1970 (or at least not one that released so many first-rate singles), Greatest Hits will do nicely. Radio may have played these songs to death over the past few decades, but &quot;Green River,&quot; &quot;Up Around the Bend,&quot; &quot;Bad Moon Rising,&quot; &quot;Travelin' Band,&quot; and &quot;Fortunate Son&quot; remain undeniably brilliant songs played with fierce hoodoo soul, and while John Fogerty may have been the peerless songwriter, singer, and idea man, with Tom Fogerty, Stu Cook, and Doug Clifford he had a band that was up to the challenge of bringing these great tunes to life. If you want a single-disc collection of Creedence Clearwater Revival's finest work, your best best is still Chronicle, Vol. 1 (which is about as good as &quot;best-of&quot; albums get), but if you're just looking for a quick fix of great music from this great band, Greatest Hits will deliver exactly what you're looking for, 33 minutes of superb, heartfelt rock &amp; roll.","torrent":{"xt":"urn:btih:31708c32901c294f7d7395dcf581022c704538a2","amp;dn":"Creedence+Clearwater+Revival+-+Greatest+Hits+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31708c32901c294f7d7395dcf581022c704538a2","infoHashBuffer":{"type":"Buffer","data":[49,112,140,50,144,28,41,79,125,115,149,220,245,129,2,44,112,69,56,162]},"announce":[],"urlList":[]}}