{"title":"Stonehearth v0.18.0 dev 3131","uid":15815695,"size":409576936,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:3181ce3f079d6feab4ee772f1a23ea6cb4a82649&amp;dn=Stonehearth+v0.18.0+dev+3131&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"dauphong","files":1,"time":1473679685,"description":"Stonehearth is a game about exploration and survival in an epic fantasy setting. Your job is to help a small group of settlers survive and carve out a place for themselves in a hostile land. You’ll need to establish a food supply, build shelter, defend your people, and find a way to grow and expand, facing challenges at every step.\r\n\r\nStarting from procedurally generated terrain with dynamic AI encounters, Stonehearth combines city sim and good old combat with infinite building possibilities. It’s designed to be moddable at every level, from your city to the people and creatures inhabiting the world, and will ship with the tools and documentation for you to add your own customizations to the game, and share them with friends.\r\nBuild and Grow Your City\r\nThe heart of the game is city building and management. When you're just starting out, you'll need to juggle tasks like obtaining a sustainable food supply, building shelter, and defending your fledgling settlement from raiders and other threats.\r\n\r\nOnce you've achieved a foothold in the world, it's up to you to write the destiny for your people. You have the flexibility to choose your own path in this game. Do you want to build a great conquering empire? A vibrant trade city? A spiritual monastery? We really want you to feel like this is your settlement, and give you the tools that make it look and operate exactly as you wish.\r\nLevel Up Your Settlers\r\nAll the settlers in your towns have jobs. A job is like a class in a role playing game. Each job has a specific role like hauling materials, building, crafting, and fighting. As your hearthlings work at a job they will gain experience and levels. Some jobs, when they meet certain prerequisites, can upgrade to entirely new jobs with new capabilities","torrent":{"xt":"urn:btih:3181ce3f079d6feab4ee772f1a23ea6cb4a82649","amp;dn":"Stonehearth+v0.18.0+dev+3131","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3181ce3f079d6feab4ee772f1a23ea6cb4a82649","infoHashBuffer":{"type":"Buffer","data":[49,129,206,63,7,157,111,234,180,238,119,47,26,35,234,108,180,168,38,73]},"announce":[],"urlList":[]}}