{"title":"Erotica. Un viaje a la sexualidad femenina.(Docu).(Spanish).","uid":4913142,"size":566313984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31a82abba57d941e771cb108f9606b3417d50810&amp;dn=Erotica.+Un+viaje+a+la+sexualidad+femenina.%28Docu%29.%28Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"cholo24","files":1,"time":1243282363,"description":"ErÃƒÂ³tica. Un viaje a la sexualidad femenina\n\nErotica, Un Viaje a la sexualidad La proyeccion del documental Erotica. A journey into female sexuality (Erotica. Un viaje a la sexualidad femenina), una produccion intimista de la realizadora canadiense Maya Gallus, abre hoy en la casa de cultura Lugaritz de San Sebastian el ciclo Cine realizado por mujeres, que organiza Donostia Kultura. Esta programacion incluye el pase de dos peliculas de ficcion, en este caso producidas en Espaa: los ultimos filmes de Isabel Coixet (A los que aman) y Chus Gutierrez (Insomnio). Erotica. A journey into female sexuality supone la universalizacion de las fantasias sexuales de la mujer a partir del testimonio de diez protagonistas del mundo del arte. La realizadora independiente reunio hace dos aos a escritoras, fotografas, directoras de cine e incluso mujeres drag queens para retratar sus experiencias, su imaginacion erotica y explorar asi la conexion entre la &quot;creatividad y la sexualidad&quot;. La pelicula (actualmente en la programacion de Documania, en Canal Stelite Digital) se realizo a partir de &quot;primeros planos&quot;, que otorgan segun la autora, ese caracter intimista a la cinta. Por eso precisamente quiso que el equipo de rodaje fuera integramente femenino para lograr que &quot;las protagonistas se sintieran comodas&quot;. Maya Gallus abordo su trabajo con la firme intencion de ofrecer una vision femenina sobre el erotismo. &quot;Ya era hora de que empezaramos a tratarlo desde nuestra perspectiva&quot;, comentaba ayer en San Sebastian. Destaco que desde el comienzo de la liberacion femenina, la difusion de los anticonceptivos, se ha superado la vision sexual de la mujer ligada a la reproduccion. Ademas, afirma, &quot;las mujeres han sido capaces de explorar su sexualidad mucho mas publicamente de lo que lo han hecho nunca&quot;. La realizadora canadiense, que lleva diez aos trabajando como directora y productora independiente, no se atreve a definir los limites difusos entre erotismo y pornografia. &quot;Son totalmente subjetivos&quot;, precisa. &quot;Algunos dicen que es erotismo si no te gusta y que es pornografia si te gusta, pero soy reticente a definirlo&quot;. Gallus estima ademas que su significado varia con el tiempo. &quot;Cuando se publico Historia de O, de Pauline Reage, fue considerada una novela pornografica; hoy se encuadra en el erotismo&quot;. Constata que el tratamiento de la sexualidad se mueve cada vez mas en el ambito de lo explicito.Y piensa que en Estados Unidos, &quot;a mas concrecion tanto mas puritano&quot; se vuelve un pais, que ella tacha de &quot;hipocrita&quot;. La proyeccion de su documental (20.15), que se emitira en version original con subtitulos en castellano, inaugura hoy un ciclo en el que tambien se podran ver A los que aman, de Isabel Coixet, una pelicula sobre una secreta pasion amorosa que marca la vida de un joven medico, e Insomnio, de Chus Gutierrez, la historia de tres jovenes y los problemas que les llevan a ser incapaces de dormir.\n","torrent":{"xt":"urn:btih:31a82abba57d941e771cb108f9606b3417d50810","amp;dn":"Erotica.+Un+viaje+a+la+sexualidad+femenina.%28Docu%29.%28Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31a82abba57d941e771cb108f9606b3417d50810","infoHashBuffer":{"type":"Buffer","data":[49,168,42,187,165,125,148,30,119,28,177,8,249,96,107,52,23,213,8,16]},"announce":[],"urlList":[]}}