{"title":"Den Som Draeber (2010) a.k.a. Those Who Kill 1 (Multi subs) TBS","uid":6345323,"size":4441671839,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:31da327d7e4a26b57ffc1aa7dd87fb7408207af0&amp;dn=Den+Som+Draeber+%282010%29+a.k.a.+Those+Who+Kill+1+%28Multi+subs%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1303816541,"description":"Den Som Draeber (2010) a.k.a. Those Who Kill \n\nEnglish\n\nAbout the hunt for a type of violent criminal who has yet to strike in Denmark, and who is surrounded by fear and mystique - the serial killer. \n\n\n \n\n\n\n&gt;&gt;&gt;&gt;&gt; @friemke - producties presenteert met trots &lt;&lt;&lt;&lt;&lt;\n&gt;&gt;&gt;&gt;&gt; Voor de liefhebbers van Nordic thrillers: &lt;&lt;&lt;&lt;&lt;\n&gt;&gt;&gt;&gt;&gt; Den Som Draeber (2010) a.k.a. Those Who Kill &lt;&lt;&lt;&lt;&lt;\n\n\n\ncustom ondertiteld in het Nederlands by @friemke\n\n\n\nFilminformatie \nGenre : thriller\nSpeelduur : 1 uur 22 minuten\nProductiejaar : 2010/2011\n\n\nIk liep tegen deze kanjer aan:\n\n\nDen Som Draeber a.k.a. Those Who Kill - TV premiere Wanted Across Europe\n25.02.2011\nNieuwe Miso Film misdaadserie over degenen die doden (Den som drÃƒÂ¦ber) is pre-verkocht aan een handvol Europese omroepen, met een voorsprong van haar premiÃƒÂ¨re 13 maart om 20.00 uur op TV2 Denemarken.\n\nDe 6x90 'stand-alone-serie (met inbegrip van een speelfilm) zal de lucht gaan in Zweden, Noorwegen,Duitsland, Nederland,BelgiÃƒÂ« en Luxemburg en een dvd-deal is in onderhandeling met AustraliÃƒÂ«. \nTV4 zal gaan lanceren medio mei in Zweden, terwijl TV2 Noorwegen en ZDF Duitsland zullen wachten tot het najaar. \n&quot;Onze ambitie was om een nieuwe en moderne misdaad-serie, niet alleen gericht op de Deense kijkers, maar ook op de internationale markt te creÃƒÂ«ren. \nDus we zijn hier natuurlijk ontzettend blij met de zeer goede respons, zowel in ScandinaviÃƒÂ« en de rest van de wereld&quot;, zei Miso Film mede-oprichter en producer Jonas Allen.\n\nDen Som Draeber a.k.a. Those Who Kill is gebaseerd op een origineel idee van de best verkopende Deense schrijver Elsebeth Egholm. \nHieruit volgt het onderzoek van een speciale eenheid van de politie van Kopenhagen, bestaande uit Detective Inspector Katrina Ries Jensen (Laura Bach) en forensisch psychiater Thomas Schaeffer (Jakob Cedergren). \nHet duo is gespecialiseerd in seriemoordenaars die niet passen binnen de traditionele gedragspatronen.\n\nDe Deense cast omvat ook Lars Mikkelsen, LÃƒÂ¦rke Winther, Ulrich Thomsen, Stine Steengade, David Dencik en Nikolaj Steen. \nDe eerste en de laatste films van de serie worden geleid door de ervaren Birger Larsen (The Killing, Wallander) en Kasper BARFOED en Niels NÃƒÂ¸rlÃƒÂ¸v zal elke rechtstreekse twee van de volgende films. Larsen die concept directeur, is tevens verbonden aan de speelfilm versie ingesteld op in Denemarken te openen in het najaar 2011.\nDe serie werd geproduceerd in samenwerking met TV 2 Denemarken, TV4 Zweden, Noorwegen en TV2 SF Film met steun van de Deense Film Instituut fonds voor openbare dienstverlening, Nordisk Film &amp; TV Fond, en het MEDIA-programma.\n\n\nIk heb begrepen dat dit de voorloper op de serie zelf is.\nHetgeen ik nu ondertiteld heb heeft een speelduur van 2 uur.\nIk hou alles in het snotje, maar dacht toch dit te gaan ondertitelen omdat het een voorloper is en op zich apart staat van de rest.\nOf ik de afleveringen te pakken kan (met Engelse subs) is nog de vraag en natuurlijk ga ik niet veel verdere moeite doen om te vertalen als het toch op de Nederlandse TV verschijnt.\nWanneer er hier uitgezonden wordt en door wie, kan ik niet ontdekken.\n\n\nVerhaallijn:\nSinds de skeletten van vier jonge vrouwen zijn gevonden, begraven in een bos ten noorden van Kopenhagen trok de ambitieuze en eigenzinnige vice Detective Kathy Ries Jensen, samen met de intellectuele en juridische psychiater Thomas Schaeffer in een dodelijke jacht op de geschiedenis van Denemarken's eerste seriemoordenaar. \nEen dader die doodt uit hoofde van een patroon is niet gemakkelijk te verklaren.\n\nKatherine en Thomas blijken paar, waarvan de aanpak en methodes vaak verschillend zijn van de conventionele politie-onderzoek.\nHun jacht brengt ze dicht bij de dader. \nZo dicht dat Katrina met zijn emotionele en wraakzuchtige gedrag onbewust zichzelf blootstelt aan de dader en dus in aanmerking komt als het perfecte volgende slachtoffer.\n\nVoor zowel Thomas en Katherine zal het een uitdaging zijn om de man te zien die achter het monster zit.\nWant alleen wanneer ze de fantasieÃƒÂ«n en trauma's die de dader drijven begrijpen, zullen zij in staat zijn om de dader te confronteren.\n\n\n\nZie ook weblinks: &lt;a href=&quot;\nhttp://www.nordiskfilmogtvfond.com/news_story.php?cid=2653&amp;sid=10&amp;ptid=4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nordiskfilmogtvfond.com/news_story.php?cid=2653&amp;sid=10&amp;ptid=4&lt;/a&gt; &lt;a href=&quot;\nhttp://www.trustnordisk.com/content/those-who-kill-goes-straight-top&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.trustnordisk.com/content/those-who-kill-goes-straight-top&lt;/a&gt;\n\nEn de trailer:\n\n\n\nBijzonderheden:\nBron : .mkv van blu-ray\nTV systeem : PAL\nBeeld : 16:9\nTaal : Deens DD5.1\nOndertitels : Deens/ Engels / Fins / Noors / Zweeds / Nederlands, custom by @friemke\nMenu : geen\nExtra's : geen\nCover : \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt1565810&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt1565810&lt;/a&gt;\n \nTBS","torrent":{"xt":"urn:btih:31da327d7e4a26b57ffc1aa7dd87fb7408207af0","amp;dn":"Den+Som+Draeber+%282010%29+a.k.a.+Those+Who+Kill+1+%28Multi+subs%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31da327d7e4a26b57ffc1aa7dd87fb7408207af0","infoHashBuffer":{"type":"Buffer","data":[49,218,50,125,126,74,38,181,127,252,26,167,221,135,251,116,8,32,122,240]},"announce":[],"urlList":[]}}