{"title":"Black - The History of a color (Art Ebook).pdf","uid":9270779,"size":13252399,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:31ff04b834b3d3d520f17c718f4b44c840aebac6&amp;dn=Black+-+The+History+of+a+color+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"STBGD","files":-1,"time":1385773831,"description":"Michel Pastoureau, &quot;Black: The History of a Color&quot; \n2008 | ISBN-10: 069113930X | 216 pages | PDF | 12,6 MB\n\nBlack--favorite color of priests and penitents, artists and ascetics, fashion designers and fascists--has always stood for powerfully opposed ideas: authority and humility, sin and holiness, rebellion and conformity, wealth and poverty, good and bad. In this beautiful and richly illustrated book, the acclaimed author of Blue now tells the fascinating social history of the color black in Europe.\nIn the beginning was black, Michel Pastoureau tells us. The archetypal color of darkness and death, black was associated in the early Christian period with hell and the devil but also with monastic virtue. In the medieval era, black became the habit of courtiers and a hallmark of royal luxury. Black took on new meanings for early modern Europeans as they began to print words and images in black and white, and to absorb Isaac Newton's announcement that black was no color after all. During the romantic period, black was melancholy's friend, while in the twentieth century black (and white) came to dominate art, print, photography, and film, and was finally restored to the status of a true color.\nFor Pastoureau, the history of any color must be a social history first because it is societies that give colors everything from their changing names to their changing meanings--and black is exemplary in this regard. In dyes, fabrics, and clothing, and in painting and other art works, black has always been a forceful--and ambivalent--shaper of social, symbolic, and ideological meaning in European societies.\nWith its striking design and compelling text, Black will delight anyone who is interested in the history of fashion, art, media, or design","torrent":{"xt":"urn:btih:31ff04b834b3d3d520f17c718f4b44c840aebac6","amp;dn":"Black+-+The+History+of+a+color+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ff04b834b3d3d520f17c718f4b44c840aebac6","infoHashBuffer":{"type":"Buffer","data":[49,255,4,184,52,179,211,213,32,241,124,113,143,75,68,200,64,174,186,198]},"announce":[],"urlList":[]}}