{"title":"Marijuana and Cannabinoid Research: Methods and Protocols","uid":9680187,"size":4174131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:322c6930229b143856f89b85d1bed8177703dfd1&amp;dn=Marijuana+and+Cannabinoid+Research%3A+Methods+and+Protocols&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"PirateBook","files":1,"time":1393653949,"description":"\nBy: Emmanuel S. Onaivi\n\nA cutting-edge collection of readily reproducible in vitro and in vivo methods to elucidate the mechanisms associated with cannabinoid function in health and disease. The techniques can be used in studies across the board from genes to behavior. The molecular neurobiological methods are invaluable in analyzing the structure, the polymorphisms, and the molecular expression of the cannabinoid receptors (CBrs), as well as their association with polysubstance abuse. \n\nThere are also methods for localizing cannabinoid receptors in different systems, visualizing cannabinoid effects using brain slice imaging and elctrophysiological approaches, and designing and synthesizing cannabinoids and endocannabinoids. The protocols follow the successful Methods in Molecular Medicineâ„¢ series format, each offering step-by-step laboratory instructions, an introduction outlining the principles behind the technique, lists of the necessary equipment and reagents, and tips on troubleshooting and avoiding known pitfalls.","torrent":{"xt":"urn:btih:322c6930229b143856f89b85d1bed8177703dfd1","amp;dn":"Marijuana+and+Cannabinoid+Research%3A+Methods+and+Protocols","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"322c6930229b143856f89b85d1bed8177703dfd1","infoHashBuffer":{"type":"Buffer","data":[50,44,105,48,34,155,20,56,86,248,155,133,209,190,216,23,119,3,223,209]},"announce":[],"urlList":[]}}