{"title":"James Carol - Jefferson Winter series  (Books #1~2) Epub,Mobi","uid":10777964,"size":2382892,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32f340b2750ad9ba0d6aa42fca4cae2664acc271&amp;dn=James+Carol+-+Jefferson+Winter+series++%28Books+%231%7E2%29+Epub%2CMobi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"karaokeking123","files":-1,"time":1408135146,"description":"Jefferson Winter series by James Carol (Books #1~2)Epub, Mobi\n\n\nRequirements: Epub Reader, 990 kB\nOverview: James Carol is the author of BROKEN DOLLS. the first in a series featuring former FBI profiler Jefferson Winter. The novel was released in January 2014 to rave reviews and became an Amazon bestseller, reaching number 1 on the fiction and thriller charts.\n\nGenre: Mystery/Thriller\n\n\n\n#1 - Broken Dolls: The first in James Carol's thrilling Jefferson Winter series, Broken Dolls offers rapid-fire suspense and a chilling look into the mind of a criminal - and into the mind of the one man who might be able to catch him. Ex-FBI star profiler Jefferson Winter is no ordinary investigator. An eccentric genius and self-described geek with a passion for Mozart, he is haunted by the legacy of his notorious serial killer father...and not likely to admit this may be why he has such a phenomenal insight into the psychology that drives the criminals he hunts. The former G-man is now a sought after freelance consultant, jetting around the globe helping local law enforcement agencies with their toughest cases. When Detective Investigator Mark Hatcher calls from Scotland Yard about a particularly disturbing case, Winter leaves his native California for the chilly streets of London to help track down a sadistic serial kidnapper. Four victims, all young women, all tortured and then lobotomised. None of them able to tell the police the name of their attacker. None of them able to live normal lives again. Just broken dolls, played with then discarded. When another young woman goes missing, Winter has to race against the clock to identify the attacker and find the latest victim before it's too late. James Carol's breakout debut novel takes readers on an action-packed rollercoaster ride that fans of Criminal Minds, Silence of the Lambs, Sleepy Head, and the Jack Reacher and Alex Cross series won't want to miss.\n\n#1.5 - Presumed Guilty: Special Agent Yoko Tanaka is one of the best profilers in the FBI. She's observant, smart and professional, but doesn't really play well with others. She's been called in to consult on the case of 'Valentino', a killer who steals his victims' hearts. Literally. With five women already dead, time is running out for the police to catch the killer before he strikes again. Within twenty-four hours of Yoko's arrival they have a suspect in custody: a precocious nineteen-year-old kid called Jefferson Winter whose IQ is off the charts. He's also a textbook psychopath and the son of one of America's most notorious serial killers. Not only does he confess to the murders, he knows details of the crimes that only the killer could know. It's an open and shut case, or is it?\n\n#2 - Watch Me: Ex-FBI profiler Jefferson Winter has taken a new case in sunny Louisiana, where the only thing more intense than the heat is a killer on the loose in the small town of Eagle Creek. But in a town where secrets are rife and history has a way of repeating itself, can Winter solve the case before someone else dies?\n","torrent":{"xt":"urn:btih:32f340b2750ad9ba0d6aa42fca4cae2664acc271","amp;dn":"James+Carol+-+Jefferson+Winter+series++%28Books+%231%7E2%29+Epub%2CMobi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f340b2750ad9ba0d6aa42fca4cae2664acc271","infoHashBuffer":{"type":"Buffer","data":[50,243,64,178,117,10,217,186,13,106,164,47,202,76,174,38,100,172,194,113]},"announce":[],"urlList":[]}}