{"title":"Telecomunicazioni GSM - GPRS [PDF ITA] TNT Village","uid":11899206,"size":12930689,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:331a51e3af0d234a7e5fe5e3c2f9dddbe2f9e91e&amp;dn=Telecomunicazioni+GSM+-+GPRS+%5BPDF+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"l.diliberto","files":1,"time":1431259000,"description":"Telecomunicazioni GSM - GPRS [PDF ITA] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=85662&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=85662&lt;/a&gt;\n\nTitolo: GSM-GPRS - seconda edizione\nEditore: Hoepli\nAutore: Bertazioli Onelio, Favalli Lorenzo\nAnno: 2002\nLingua: Italiana\nFormato file: PDF\nGrandezza del file: 12,3 MB\n\n* Tecniche\n* Architetture\n* Procedure\n* Evoluzione verso UMTS\n\nLa nuova edizione del volume riprende l'architettura del sistema GSM presentata nella prima edizione e la aggiorna con le piu' recenti innovazioni, fornendo tra l'altro dettagli teorico-pratici sulla struttura delle reti a commutazione di pacchetto (in particolare sulle reti IP) indispensabili per comprendere le tecniche impiegate nella fase 2+ del GSM e nei cosiddetti sistemi di terza generazione. Le principali novita' riguardano sia una panoramica sull'evoluzione del sistema GSM sia una trattazione dettagliata del GPRS. Vengono altresi' introdotti i sistemi di terza generazione (MBS, UMTS, con accenni anche a quelli di quarta generazione (MBS, Mobile Broadband Systems). In un capitolo, inoltre, sono presentati gli aspetti tecnici, sanitari e normativi relativi all'esposizione a campi e.m. a frequenze elevate. Le parti piu' specificatamente teoriche, infine, sono riportate nelle appendici conclusive.\n\nOnelio Bertazioli, Ingegnere elettronico, si e' occupato di trasmissione dati presso la societa' ARE, ha svolto attivita' di redazione e docenza per corsi aziendali e nella formazione postdiploma. Insegna Telecomunicazioni presso l'ITIS &quot;E. Mayorana&quot; di Cesano Maderno.\nLorenzo Favalli, Ingegnere elettronico, e' Professore associato presso il Dipartimento di Elettronica dell'Universita' di Pavia dove si occupa di sistemi e servizi avanzati di telecomunicazioni e dove tiene il corso di Trasmissione numerica dell'informazione e di sistemi di comunicazioni.\nATES (www.atesonline.it), avvalendosi della collaborazione di professionisti delle telecomunicazioni, opera come content provider nel settore e-learning; offre servizi di training e di formazione tecnica rivolta ad aziende, gestori di TLC ed Istituzioni pubbliche e private","torrent":{"xt":"urn:btih:331a51e3af0d234a7e5fe5e3c2f9dddbe2f9e91e","amp;dn":"Telecomunicazioni+GSM+-+GPRS+%5BPDF+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"331a51e3af0d234a7e5fe5e3c2f9dddbe2f9e91e","infoHashBuffer":{"type":"Buffer","data":[51,26,81,227,175,13,35,74,126,95,229,227,194,249,221,219,226,249,233,30]},"announce":[],"urlList":[]}}