{"title":"Acid Bath - When The Kite String Pops mp3  1994","uid":11102897,"size":66428901,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:338c58a6124d4af31e26cfb73e87ceb3e982624a&amp;dn=Acid+Bath+-+When+The+Kite+String+Pops+mp3++1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"analogkid6103","files":16,"time":1411692812,"description":"Acid Bath was a seminal American sludge metal band from Houma, Louisiana that was active from 1991 to 1997. Acid Bath combined doom metal roots with influences from black metal, death metal, gothic rock, blues, folk, and country. In a Pit Magazine interview, vocalist Dax Riggs classified their sound as &quot;death rock&quot; (referring to death as a dominant lyrical theme, rather than deathrock), and also classified the band's music as a blending of stoner metal and doom metal. In another interview, guitarist Sammy Duet described their sound as &quot;gothic hardcore&quot;.Biography\n\nAcid Bath was an incarnation of two bands, Dark Karnival which featured Audie Pitre, Sammy &quot;Pierre&quot; Duet, and Tommy Viator, and Golgotha which featured Dax Riggs, Mike Sanchez, Jimmy Kyle, and Jerry &quot;Boon&quot; Businelli. Golgotha's bassists were in frequent rotation finally culminating with Chad Pierce, who would then be succeeded by Pitre during Acid Bath's formation. Tommy Viator was later replaced by Jimmy Kyle on drums but would return to play keyboards toward the end of the band's career. Joseph J. Fontenot was the bassist for a short period of time.\n\nAcid Bath formed in 1991. The band was based south of New Orleans in several small towns including Houma, Thibodaux, Morgan City and Galliano. Influenced by thrash metal as well as bands and artists such as Black Sabbath, Alice Cooper, Celtic Frost, Carcass and Darkthrone, they recorded their demo Hymns of the Needle Freak with their manager and producer Keith Falgout in 1993. The strength of the demo earned them a deal with Rotten Records, an independent label. They released When the Kite String Pops produced by Spike Cassidy in 1994, followed two years later by their second and final effort Paegan Terrorism Tactics (also produced by Keith Falgout). Neither gained them mainstream success, but both albums earned a high degree of underground acclaim. In 2005, another album composed of their demos, Demos: 1993 - 1996, was released.Track listing\n\nAll songs written and composed by Acid Bath.\nNo. \tTitle \tLength \t\n1. \t&quot;The Blue&quot;   \t6:13\n2. \t&quot;Tranquilized&quot;   \t4:14\n3. \t&quot;Cheap Vodka&quot;   \t2:14\n4. \t&quot;Finger Paintings of the Insane&quot;   \t6:04\n5. \t&quot;Jezebel&quot;   \t4:53\n6. \t&quot;Scream of the Butterfly&quot;   \t6:14\n7. \t&quot;Dr. Seuss Is Dead&quot;   \t6:04\n8. \t&quot;Dope Fiend&quot;   \t5:19\n9. \t&quot;Toubabo Koomi&quot;   \t5:01\n10. \t&quot;God Machine&quot;   \t5:00\n11. \t&quot;The Morticians Flame&quot;   \t4:05\n12. \t&quot;What Color Is Death&quot;   \t3:19\n13. \t&quot;The Bones of Baby Dolls&quot;   \t6:00\n14. \t&quot;Cassie Eats Cockroaches&quot;   \t4:22\n\nTrack 14 contains samples from the 1971 Stanley Kubrick film A Clockwork Orange, as well as the 1986 David Lynch film Blue Velvet.","torrent":{"xt":"urn:btih:338c58a6124d4af31e26cfb73e87ceb3e982624a","amp;dn":"Acid+Bath+-+When+The+Kite+String+Pops+mp3++1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338c58a6124d4af31e26cfb73e87ceb3e982624a","infoHashBuffer":{"type":"Buffer","data":[51,140,88,166,18,77,74,243,30,38,207,183,62,135,206,179,233,130,98,74]},"announce":[],"urlList":[]}}