{"title":"Resources for Study of Islam and Qur'an - A Collection","uid":5833231,"size":225524015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:338f10bfb02d5b5d31e070ea2b1b298ec8262315&amp;dn=Resources+for+Study+of+Islam+and+Qur%5C%27an+-+A+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"moman73","files":40,"time":1284643101,"description":"Resources for Study of Islam and Qur'an - A Collection:\n\n\nThe last few weeks have witnessed intensified levels of Islamophobia. It started with the controversy over building a Muslim Community Center in a location about 6 blocks away from &quot;ground zero&quot; where the twin towers of the World Trade Center (WTC) once stood. Although the project was approved by a Manhattan Community Board by a vote of 29 to 1, some people made an issue of the project in an attempt to raise religious fanaticism against Islam and Muslims. This resulted in wide demonstrations against the proposed center, and was followed by many acts of vandalism against Islamic mosques and centers in several cities in the USA.\n\nThe above controversy was then followed by a threat from a pastor in a Florida church, Rev. Terry Jones, to burn hundreds of copies of the Qur'an on Sept. 11. Although he backed down from his threat, several incidents of burning the Qur'an took place in several cities in the USA.  \n\nThese kind of acts can only fuel religious intolerance and fanaticism. On the positive side, however, these acts increased the interest of many people to know more about Islam. \n\nThis upload gives some useful resources to those who are interested in studying Islam and the Qur'an. It contains 40 titles. In the subdirectory: Translations of the Meanings of the Qur'an, we have 5 titles:\n\n-  Abdel Haleem - The Qur'an; A New Translation (2005)\n\n-  Al-Hilali &amp; Khan - Translation of the Meanings of The Noble Qur'an (2004)\n\n-  Ali - The Qur'an Translation (1934)\n\n-  Pickthal - Meanings of Holy Qur'an In English (1930)\n\n-  Unal - The Qur'an with Annotated Interpretation in Modern English (2006)\n\n\nAnd in the main directory, we have 35 titles:\n\n-  Abu-Hamdiyyah - The Qur'an; An Introduction (2000)\n\n-  Akhtar - The Qur'an and the Secular Mind; A Philosophy of Islam (2008)\n\n-  Bucaille - The Bible, the Qur'an and Science\n\n-  El-Masry - The Qur'an 365 Selections for Daily Reading (2003)\n\n-  El-Naggar - Geological Concept of Mountains in the Qur'an (1992)\n\n-  Esack - The Qur'an; A User's Guide (2005)\n\n-  Haroun - Why Islam; Proofs of Modern Science (2003)\n\n-  Headley - A Western Awakening to Islam (1914)\n\n-  Izutsu - Ethico-Religious Concepts in the Qur'an (2002)\n\n-  Leaman - The Qur'an; An Encyclopedia (2006)\n\n-  McAuliffe - Encyclopaedia of the Qur'an, Vol. 1 (Brill, 2001) [6 volumes]\n\n-  Miller - The Amazing Qur'an (1992)\n\n-  Murad - Way to the Qur'an\n\n-  Naik - The Qur'an and Modern Science - Compatible or Incompatible\n\n-  Nursi - Al-Mathnawi Al-Nuri; Seedbed of The Light (2007)\n\n-  Nursi - The Gleams; Reflections on Qur'anic Wisdom and Spirituality (2008)\n\n-  Nursi - The Reasonings; A Key to Understanding the Qur'an's Eloquence (2008)\n\n-  Nursi - The Words; The Reconstruction of Islamic Belief and Thought (2005)\n\n-  Saeed - The Qur'an; An Introduction (2008)\n\n-  Sarwar - Guide to the Koran (2003)\n\n-  Shirazi - On the Hermeneutics of the Light Verse of the Qur'an (2004)\n\n-  Von Denffer - Ulum al Qur'an\n\n-  Yahya - An Index to the Qur'an (2003)\n\n-  Yahya - Answers From The Qur'an (2003)\n\n-  Yahya - Miracles of the Qur'an (2001)\n\n-  Yahya - Prayer in the Qur'an (2003)\n\n-  Yahya - Solution; Values of the Qur'an, 2nd Ed. (2001)\n\n-  Yahya - Some Secrets of the Qur'an (2002)\n\n-  Yahya - Taking the Qur'an as a Guide (2003)\n\n-  Yahya - The Qur'an Leads the Way to Science, 2nd Ed. (2004)\n\n","torrent":{"xt":"urn:btih:338f10bfb02d5b5d31e070ea2b1b298ec8262315","amp;dn":"Resources+for+Study+of+Islam+and+Qur%5C%27an+-+A+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"338f10bfb02d5b5d31e070ea2b1b298ec8262315","infoHashBuffer":{"type":"Buffer","data":[51,143,16,191,176,45,91,93,49,224,112,234,43,27,41,142,200,38,35,21]},"announce":[],"urlList":[]}}