{"title":"The Devil Makes Three - Longjohns, Boots, and a Belt [2004][EAC,","uid":8202149,"size":221894107,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:339e6567840b386b1614173d2f06537e20d2f4db&amp;dn=The+Devil+Makes+Three+-+Longjohns%2C+Boots%2C+and+a+Belt+%5B2004%5D%5BEAC%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"dickspic","files":14,"time":1362043644,"description":"one of Dicks Americana collection\n\nArtist: Release: Longjohns, Boots, and a Belt\nMusicBrainz: 111b615b-56f7-45cf-b60c-7efcf057887d\nReleased: 2004\nCatalog#: MWP 002\nCountry: US\n\nTracklisting:\n\n01. Never Learn (04:58)\n02. North Carolina (02:40)\n03. Man Tap (03:57)\n04. Sweeping (02:58)\n05. Bangor Mash (03:21)\n06. Judgement Day (03:15)\n07. Tow (04:24)\n08. Black Irish (03:34)\n09. Long Boots Johnson (02:11)\n10. River Deep (09:45)\n\nOn their second album the band's ragtime bounce is still intact, but country blues share the billing, all presented with a cleaner mix that shows just how impressive the band's instrumental chops are. Pete Bernhard's songwriting moves in a more serious, more insightful direction here. Drinking and hard times still figure heavily in the songs, but mindless indulgence has been replaced with a consciousness that puts the behavior in a broader social context. The good time music is tempered by sober lyrics rooted in the usual social concerns of a singer/songwriter. &quot;North Carolina&quot; is a country blues with some impressive guitar picking from Cooper McBean, a starkly traditional &quot;she done me wrong song&quot; delivered in a straightforward manner that intensifies the hurt Bernhard sings about. &quot;Man Tap&quot; is a tale of hard times and drinking, but this time Bernhard treats the subject with a more solemn attitude, acknowledging that while booze may provide temporary relief, in the long run life's just going to keep piling up troubles on your doorstep. &quot;Sweeping&quot; is a classic protest song marked by energetic picking, and a scathing lyric that contrasts the lives of the privileged with those of the working people who make their leisure possible. &quot;Bangor Mash&quot; harks back to the first album's jaunty odes to death; it's a salute to the end of life with a carefree lyric and a breathless double-time bridge that accentuates the tune's happy-go-lucky vibe. &quot;Judgment Day&quot; is a Jimmie Rodgers' style blues with some nice resonator guitar work from McBean. &quot;Black Irish&quot; has a Celtic feel with McBean's clattering rhythm work on banjo, and a dark lyric about living life to its fullest despite the fear that can grind you down. McBean's musical saw gives &quot;River Deep,&quot; one of his own tunes, an eerie vibe intensified by his sinister Lee Hazlewood style vocal. It's a perfect blend of ominous urban poetry and country sunshine. &quot;Long Boots Johnson,&quot; the album's only instrumental, is another country blues that shows off McBean's splendid guitar and banjo work and Lucia Turino's rock-solid standup bass, the sound that provides the anchor on every track.","torrent":{"xt":"urn:btih:339e6567840b386b1614173d2f06537e20d2f4db","amp;dn":"The+Devil+Makes+Three+-+Longjohns%2C+Boots%2C+and+a+Belt+%5B2004%5D%5BEAC%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"339e6567840b386b1614173d2f06537e20d2f4db","infoHashBuffer":{"type":"Buffer","data":[51,158,101,103,132,11,56,107,22,20,23,61,47,6,83,126,32,210,244,219]},"announce":[],"urlList":[]}}