{"title":"Adobe Photoshop CS5.5 Extended [Dmg- MultiLang][TNTVillage]","uid":6628181,"size":1530151939,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:33c4474bae56385c2cadf478a6a5fd708f7c22cf&amp;dn=Adobe+Photoshop+CS5.5+Extended+%5BDmg-+MultiLang%5D%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"DrBald","files":1,"time":1314230614,"description":"Adobe Photoshop CS5.5 Extended\n\n\n.: Descrizione :.\nAdobe Photoshop ÃƒÂ¨ un software proprietario prodotto dalla Adobe Systems Incorporated specializzato nell\\'elaborazione di fotografie (fotoritocco) e, piÃƒÂ¹ in generale, di immagini digitali.\nQuesto programma ÃƒÂ¨ in grado di effettuare ritocchi di qualitÃƒÂ  professionale alle immagini, offrendo enormi possibilitÃƒÂ  creative grazie ai numerosi filtri (filters in inglese) e strumenti che permettono di emulare le tecniche utilizzate nei laboratori fotografici per il processamento delle immagini, le tecniche di pittura e di disegno.\nUn\\'importante funzione del programma ÃƒÂ¨ data dalla possibilitÃƒÂ  di lavorare con piÃƒÂ¹ \\&quot;livelli\\&quot;, permettendo di gestire separatamente le differenti immagini che compongono l\\'immagine principale.\nÃƒË† un software di grafica raster e in quanto tale si differenzia dai software di grafica vettoriale poichÃƒÂ© agisce direttamente sui pixel, sebbene alcuni strumenti (tools) abbiano la possibilitÃƒÂ  di applicare gli algoritmi di BÃƒÂ©zier (dalla versione CS2 sono stati introdotti dei miglioramenti per potenziarne la resa).\nIl software ÃƒÂ¨ espandibile mediante l\\'uso dei plug-in (come quelli in formato 8bf), che permettono di ampliarne le funzionalitÃƒÂ . Tra i plug-in, notevole importanza rivestono quelli che permettono al programma di leggere e scrivere nuovi formati di file come Adobe Camera Raw che permette di lavorare con file Raw prodotti da molte macchine fotografiche (tipicamente le reflex digitali) e con i file DNG.\nAdobe ha reso disponibili le specifiche del formato per la compilazione dei plug-in anche ad aziende di terze parti, creando quindi un mercato specifico di componenti per Photoshop, compresi anche pennelli, campioni di colore, pattern e sfumature, nonchÃƒÂ© di macro (comunemente chiamate \\'azioni\\').\n\n\n.: Scheda del Software :.\nNome:  Adobe Photoshop CS 5.5 Extended\nLingua: Portoghese Brasiliano, Danese, Tedesco, Finlandese, Francese, Francese Canadese, Italiano, Norvegese, Spagnolo e Svedese\nVersione: 12.1 Extended \nGenere:  Grafica\nProduzione:  Adobe\nData di uscita versione base:  17 Dicembre 2010\n\n\n.: Requisiti di Sistema :.\nProcessore:IntelÃ‚Â® multicore\nOS: Mac OS X v. 10.5.8, 10.6 o 10.7\nRam: 1 GB\nDisco Rigido: 2 GB di spazio disponibile su disco rigido per l\\'installazione. ÃƒË† necessario ulteriore spazio durante l\\'installazione, che non puÃƒÂ² essere effettuata su volumi che utilizzano file system con distinzione tra maiuscole e minuscole o periferiche di archiviazione di massa flash rimovibili.\nRisoluzione schermo: 1024x768 (consigliata 1280x800) con apposita scheda grafica dotata di hardware con accelerazione OpenGL, colore a 16 bit e 256 MB di VRAM\nSupporto grafico per Shader Model 3.0 e OpenGL 2.0 per alcune funzionalitÃƒÂ  basate su accelerazione GPU\nSoftware: E\\' richiesto QuickTime 7.6.2 per le funzionalitÃƒÂ  multimediali\n\n\n.: Istruzioni :.\n-&gt;Aprire il DMG\n-&gt;Usare le istruzioni comprese\n-&gt;Enjoy ;)\n\n\n-------------------------\n\n\n\nAdobe Photoshop CS5.5 Extended\n\n\n.: Description :.\nAdobe Photoshop is a graphics editing program developed and published by Adobe Systems Incorporated.\nAdobe\\'s 2003 \\&quot;Creative Suite\\&quot; rebranding led to Adobe Photoshop 8\\'s renaming to Adobe Photoshop CS. Thus, Adobe Photoshop CS5 is the 12th major release of Adobe Photoshop. The CS rebranding also resulted in Adobe offering numerous software packages containing multiple Adobe programs for a reduced price. Adobe Photoshop is released in two editions: Adobe Photoshop, and Adobe Photoshop Extended, with the Extended having extra 3D image creation, motion graphics editing, and advanced image analysis features. Adobe Photoshop Extended is included in all of Adobe\\'s Creative Suite offerings except Design Standard, which includes the Adobe Photoshop edition.\nAlongside Adobe Photoshop and Adobe Photoshop Extended, Adobe also publishes Adobe Photoshop Elements and Adobe Photoshop Lightroom, collectively called \\&quot;The Adobe Photoshop Family\\&quot; by Adobe. In 2008, Adobe released Adobe Photoshop Express, a free web-based image editing tool to edit photos directly on blogs and social networking sites.\n\n\n.: Software Data :.\nName:  Adobe Photoshop CS 5.5 Extended\nLanguage: Brazilian Portuguese , Danish , Dutch , Finnish , French , French Canadian, German , Italian , Norwegian (Norsk) , Spanish , Spanish and Swedish\nVersion: 12.1 Extended \nGenre:  Graphic Editing\nProducer:  Adobe\nBase Version\\'s Release date:  December 17th, 2010\n\n\n.: System Requirements :.\nProcessor:Multicore IntelÃ‚Â® processor\nOS: Mac OS X v. 10.5.8, 10.6 or 10.7\nRam: 1 GB\nHard Drive: 2GB of available hard-disk space for installation; additional free space required during installation (cannot install on a volume that uses a case-sensitive file system or on removable flash storage devices)\nScreen Resolution: 1024x768 display (1280x800 recommended) with qualified hardware-accelerated OpenGL graphics card, 16-bit color, and 256MB of VRAM Some GPU-accelerated features require graphics support for Shader Model 3.0 and OpenGL 2.0\nSoftware: QuickTime 7.6.2 software required for multimedia features\n\n\n.: Instructions :.\n-&gt;Open DMG\n-&gt;Use instructions\n-&gt;Enjoy ;)\n","torrent":{"xt":"urn:btih:33c4474bae56385c2cadf478a6a5fd708f7c22cf","amp;dn":"Adobe+Photoshop+CS5.5+Extended+%5BDmg-+MultiLang%5D%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33c4474bae56385c2cadf478a6a5fd708f7c22cf","infoHashBuffer":{"type":"Buffer","data":[51,196,71,75,174,86,56,92,44,173,244,120,166,165,253,112,143,124,34,207]},"announce":[],"urlList":[]}}