{"title":"[Ebook-Ita-Pdf-Thriller]Dan Brown - Crypto[SoM]","uid":5313584,"size":3255435,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3412b55492a82cba517d9b39a95a9039621392c9&amp;dn=%5BEbook-Ita-Pdf-Thriller%5DDan+Brown+-+Crypto%5BSoM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"misafor","files":1,"time":1264633491,"description":"\n\nA Washington ÃƒÂ¨ sabato pomeriggio quando la trentottenne Susan Fletcher, una delle piÃƒÂ¹ brillanti menti matematiche degli Stati Uniti - responsabile della divisione di crittologia dell'NSA (National Security Agency) -, viene convocata con urgenza nell'ufficio del comandante Strathmore. Qualcuno ha messo a punto un programma capace di &quot;ingannare&quot; il piÃƒÂ¹ sofisticato strumento informatico di spionaggio al mondo, un supercomputer che, grazie ai suoi tre milioni di processori che lavorano in parallelo, puÃƒÂ² decodificare qualunque testo cifrato a una velocitÃƒÂ  strabiliante.\nPochissimi sanno dell'esistenza di questa macchina, ideata per contrastare le nuove minacce alla sicurezza nell'era di Internet e in grado di controllare la posta elettronica di chiunque. La stessa NSA, nata cinquant'anni prima con l'intento di proteggere le comunicazioni riservate del governo americano - e di intercettare quelle delle potenze straniere -, opera in semiclandestinitÃƒÂ , al di fuori del controllo pubblico.\nSusan non si stupisce quando viene a sapere che &quot;Fortezza Digitale&quot; - cosÃƒÂ¬ ÃƒÂ¨ stato battezzato il programma - ÃƒÂ¨ frutto delle ricerche di un genio informatico: il giapponese Ensei Tankado, handicappato dalla nascita per i perduranti effetti del disastro atomico di Hiroshima, che dopo essere stato chiamato negli Stati Uniti a lavorare per l'NSA ha sbattuto la porta in faccia ai suoi capi quando si ÃƒÂ¨ accorto che il supercomputer rischiava di trasformarsi in un nuovo Grande Fratello. I suoi intenti sono nobili, ma la sua decisione di boicottare l'operato dell'NSA, mettendo il programma in rete e permettendo a chiunque di scaricarlo, rischia di creare l'anarchia e di assicurare la piÃƒÂ¹ completa libertÃƒÂ  d'azione a spie, criminali, terroristi, trafficanti di droga e riciclatori di denaro sporco...\nIn un crescendo di tensione, Susan si trova a combattere per difendere la nazione e gli scopi dell'Agenzia nella quale crede. Ma dovrÃƒÂ  destreggiarsi fra menzogne e tradimenti, mettendo a repentaglio la propria vita e quella dell'uomo che ama.\nIn Crypto Dan Brown torna ad affondare lo sguardo in quella zona grigia in cui bene e male si confondono in maniera inestricabile, per consegnarci un tecno-thriller assolutamente realistico che mette a nudo il conflitto, oggi piÃƒÂ¹ problematico che mai, tra libertÃƒÂ  personali e salvaguardia della sicurezza internazionale.\n","torrent":{"xt":"urn:btih:3412b55492a82cba517d9b39a95a9039621392c9","amp;dn":"%5BEbook-Ita-Pdf-Thriller%5DDan+Brown+-+Crypto%5BSoM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3412b55492a82cba517d9b39a95a9039621392c9","infoHashBuffer":{"type":"Buffer","data":[52,18,181,84,146,168,44,186,81,125,155,57,169,90,144,57,98,19,146,201]},"announce":[],"urlList":[]}}