{"title":"Haruki Murakami - The Wind-Up Bird Chronicle","uid":12257977,"size":3101909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3450cbe5d7fd985b81abd317edfe1a990d906b9d&amp;dn=Haruki+Murakami+-+The+Wind-Up+Bird+Chronicle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"icnhztrtz","files":1,"time":1440125893,"description":"\nThe actual epub retail copy of the book unmarred by terrible OCR and DRM. The copies uploaded here were OCR'd badly.\n\n//\n\n\nBad things come in threes for Toru Okada. He loses his job, his cat disappears, and then his wife fails to return from work. His search for his wife (and his cat) introduces him to a bizarre collection of characters, including two psychic sisters, a possibly unbalanced teenager, an old soldier who witnessed the massacres on the Chinese mainland at the beginning of the Second World War, and a very shady politician.\n\nHaruki Murakami is a master of subtly disturbing prose. Mundane events throb with menace, while the bizarre is accepted without comment. Meaning always seems to be just out of reach, for the reader as well as for the characters, yet one is drawn inexorably into a mystery that may have no solution. The Wind-Up Bird Chronicle is an extended meditation on themes that appear throughout Murakami's earlier work. The tropes of popular culture, movies, music, detective stories, combine to create a work that explores both the surface and the hidden depths of Japanese society at the end of the 20th century.\n\nIf it were possible to isolate one theme in The Wind-Up Bird Chronicle, that theme would be responsibility. The atrocities committed by the Japanese army in China keep rising to the surface like a repressed memory, and Toru Okada himself is compelled by events to take responsibility for his actions and struggle with his essentially passive nature. If Toru is supposed to be a Japanese Everyman, steeped as he is in Western popular culture and ignorant of the secret history of his own nation, this novel paints a bleak picture. Like the winding up of the titular bird, Murakami slowly twists the gossamer threads of his story into something of considerable weight. --Simon Leake --This text refers to an out of print or unavailable edition of this title","torrent":{"xt":"urn:btih:3450cbe5d7fd985b81abd317edfe1a990d906b9d","amp;dn":"Haruki+Murakami+-+The+Wind-Up+Bird+Chronicle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3450cbe5d7fd985b81abd317edfe1a990d906b9d","infoHashBuffer":{"type":"Buffer","data":[52,80,203,229,215,253,152,91,129,171,211,23,237,254,26,153,13,144,107,157]},"announce":[],"urlList":[]}}