{"title":"Pharmacology Case Studies for Nurse Prescribers [StormRG]","uid":11890348,"size":6384478,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3451be9f7d8b7c2aecff7386f417f19b5fc0072b&amp;dn=Pharmacology+Case+Studies+for+Nurse+Prescribers+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"0xmovva","files":2,"time":1430979722,"description":"TITLE/EDITION Pharmacology Case Studies for Nurse Prescribers\nBy: Donna Scholefield (Author), Alan Sebti (Author), Alison Harris (Author)\nPaperback: 346 pages\nPublisher: M&amp;K Publishing, an imprint of M&amp;K Update Ltd (April 1, 2015)\nISBN-10: 1905539606\nISBN-13: 978-1905539604\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nNurse prescribers are now practising within every discipline of nursing and midwifery, both in the community and the hospital setting. This much-needed book is aimed particularly at students on a non-medical prescribing (NMP) course as well as those nurses who are studying for their community practitioner non-medical prescribing qualification as part of the specialist practice programme. The book is also a useful resource for nursing students and registered nurses who administer and/or prescribe medicines. \n\nThe authors offer a basic introduction to pharmacological concepts, embedded in specific conditions, through case studies and self-assessment questions. By utilising a case study approach, they enable the reader to link pharmacological concepts with clinical practice. \n\nMany of the conditions presented will be seen across all healthcare settings. In addition, the comprehensive glossary and list of abbreviations will enable students to understand some of the more technical terms used in the British National Formulary (BNF) and other prescribing sources. \nReading this book, and carrying out the numerous self-assessment activities, will give the reader an appreciation of the value of having a sound pharmacological knowledge base in order to deliver safe practice, effective prescribing and improved patient care","torrent":{"xt":"urn:btih:3451be9f7d8b7c2aecff7386f417f19b5fc0072b","amp;dn":"Pharmacology+Case+Studies+for+Nurse+Prescribers+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3451be9f7d8b7c2aecff7386f417f19b5fc0072b","infoHashBuffer":{"type":"Buffer","data":[52,81,190,159,125,139,124,42,236,255,115,134,244,23,241,155,95,192,7,43]},"announce":[],"urlList":[]}}