{"title":"Bible Black (Anime)","uid":9166173,"size":5436770701,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:3522468426c384a0b736deaad34f229d67aa6f88&amp;dn=Bible+Black+%28Anime%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Horse0","files":-1,"time":1383987718,"description":"*SPOILER ALERT*\n\n\nAn academy student, Taki Minase, finds a strange book while exploring an abandoned room in the school's basement. With the help of his cousin, he translates the Latin-French writings and finds them to be instructions for dark magic, which is actually a form of Kabbalistic satanism (the translation was not mentioned in the OVA).\n\nUsing the magic, Minase is able to make Rika Shiraki love him, as well as help his friend, Ayumi Murai, to get the boy she loves to love her back. Reika Kitami, the school nurse, hears of his magical acts and decides to sway him to her because she needs the book for herself. Twelve years prior, Kitami was used as a sacrifice for the previous Witchcraft Club and only survived after making a deal with Satan. She now needs a virgin girl to act as a vessel for her reincarnation as the life that Satan has given her is running out. Kaori Saeki, the head of the new Witchcraft Club, also notes Minase's magic acts and persuades him to come to one of her meetings with the book. After being possessed by a lesser demon, he brings Kitami with him and she takes over the Witchcraft Club.\n\nKitami holds private counseling sessions for girls, trying to find the virgin she needs. She reveals to Minase that the two girls she has had her eyes on were Shiraki and Minase's childhood friend, Kurumi Imari. However, since Shiraki is no longer a virgin (thanks to Minase), Kitami pursues Imari, who has been missing school recently after walking in on Minase and Shiraki during intercourse. Kitami also regularly kidnaps the art teacher, Hiroko Takashiro, and performs sexual tortures on her after finding out that Takashiro was the head of the Witchcraft Club that had sacrificed her, even though Takashiro had left the circle prior to the ritual.\n\nAfter Imari is abducted by Kitami, the lesser demon leaves Minase and he realizes that he loves Imari and must save her. With the help of Takashiro and the Bible Black, he finds a spell Takashiro believes will stop Kitami's evil scheme. By this point, it is Walpurgis Night once again, and Kitami plans to reincarnate herself in Imari. Kitami slits her wrists and has sexual intercourse with Imari as the reincarnation ritual demands, but Minase interrupts it and casts his spell on Kitami. This apparently causes the ritual to fail and Kitami to die from blood loss.\n\nThe series ends with Minase and Imari confessing their love for each other and having intercourse. Afterwards, Saeki is seen in the Witchcraft Club sanctuary, planning to steal the Bible Black, which was going to be left in there before the entrance was cemented over. Imari enters the room and destroys the Bible Black with a spell that causes it to burst into flames, then reveals herself to be a hermaphrodite, showing that Kitami's ritual was successful. Kitami then decides to test her new body out by raping Saeki.\n\nDetails:\n\nResolution: 640 x 480\nLanguage: Japanese\nSubtitles: English\nFormat: mkv\nBitrate: 1236 kbps\n\nWatch order:\n\nBible Black\nBible Black Gaiden\nBible Black Only\nBible Black Only Imari Rape\nBible Black New Testament\n","torrent":{"xt":"urn:btih:3522468426c384a0b736deaad34f229d67aa6f88","amp;dn":"Bible+Black+%28Anime%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3522468426c384a0b736deaad34f229d67aa6f88","infoHashBuffer":{"type":"Buffer","data":[53,34,70,132,38,195,132,160,183,54,222,170,211,79,34,157,103,170,111,136]},"announce":[],"urlList":[]}}