{"title":"Tattoo Machines And Their Secrets[BBS]","uid":6611535,"size":19414967,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:359e0a315fed5daea4dc0d0e9ea56a78876cb415&amp;dn=Tattoo+Machines+And+Their+Secrets%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1313612964,"description":"Probably the most important industry text book any professional tattoo artist should own.\n\n\nThe cover art was done by Mark Lankin of Funhouse Tattooing in Vancouver and was written by Art &amp; Steve Godoy.\n\nThe function of the tattoo machine is everything. It controls the force at which the needles penetrate the skin. Understanding this function, in detail, will enable any artist of any skill level to reach artistic goals which weren't possible with an un-tuned machine.\n\nThese days, the tattoo industry is making money. The silly t.v. shows have glamorized the industry so much that everybody and their brother wants to become a tattoo artist. Elevating their status from fry cook to &quot;tattoo artist&quot; has created the backyard scribbler. Now he has &quot;star status&quot;... he can get his &quot;sleeves&quot;, meet chicks... be recognized anywhere and work in his unregulated and unsterile environment! Though through the decades, there have always been backyard scribblers, there are more now than ever before! Some suppliers, without ethics, sell to anybody... why? because they are motivated by money.\n\nThe tattoo industry is making money, suppliers are making the most money. They are buying cheap and selling high. Most of the machines they sell are manufactured in China and sold for as little as $20.00 a machine. It's really become a throw away world! And why not?? the price is right... if your machine runs like sh*t, throw it away and get another $20.00 machine. Maybe the supplier may even have a sale... you can get it for $15.00!\n\nA good artist should be able to diagnose problems, repair and tune his/her machines. That artist should understand the function of that machine in association with artistic technique. This is the difference between real professionals and amateurs. The difference between gliding through a 1 hour tattoo as opposed to suffering for 2 or 3 hours using a machine which it not tuned.\n\nThe machine can't be bought (usually) and expected ","torrent":{"xt":"urn:btih:359e0a315fed5daea4dc0d0e9ea56a78876cb415","amp;dn":"Tattoo+Machines+And+Their+Secrets%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"359e0a315fed5daea4dc0d0e9ea56a78876cb415","infoHashBuffer":{"type":"Buffer","data":[53,158,10,49,95,237,93,174,164,220,13,14,158,165,106,120,135,108,180,21]},"announce":[],"urlList":[]}}