{"title":"SketchUp Pro 2013 13.0 build 3689 (2-click run)(registred)","uid":8510148,"size":66413742,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:35b4f94972b68d7ce3456078dd075ae9464bdfd1&amp;dn=SketchUp+Pro+2013+13.0+build+3689+%282-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1369552614,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nAn Extension Warehouse has been created and integrated with SketchUp. Users can now manage hundreds of extensions installed on their computer via the Extension Warehouse.\n-The word ?Ã‡Â£SketchUp?Ã‡Â¥ now refers to a product family of which there are two members: SketchUp Pro and SketchUp Make.\n-Toolbars for SketchUp on Windows operating systems have been improved. They are now customizable and more reliably stay put once they have been docked.\n-Scene-based animations can now be exported to high-quality video from SketchUp.\n-Toolbars and cursors have been updated and made consistent between SketchUp, LayOut, Style Builder and SketchUp Viewer.\n-We have a new SDK. See the ?Ã‡Â£getting_started.html?Ã‡Â¥ and ?Ã‡Â£migration_guide.html?Ã‡Â¥ in the SDK package for details.\n-Lots of little tweaks, bugs fixes and improvements were made to existing features.\n-SketchUp no longer will take a long time to open and close with an unstable Internet connection. \n-(Mac) SketchUp does not support OS X 10.6 and older versions of OS X. Users with these platforms will see an error on launch.\n-(Windows) XP SP3 is now required to run SketchUp on XP.\n\nExtension warehouse/Ruby plugins:\n-We are installing only the following extensions with the product : Advanced Camera Tools, Dynamic Components, Sandbox Tools, Photo Textures. The other SketchUp 8 extensions (Ruby Script Examples, Ocean Modeling, Utilities Tools, Shadow Strings Fix toolbar, Solar North toolbar) are available for download on the Extension Warehouse.\n-The plugins directory on the Mac has moved to ~/Library/Application Support/SketchUp 2013/SketchUp. We no longer install anything into the Macintosh HD/Library/Application Support/SketchUp directory.\n\nSketchUp Toolbars :\n-Toolbars now stay put and you can customize toolbars containing non-Ruby tool icons!\n-The SketchUp 8 ?Ã‡Â£Save toolbar positions?Ã‡Â¥ menu choice has been removed as it is no longer needed - toolbar settings are saved when exiting SketchUp.\n-View &gt; Toolbars shows just one menu choice now. Customization of toolbars has been moved to one dialog.\n-SketchUp 2013 does not have the ability to create 2 column vertical toolbars (a limitation of the libraries we used as the basis of our new toolbars). If you want to create a setup similar to what is in SketchUp 8, you can either create a few new custom toolbars, docking them side by side to create 2 columns, or you can dock some of our smaller toolbars side by side.\n-To customize non-Ruby toolbars, bring up the View &gt; Toolbars dialog. You can move an icon from one toolbar to another by dragging it or pressing the Alt key. Holding down the Ctrl key allows you to copy an icon. Right clicking on a toolbar gives you some additional functionality.\n\nLayOut:\n-Changes were made to improve overall performance with LayOut.\n-Shapes can now be filled with image-based patterns in addition to solid colors. This is called Pattern Fill. \n-LayOut now has the ability to create multi-copy arrays, similar to the way SketchUp works.\n-Text leader lines can now be curved.\n-Users can now zoom in to a document up to 10,000%.\n-To better reflect standards, dimensions now have dashes to separate feet from inches. \n\nOS : Windows XP sp3, Windows Vista, Windows 7, Windows 8 \n\nLanguage : English\n\nHomepage : http://www.sketchup.com/products/sketchup-pro","torrent":{"xt":"urn:btih:35b4f94972b68d7ce3456078dd075ae9464bdfd1","amp;dn":"SketchUp+Pro+2013+13.0+build+3689+%282-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b4f94972b68d7ce3456078dd075ae9464bdfd1","infoHashBuffer":{"type":"Buffer","data":[53,180,249,73,114,182,141,124,227,69,96,120,221,7,90,233,70,75,223,209]},"announce":[],"urlList":[]}}