{"title":"Tom Clancy's Splinter Cell Conviction","uid":5535885,"size":8315011072,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:35cb8bab3da098f4c75a92f6035ba6dd1384feac&amp;dn=Tom+Clancy%5C%27s+Splinter+Cell+Conviction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":9,"uploader":"DjAligator14","files":-1,"time":1273066884,"description":"Eboy\n\nS  K  i  D  R  O  W\n\n-  T H E  L E A D i N G  F O R C E  -\n\nproudly presents\nTom Clancy's Splinter Cell Conviction / Ubisoft\n\nRELEASE DATE : 30-04-2010              PROTECTION : Ubisoft DRM\nGAME TYPE    : Action                  DISKS      : 1 DVD\n\nRelease Notes:\n\nStupid Sceners Notice:\n\nWhile in the competition stages, we had at least a decent\namount of respect for the work Razor1911 and RELOADED normally\ndo. Now during the last weeks they have for sure lost our last\nlines of respect.\n\n1. RELOADED, get some balls and bring your stupidity out in\nthe open. At least get someone who we don't know to write\nyour FAKE nfos for the FAKE content of the Assassins Creed\n2 nfo release. The writing style is so obvious, that\nseveral non scenere already caught who was behind it.\n\nAlso, when you plan to make such FAKE nfo statements\nreleases, then at least cover your tracks of it's origin.\nOur FTP scanning logs, verify that the release was first\nupped and spread by a certain RELOADED affiliated person.\n\nFurthermore we have already guessed your purpose of all\nthis dissing towards us. It's obvious that you want the\npublic, as well as the scene to believe that our 100%\nworking Assassins Creed 2 release is nuked, so that you can\nmake path for yet another dupe. Do we even have to mention\nJust Cause 2?\n\nRELOADED, your lies and propaganda can help you boost your\nego beyond your talent, but eventually your lies and\npropaganda will stand out as the most talented about you.\n\n2. Razor1911, you took the liberity to use bigger words, than\nyou can handle. You obviously haven't even looked at our\nAssassins Creed 2 crack.\n\nYou judge our Assassins Creed 2 crack by reading public\nboards and FAKE nfos with FAKE content really made you look\nnonworthy to use the blade's group name. It's so obvious\nthat you're not the sharpest blade in the drawer.\n\nClaiming you was the first to crack the new Ubisoft\nprotection, is just so ridiculous, so much actually, that\nwe're infact still laughing since you released Settlers 7.\n\nYou even praised the new Ubisoft DRM, as it apparently to\nyou, gives the scene a chance for redemption to bring back\nthe good old days of REAL cracking. You're so full of\nbullshit with that Settlers 7 nfo, that you're starting to\nsound like RELOADED.\n\nFor the people with no cracking knowledge, then we will\nexplain a few things about the Ubisoft DRM:\n\na) Ubisoft DRM can't even be compared with protections of the\n&quot;good&quot; old days.\n\nb) Razor's &quot;crack&quot; isn't really any different from our\nAssassins Creed 2 crack, it's the emulated data that makes\nthe differences.\n\nc) Razor just moved the Ubisoft launcher into the main folder\nof the Settlers 7 game and patched it to work from there.\n\nd) To make these &quot;cracks&quot; work correctly you still have to\ngather and emulate the data that are being sent/recieved\nfrom the communication between the game and your PC.\n\nThe cracking method is still the same for each title. It's the\nhandling of the data being sent/recieved between the Ubisoft\nservers, and the decryption methods of it, that takes time to\ndo properly.\n\nObviously, that has nothing to do with exterme skill, nor has\nit anything to do with the REAL protections of the past. It's\nalso getting more obvious that 1911 marks the IQ level of\nwhole Razor.\n\nThe real old blade, must feel very ashamed now.\n\nNote to anybody else:\n\nThis will be the last nfo, where we defend our Ubisoft DRM\nwork. We're here to compete, even if we lost a lot of faith in\nthe two mention groups above. We're here for scene matters and\nnot childish behaviours, like our competitiors choose as path\nto get their messages out. Let the work speak instead.\n\nBeware with the trigger, as you never know if the bullet will\nhit yourself in the end\n\nReloading might not be an option, no matter how sharp you have\nrazored the bullets edges\n\n/\n/ / //          / / /  /\n/ / / / //      //// / / / / / /\n/      /      / / / // / /// /\n/// / //////\ntwice the fun  / double the trouble\n\nOn with the game release information:\n\nAn investigation into his daughter's death unwittingly leads\nformer agent Sam Fisher to discover he's been betrayed by his\nprior agency, the Third Echelon. Now a renegade, Fisher finds\nhimself in a race against time to thwart a deadly terrorist\nplot that threatens millions.\n\nUniting revolutionary gameplay enhancements with a\nhigh-octane, no-holds-barred storyline, Tom Clancy's Splinter\nCell Conviction arms you to the teeth with all the high-tech\nweaponry and lethal skills of an elite operative and invites\nyou to enter a dangerous world where justice means making your\nown rules.\n\nNEW LEVEL OF ACTION FOR SPLINTER CELL A full arsenal of\ncutting-edge innovations allow you to outflank foes with the\nLast Known Position system, tag and eliminate enemies using\nthe Mark and Execute feature, and much more.\n\nBLOCKBUSTER EXPERIENCE A unique storytelling style keeps you\non the edge of your seat as you navigate the explosive world\nof a renegade agent where trust is impossible and justice\nrequires you to go above the law.\n\nJAW DROPPING VISUALS A revolutionary new graphic direction\ndelivers an utterly seamless gameplay experience that'll keep\nyou totally engrossed in the story of Sam Fisher.\n\nEXPLOSIVE ONLINE PLAY Brand-new addictive multiplayer modes\namp up the dramatic intensity like never before.\n\nInstall Notes:\n\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nAdditional Notes:\n\nDon't run the game with patch 1.01 applied, do a fresh install\nand apply our crack.\n\nPatch 1.01 isn't official by Ubisoft yet. When it is, we will\nof course release it.\n\nSupport the companies, which software you actually enjoy\n\nWe 3 Paris Hilton\n\nGreetings:\n\nSalutes to our old Amiga friends from:\n\nFAIRLIGHT - RAZOR 1911 - VISION FACTORY - PARADOX - QUARTEX\nDCS - CRYSTAL - ZENITH - ACCESSION - ALPHA FLIGHT - PRODIGY\nTHE COMPANY - LEGEND - TRSI - ORACLE - ANTHROX - CLASSIC\n\nSalutes to our new friends in:\n\nUNLEASHED - TiNYiSO - BReWErS - RADIKAL - POSTMORTEM - SHOCK\nFAIRLIGHT - CRUDE - VACE - ReUnion - OUTLAWS - GENESIS\n\nLogo and layout by: Eboy/SAE\nLast updated 21/07/2007 by XXX","torrent":{"xt":"urn:btih:35cb8bab3da098f4c75a92f6035ba6dd1384feac","amp;dn":"Tom+Clancy%5C%27s+Splinter+Cell+Conviction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35cb8bab3da098f4c75a92f6035ba6dd1384feac","infoHashBuffer":{"type":"Buffer","data":[53,203,139,171,61,160,152,244,199,90,146,246,3,91,166,221,19,132,254,172]},"announce":[],"urlList":[]}}