{"title":"Mirrors Edge - Reflected Edition RUS | ENG 2009/RePack","uid":6924212,"size":3764459520,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:35ccc6ef9cc4721b0f0808ba3cd9b906834759a8&amp;dn=Mirrors+Edge+-+Reflected+Edition+RUS+%7C+ENG+2009%2FRePack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"rcbcsk","files":-1,"time":1325402724,"description":"Year: 2009 Genre: Action / 3D / 1st Person Developer: EA Digital Illusions Creative Entertainment Publisher: EA Publication Type: RePack Language: English | Russian Language: English | Russian Crack: not required System requirements: &gt; Operating system: Windows XP / Vista &gt; Processor: Pentium IV 2,4 GHz / Athlon 64 2800 + &gt; Memory: 1 GB &gt; Video: GeForce 6/Radeon X1650 (Radeon HD 2400 is recommended) 256 MB &gt; Sound Card: Sound device compatible with DirectX Ã‚Â® 9.0 &gt; Free space on your hard disk: 11.5 GB\n\n\n| Description |\nIn an age of information technology there is nothing easier than to share this information. The addressee can call, write an email, send a fax - variants weight. However, none of them are not suitable for exchange of confidential data in totalitarian society Mirror's Edge. With the help of numerous agents and smart devices the government carefully monitors the information flow, so for the exchange of information used couriers, dubbed the runners. Your name is Faith (in translation from English - Belief), and you - a professional runner. Your element - the sun shining on the roofs of skyscrapers, where government agents wander frequently. However, the current mission is fundamentally different from the ordinary order. Your sister was accused of a crime which she did not commit, and you declared hunting. Now can not hide, even high above the ground, so only one thing - run!\n\n\n| Features |\nMovement. For an experienced stuntman roofs of several buildings by the nearby merging into a single platform - just need to properly take advantage of the terrain. Jump, slide, push off from the walls, walk on his hands, tumble, pull, run! You will find a risky parkour at an altitude of several hundred meters - the constant risk of falling down and tickles nerves driving the soul to the heel.\nImmersion. In Mirror's Edge is not the player and his character, there is only you - a girl named Faith, running at breakneck speed on the roofs. Unique animation and first-person view provides an unprecedented immersion into another reality. You will feel at hand rough concrete, feel the push to his feet hard surface after a successful jump. World shaken before his eyes, when you hang-ups over the abyss, and convulsively shudder, if you do not manage to dodge the bullet. Looking down from the rooftops, you'll forget where you are in fact and become a shiver of fear, while adrenaline disperses on an organism.\nBattle. You try to stop, but dexterity, attentiveness and world-class reaction will help to overcome all difficulties. Dodge the bullets, escapes from the blows, crush opponents sudden attacks, entice them to the edge of the roof and head down! Having seized their weapons, you can protect your life in a firefight.\nExemption. You - Begun by God, endowed with rare ability. You are a descent notice all subjects environment, which may be useful in the next trick. Due to such a useful skill, you can easily associate the individual jumps and somersaults into a harmonious series of graceful maneuvers. Run forward, without stopping, and the journey turns into a fascinating cast of glittering roofs towards freedom!\n\nScreens\n &lt;a href=&quot;\nhttp://img266.imageshack.us/img266/3852/1e3455faec0153c13dfe846.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img266.imageshack.us/img266/3852/1e3455faec0153c13dfe846.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img189.imageshack.us/img189/2914/af676d1a02a1c31812528ab.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img189.imageshack.us/img189/2914/af676d1a02a1c31812528ab.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img18.imageshack.us/img18/7205/c0ff4040f1eada124db619c.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img18.imageshack.us/img18/7205/c0ff4040f1eada124db619c.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:35ccc6ef9cc4721b0f0808ba3cd9b906834759a8","amp;dn":"Mirrors+Edge+-+Reflected+Edition+RUS+%7C+ENG+2009%2FRePack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ccc6ef9cc4721b0f0808ba3cd9b906834759a8","infoHashBuffer":{"type":"Buffer","data":[53,204,198,239,156,196,114,27,15,8,8,186,60,217,185,6,131,71,89,168]},"announce":[],"urlList":[]}}