{"title":"Mono Discography (2001-2012) [FLAC]","uid":9490365,"size":9274501446,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:361ae49549b6bd972a9e31ac896e2c475f7859cb&amp;dn=Mono+Discography+%282001-2012%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"100.XY","files":-1,"time":1389985562,"description":"For hard-core fans the sharp sound of FLAC\n\nMono Discography (2001-2012) [FLAC]\n\nWikipedia:\nMono (stylised as MONO) are a Japanese instrumental rock band, formed in 1999 in Tokyo. The band consists of Takaakira Goto (electric guitar, glockenspiel), Hideki Suematsu (electric guitar, glockenspiel), Tamaki Kunishi (bass guitar, electric guitar, piano, glockenspiel), and Yasunori Takada (drum kit, glockenspiel, synthesizer).\nMono have released six studio albums. The band spent their early years, from 1999 to 2003, touring Asia, Europe, and America continuously, and released two studio albums, Under the Pipal Tree (2001) and One Step More and You Die (2002) on the Tzadik and Music Mine Inc. record labels, respectively. From 2004 to 2007, Mono signed to Temporary Residence Limited, released two more studio albums, Walking Cloud and Deep Red Sky, Flag Fluttered and the Sun Shined (2004) and You Are There (2006), and toured worldwide in their support. In 2008, the band took a break, returning one year later with a new studio album, Hymn to the Immortal Wind (2009), also on Temporary Residence Limited. During the tour that followed they recorded a live album, Holy Ground: NYC Live With The Wordless Music Orchestra which was released in 2010. In October 2012 the band released their sixth studio album, titled For My Parents.\nThe band's style of music is influenced by the genres of experimental rock and shoegazing, as well as by both the classical and contemporary classical periods of classical music, and also by noise and minimalism. Mono's sound is characterised by the lead and rhythm guitars of Goto and Yoda respectively, both of whom make extensive use of reverb, distortion and delay effects. The band's live performances are noted for their intensity, both in the playing and in the dynamics.\n\n\nAlbum List:\n(2001) Mono - Under the Pipal Tree [FLAC]\n(2003) Mono - One Step More And You Die [VinylRip 24-96]\n(2004) Mono - Walking Cloud and Deep Red Sky, Flag Fluttered and the Sun Shined [VinylRip 24-192]\n(2006) Mono - You Are There [VinylRip 24-192]\n(2007) Mono - Gone (A Collection of EPs 2000-2007) [FLAC]\n(2007) Mono - The Phoenix Tree (EP) [FLAC]\n(2009) Mono - Hymn to the Immortal Wind [VinylRip 24-96]\n(2010) Mono - Holy Ground - NYC Live With The Wordless Music Orchestra [FLAC]\n(2012) Mono - For My Parents [FLAC]\n\nSummary:\nCountry: Japan\nGenre: Post-rock, instrumental rock\n\nMedia Report:\nSource                           : CD and Vinyl \nFormat                           : FLAC\nFormat/Info                      : Free Lossless Audio Codec\nBit rate mode                    : Variable\nBit rate                         : ~700 Kbps - 5.4 Mbps\nChannel(s)                       : 2 channels\nSampling rate                    : 44.1 KHz\nBit depth                        : 16 bits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:361ae49549b6bd972a9e31ac896e2c475f7859cb","amp;dn":"Mono+Discography+%282001-2012%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"361ae49549b6bd972a9e31ac896e2c475f7859cb","infoHashBuffer":{"type":"Buffer","data":[54,26,228,149,73,182,189,151,42,158,49,172,137,110,44,71,95,120,89,203]},"announce":[],"urlList":[]}}