{"title":"Catch-22 by Joseph Heller","uid":7576164,"size":1228197,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3658808a35a42d10ef8e922b24ad6042774a4cae&amp;dn=Catch-22+by+Joseph+Heller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"azizex666","files":-1,"time":1346119849,"description":"Catch-22 is like no other novel. It is one of the funniest books ever written, a keystone work in American literature, and even added a new term to the dictionary.\n\nAt the heart of Catch-22 resides the incomparable, malingering bombardier, Yossarian, a hero endlessly inventive in his schemes to save his skin from the horrible chances of war. His efforts are perfectly understandable because as he furiously scrambles, thousands of people he hasn't even met are trying to kill him. His problem is Colonel Cathcart, who keeps raising the number of missions the men must fly to complete their service. Yet if Yossarian makes any attempts to excuse himself from the perilous missions that he is committed to flying, he is trapped by the Great Loyalty Oath Crusade, the hilariously sinister bureaucratic rule from which the book takes its title: a man is considered insane if he willingly continues to fly dangerous combat missions, but if he makes the necessary formal request to be relieved of such missions, the very act of making the request proves that he is sane and therefore ineligible to be relieved.\n\nCatch-22 is a microcosm of the twentieth-century world as it might look to some one dangerously sane -- a masterpiece of our time.\n\n\n\n                         Format 1 - Epub\n\n                         Format 2 - Mobi\n","torrent":{"xt":"urn:btih:3658808a35a42d10ef8e922b24ad6042774a4cae","amp;dn":"Catch-22+by+Joseph+Heller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3658808a35a42d10ef8e922b24ad6042774a4cae","infoHashBuffer":{"type":"Buffer","data":[54,88,128,138,53,164,45,16,239,142,146,43,36,173,96,66,119,74,76,174]},"announce":[],"urlList":[]}}