{"title":"H Miracle - system to treat &amp; cure hemorrhoids","uid":6327620,"size":15604956,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:366ef7441846b399d5bd0969da45cab86ab544b4&amp;dn=H+Miracle+-+system+to+treat+%26+cure+hemorrhoids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"varnapua","files":-1,"time":1303164867,"description":"WEBSITE: \n  &lt;a href=&quot;\nhttp://hemorrhoidmiracle.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://hemorrhoidmiracle.com&lt;/a&gt;\n\n\n\nDESCRIPTION: \n\nAre you sick of the itching, burning, pain, swelling, or bleeding down there? Aren't you frustrated because it's completely embarrassing to ask for advice on this potentially crippling condition? I sure was - suffering silently.\n\nAre you sick of constricting your diet or work - hoping for relief? Plus, all of the other &quot;management&quot; burdens of this on your everyday life?\n\nAre you tired of all the creams, pills, suppositories, and ointments that NEVER fix the true root issue? Then, don't spend another penny on those expensive options until you've read everything I'm about to reveal.....\n\nHemorrhoids, also known as &quot;piles&quot;, are basically inflamed tissue or blood vessels at the lower rectum. It's something that millions suffer silently from in varying degrees.\n\nIf you have any of the symptoms mentioned, it's extremely likely to be hemorrhoids. It's important that you read this entire article carefully at any suspect ....\n\neMedicine, the clinical knowledge base say that it can &quot;plague all age groups&quot;.\n\nThe world-renowned Harvard University Medical International Journal does cite &quot;lack of fiber&quot; as one culprit. I agree, but I believe there's more to the story.\t \t\nTrust me, I know what you're going through... I've experimented with so many ways to cure my own chronic, intolerable hemorrhoid condition a few years ago. Ever since then, I've helped dozens of people get rid of this seemingly permanent problem for good naturally.\n\n\n\nPERSONAL COMMENT:\n\nThis is the most talked-about treatment on the net. I haven't tried it yet. Please  seed, give feedback through your comments about it. Did it work for you?","torrent":{"xt":"urn:btih:366ef7441846b399d5bd0969da45cab86ab544b4","amp;dn":"H+Miracle+-+system+to+treat+%26+cure+hemorrhoids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"366ef7441846b399d5bd0969da45cab86ab544b4","infoHashBuffer":{"type":"Buffer","data":[54,110,247,68,24,70,179,153,213,189,9,105,218,69,202,184,106,181,68,180]},"announce":[],"urlList":[]}}