{"title":"Polymer Extrusion - Pierre G. Lafleur, Bruno Vergnes","uid":12428790,"size":8601713,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36f99f056de03540b1233f291f0a26a6faf27ed6&amp;dn=Polymer+Extrusion+-+Pierre+G.+Lafleur%2C+Bruno+Vergnes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1442424438,"description":"Polymer Extrusion - Pierre G. Lafleur, Bruno Vergnes (ISTE, Wiley, 2014).pdf\n\nExtrusion is by far the most important and the oldest processing and shaping method for thermoplastic polymers. This process concerns almost all synthetic polymers, as well as elastomers or food materials. Single-screw extrusion is mainly used nowadays to manufacture finished goods or semi-finished products. More than 90 million tons of thermoplastics are therefore processed every year. Twin-screw extrusion may be divided into two systems: contra-rotating systems used within the context of PVC extrusion, for the manufacture of pipes or profiles; and co-rotating systems experiencing nowadays a very significant development, because of their significant adaptability and flexibility, which enables the manufacture of specific materials (polymer alloys, thermoplastic elastomers, filled polymers, nanocomposites). Extrusion is carried out by passing molten polymer through a tool called die that will give the product its final shape (films and sheets, rolled products, and electric cables). Thanks to the design of dies, we obtain at the output a product with controlled dimensions, uniform speeds and homogeneous temperatures. The book will discuss the same production types, but only in the case of coextrusion flows, i.e. multilayer stratified products. First of all, we will present in this book the physics of the mechanisms at stake, then propose more or less complex models in order to describe these mechanisms and then go forward in the interpretation of results and the control of condition flows","torrent":{"xt":"urn:btih:36f99f056de03540b1233f291f0a26a6faf27ed6","amp;dn":"Polymer+Extrusion+-+Pierre+G.+Lafleur%2C+Bruno+Vergnes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36f99f056de03540b1233f291f0a26a6faf27ed6","infoHashBuffer":{"type":"Buffer","data":[54,249,159,5,109,224,53,64,177,35,63,41,31,10,38,166,250,242,126,214]},"announce":[],"urlList":[]}}