{"title":"Malwarebytes Anti-Malware Premium 2.2.0.1024 Final Multilingual","uid":12559245,"size":22993764,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:36fcf3bb0b86c61ede2f3a32bcdd1919f0218eb8&amp;dn=Malwarebytes+Anti-Malware+Premium+2.2.0.1024+Final+Multilingual+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"OnlyByTheRain","files":2,"time":1444682082,"description":"[b]Malwarebytes Anti-Malware Premium 2.2.0.1024 Final Multilingual[/b]\r\n\r\n\r\n[b]Malwarebytes' Anti-Malware is a high performance anti-malware application that thoroughly removes even the most advanced malware and spyware. With one of the fastest, most effective quick scans and malware removal capabilities on the market, this program is the perfect addition to your PC's defenses.\r\n\r\nThe full version of the product includes a number of key features, including the ability to schedule updates and scans and most importantly, a real-time malware protection module that blocks malicious processes before they even start.\r\n\r\nWhats New:\r\n\r\nImprovements:\r\n• Full support for Windows 10 operating system added\r\n• Enhanced safeguards to prevent false positives on legitimate files\r\n• Improved rootkit scanning to prevent false positives for Unknown.Rootkit.Driver and Unknown.Rootkit.VBR\r\n• Minor user interface edits including updated Scan Results view and updated top navigation menu\r\n• Added ability to sort the columns in Quarantine table under History tab\r\n• Improved handling of scheduled updates set to run on reboot to prevent repeated missed updates\r\n• Improved messaging in limited user accounts when an action requiring Admin privileges is attempted\r\n• New message added when Malwarebytes Anti-Malware is running in a business environment\r\n• Updated License Agreement included\r\n\r\nIssues Fixed:\r\n• Fixed security vulnerability and enhanced Malwarebytes Anti-Malware self-protection\r\n• Fixed several issues related to updating databases in a limited user account\r\n• Fixed issue where USB drives would not show as available for scanning on the Custom Scan Configuration screen\r\n• Fixed several licensing issues that could potentially cause invalid license and protection states\r\n• Fixed problem where double-clicking the tray icon would not launch the user interface[/b]\r\n\r\n[img]https://dump.bz/storage-1/1015/G6u5PfDuFnEyc9QF1gI4VTVunqSYiWEZ.jpg[/img]","torrent":{"xt":"urn:btih:36fcf3bb0b86c61ede2f3a32bcdd1919f0218eb8","amp;dn":"Malwarebytes+Anti-Malware+Premium+2.2.0.1024+Final+Multilingual+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36fcf3bb0b86c61ede2f3a32bcdd1919f0218eb8","infoHashBuffer":{"type":"Buffer","data":[54,252,243,187,11,134,198,30,222,47,58,50,188,221,25,25,240,33,142,184]},"announce":[],"urlList":[]}}