{"title":"New Oxford Annotated Bible (NRSV) 4th ed. (pdf)","uid":9276992,"size":48511825,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:373882cc2bf0de9bfdb56a875afa80cb7d8ac230&amp;dn=New+Oxford+Annotated+Bible+%28NRSV%29+4th+ed.+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"pharmakate","files":-1,"time":1385877661,"description":"The New Oxford Annotated Bible With The Apocrypha (New Revised Standard Version), Fourth Edition (Michael Coogan, Marc Zvi Brettler, Carol Newsom, Pheme Perkins, editors) (Oxford Univ. Press, 2010). 2440 pages.\n\nRetail pdf.\n\ndescription:\n\nThe premier study Bible used by scholars, pastors, undergraduate and graduate students, The New Oxford Annotated Bible offers a vast range of information, including extensive notes by experts in their fields; in-text maps, charts, and diagrams; supplementary essays on translation, biblical interpretation, cultural and historical background, and other general topics.\n\nExtensively revised--half of the material is brand new--featuring a new design to enhance readability, and brand-new color maps, the Annotated Fourth Edition adds to the established reputation of this essential biblical studies resource. Many new and revised maps, charts, and diagrams further clarify information found in the Scripture text. In addition, section introductions have been expanded and the book introductions present their information in a standard format so that students can find what they need to know. Of course, the Fourth Edition retains the features prized by students, including single column annotations at the foot of the pages, in-text charts, and maps, a page number-keyed index of all the study materials in the volume, and Oxford's renowned Bible maps. This timely edition maintains and extends the excellence the Annotated's users have come to expect, bringing still more insights, information, and perspectives to bear upon the understanding of the biblical text.\n\n--The renowned New Revised Standard Version Bible translation, the scholarly standard for study of the Bible\n\n--Wholly revised, and greatly expanded book introductions and annotations.\n\n--Annotations in a single column across the page bottom, paragraphed according to their boldface topical headings.\n\n--In-text background essays on the major divisions of the biblical text.\n\n--Essays on the history of the formation of the biblical canon for Jews and various Christian churches.\n\n--More detailed explanations of the historical background of the text.\n\n--More in-depth treatment of the history and varieties of biblical criticism.\n\n--A timeline of major events in the ancient Near East.\n\n--A full index to all of the study materials, keyed to the page numbers on which they occur.\n\n--A full glossary of scholarly and critical terms.\n\n--36-page section of full color New Oxford Bible Maps, approximately 40 in-text line drawing maps and diagrams.\n\nClassic but not stodgy, up-to-date but not trendy, The New Oxford Annotated Bible: 4th Edition is ready to serve new generations of students, teachers, and general readers.\n\nAbout the Editors:\n\nMichael Coogan is Professor of Religious Studies at Stonehill College and Director of Publications for the Harvard Semitic Museum. He has also taught at Harvard University, Boston College, Wellesley College, Fordham University, and the University of Waterloo (Ontario), and has participated in and directed archaeological excavations in Israel, Jordan, Cyprus, and Egypt. He is the author of Old Testament text books and The Old Testament VSI.\n\nMarc Z. Brettler is Dora Golding Professor of Biblical Studies and chair of the Department of Near Eastern and Judaic Studies, Brandeis University.\n\nCarol Newsom is Charles Howard Candler Professor of Old Testament, Candler School of Theology, Emory University.\n\nPheme Perkins is Professor of Theology at Boston College.\n\n---\n\nMany thanks to the original uploader.\n\n","torrent":{"xt":"urn:btih:373882cc2bf0de9bfdb56a875afa80cb7d8ac230","amp;dn":"New+Oxford+Annotated+Bible+%28NRSV%29+4th+ed.+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"373882cc2bf0de9bfdb56a875afa80cb7d8ac230","infoHashBuffer":{"type":"Buffer","data":[55,56,130,204,43,240,222,155,253,181,106,135,90,250,128,203,125,138,194,48]},"announce":[],"urlList":[]}}