{"title":"Hofmann's Potion [LSD Documentary] (2002)","uid":6630427,"size":1023087269,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:37570fb3bfc5f80078987af874eb0ae8ef49e635&amp;dn=Hofmann%5C%27s+Potion+%5BLSD+Documentary%5D+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"naba888","files":5,"time":1314313484,"description":"Hofmann's Potion [LSD Documentary] (2002)\n\n1) Hofmann's Potion (2002).mp4, H.264, 640 x 480, Millions, AAC, Stereo (L R), 48.000 kHz, 1598.47 kbits/s, 00:56:26.41\n\nThis documentary offers a compassionate, open-minded look at LSD and how it fits into our world. Long before Timothy Leary urged a generation to &quot;tune in, turn on and drop out,&quot; the drug was hailed as a way to treat forms of addiction and mental illness. At the same time, it was being touted as a powerful tool for mental exploration and self-understanding. Featuring interviews with LSD pioneers, beautiful music and stunning cinematography, this is much more than a simple chronicle of LSD's early days. It's an alternative way of looking at the drug... and our world.\n\n2) LSD Schizophrenic Model Psychosis [gov.archives.arc.1662201].mp4\n\nNational Archives - Schizophrenic Model Psychosis Induced by Lysergic Acid Diethylamide (LSD) - National Security Council. Central Intelligence Agency. (09/18/1947 - 12/04/1981). - This film provides footage of University of California medical tests with LSD. - DVD Copied by IASL Scanner John Williams. - ARC 1662201 / LI 263.1153\n\n3) MER-17 and LSD-25 [gov.archives.arc.1634172].mp4\n\nNational Archives - Experimental Compound MER 17 (Frenquel) and LSD-25 - National Security Council. Central Intelligence Agency. (09/18/1947 - 12/04/1981). - This film examines medical experiments to determine the efficacy of LSD-25 and MER 17 (Frenquel) on treating psychosis. - DVD Copied by IASL Scanner Thomas Gideon. - ARC 1634172 / LI 263.1057\n\ncomment: Why is LSD illegal? LSD is the direct path to illumination, not enlightenment though. And since the ruling masonic hierarchy believes that illumination is a privilege reserved to the members of their cult only, common man had to be excluded from it. Alcohol in contrast to LSD is killing humans by the thousands, but since it doesn't illuminate people but is dumbing them down, that substance has, therefore, to be completely legal.\n\ntags: LSD, drug, hallucinogen, mind, consciousness, transformation, enlightenment, illumination, meditation, psychology, psychiatry, mental, health, psycholytic, transpersonal, psychotherapy","torrent":{"xt":"urn:btih:37570fb3bfc5f80078987af874eb0ae8ef49e635","amp;dn":"Hofmann%5C%27s+Potion+%5BLSD+Documentary%5D+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37570fb3bfc5f80078987af874eb0ae8ef49e635","infoHashBuffer":{"type":"Buffer","data":[55,87,15,179,191,197,248,0,120,152,122,248,116,235,10,232,239,73,230,53]},"announce":[],"urlList":[]}}