{"title":"Flash Boys: A Wall Street Revolt - Michael Lewis &amp; Dylan Bak","uid":10107576,"size":295759057,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:37bd58823b84f3076d2a7e9c33e2746fa68738f4&amp;dn=Flash+Boys%3A+A+Wall+Street+Revolt+-+Michael+Lewis+%26amp%3B+Dylan+Bak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"SectorVector","files":-1,"time":1399476811,"description":"\nFlash Boys: A Wall Street Revolt (Audiobook) by Michael Lewis and Dylan Baker\n\n# 2014 \n# 10 hours and 18 minutes\n# MP3 64 kbps\n\n\nFour years after his #1 bestseller The Big Short, Michael Lewis returns to Wall Street to report on a high-tech predator stalking the equity markets.\n\n\nFlash Boys is about a small group of Wall Street guys who figure out that the U.S. stock market has been rigged for the benefit of insiders and that, post-financial crisis, the markets have become not more free but less, and more controlled by the big Wall Street banks. \n\n\nWorking at different firms, they come to this realization separately; but after they discover one another, the flash boys band together and set out to reform the financial markets. This they do by creating an exchange in which high-frequency trading -- source of the most intractable problems -- will have no advantage whatsoever.\n\n\nThe characters in Flash Boys are fabulous, each completely different from what you think of when you think &quot;Wall Street guy.&quot; Several have walked away from jobs in the financial sector that paid them millions of dollars a year. From their new vantage point they investigate the big banks, the world's stock exchanges, and high-frequency trading firms as they have never been investigated, and expose the many strange new ways that Wall Street generates profits.\n\n\nThe light that Lewis shines into the darkest corners of the financial world may not be good for your blood pressure, because if you have any contact with the market, even a retirement account, this story is happening to you. But in the end, Flash Boys is an uplifting read. Here are people who have somehow preserved a moral sense in an environment where you don't get paid for that; they have perceived an institutionalized injustice and are willing to go to war to fix it.\n\n &lt;a href=&quot;\nhttp://www.goodreads.com/book/show/20604826-flash-boys&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.goodreads.com/book/show/20604826-flash-boys&lt;/a&gt;\n\n\n-_-\n(SB request)\n","torrent":{"xt":"urn:btih:37bd58823b84f3076d2a7e9c33e2746fa68738f4","amp;dn":"Flash+Boys%3A+A+Wall+Street+Revolt+-+Michael+Lewis+%26amp%3B+Dylan+Bak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37bd58823b84f3076d2a7e9c33e2746fa68738f4","infoHashBuffer":{"type":"Buffer","data":[55,189,88,130,59,132,243,7,109,42,126,156,51,226,116,111,166,135,56,244]},"announce":[],"urlList":[]}}