{"title":"Missax - Adriana Chechik (CTRL-ALT-DEL Mommy V) HD","uid":15091361,"size":1035638403,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:37dc1883d4437a4459f45ad3add6b338d2a3858d&amp;dn=Missax+-+Adriana+Chechik+%28CTRL-ALT-DEL+Mommy+V%29+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"SudoSu","files":1,"time":1466902890,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/0OTH5 \nhttp://imgkiss.com/image/0O26g\r\n\r\nI put the box outside by the door, rang the bell, and hurried to my bedroom. I had no clue if the chip would work inside the sexy toy, or worse-- Mom would catch me in the act. I pressed my ear to the wall and listened to her open the box, she gasped in surprise. I heard her ruffle through her purse and I knew she was looking for her phone, fuck-- she's going to call Dad and know that the sex toy didn't come from him. I held my breath as I waited for her to text me, she thinks I'm at baseball practice. The text came in, &quot;coming home for dinner soon?&quot; I smile hopeful she'll start the process soon, &quot;no, I'll be very late. Go ahead and start without me.&quot; Seconds later I hear the soft buzz of the toy. I sneak out of my room to watch her turn.\r\n\r\nMom looks like a goddess as she slides her panties down and puts the vibrating egg up and down her clit. My mouth salivates as I see her pussy moisten, and she throws her head back in pleasure. The chip is programmed for her to completely lose her inhibitions, and I can tell it's working as she bucks her hips welcoming the chrome egg to spread her wide open. She grabs the remote and turns up the vibration causing her to have an orgasm that nearly collapses her. I watch as the shards of green in her eyes are replaced with white and I know the process is nearly complete.\r\n\r\nI walk in and grab the remote. She sits up and I program her to confess to me the deepest secrets of her thoughts about me. Mom is brutally honest and one confession makes me wince. She reminds me that I can program her in any way that I choose. I choose to let her out of the trance some-what so that she can move more fluidly, but I keep her mind under control. I want to feel her mouth on my cock. I'm obsessed with her perfect lips, warm and soft as they kiss me on the cheek. I'm dying to feel them wrapped around me as I fuck her pretty robotic face. I allow my mother to feel pleasure, I'm not an asshole, this has got to be good for her too. I couldn't wait to feel her pussy. My mom is so tight, so warm, wet, she squeezed my cock as I thrust in and out of her. Wet cum dribbled out of her pussy, down to her ass, and when she came she squeezed me deep inside of her.\r\n\r\nDon't worry. Mom won't remember a thing. I pull up my pants, remove the chip, the egg slides out of her tight pussy, and I can't wait to play with her as soon as we're alone again. 2016\r\n\r\nSail to another one at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:37dc1883d4437a4459f45ad3add6b338d2a3858d","amp;dn":"Missax+-+Adriana+Chechik+%28CTRL-ALT-DEL+Mommy+V%29+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37dc1883d4437a4459f45ad3add6b338d2a3858d","infoHashBuffer":{"type":"Buffer","data":[55,220,24,131,212,67,122,68,89,244,90,211,173,214,179,56,210,163,133,141]},"announce":[],"urlList":[]}}