{"title":"Marvel 1602 Collection","uid":8834397,"size":307444430,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3817ce3a2a684558c57b84f2361115707a236083&amp;dn=Marvel+1602+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377075971,"description":"Marvel 1602\nWritten by Neil Gaiman, Illustrated by Andy Kubert.\nAll's not well in the Marvel Universe in the year 1602 as strange storms are brewing and strange new powers are emerging! Spider-Man, the X-Men, Nick Fury, Dr. Strange, Daredevil, Dr. Doom, Black Widow, Captain America, and more appear in the waning days of the reign of Queen Elizabeth. As the world begins to change and enter into a new age, Gaiman weaves a thrilling mystery. How and why are these Marvel stars appearing nearly 400 years before they're supposed to?\nMarvel 1602: #1-8\n\nMarvel 1602: New World\nWritten by Greg Pak. Illustrated by Greg Tocchini.\nReturn to the world of 1602 Rising stars Greg Pak (X-Men: Phoenix -- Endsong) and Greg Tocchini (Thor: Son Of Asgard) pick up where the best-selling story by Neil Gaiman left off: America, the New World When Captain America was thrust back in time, it changed reality as we know it. Dinosaurs still roam the earth, and the Marvel super heroes we know came to exist 500 years early. Witness David Bruce Banner and Peter Parquagh become the Hulk and Spider-Man in the most eagerly-awaited event of the year\nMarvel 1602: New World #1-5\n\nMarvel 1602: Fantastick Four\nWritten by Peter David. Illustrated by Pascal Alixe.\nDoom returns! The Four from the Fantastik's greatest enemy has an insidious plan that takes them to the ends of the Earth! Peter David (Friendly Neighborhood Spider-Man, X-Factor) takes the reins with superstar artist-to-be Pascal Alixe (Superman, The Legion) for the eagerly awaited spin-off from Neil Gaiman's 1602. What does Doom want? Why doesn't Invisible Woman want to fight him? And what does Shakespeare have to do with it?\nMarvel 1602: Fantastick Four #1-5\n\nMarvel 1602: Spider-Man\nWritten by Jeff Parker. Illustrated by Ramon Rosanas.\nA return to the acclaimed universe created by Neil Gaiman and Andy Kubert kicks off as The Spider has reached manhood in the New World The young nation has grown peacefully, but Norman Osbourne's treachery finds a way to spoil the peace and put Peter's life on a new course - back to Europe. Jeff Parker Agents of Atlas] joins artist Ramon Rosanas to begin the final story of the 1602 saga\nMarvel 1602: Spider-Man 1602 #1-5\n\n1602 Sketchbook\n\nAll files in .cbr/.cbz formats ","torrent":{"xt":"urn:btih:3817ce3a2a684558c57b84f2361115707a236083","amp;dn":"Marvel+1602+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3817ce3a2a684558c57b84f2361115707a236083","infoHashBuffer":{"type":"Buffer","data":[56,23,206,58,42,104,69,88,197,123,132,242,54,17,21,112,122,35,96,131]},"announce":[],"urlList":[]}}