{"title":"Yii Rapid Application Development Hotshot","uid":8068705,"size":5910071,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3821ade54bad53bc4c018c95aa177970317f3f22&amp;dn=Yii+Rapid+Application+Development+Hotshot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"imarion","files":-1,"time":1359229083,"description":"Lauren J. O'Meara and James R. Hamilton III, &quot;Yii Rapid Application Development Hotshot&quot;\nEnglish | ISBN: 1849517509 | 2012 | PDF, EPUB | 340 pages | 5 + 15 MB\n\n\nBecome a RAD hotshot with Yii, the world's most popular PHP framework\n\nOverview\nA series of projects to help you learn Yii and Rapid Application Development.\nLearn how to build and incorporate key web technologies.\nUse as a cookbook to look up key concepts, or work on the projects from start to finish for a complete web application.\n\nIn Detail\n\nYii is a high performance PHP framework for rapid web application development. It is well designed, well supported, easy to learn, and easy to maintain. If you are beginning to learn web development or are a seasoned programmer with demanding clients, learning Yii will benefit your projects and career.\n\nYii Rapid Application Development Hotshot will guide you through a series of projects covering a variety of web development hot topics to build a complete application. You will explore key features of a web application as implemented in Yii and experience the power of rapid application development.\n\nSupercharge your projects and your programming ability by becoming a Yii Rapid Application Development Hotshot. Start with the topics that grab your attention or work through each project in sequence. At the end of each project, you will have a working application, a better understanding of Yii, and a new web development skill under your belt.\n\nIntegrate with Google API. Gamify your data. Share your functionality as a service. Mobilize your app. Mine and report on your information. Have fun and produce results!\n\nWhat you will learn from this book\nCatapult your application into existence with Yii's scaffolding capabilities.\nMobilize your web application with Yii and jQuery Mobile.\nLock down areas of your application with access control.\nManage users and permission levels.\nIncorporate Software as a Service into your application.\nGamify your data.\nMine your information with data query jobs and reporting.\nReuse your work as Yii modules.\n\nApproach\n\nPractical, real world example projects. Start with the topics that grab your attention or work through each project in sequence.\n\nWho this book is written for\n\nThis book is for intermediate to advanced level PHP programmers who want to master Yii. ","torrent":{"xt":"urn:btih:3821ade54bad53bc4c018c95aa177970317f3f22","amp;dn":"Yii+Rapid+Application+Development+Hotshot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3821ade54bad53bc4c018c95aa177970317f3f22","infoHashBuffer":{"type":"Buffer","data":[56,33,173,229,75,173,83,188,76,1,140,149,170,23,121,112,49,127,63,34]},"announce":[],"urlList":[]}}