{"title":"Morrowind","uid":6154254,"size":633464570,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3832c5aae2d4badf06e12cbd076827f3d434d39b&amp;dn=Morrowind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"etpirateb","files":1,"time":1296989498,"description":"\nMorrowind should not need any introduction by now, but in case...\n\n=================\nThe Elder Scrolls III: Morrowind, often simply referred to as Morrowind, is a single-player computer role-playing game developed by Bethesda Game Studios, and published by Bethesda Softworks and Ubisoft. It is the third installment in The Elder Scrolls series of games.\n\nThe main story takes place on Vvardenfell, an island in the Dunmer province of Morrowind, which lies in the empire of Tamriel and is far from the more civilized lands to the west and south that typified Daggerfall and Arena. The central quests concern the deity Dagoth Ur, housed within the volcanic Red Mountain, who seeks to gain power and break Morrowind free from Imperial reign.\n\nMorrowind was designed with an open-ended free-form style of gameplay in mind, with a lessened emphasis on the game's main plot.\n=================\n\n\n\nMorrowind is a little boring to install; there are three setups (Morrowind, Tribunal and Bloodmoon), patches, official mod and some external utilities to install.\n\nOriginally for my own use I made an archive with the whole _official_ Morrowind installed and patched. Now I decided to share it with the world, in case anyone other like the idea of an `unpack and go' clean Morrowind.\n\nThe torrent hashes a single 7zip solid archive with:\n- Morrowind\n- Tribunal\n- Bloodmoon\n- The eight official plug-ins\n-- Adamantium Armor\n-- Area Effect Arrows\n-- Bitter Coast Sounds\n-- Entertainers\n-- Helm of Tohan\n-- LeFemm Armor\n-- Master Index\n-- Siege at Firemoth\n- Morrowind Patch Project\n\nThe morrowind.exe has been fixed with Morrowind Code Patch and a no-cd patch; I used the patch to fix bugs, I also selected few Gameplay Changes or new Features. But only the ones I fond more reasonable and that do not change the game much.\n\nAll the patches, mods and the original morrowind.exe are included. So you can easily revert if you need.\n\nI also copied the three Morrowind story movies: the introduction, the half-game recap and the ending. I did not copied the other movies as actually unneeded (credits, menu...).\n\nThere is also a directory with various maps for fast travel, roads and political influences...\n\nFinally in the directory `utilities' are few items to improve your modding experience: the guide to scripting, tesame, testool, wrye mash and few others. In the data files folder are two programs to simply sort the mods. (One makes the mod-list, the second sort the file following the mod list)\n\nThe play:\n- unpack,\n- edit the morrowind_path.reg to match the directory where you installed,\n- start.\n\nMorrowind (as many old games) needs to write in its folder, so do not unpack it in `Program Files' or another Windows protected folder. Install somewhere like 'c:\\morrowind', 'c:\\games\\morrowind' or even your Document folder. Of course if you use Windows 98 or Wine this is not a problem at all.\n\nI say it again: this archive is meant as a `ready to go' VANILLA Morrowind. Patches a part, there is no fan-made content. Most probably you want some. Check planetelderscrolls.gamespy.com .\n","torrent":{"xt":"urn:btih:3832c5aae2d4badf06e12cbd076827f3d434d39b","amp;dn":"Morrowind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3832c5aae2d4badf06e12cbd076827f3d434d39b","infoHashBuffer":{"type":"Buffer","data":[56,50,197,170,226,212,186,223,6,225,44,189,7,104,39,243,212,52,211,155]},"announce":[],"urlList":[]}}