{"title":"Hermann Hesse - Magister Ludi (The Glass Bead Game)","uid":10506972,"size":15192045,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:387bc053f2afc283f9aaf1d23fac032367f417d3&amp;dn=Hermann+Hesse+-+Magister+Ludi+%28The+Glass+Bead+Game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1404783416,"description":"\nHermann Hesse - Magister Ludi (The Glass Bead Game) (Bantam, 1970).  Translated by Richard and Clara Winston, with a Foreword by Theodore Ziolkowski.\n\nISBN: 9780553262377 | 544 pages | PDF\n\n\n* This is a corrected copy of the PDF that originally appeared in my Hermann Hesse collection.  Some of the pages were inadequately scanned (missing page headers, text cut off, etc.) but I trust this new copy corrects these errors.  I apologize for the inconvenience.\n\nThe full Hesse collection, including an ePUB version of the present translation, can be found here: http://thepiratebay.se/torrent/10476431/  \n\n\nMAGISTER LUDI (1943), also known as THE GLASS BEAD GAME [Das Glasperlenspiel], was Hesse's last full-length work and won for him the Nobel Prize for Literature three years later.  Described as &quot;sublime&quot; by Thomas Mann, admired by Andre Gide and T. S. Eliot, it is considered one of the important novels of the 20th century.\n\nSet in the 23rd century, it is the story of Joseph Knecht, who has been raised in Castalia, the remote place his society has provided for the intellectual elite to grow and flourish, and devoted wholly to the mind and the imagination.  Since childhood, Knecht has been consumed with mastering the Glass Bead Game, which is thought in its purest form, a synthesis through which philosophy, logic, art, music and scientific law are appreciated simultaneously.\n\nPart romance, part philosophical tract, part utopian fantasy, the novel addresses the conflict between -- and the need to synthesize -- thought and action, intellect and the flesh.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                       &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:387bc053f2afc283f9aaf1d23fac032367f417d3","amp;dn":"Hermann+Hesse+-+Magister+Ludi+%28The+Glass+Bead+Game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"387bc053f2afc283f9aaf1d23fac032367f417d3","infoHashBuffer":{"type":"Buffer","data":[56,123,192,83,242,175,194,131,249,170,241,210,63,172,3,35,103,244,23,211]},"announce":[],"urlList":[]}}