{"title":"Social Collaboration For Dummies - David F.Carr","uid":11877572,"size":15960120,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38ae1ff4f6374058310e0785fa9490066b30a189&amp;dn=Social+Collaboration+For+Dummies+-+David+F.Carr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1430585220,"description":"Realize the potential of social collaboration in business with this easy-to-understand guide\n\nSocial media have proven to be an engaging and addictive mode of communication and information gathering for users on a personal level. However, by applying that same philosophy, a corporate collaboration system that employs social technologies could potentially get employees more involved in running an efficient and effective business. This fun and friendly guide shows you exactly how to put social networking to work in order to achieve business goals. Taking you beyond just the features and tools of social collaboration, the book focuses on where and how social collaboration principles and technologies can be applied in order to enhance the performance of an organization, regardless of how big or small it may be.\n\nHelps businesses understand how to introduce social collaboration practices into their organizations in order to create the results they are seeking\nDetails ways to transform a business into a social business by using social collaboration technologies\nProvides case studies that exemplify ways in which business can engage and learn in social collaboration\nSocial Collaboration For Dummies is an ideal introductory guide for anyone looking to use social collaboration to lead to improvements in productivity, organizational agility, innovation, and employee engagement","torrent":{"xt":"urn:btih:38ae1ff4f6374058310e0785fa9490066b30a189","amp;dn":"Social+Collaboration+For+Dummies+-+David+F.Carr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38ae1ff4f6374058310e0785fa9490066b30a189","infoHashBuffer":{"type":"Buffer","data":[56,174,31,244,246,55,64,88,49,14,7,133,250,148,144,6,107,48,161,137]},"announce":[],"urlList":[]}}