{"title":"Nirvana Nevermind 24 Bit Vinyl Pack","uid":9406975,"size":6967325768,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:390905a4c34948e74897ce1458f85ca0cbb9d211&amp;dn=Nirvana+Nevermind+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":3,"uploader":"politux","files":-1,"time":1388185068,"description":"\n  Nirvana Nevermind 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Alternative, Grunge\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 - 5,600 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz, 192,000 Hz\n\n  24/96\n\n  Nirvana - Nevermind 1996 MFSL 1-258 200g \n  Nirvana - Nevermind \n  Nirvana - Nevermind ORG 180g\n  Nirvana - Nevermind ORG Pallas\n  Nirvana - Nevermind The Singles (Limited RSD 2011 4xEP Box)\n\n  24/192\n\n  Nirvana - Nevermind (UIJY-9009 Japan 2LP)\n\n  Nevermind was never meant to change the world, but you can never predict when the Zeitgeist will hit, and Nirvana's second album turned out to be the place where alternative rock crashed into the mainstream. This wasn't entirely an accident, either, since Nirvana did sign with a major label, and they did release a record with a shiny surface, no matter how humongous the guitars sounded. And, yes, Nevermind is probably a little shinier than it should be, positively glistening with echo and fuzzbox distortion, especially when compared with the black-and-white murk of Bleach. This doesn't discount the record, since it's not only much harder than any mainstream rock of 1991, its character isn't on the surface, it's in the exhilaratingly raw music and haunting songs. Kurt Cobain's personal problems and subsequent suicide naturally deepen the dark undercurrents, but no matter how much anguish there is on Nevermind, it's bracing because he exorcizes those demons through his evocative wordplay and mangled screams -- and because the band has a tremendous, unbridled power that transcends the pain, turning into pure catharsis. And that's as key to the record's success as Cobain's songwriting, since Krist Novoselic and Dave Grohl help turn this into music that is gripping, powerful, and even fun (and, really, there's no other way to characterize &quot;Territorial Pissings&quot; or the surging &quot;Breed&quot;). In retrospect, Nevermind may seem a little too unassuming for its mythic status -- it's simply a great modern punk record -- but even though it may no longer seem life-changing, it is certainly life-affirming, which may just be better.","torrent":{"xt":"urn:btih:390905a4c34948e74897ce1458f85ca0cbb9d211","amp;dn":"Nirvana+Nevermind+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"390905a4c34948e74897ce1458f85ca0cbb9d211","infoHashBuffer":{"type":"Buffer","data":[57,9,5,164,195,73,72,231,72,151,206,20,88,248,92,160,203,185,210,17]},"announce":[],"urlList":[]}}