{"title":"Candide 2005 Live On Broadway - Hysterically Funny","uid":4113450,"size":734850032,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:392133744460867711549f5cc9b4da6dfacb3cac&amp;dn=Candide+2005+Live+On+Broadway+-+Hysterically+Funny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"rambam1776","files":18,"time":1207179505,"description":"If you know someone who thinks opera or musicals all suck, then this is the one to show them ? a combination of outrageous humor, spectacular orchestration, and the finest human voices can provide, not to mention sex, sex, sex! This is the 2005 production of Leonard Bernstein?s CANDIDE, Live On Broadway. I am making an effort to get all of my live performances DVDs torrented. If you love live theatre as much as I do, click my name for other performances, and if you have any of your own, please link them to this in the comment section. One other thing ? a few days ago I added a performance that had 100 leechers within hours, and now 4 people are seeding it. I try to put out some rarer stuff that is not going to attract tons of people, so please help me seed. I?m afraid my stuff is not the kind of thing that will be seeded by many. So let it sit on your drive for a week or so before dumping it! How else can we use torrents to build collections?\n\n\nThe description below is from the Amazon.I?m ripping this as an AVI, since the DVD had no special features. \n\n\nWhen a show&amp;#039;s pit band is the New York Philharmonic, you can expect something special, and that&amp;#039;s what this all-star Candide delivers. It is a concert performance, without scenery but with costumes, makeup, a bit of dancing, and a lot of acting. Musically, it sounds like the best of all possible Candides. Besides an unusually talented cast, its strong points include the pacing and accentuation of Marin Alsop, one of the brightest individuals in the younger generation of conductors; the polished presence of Thomas Allen, who doubles as the narrator and Dr. Pangloss, and the spirited participation of the brilliant Westminster Symphonic Choir. \nTaught in childhood to believe they live in &quot;the best of all possible worlds,&quot; the young characters struggle to preserve their optimism through a harrowing sequence of war, famine, shipwreck, piracy, slavery, rape, and disease with a sparkle in their eyes and a tune on their lips, until, with difficulty, they finally reach a sense of reality. \nCandide spans the traditional division between opera and Broadway. The soloists, all headliners, are recruited from both worlds. Broadway is represented by Patti LuPone, who became a legend in Evita, and Tony award winner Kristin Chenoweth. Paul Groves and Stanford Olsen have distinguished operatic backgrounds. They all sing Leonard Bernstein&amp;#039;s catchy tunes and the show&amp;#039;s clever lyrics with gorgeous voices, a lot of acting skill and a witty, flippant response to Voltaire&amp;#039;s cynical (or, rather, realistic) philosophy. --Joe McLellan \n\nProduct Description\nLeonard Bernstein&amp;#039;s brilliant comic operetta comes to dazzling new life under the guidance of director Lonny Price (A Class Act). Based on the classic Voltaire tale of an innocent young man&amp;#039;s journey through a life filled with colorful characters and unexpected life lessons this tune-filled frolic features Tony AwardÂ©-winners Patti LuPone and Kristin Chenoweth heading a dazzling cast with Paul Groves Stanford Olsen Sir Thomas Allen and the Westminster Symphonic Choir. The impeccable score (with lyrics by luminaries including Lillian Hellman Dorothy Parker Stephen Sondheim Richard Wilbur and John La Touche) includes a host of delightful songs such as &quot;Life Is Happiness Indeed&quot; &quot;It Must Be So&quot; &quot;You Were Dead You Know&quot; and &quot;Make Our Garden Grow.&quot; \n","torrent":{"xt":"urn:btih:392133744460867711549f5cc9b4da6dfacb3cac","amp;dn":"Candide+2005+Live+On+Broadway+-+Hysterically+Funny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"392133744460867711549f5cc9b4da6dfacb3cac","infoHashBuffer":{"type":"Buffer","data":[57,33,51,116,68,96,134,119,17,84,159,92,201,180,218,109,250,203,60,172]},"announce":[],"urlList":[]}}