{"title":"ABC of Clinical Leadership [PDF] [StormRG]","uid":11173789,"size":2072665,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:397888000a7976f67bda422163c987d2405b04ac&amp;dn=ABC+of+Clinical+Leadership+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":-1,"time":1412743386,"description":"TITLE/EDITIONABC of Clinical Leadership\nAuthor: Tim Swanwick (Author), Judy McKimm (Author)\nPaperback: 88 pages\nPublisher: BMJ Books; 1 edition (December 28, 2010)\nLanguage: English\nISBN-10: 1405198176\nISBN-13: 978-1405198172\nFormat: Retail PDF\n\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n_______________________________________________________________________________\n\n\nThis new title in the ABC series is written by clinical educators involved in running leadership programmes for doctors and other healthcare professionals, and defines the scope of clinical leadership, emphasising its importance in the clinical context. It develops and explores the key principles of leadership and management, and outlines the main leadership theories that have influenced healthcare practice.\nThrough the use of short illustrative case studies, the book considers the challenges and skills in leading multi-disciplinary health care teams as well as the key factors involved in the leadership and management of change both at an individual and organisational level. It explains the running of departments, units and practices and considers the healthcare system as part of wider social systems and structures.\n\nThe ABC of Clinical Leadership is written with reference to the Medical Leadership Competency Framework - co-developed by the NHS and all UK Medical Royal Colleges - and considers a systematic approach to leading clinical services, strategic planning, and the management of people and resources. It also covers educational leadership, collaborative working and the importance of leading ethically and with integrity. The book concludes by asking the all important question - does leadership development make a difference?","torrent":{"xt":"urn:btih:397888000a7976f67bda422163c987d2405b04ac","amp;dn":"ABC+of+Clinical+Leadership+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397888000a7976f67bda422163c987d2405b04ac","infoHashBuffer":{"type":"Buffer","data":[57,120,136,0,10,121,118,246,123,218,66,33,99,201,135,210,64,91,4,172]},"announce":[],"urlList":[]}}