{"title":"World Without Cancer_The Story of Vitamin B17 - G. Edward Griffi","uid":4114324,"size":3366187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39a654cc8e4f52810e27058c67bfd48cb8a1555a&amp;dn=World+Without+Cancer_The+Story+of+Vitamin+B17+-+G.+Edward+Griffi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"blackpen","files":1,"time":1207230472,"description":"This is The Full book in PDF, OCR  with Pics  \n\nGet this info to every one you love or hate /  nobody in this world should be dying of Cancer that goes for you also, This info needs to be free, If you download this Email it to everyone, put it on Emule, other torrent trackers,  just get it out there, \nand Thank you    G EDWARD GRIFFIN for this great book,    \n\n\n\n This book is a MUST READ for anyone, May 9, 2000\n\n(Amason review) \n\nMy brother died of cancer in 1978. Shortly after he died, I heard the tape &quot;The Politics of Cancer Therapy&quot;, which is based on the second half of the book &quot;World Without Cancer&quot;. That tape was one of the best done presentations I&amp;#039;ve ever heard--about anything. It is about the takeover of the field of medical education by the drug industry, and explains why cures for cancer aren&amp;#039;t really of great interest to the medical field.\n\nThe tape was so fascinating that I immediately went out, bought the book, found that even better, and made the trip out to interview Mr. Griffin.\n\nMr. Griffin is extremely well informed, writes and speaks clearly and makes his subjects very easy to understand.\n\nIf you have any interest in either an effective treatment for cancer, in world politics, or in politics and the medical field you simply have to read this book. I cannot speak too highly of it.\n\n\n\n","torrent":{"xt":"urn:btih:39a654cc8e4f52810e27058c67bfd48cb8a1555a","amp;dn":"World+Without+Cancer_The+Story+of+Vitamin+B17+-+G.+Edward+Griffi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39a654cc8e4f52810e27058c67bfd48cb8a1555a","infoHashBuffer":{"type":"Buffer","data":[57,166,84,204,142,79,82,129,14,39,5,140,103,191,212,140,184,161,85,90]},"announce":[],"urlList":[]}}