{"title":"Tits and Tugs 8 (The Score Group) [DVDRip]","uid":8910083,"size":1360274800,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:39db0abb2fb5a4482929678732836f57ee5508ee&amp;dn=Tits+and+Tugs+8+%28The+Score+Group%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"chkm8te","files":1,"time":1378999389,"description":"Tits &amp; Tugs 8 (The Score Group) [DVDRip]\n\nValory Irene, Elaina Gregory, Maserati, Beverly Paige, Desiree, Elizabeth Starr, Bailey Santanna, Danica Danali, Catt Green, Claudia KeAloha, Charlee Chase\n\nShe's a sexy girl-next-door with the most perfect tits you've ever seen, and now those FF-cup naturals are getting fucked and jizzed. Yes, Valory Irene has gone from shy girl to tits &amp; tugger in the scene we've been dreaming of. Plus, huge-breasted newcomers Maserati and Desiree team up on a lucky cock, porn star Elizabeth Starr busts out of retirement to take a load on her super-sized rack and more! Thirteen scenes in all, and even some surprise blow jobs!\n\nTHIRTEEN SCENES, INCLUDING VALORY IRENE'S FIRST BOY-GIRL!\n\nIt's the first boy-girl scene for Valory Irene, a newcomer with perfectly shaped FF-cup naturals. Valory strips out of a bikini to put on a tit show, then works her tits over the lucky stud's cock until he cums.\nBlack 'n' super-stacked Maserati drags her boyfriend into a public restroom where he buries his face between her H-cup naturals before the tits 'n' tugs action begins.\nRedhead Desiree services a hung, black stud in a bath tub, spreading her asshole for him before washing his cock with a sponge, talking dirty and offering up her wet tits for his cum.\nBrunette Beverly Paige is a student who gets called to the principal's office because of how she dresses. He can't resist fingering her shaved pussy then burying his dick between her tits.\nRedhead newcomer Catt Green, in her first boy-girl scene, gets her tits oiled up, then lies back to tug and tit-fuck the lucky stud.\nHawaiian MILF Claudia Kealoha puts on a show for a hotel bellhop stripping naked to have him finger her pussy while she plays with her tits and keeping up a steady stream of jack talk while he fucks her tits.\nDesiree and Maserati return from earlier in the DVD to share a cock...and offer up some sloppy blow job action, too! It's a friendly battle for cum as they suck, tit-fuck and end up sharing a load on their big, natural racks.\nDanica Danali is a super-sized XL Girl who gives her date an after-dinner treat by jacking his cock and burying it between her tits.\nBlonde plumper Bailey Santanna is a busty seamstress who loosens a guy's pants by taking out his cock and jacking it onto her GG-cup naturals.\nBeverly Paige and Catt Green are pillow-fighting friends who invite a friend over for a tit show, then jack his cock and have him tit-fuck them one by one.\nBlonde MILF Charlie Chase, tits busting out of a halter top, offers up her best, sloppy blow job, lies back to have her pussy fingered, then enjoys an energetic tit-fuck and a load of cum on her face.\nMega-busty porn legend Elizabeth Starr strips and has a stud play with her pink pussy and clit. Elizabeth can't stop talking dirty as he tit-fucks her massive rack.\nN-cup girl-next-door Elaina Gregory buries a cock with her big, floppy, natural tits in her first hardcore scene. She also jacks the cock while paying with her pussy and ends up with cum all over her tits.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=drna4nbxkwe8nk3iyvle.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=drna4nbxkwe8nk3iyvle.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=t2ihklf9oipmm9o1or1s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=t2ihklf9oipmm9o1or1s.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:39db0abb2fb5a4482929678732836f57ee5508ee","amp;dn":"Tits+and+Tugs+8+%28The+Score+Group%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39db0abb2fb5a4482929678732836f57ee5508ee","infoHashBuffer":{"type":"Buffer","data":[57,219,10,187,47,181,164,72,41,41,103,135,50,131,111,87,238,85,8,238]},"announce":[],"urlList":[]}}