{"title":"Medical- Surgical Nursing 7th Edition [Epub]","uid":9333559,"size":32046157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39dc62597642dc7e53a42ecc3140a4ec3d10064a&amp;dn=Medical-+Surgical+Nursing+7th+Edition+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"F1restorm","files":-1,"time":1386810232,"description":"Title: Medical-Surgical Nursing: Patient-Centered Collaborative Care, Seventh Edition\nAuthors: Donna D Ignatavicius and M Linda Workman\nPublished: 2013\nPublisher: Elsevier\nISBN: 9781437728019\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\nFormat conversion: convert epub to mobi (Kindle) with Calibre\nThere are some review questions on the publisher's website, registration required, but because this book is a copy I can't guarantee access to the online content. Better than paying $112 though and this book is quite comprehensive anyway. Hope it helps!\n\nTested on the above readers on laptop and Android tablet with no problems. Surprisingly at 6352 pages the book doesn't lag at all. Don't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\nUsing a uniquely collaborative and reader-friendly approach, expert authors Donna D. Ignatavicius and M. Linda Workman cover all the latest trends, evidence-based treatment guidelines, and additional updated information needed for safe clinical practice in medical-surgical nursing. This seventh edition features an expanded emphasis on patient safety and NCLEXÂ® Examination preparation, new ties to the QSEN priorities for patient safety, and a greater alignment with the language and focus of clinical practice. A new chapter on evidence-based practice and a wealth of effective online learning tools help solidify your mastery of medical-surgical nursing.","torrent":{"xt":"urn:btih:39dc62597642dc7e53a42ecc3140a4ec3d10064a","amp;dn":"Medical-+Surgical+Nursing+7th+Edition+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39dc62597642dc7e53a42ecc3140a4ec3d10064a","infoHashBuffer":{"type":"Buffer","data":[57,220,98,89,118,66,220,126,83,164,46,204,49,64,164,236,61,16,6,74]},"announce":[],"urlList":[]}}