{"title":"Keith Jarrett &amp; Charlie Haden - 2014 - Last Dance (HDTracks ","uid":10427300,"size":1254381539,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:39e21b5094f5366a10668ddb1ed950d51283b750&amp;dn=Keith+Jarrett+%26amp%3B+Charlie+Haden+-+2014+-+Last+Dance+%28HDTracks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"eika256","files":-1,"time":1403721299,"description":"Keith Jarrett &amp; Charlie Haden - 2014 - Last Dance\nHDTracks 24 bits, 96 KHz\n\nIn 2010, ECM released Jasmine, an informal archival recording of standards between old friends who hadn't worked together in over three decades. The recordings were made at Keith Jarrett's Cavelight home studio in 2007. The nine tunes on Last Dance are taken from those same sessions. There are two alternate takes of tracks from the earlier album. &quot;Where Can I Go Without You&quot; is played at a similar tempo, yet offers more lyricism from Charlie Haden. Gordon Jenkins' &quot;Goodbye,&quot; a well-known Benny Goodman theme, closes the set, but it's slower here, more emotionally resonant; almost poignant in the way it reveals something deeper than its articulation on the earlier volume. Thelonious Monk's &quot;'Round Midnight&quot; has been done by Jarrett before, but here it is offered with a curious, almost strange intro. As it unfolds, it reveals an affection for its melody that he's not previously displayed. Haden's confident ability to assert the correct note for each phrase has long been a trademark in his playing, but the warmth he offers to it here is remarkable. He remains open and inquisitive about its lyric rather than engaging in a nostalgic presentation. He knows there are still possibilities inside its framework. &quot;Everything Happens to Me&quot; is more uptempo, but far from quick. Haden's woody tone and impeccable swing add dimension to Jarrett's songlike pianism in the melody and solo. Bud Powell's &quot;Dance of the Infidels&quot; is not played with breakneck athleticism, but is sprightly and fluid. Jarrett digs with delight into the intricate melody, offering a punchy sense of reflexiveness in his solo, while Haden strides along. In his own solo, the bassist once more peels back the skin in the harmony and finds hints of several other melodies all placed within different sections of the tune's body. The elegance in the presentation of Cole Porter's &quot;Everytime We Say Goodbye&quot; reveals the pair's confidence in their interplay. They don't overstate anything; the music provides meaning all on its own. They relax into its beauty playing toward one another as hints, suggestions, and references to popular music history bridge the space between. Last Dance is a necessary addendum to Jasmine; it fleshes out the confident, mature, amiable, and eloquent speech in the canonical language these two jazz masters share. (AllMusic)\n\nTrack list:\n01 - My Old Flame\n02 - My Ship\n03 - 'Round Midnight\n04 - Dance of the Infidels\n05 - It Might As Well Be Spring\n06 - Everything Happens to Me\n07 - Where Can I Go Without You\n08 - Every Time We Say Goodbye\n09 - Goodbye\n\nPersonnel:\nKeith Jarrett - piano\nCharlie Haden - double bass\n\nEnjoy and share!","torrent":{"xt":"urn:btih:39e21b5094f5366a10668ddb1ed950d51283b750","amp;dn":"Keith+Jarrett+%26amp%3B+Charlie+Haden+-+2014+-+Last+Dance+%28HDTracks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39e21b5094f5366a10668ddb1ed950d51283b750","infoHashBuffer":{"type":"Buffer","data":[57,226,27,80,148,245,54,106,16,102,141,219,30,217,80,213,18,131,183,80]},"announce":[],"urlList":[]}}