{"title":"The History of interior decoration (Art Ebook).pdf","uid":11136420,"size":63739316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:39f3161eed28478e1e2d525b403ed9e601c61803&amp;dn=The+History+of+interior+decoration+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"STBGD","files":-1,"time":1412113182,"description":"Pdf / English / 1990 / 224 pages / 60.7 MB\n\nWhen this book was first published in 1983 there was no other study of its kind, and to my astonishment this is still the case. In 1984, Peter Thornton's Authentic Decor, the Domestic Interior 1620-1920 appeared, immediately becoming a classic and establishing itself as the ne plus ultra of reference books on furniture and fittings. However, it had never been my aim to write a study of the movable parts of the domestic interior, but to unite in one text all the elements from the disparate information available about what might be termed 'interior architecture'. Depressingly few interiors retain their original entity of interior architecture, attached fittings, movable furniture and other decorations such as pictures or tapestries. Thus the study of the shell and its former contents is too often of necessity carried out only through a painstaking reconstructive process - if either shell or contents survive. This is why Mario Praz's pioneering study, published in English as An Illustrated History of Interior Decoration in 1964, and Thornton's book both rely largely on contemporary illustrations to show what was, not what is. My book is largely concerned with what is.","torrent":{"xt":"urn:btih:39f3161eed28478e1e2d525b403ed9e601c61803","amp;dn":"The+History+of+interior+decoration+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39f3161eed28478e1e2d525b403ed9e601c61803","infoHashBuffer":{"type":"Buffer","data":[57,243,22,30,237,40,71,142,30,45,82,91,64,62,217,230,1,198,24,3]},"announce":[],"urlList":[]}}