{"title":"Buckethead Discography [Customized] [3 Nov 2010]","uid":5932399,"size":4020671127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a0e674a870a4563d7fffcc573fc1ef77409d4ff&amp;dn=Buckethead+Discography+%5BCustomized%5D+%5B3+Nov+2010%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Ghost_Face","files":-1,"time":1288823593,"description":"Buckethead Discography [Customized] [3 Nov 2010]\n\n\n\n\nBuckethead is a virtuoso guitarist who encompasses several genres of music. He has released 29 studio albums, 4 special releases and an EP as of 2010. He has performed on over 50 more albums by other artists. His music spans such diverse areas as progressive metal, thrash metal, funk, electronica, jazz, bluegrass, and avant-garde music.\n\n\n\n\n\nThis is a complete collection of every song Buckethead has ever performed on that is currently available as of 03 November 2010. \n\nIt includes:\n\n*** Full solo discography (29 albums).\n\n*** Every album in which he collaborated with another band or artist(s)\n\nIncluding; Colonel Claypool's Bucket of Bernie Brains, Guns N' Roses, Praxis, Serj Tankian, Deli Creeps, Science Faxtion, Cornbugs, El Stew, Arcana, Thanatopsis, Primus, \n\n*** All early demo tapes.\n\n*** Full Death Cube K (Bucketheads alias) discography.\n\n*** Live versions of many songs.\n\n*** Some untitled tracks only played when Buckethead is on tour.\n\n*** Also includes a number of rare songs in which it is believed Buckethead is\n    singing.\n\n\n\n\n\nCustomized:\n\n I have uploaded this torrent for the purpose of sharing with friends or anyone else who enjoys Bucketheads music. \n\nAs this is a personal collection, I have adapted it to my tastes and a small number of songs have been removed simply due to the fact I had never listened to them more than once. \n There are 100s of songs in this collection and I have kept the songs which I enjoy (which is around 95% of 850 files) so you are really not missing anything from the songs which have been removed.\n\n The majority of them were either samples from movies, voice samples from other artists, obscure 5-10 second beats or riffs, or extremely experimental material which just wasnt to my taste.\n\nAll these songs can easily be found elsewhere however if you do still want them.\n\n\n\nI have removed renamed all songs to simply;\n\n Buckethead - *Track Title*\n\nSo the track numbers are no longer in the filenames, but the information is still embedded within the files and can be seen in any media player.\n\n\nAll in all, this is an amazing collection of music by a brilliant, but underrated artist. It is very unique and even more diverse.\n\n","torrent":{"xt":"urn:btih:3a0e674a870a4563d7fffcc573fc1ef77409d4ff","amp;dn":"Buckethead+Discography+%5BCustomized%5D+%5B3+Nov+2010%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a0e674a870a4563d7fffcc573fc1ef77409d4ff","infoHashBuffer":{"type":"Buffer","data":[58,14,103,74,135,10,69,99,215,255,252,197,115,252,30,247,116,9,212,255]},"announce":[],"urlList":[]}}