{"title":"Engineers Of Victory By Paul Kennedy (Epub,Mobi) Gooner","uid":9678199,"size":15763418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a51b6b115d9e5f2405349a8c34d50444eaf4b78&amp;dn=Engineers+Of+Victory+By+Paul+Kennedy+%28Epub%2CMobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"GoonerTPB","files":2,"time":1393604859,"description":"Format: mobi/epub\nGenre: History/Second World War\nPrint Length: 464 pages\nRelease Date: 29 January 2013\n\nPaul Kennedy provides a new and unique look at how World War II was won. Engineers of Victory is a fascinating nuts-and-bolts account of the strategic factors that led to Allied victory. Kennedy reveals how the leaders' grand strategy was carried out by the ordinary soldiers, scientists, engineers, and businessmen responsible for realizing their commanders? visions of success.\n\nIn January 1943, FDR and Churchill convened in Casablanca and established the Allied objectives for the war: to defeat the Nazi blitzkrieg; to control the Atlantic sea lanes and the air over western and central Europe; to take the fight to the European mainland; and to end Japan's imperialism. Astonishingly, a little over a year later, these ambitious goals had nearly all been accomplished. With riveting, tactical detail, Engineers of Victory reveals how.\n\nKennedy recounts the inside stories of the invention of the cavity magnetron, a miniature radar 'as small as a soup plate' and the Hedgehog, a multi-headed grenade launcher that allowed the Allies to overcome the threat to their convoys crossing the Atlantic; the critical decision by engineers to install a super-charged Rolls-Royce engine in the P-51 Mustang, creating a fighter plane more powerful than the Luftwaffe's; and the innovative use of pontoon bridges (made from rafts strung together) to help Russian troops cross rivers and elude the Nazi blitzkrieg. He takes readers behind the scenes, unveiling exactly how thousands of individual Allied planes and fighting ships were choreographed to collectively pull off the invasion of Normandy, and illuminating how crew chiefs perfected the high-flying and inaccessible B-29 Superfortress that would drop the atomic bombs on Japan.\n\nAuthor:\n\nPaul Kennedy is internationally known for his writings and commentaries on global political, economic, and strategic issues. He earned his B.A. at Newcastle University and his doctorate at the University of Oxford. Since 1983, he has been the Dilworth Professor of History and director of international security studies at Yale University. \n\nHe is on the editorial board of numerous scholarly journals and writes for The New York Times, Los Angeles Times, The Atlantic, and many foreign-language newspapers and magazines. Kennedy is the author and editor of nineteen books, including The Rise and Fall of the Great Powers, which has been translated into more than twenty languages, followed by Preparing for the Twenty-first Century (1993), and The Parliament of Man (2006).","torrent":{"xt":"urn:btih:3a51b6b115d9e5f2405349a8c34d50444eaf4b78","amp;dn":"Engineers+Of+Victory+By+Paul+Kennedy+%28Epub%2CMobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a51b6b115d9e5f2405349a8c34d50444eaf4b78","infoHashBuffer":{"type":"Buffer","data":[58,81,182,177,21,217,229,242,64,83,73,168,195,77,80,68,78,175,75,120]},"announce":[],"urlList":[]}}