{"title":"The_Last_Story_USA_WII-VIMTO","uid":9627127,"size":8532723459,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:3a80750f912233babe942798d2a770ccd241507c&amp;dn=The_Last_Story_USA_WII-VIMTO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"ffm58","files":89,"time":1392609456,"description":"Publisher: Xseed Games \nDevelopers: Mistwalker, AQ Interactive \nGenre: RPG \nRelease Date: August 14, 2012 \nT for Teen: Language, Mild Suggestive Themes, Use of Alcohol, Violence \nRegion: NTSC \n\nTake charge of a band of mercenaries and journey with them into an epic and cinematic adventure in The Last Story for Wii. Players will explore secret-filled locations scattered across Lazulis Island, the heart of a human empire and scene of an unfolding drama that will bring hostilities between two ancient races to a head. Among the band of mercenaries under your control is Zael, a warrior imbued with rare powers and intrigued by the notion of one day becoming an honourable knight. But as Zael and his mercenary friends reach the islandï¿½s capital city and find themselves drawn into official affairs, they discover that honour is one quality that can never be taken for granted. \n\nCentral to gameplay in The Last Story is a combat system that calls on players to take the lead in employing tactical teamwork. By using the special &quot;Gathering&quot; ability, the character under your control will become the focal point for enemy aggression, freeing team-mates up to perform specific tasks or attacks and recover their health. The option of using either an automatic or manual attack system means players of all skill levels can alter the level of challenge to suit their abilities. And once you feel confident that youï¿½ve mastered the finer points of fighting, thereï¿½s a whole other arena in which to test your skills, with The Last Story offering cooperative and competitive online battles for 2-6 players. ","torrent":{"xt":"urn:btih:3a80750f912233babe942798d2a770ccd241507c","amp;dn":"The_Last_Story_USA_WII-VIMTO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a80750f912233babe942798d2a770ccd241507c","infoHashBuffer":{"type":"Buffer","data":[58,128,117,15,145,34,51,186,190,148,39,152,210,167,112,204,210,65,80,124]},"announce":[],"urlList":[]}}