{"title":"Yuri Norstein - Skazka Skazok (Tale of Tales)","uid":4258997,"size":242956302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3a8cf20951d4ce9f9fb6d39ffb05b5421da5a364&amp;dn=Yuri+Norstein+-+Skazka+Skazok+%28Tale+of+Tales%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"mfccorrea","files":3,"time":1214375253,"description":"Skazka Skazok (Tale of Tales) is a 27-minute animated short film, considered the masterpiece of influential Russian animator Yuri Norstein. Told in a non-narrative style by free association, the film employs various techniques including puppets, cut-outs, and traditional cell animation. Using classical music and &amp;#039;30s jazz tunes instead of dialogue, it&amp;#039;s a mood piece based on the Russian lullaby roughly translated, &quot;Go to sleep, or the little wolf will carry you away into the woods.&quot; The little wolf is the only reoccurring character and he does end up carrying a crying baby through the woods. The rest of the highly symbolic images are constructed to resemble what Norstein calls a &quot;visual memory,&quot; using images from his own memories. Traveling trains, falling snow and leaves, abandoned cars, and dancing couples all come into play. Picasso&amp;#039;s Minotaur, Alexander Pushkin&amp;#039;s literary characters, and other figures from history and art interact on a two-dimensional plane. One particular scene involves a little boy eating an apple in the snow. He tries to share his apple with some crows, but his drunken father drags him away. Tale of Tales was named &quot;the best animated film of all time&quot; by the 1984 Los Angeles Olympic Arts Festival.\n\nEmbedded English subtitles. Spanish and Portuguese (Brazilian) .srt subtitles.","torrent":{"xt":"urn:btih:3a8cf20951d4ce9f9fb6d39ffb05b5421da5a364","amp;dn":"Yuri+Norstein+-+Skazka+Skazok+%28Tale+of+Tales%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a8cf20951d4ce9f9fb6d39ffb05b5421da5a364","infoHashBuffer":{"type":"Buffer","data":[58,140,242,9,81,212,206,159,159,182,211,159,251,5,181,66,29,165,163,100]},"announce":[],"urlList":[]}}