{"title":"James Patterson-Gone","uid":15505302,"size":228293719,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b06962abb6d213c887471ad7f407a911bde39aa&amp;dn=James+Patterson-Gone&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"twocows","files":10,"time":1470569961,"description":"\nA crime lord has declared war on America. Only Detective Michael Bennett knows why.\r\nManuel Perrine doesn't fear anyone or anything. A charismatic and ruthless leader, Perrine slaughters rivals as effortlessly as he wears his trademark white linen suit. Detective Michael Bennett once managed to put Perrine behind bars, the only official in the US ever to accomplish that. But now Perrine is out, and he has sworn to find and kill Bennett and everyone dear to him.Detective Bennett, along with his ten adopted children, their nanny, and his grandfather, are hidden safely on a rural California farm, with guards courtesy of the FBI's witness protection program. Perrine begins to embark on an escalating series of assassinations across the country, killings whose brazenness and audacity bring into question the possibility of safety and law in the US. The FBI has no choice but to ask Detective Bennett to risk it all in Perrine's war on America.With explosive action and fierce villainy that rivals James Bond movies at their best, Gone is the next astounding novel by James Patterson","torrent":{"xt":"urn:btih:3b06962abb6d213c887471ad7f407a911bde39aa","amp;dn":"James+Patterson-Gone","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b06962abb6d213c887471ad7f407a911bde39aa","infoHashBuffer":{"type":"Buffer","data":[59,6,150,42,187,109,33,60,136,116,113,173,127,64,122,145,27,222,57,170]},"announce":[],"urlList":[]}}