{"title":"Alfred 2.6.374 with powerpack [Mac Os X] [Coque599]","uid":11672696,"size":5855811,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3b6054b62c34fe53bbd8ca980fa8dd2e292439bd&amp;dn=Alfred+2.6.374+with+powerpack+%5BMac+Os+X%5D+%5BCoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"coque599","files":1,"time":1422736648,"description":"Alfred is an award-winning productivity application for Mac OS X.\nAlfred saves you time when you search for files online or on your Mac. Be more productive with hotkeys, keywords and file actions at your fingertips.\n\nFind Applications &amp; Files\nLaunch apps and files on your Mac without lifting your hands off the keyboard. Alfred learns which apps you use most and prioritises them when you search.\nIncrease your productivity with handy filter keywords, and ward off RSI, making your mouse almost obsolete!\n\nQuick-Search the Web\nUse built-in web searches and your own custom searches to make it faster than ever to search the web by prefixing your search with keywords like wiki, twitter or youtube.\nCustomise the default searches in Alfred's main window to make them fit your everyday needs.\n\nCreate and Import Workflows\nCreate immensely powerful workflows by connecting keywords, hotkeys and actions together to extend Alfred to do amazing things without writing a single line of code!\nExport your workflows to share, or import those created by our brilliant developer community.\n\nClipboard &amp; Snippets\nAccess text you've saved to your clipboard with a keyboard shortcut, search past clips and paste them wherever you're working.\nSave snippets for your most frequently used clips like addresses and email signatures to save time and effort.\n\nTheming\nMatch Alfred to your desktop, your clothes or your mood. Create your own themes by choosing colours, fonts, sizes and more.\nShow off your design skills and share your themes with friends, and import their themes.\n\n\n\n\nAlfred Powerpack\nThe Powerpack is a set of incredibly powerful features, built on top of the robust core of Alfred. Deeply integrated with OS X, it will make you more productive than ever!\nBoost your productivity even further with the Powerpack\n\nSeed And Enjoy\nIf you like my work vote it good","torrent":{"xt":"urn:btih:3b6054b62c34fe53bbd8ca980fa8dd2e292439bd","amp;dn":"Alfred+2.6.374+with+powerpack+%5BMac+Os+X%5D+%5BCoque599%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b6054b62c34fe53bbd8ca980fa8dd2e292439bd","infoHashBuffer":{"type":"Buffer","data":[59,96,84,182,44,52,254,83,187,216,202,152,15,168,221,46,41,36,57,189]},"announce":[],"urlList":[]}}