{"title":"Virginia Woolf - Orlando / To the Lighthouse (Unabridged)","uid":4638501,"size":231084927,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3b9acda439537f6c2d2eeec78b6e3de92ba570d7&amp;dn=Virginia+Woolf+-+Orlando+%2F+To+the+Lighthouse+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"sheila6","files":17,"time":1231633836,"description":"Audio Books : Literary : Other quality : English\n\n\n\n\nTo the Lighthouse:\n\nIt's wondrous to listen to a fine reading of a long-loved novel. Leishman makes masterly use of volume, timbre and resonance to distinguish between characters and draw us into the emotional swings and vibrations of the internal musings of each. \n\nShe creates not a new but a more nuanced reading, following the interwoven streams of consciousness in a British English that lends authenticity to each voice. \n\nLeishman swims smoothly through Woolf's sentences that ebb and flow with numerous parenthetical thoughts and fresh images. These passages are interspersed with quick, sharp, simple sentences that gain strength in contrast. \n\nLeishman also draws our attention to Woolf's poetic prose: her rhythms and images, her use of hard consonants in monosyllabic words in counterpoint to long, soft, dreamy words and phrases. \n\nTo The Lighthouse plays back and forth between telescopic and microscopic views of nature and human nature. Mrs. Ramsey is both trapped in and pleased in her roles as wife, mother and hostess. The introspective Mr. Ramsey is consumed with his legacy of long-since-published abstract philosophy. This is a book that cannot be read - or heard - too often.\n\n\n\n\nOrlando:\n\n&quot;Orlando&quot; is a fictional biography whose subject in the beginning is a sixteen-year-old boy in the Elizabethan era and in the end - three hundred years later - is a thirty-six-year-old woman. \n\nThis is not a novel about transsexuality, as such a premise would indicate, but it is a statement about sexual identity and gender roles in English society as only an author like Virginia Woolf could make, territory not even the brazen D.H. Lawrence could traverse with much confidence. It is a lyrical tour de force in which Woolf displays her considerable talent for subtly describing moods and scenery, but most surprisingly, it demonstrates her sly sense of humor and satire.\n\nOrlando's gender alteration is naturally the central event of his preternaturally long life, but his aging only twenty years over a course of three centuries is certainly no less bizarre. To describe the circumstances under which he becomes a woman or explain the logic by which he ages so slowly would be giving away too much in this review, nor would it really help to recommend the novel to one who is not yet persuaded to read it, so I will be silent on that account, saying only that these outrageous devices fully succeed as vehicles to explore Woolf's theme of femininity with respect to English cultural and historical frames of reference.\n\nThe novel examines the effect of gender alteration on Orlando's amorous and professional capacities. As a young nobleman in the Elizabethan court whose interests are swordsmanship and poetry, he is engaged to an aristocratic Irish girl, has a torrid affair with a Russian princess, and meets a silly woman who, resembling nothing so much as a hare, calls herself the Archduchess Harriet. After serving as an ambassador in Turkey, Orlando becomes a woman, joins a band of gypsies, and returns to England where he (she) must handle the legalities regarding his dukeship because of his new gender. As a woman, he manages to gain the romantic attentions of famous writers like Pope, Dryden, and Swift before eventually marrying and having a son. Some surprises ensue, but let it suffice to say that Orlando is not the only androgynous character in the novel.\n\nAn underlying, and highly controversial, implication is that every human being harbors aspects of both genders, mainly psychological, but Woolf goes so far as to make them physical in order to press the point. Although the idea may seem tame now, &quot;Orlando&quot; may have set a precedent for cross-gender role-playing when it was first published in 1928. The novel is very much ahead of its time; it has a sort of nonchalant sophistication that characterizes the type of magical realism that was to become a large part of European-influenced literature throughout the rest of the twentieth century. My admiration for Virginia Woolf only increases with each novel of hers that I read, and &quot;Orlando&quot; is in my opinion the best yet.\n\n\n\n\nEnjoy and Seed!","torrent":{"xt":"urn:btih:3b9acda439537f6c2d2eeec78b6e3de92ba570d7","amp;dn":"Virginia+Woolf+-+Orlando+%2F+To+the+Lighthouse+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b9acda439537f6c2d2eeec78b6e3de92ba570d7","infoHashBuffer":{"type":"Buffer","data":[59,154,205,164,57,83,127,108,45,46,238,199,139,110,61,233,43,165,112,215]},"announce":[],"urlList":[]}}