{"title":"Zombie Objective v1.0.7 [Mod Money] Apk-XpoZ","uid":15901716,"size":57832638,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3bab7e66b5eee7e9ac72217628f88b702bdf2fd5&amp;dn=Zombie+Objective+v1.0.7+%5BMod+Money%5D+Apk-XpoZ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"meXpoZ","files":5,"time":1475017182,"description":"Zombie Objective v1.0.7 [Mod Money] Apk-XpoZ \r\n\r\n| Category: Action | | Requires : Android 3.0 and up | \r\n\r\n \r\n\r\n\r\nTo become the ultimate zombie destroyer... \r\n\r\nWhat the Mod: \r\n\r\n&gt;Money \r\n\r\n\r\nWhat is in this version : \r\n\r\n- New Mission Helper. \r\n- fixed user interface bug that occurs on some tablets. \r\n\r\nGame Review: \r\n\r\nThe war against the dead has begun. Zombie Objective is a pivotal military operation to secure a zombie-infested city. You are a member of an elite military team that will blast through the dead until the zombies are annihilated, and the city is secure. You will carry out missions to defend assets, protect the injured, gather supplies, provide sniper support and above all, hunt and kill the zombies. \r\nIn this thrilling zombie shooter, you are armed with guns and melee weapons, tech, and armor, to help you survive the hordes of dead swarming this city. To become the ultimate zombie destroyer, you will need all of your tactical training and military skills to fight the dead in 7 unique environments. \r\n\r\nCustomize your equipment and weapons to play any style you want. Hunt the dead as a heavy machine gunner, a stealth zombie sniper, a super fast ninja, a machete zombie hunter, an axe murderer, a samurai zombie fighter, and more. \r\n\r\nIf you are tired of standing in one place shooting at waves of zombies, then this is the game for you. Zombie Objective is a free-movement first person shooter (FPS). \r\n\r\n \r\n\r\nKILLER FEATURES: \r\n&gt; 7 large locations with stunning 3D graphics. Each map presents unique challenges, and requires different tactical strategies. Choose between easy, hard, or killer missions. \r\n&gt; 7 Modes of Gameplay: Sniper, Defend, Gather, Protect, Survival, Attack, and Boss Battles. \r\n&gt; 12+ Zombie Types: Shufflers, Fast movers, Spitters, Smoking Zombies, Fire Zombies, Vicious Dogs, Rage Zombies, Armored Zombies, Mutant Zombies, Exploding Zombies, Bosses and more. \r\n&gt; 21 modern and futuristic Guns: Small guns, sniper rifles, shotguns, long guns, and heavy machine guns. \r\n&gt; Melee weapons: Crowbar, hunting knife, machete, bloody axe, deadly katana, dragon sword, and the awesome laser sword. \r\n&gt; Armor and shoes to protect you and help you outrun the zombies on your missions. \r\n&gt; Powerful equipment and Boosters: Grenades, land mines, holograms, slow motion device, medkits and power ups. \r\n&gt; Controls: Autofire for the casual gamer or manual shooting for the FPS gamer. 180 degree turn button for quick reaction. Virtual analog stick for full movement. \r\n\r\n\r\nMore At GooglePlay:- \nhttps://play.google.com/store/apps/details?id=com.killerbeanstudios.zombieobjective\r\n\r\n\r\nHigh Quality Movies in Ultra compressed size \r\n\r\n\r\nwithout loss in Quality. \r\n\r\n&amp;&amp;&amp; \r\n\r\nFull Android Games &amp; App. \r\n\r\n\r\nXpoZ.Torrent \r\n\r\n\r\nPlz seed Back &amp; keep alive this torrent. \r\n\r\nIf You Need Seeder any of My torrent, Let me Know. \r\n\r\nI'm always there for Seeding. \r\n\r\nAnd Also If You Liked My Torrent, Plsz Don't Forget to Left FeedBack and Comment. \r\n\r\nMore Uploads &amp; For FeedBack Me..... \r\n\r\n\r\nFollow Me At Google+..........:- https://plus.google.com/+XpoZTorrent","torrent":{"xt":"urn:btih:3bab7e66b5eee7e9ac72217628f88b702bdf2fd5","amp;dn":"Zombie+Objective+v1.0.7+%5BMod+Money%5D+Apk-XpoZ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bab7e66b5eee7e9ac72217628f88b702bdf2fd5","infoHashBuffer":{"type":"Buffer","data":[59,171,126,102,181,238,231,233,172,114,33,118,40,248,139,112,43,223,47,213]},"announce":[],"urlList":[]}}