{"title":"Lynda Resnick: Fresh Approaches to Branding and Marketing","uid":4783555,"size":188920876,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3c417aafdb86aeb8173c352a03e5083884333d1f&amp;dn=Lynda+Resnick%3A+Fresh+Approaches+to+Branding+and+Marketing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"the_Phyrexian","files":-1,"time":1237473153,"description":"Lynda Resnick, one of Working Woman's Top 50 U.S. Women Business Owners, is behind the marketing success of brands such as POM Wonderful, Fiji Water and Teleflora. She and her husband Stewart Resnick also own Paramount Farms and Paramount Citrus Companies, making them the largest farmers of tree crops in the U.S.\n\nLisa Napoli - In over 20 years in journalism, Lisa Napoli has been a writer at CNN, a columnist and reporter for The New York Times, an on-air correspondent for MSNBC, a columnist for MSNBC.com, and a producer (in various capacities) for News Corp. and for the home-shopping channel QVC. Napoli has directed documentaries that have aired on public television, and written many news stories for a variety of publications, which her father dutifully archives in cardboard boxes. Most recently, Napoli worked for a start-up radio station called Kuzoo FM 90 in the formerly media-free Kingdom of Bhutan, a country between India and China.\nLynda Resnick - Lynda Resnick began her business career at the age of 19, when she founded a full-service advertising agency. Other ventures throughout her career include corporate management, marketing, product development, and most recently, writing. She and her husband Stewart are passionate about all things healthy and Resnick is behind the marketing success of brands such as POM Wonderful, Fiji Water and Teleflora. In her role as President of Teleflora, Resnick introduced &quot;Flowers in a Gift,&quot; which earned her a gold Effie award. For six years, Resnick has been listed as one of Working Woman's Top 50 U.S. Women Business Owners. She serves on the Executive Board of The Aspen Institute and chairs the Development Committee; the Executive Board for the UCLA Medical Sciences; CaP CURE and the Milken Family Foundation. She is a Trustee and Executive Vice President of Los Angeles County Museum of Art, as well as the Chair of the Collections Committee, and is a Trustee of the Philadelphia Museum of Art. Along with her husband, she is a proud parent and grandparent and calls Beverly Hills and Aspen home.","torrent":{"xt":"urn:btih:3c417aafdb86aeb8173c352a03e5083884333d1f","amp;dn":"Lynda+Resnick%3A+Fresh+Approaches+to+Branding+and+Marketing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c417aafdb86aeb8173c352a03e5083884333d1f","infoHashBuffer":{"type":"Buffer","data":[60,65,122,175,219,134,174,184,23,60,53,42,3,229,8,56,132,51,61,31]},"announce":[],"urlList":[]}}