{"title":"The Fat Chance Cookbook: More Than... (Robert Lustig)","uid":9497837,"size":22308196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c60864348457b3a0a7866d293d21a28f2837389&amp;dn=The+Fat+Chance+Cookbook%3A+More+Than...+%28Robert+Lustig%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"7","files":-1,"time":1390154618,"description":"The Fat Chance Cookbook: More Than 100 Recipes Ready in Under 30 Minutes to Help You Lose the Sugar and the Weight\n\n\nFat Chance became an instant New York Times bestseller. Robert Lustig s message that the increased sugar in our diets has led to the pandemic of chronic disease over the last thirty years captured our national attention.\nNow, in The Fat Chance Cookbook, Lustig helps us put this information into action for ourselves. With more than 100 recipes as well as meal plans, nutritional analyses, shopping lists, and food swaps, he shows us easy ways to drastically reduce sugar and increase fiber to lose weight and regain health ? both for ourselves and for our families. Lustig also shows us how to navigate the grocery store with handy lists for stocking the pantry as well as how to read a food label in order to find hidden sugars and evaluate fiber content.\nAccessible, affordable, and geared toward lasting results, The Fat Chance Cookbook will be a fun and easy roadmap to better health for the whole family.\n\nGenre:  Non- fiction\n\n","torrent":{"xt":"urn:btih:3c60864348457b3a0a7866d293d21a28f2837389","amp;dn":"The+Fat+Chance+Cookbook%3A+More+Than...+%28Robert+Lustig%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c60864348457b3a0a7866d293d21a28f2837389","infoHashBuffer":{"type":"Buffer","data":[60,96,134,67,72,69,123,58,10,120,102,210,147,210,26,40,242,131,115,137]},"announce":[],"urlList":[]}}