{"title":"Legendary.The.Best.of.Belladonna.DiSC1+2.XXX.DVDRip.x264-CHiKANi","uid":8814490,"size":3296006064,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3caab3103b31e02bc33ea5656b74df06e45c9380&amp;dn=Legendary.The.Best.of.Belladonna.DiSC1%2B2.XXX.DVDRip.x264-CHiKANi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"chkm8te","files":2,"time":1376546235,"description":"Legendary.The.Best.of.Belladonna.DiSC1.XXX.DVDRip.x264-CHiKANi\nLegendary.The.Best.of.Belladonna.DiSC2.XXX.DVDRip.x264-CHiKANi\n\nBelladonna, Alexis Texas, Bobbi Starr, Dana DeArmond, Sandra Romain, Joanna Angel, Cytherea\n\nA Belladonna Entertainment Compilation, Over 6 Hours Of Only The Best!\n10 Of Her Favorite Scenes! Handpicked By Belladonna!\nSee Why Belladonna Is Referred To By Everyone As Legendary!\n'Legendary: The Best Of Belladonna' is a double-disc compilation showcasing a true porn icon's varied career. With fetish-flavored girl-girl sessions, graphic cock worship, nasty interracial fucking and anal mayhem, the 10 scenes cover the gamut of the gap-toothed, tattooed beauty's distinctive performing, directing and sexual talents. Assembled by Bella's longtime filmmaking partner, Aiden Riley, the new collection delivers the finest scenes they created together, constantly demonstrating the originality, quality and genuine lust beloved by Belladonna's legion of fans. Disc One is all filthy heterosexual fun, while Disc Two is dedicated to lesbian sex!\nHandsome stud James Deen manhandles the star in two scenes of anal ramming and foot fetish. In two separate scenes of intense interracial double-penetration, the star takes on the enormous black cocks of Prince Yahshua and Rico Strong. Joanna Angel and Bella spend a romantic afternoon of intimate, dyke-punk passion. Gorgeous Bella, Dana DeArmond and Bobbi Starr have a butthole-stretching sleepover. Big-assed beauty Alexis Texas joins Bella for some dirty discussion and sex toy product testing. Nasty Euro-mistress Sandra Romain's bizarre dinnertime session re-defines silverware etiquette. The Legend shares outrageous, perverted action with Mr. Pete, Mark Wood, John Strong and Cytherea. One of the world's timeless porn performers, Belladonna pursues her art with a smiling enthusiasm that can't be faked ... because her creative output has always been about pleasing the fans by doing what she loves best. 'Legendary: The Best of Belladonna' is the perfect retrospective of an uninhibited, extremely popular sexual explorer!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=3nvu2uqz2t8vhoz06v2l.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=3nvu2uqz2t8vhoz06v2l.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=lrix2ts9cs45dx8138ij.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=lrix2ts9cs45dx8138ij.jpeg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=hf6u7ek0uy85kf1ecbw0.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=hf6u7ek0uy85kf1ecbw0.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:3caab3103b31e02bc33ea5656b74df06e45c9380","amp;dn":"Legendary.The.Best.of.Belladonna.DiSC1%2B2.XXX.DVDRip.x264-CHiKANi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3caab3103b31e02bc33ea5656b74df06e45c9380","infoHashBuffer":{"type":"Buffer","data":[60,170,179,16,59,49,224,43,195,62,165,101,107,116,223,6,228,92,147,128]},"announce":[],"urlList":[]}}