{"title":"Tsukihime + Ever After soundtrack","uid":4244030,"size":442905118,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d0fdd4b4d265ad55bb886bf6cb1ed4c4f8edafe&amp;dn=Tsukihime+%2B+Ever+After+soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"mikeysama","files":14,"time":1213703737,"description":"This is an ISO for the visual novel Tsukihime. Also included is the Ever After soundtrack. The game is in Japanese, but a patch can be found easily on Google. The patch is not included as a courtesy to the group who created it, as they have done good work and should not be discouraged. They ask that the patch not be included with pirated copies or used in a way that promotes piracy. However, Tsukihime is almost impossible to find, and is sold at exorbitant prices due to it no longer being in production, money which the developers/authors will not see at this point anyway. If Type-moon puts the game back into production, I&amp;#039;d gladly pay a reasonable price for it, but as it stands piracy is the only realistic way to obtain the game, whether the translation group likes it or not. I know this doesn&amp;#039;t matter to the average Pirate Bay user, but I do encourage everyone to purchase this game should it go back into production. The translation patch does work with this ISO copy of the game, simply mount the ISO in this torrent (without installing the game) and once you&amp;#039;ve obtained the patch, use that to install the game. Also included is the Ever After soundtrack. Once the game is fully installed, place the CD folder in the game&amp;#039;s directory. Enjoy, and please seed.","torrent":{"xt":"urn:btih:3d0fdd4b4d265ad55bb886bf6cb1ed4c4f8edafe","amp;dn":"Tsukihime+%2B+Ever+After+soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d0fdd4b4d265ad55bb886bf6cb1ed4c4f8edafe","infoHashBuffer":{"type":"Buffer","data":[61,15,221,75,77,38,90,213,91,184,134,191,108,177,237,76,79,142,218,254]},"announce":[],"urlList":[]}}