{"title":"Odysseus Elytis - Nobel Prize in Literature, 1979 (3 books)","uid":11860843,"size":8662082,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3d74993929ac25f07a33d526cc9db86b34881c10&amp;dn=Odysseus+Elytis+-+Nobel+Prize+in+Literature%2C+1979+%283+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":6,"time":1430267957,"description":"\nODYSSEUS ELYTIS (1911-1996) was a Greek poet who was awarded the 1979 Nobel Prize in Literature.  The Swedish Academy declared in its presentation that his poetry &quot;depicts with sensual strength and intellectual clearsightedness, modern man's struggle for freedom and creativeness. . .  [In] its combination of fresh, sensuous flexibility and strictly disciplined implacability in the face of all compulsion, Elytis' poetry gives shape to its distinctiveness, which is not only very personal but also represents the traditions of the Greek people.&quot;\n\nElytis' poetry addresses the power of language and connects the history and mythology of Greece to the physical world and to the realities of the modern age.  Renowned for their lyricism and profound optimism, his poems capture the natural wonders of Greece and give voice to the contemporary Greek -- and a more universally human -- consciousness.\n\nTHE COLLECTED POEMS (1997) was the first complete collection of Elytis's poems in any language.  The volume includes his early poems, influenced in equal parts by surrealism and the natural world; &quot;Song Heroic and Mourning for the Lost Second Lieutenant of the Albanian Campaign&quot;, his epic poem connecting Greece's, and his own, Second World War experience to the myth of the eternal Greek hero; his most ambitious work, &quot;The Axion Esti&quot;; and his mature poetry, from &quot;Maria Nephele&quot; to &quot;West of Sorrow&quot;.\n\nElytis summarized his life's work in a 1975 interview: &quot;I consider poetry a source of innocence full of revolutionary forces.  It is my mission to direct these forces against a world my conscience cannot accept, precisely so as to bring that world through continual metamorphoses more in harmony with my dreams.  I am referring here to a contemporary kind of magic whose mechanism leads to the discovery of our true reality.  It is for this reason that I believe, to the point of idealism, that I am moving in a direction which has never been attempted until now.  In the hope of obtaining a freedom from all constraint and the justice which could be identified with absolute light, I am an idolater who, without wanting to do so, arrives at Christian sainthood.&quot;\n\n\nThe following books are in PDF format:\n\n* THE COLLECTED POEMS OF ODYSSEUS ELYTIS (Johns Hopkins UP, 1997).  Translated by Jeffrey Carson and Nikos Sarris.\n\n* MARIA NEPHELE: A Poem in Two Voices (Houghton Mifflin, 1981).  Translated by Athan Anagnostopoulos.\n\n* THE SOVEREIGN SUN: Selected Poems (Temple UP, 1974).  Translated by Kimon Friar.\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n            &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:3d74993929ac25f07a33d526cc9db86b34881c10","amp;dn":"Odysseus+Elytis+-+Nobel+Prize+in+Literature%2C+1979+%283+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d74993929ac25f07a33d526cc9db86b34881c10","infoHashBuffer":{"type":"Buffer","data":[61,116,153,57,41,172,37,240,122,51,213,38,204,157,184,107,52,136,28,16]},"announce":[],"urlList":[]}}