{"title":"A guide to overcoming depression (with cognitive therapy forms)","uid":8171089,"size":526888972,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3d91f85c7b8055b274ca56164a156df95e68014b&amp;dn=A+guide+to+overcoming+depression+%28with+cognitive+therapy+forms%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"tri895","files":-1,"time":1361428438,"description":"The torrent includes recreations of the cognitive therapy forms used in the movie.\n\nTo support video producer: http://www.monkeysee.com.au/depression_video.htm\n\nDVD: 45 minutes\n\nIn this acclaimed program from Monkey See Productions four people will talk about their depression and actually teach the techniques that they have used to help overcome it. These techniques are based on cognitive behavioural therapy, a very successful and popular form of therapy for many types of depression. Additional insight is given by Professor Philip Boyce, Professor of Psychiatry at the University of Sydney. The program is presented by well known comedian Spike Milligan, who despite suffering from severe and debilitating depression for much of his time, has managed to lead a very full and creative life.\n\nCognitive behaviour therapy involves common sense and practical notions of how to recover from depression, yet it is based on well grounded psychological research. It has proven to be a successful treatment for many forms of depression, and this video teaches how to use these tools that have worked so well for other people.\n\nThis program was developed as a self help tool for sufferers of depression, and for use by health professionals in clinical and group situations. It has also been successfully used in the training of health professionals.\n\nWhile providing you with useful and practical techniques that will help you to master depression, you will also get to know the people in the video. The program gives insight into depression and hope for a way out.\n\n* What is depression?\n* What is cognitive behavioural therapy?\n* Daily mood monitor and daily thoughts diary\n* Meditation, focusing and imagery techniques\n* Daily activity plan\n* The role of medication\n* Suicide prevention\n* Advice for family and friends","torrent":{"xt":"urn:btih:3d91f85c7b8055b274ca56164a156df95e68014b","amp;dn":"A+guide+to+overcoming+depression+%28with+cognitive+therapy+forms%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d91f85c7b8055b274ca56164a156df95e68014b","infoHashBuffer":{"type":"Buffer","data":[61,145,248,92,123,128,85,178,116,202,86,22,74,21,109,249,94,104,1,75]},"announce":[],"urlList":[]}}