{"title":"Ben Howard - These Waters (2009) [FLAC]","uid":9933375,"size":163496725,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3dade28c4e6dcb84c5140602cfa46965639f77f2&amp;dn=Ben+Howard+-+These+Waters+%282009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"JeezusK","files":11,"time":1397089516,"description":".: Album Data :.\n\nYear: 2009\nGenre: Folk-rock\nFormat: FLAC\nArtwork is included!\n\n.: Tracklist :.\n\n1. The Wolves\n2. Cloud Nine\n3. London\n4. These Waters\n5. Move Like You Want\n6. The Fire (Bonus Track)\n\nTotal length: 26m09s\n\n\n.: Biography :.\n\nBefore launching his career as an acoustic singer/songwriter, Ben Howard grew up in South Devon, England, where his mother's collection of folk records helped instill a love for Joni Mitchell, Donovan, and Richie Havens in her son. Howard also developed an interest in surfing, catching his first wave at the age of 11 and heading to the beach whenever he wasn't busy writing music in the folksy style of his influences. While pursuing a journalism degree years later, he briefly moved to Newquay, the surf capital of the U.K., where he received class credit for working at a surfing magazine. Howard dropped out of school six months shy of graduation, though, convinced by the surf community's enthusiastic response to his music --- which, despite its acoustic folk sound and beachy vibe, sounded more like John Martyn than Jack Johnson --- that he should ditch the newsroom and focus on songwriting.\nThe surf community proved to be a big stepping stone for Howard, who found himself playing to packed audiences long before his music spread beyond the U.K. beaches. He continued developing his style, too, adding a percussive element to his playing by learning to rap his knuckles across the guitar body between strums. A European tour with Xavier Rudd helped him build a wider audience in late 2008, as did the release of EPs like These Waters and Old Pine. By the time Howard finished recording his full-length debut, Every Kingdom, in autumn 2011, he'd signed a major-label deal with Island Records (the same label that once released music by John Martyn) and graduated to headliner status, thanks to growing fan bases in England, Germany, France, and Holland. [allmusic.com]\n\n.: Review :.\n\nBen Howard, who's name is relatively unknown at this current time, is about to gain much more popularity very quickly, very soon. Consisting of a small group of musicians, their massive passion for folk music clearly shows throughout the unfortunately short duration of this EP. Hailing from the county of Devon, England. The band consists of Ben Howard who is the main songwriter and ultimately the driving force behind the bands music, India Bourne who provides her atmospheric touches with her subtle chello playing and Chris Bond, who plays bass guitar, double-bass, drums, additional percussion and any other instrument which seems to take the man's fancy (he is also capable of playing three of these instruments at the same time live). The trio craft a surprisingly emotional EP which shows a strong sense of ambition and experimentation while never losing it's focus or sense of purpose.\n\nThe EP starts off with one of the best tracks on the album, the uplifting song The Wolves. Beginning with a soft-picked guitar with Ben crooning a melody which is sure to be stuck in your head for many days before the subtle percussion comes in and adds a nice, quick pace to the song. The first thing that may strike the listener is Ben's unusual sounding vocals, while taking some time to become accustomed to, they manage to suit their style perfectly while adding a unique and instantly recognizeable characteristic to their sound which will make them stand out from their local scene. As the song reaches its' climax the vocals take on a more powerful edge which shows Ben's versatility and conveys his strong connection to his music. Another uplifting and this reviewer's personal favourite song is 'Move Like You Want' boasting the catchiest chorus on the album with several addictive melodies which you can't help but literally 'move' and tap your foot along to with a silly grin on your face. This is also Chris's shining moment on the EP as he pulls off playing three instruments (the bass guitar, drums and any additional percussion) at the same time while not detracting from its overall impact.\n\nHowever the album isn't completely cheerful throughout it's duration such as the second track Cloud Nine, London and These Waters. The former and These Waters being the first to feature Ben's more peculiar playing style which consists of slapping the strings with his fore-finger and tapping the body of his guitar, thus providing a nice change of pace and adds to the EP's overall diversity. While India's Cello playing adds that extra atmosphere that is needed, her best cello performance on These Waters where her instrument comes to the forefront and adds a powerful and atmospheric moment and creates a strong emotional impact as the song reaches its' climax. \n\nAlthough Ben Howard is a relatively unknown name at this time, this EP shows their inspiration and pure passion that this small group of individuals put into their music. Nonetheless their population is growing slowly and their music is now being featured on several local radio stations, if they continue creating music of this calibre they may find themselves becoming one of the leading roles in the re-emergence of folk music in England. [TheArkitecht @ sputnikmusic.com]\n\n","torrent":{"xt":"urn:btih:3dade28c4e6dcb84c5140602cfa46965639f77f2","amp;dn":"Ben+Howard+-+These+Waters+%282009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dade28c4e6dcb84c5140602cfa46965639f77f2","infoHashBuffer":{"type":"Buffer","data":[61,173,226,140,78,109,203,132,197,20,6,2,207,164,105,101,99,159,119,242]},"announce":[],"urlList":[]}}