{"title":"The Fall of the Roman Empire  (Unabridged)","uid":11794620,"size":938725717,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3dcd522abca1673a0c0535b67e5c39d3f33a5851&amp;dn=The+Fall+of+the+Roman+Empire++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"davieboy1966","files":45,"time":1428082615,"description":"Audio Books : History : MP3/128Kbps : English\n\n\nPeter Heather - The Fall of the Roman Empire\n\nA New History of Rome and the Barbarians\nWritten by: Peter Heather\nNarrated by: Allan Robertson\nLength: 21 hrs and 42 mins\nUnabridged Audiobook\n\nThe death of the Roman Empire is one of the perennial mysteries of world history. Now, in this groundbreaking book, Peter Heather proposes a stunning new solution: Centuries of imperialism turned the neighbors Rome called barbarians into an enemy capable of dismantling an Empire that had dominated their lives for so long. A leading authority on the late Roman Empire and on the barbarians, Heather relates the extraordinary story of how Europe's barbarians, transformed by centuries of contact with Rome on every possible level, eventually pulled the empire apart. He shows first how the Huns overturned the existing strategic balance of power on Rome's European frontiers, to force the Goths and others to seek refuge inside the Empire. This prompted two generations of struggle, during which new barbarian coalitions, formed in response to Roman hostility, brought the Roman west to its knees.\n\nThe Goths first destroyed a Roman army at the battle of Hadrianople in 378, and went on to sack Rome in 410. The Vandals spread devastation in Gaul and Spain, before conquering North Africa, the breadbasket of the Western Empire, in 439. We then meet Attila the Hun, whose reign of terror swept from Constantinople to Paris, but whose death in 453 ironically precipitated a final desperate phase of Roman collapse, culminating in the Vandals' defeat of the massive Byzantine Armada: the west's last chance for survival.\n\nPeter Heather convincingly argues that the Roman Empire was not on the brink of social or moral collapse. What brought it to an end were the barbarians.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:3dcd522abca1673a0c0535b67e5c39d3f33a5851","amp;dn":"The+Fall+of+the+Roman+Empire++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dcd522abca1673a0c0535b67e5c39d3f33a5851","infoHashBuffer":{"type":"Buffer","data":[61,205,82,42,188,161,103,58,12,5,53,182,126,92,57,211,243,58,88,81]},"announce":[],"urlList":[]}}