{"title":"Story Engineering - Larry Brooks","uid":9624226,"size":1940939,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e770278b33ffe55a8ce4be71f315d6616e71a00&amp;dn=Story+Engineering+-+Larry+Brooks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ZamKhan","files":3,"time":1392564079,"description":"What makes a good story or a screenplay great?\nThe vast majority of writers begin the storytelling process with only a partial understanding where to begin. Some labor their entire lives without ever learning that successful stories are as dependent upon good engineering as they are artistry. But the truth is, unless you are master of the form, function and criteria of successful storytelling, sitting down and pounding out a first draft without planning is an ineffective way to begin.\n\nStory Engineering starts with the criteria and the architecture of storytelling, the engineering and design of a story--and uses it as the basis for narrative. The greatest potential of any story is found in the way six specific aspects of storytelling combine and empower each other on the page. When rendered artfully, they become a sum in excess of their parts.\n\nYou'll learn to wrap your head around the big pictures of storytelling at a professional level through a new approach that shows how to combine these six core competencies which include:\n\nFour elemental competencies of concept, character, theme, and story structure (plot)\nTwo executional competencies of scene construction and writing voice\nThe true magic of storytelling happens when these six core competencies work together in perfect harmony. And the best part? Anyone can do it!","torrent":{"xt":"urn:btih:3e770278b33ffe55a8ce4be71f315d6616e71a00","amp;dn":"Story+Engineering+-+Larry+Brooks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e770278b33ffe55a8ce4be71f315d6616e71a00","infoHashBuffer":{"type":"Buffer","data":[62,119,2,120,179,63,254,85,168,206,75,231,31,49,93,102,22,231,26,0]},"announce":[],"urlList":[]}}