{"title":"Hardtied--Morph  Marica Hase High","uid":15427867,"size":2204803511,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3eb9319b10ff29afc751b65e314d5395ce22002c&amp;dn=Hardtied--Morph++Marica+Hase+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"merzedes","files":1,"time":1469687504,"description":"Morph | Marica Hase \r\n\r\nJuly 27, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBondage Babe Gets Used Non-Stop for Forty Minutes \r\n \r\nWhen Marica Hase starts our shoot she is cute and composed, all done up in an outfit and makeup that make her look like the girl next door, with her wrists tied up to our ceiling. Matt Williams isn't about to let that last long, though. He is intent on transforming Marica into a drooling fuckpuppet by the end of her time here. The best way he can think to do that is to keep her going non-stop until she breaks.\r\n\r\nMatt attaches clamps to Marica's nipples and hangs weights from them before clipping clothespins all up and down her torso. All of them are attached to the same string, so with one little tug they all tear loose. It's easy to see how much it hurts Marica from both the sexy little yelp she lets out and the fresh red marks all over her tits and stomach. Matt sits her down on a table and vibrates her pussy until he has heard enough of the whimpering, little noises she makes. Then he takes the table out from under her and leaves her hanging, suspended by the rope binding her arms and legs, like a human wrecking ball.\r\n\r\nMatt's session with Marica Hase is not like other sessions we have in our studio. There are no cuts, no breaks, just one continuous feed of unending BDSM torment. Unlike other models, Merica does not get to take a moment to breathe and compose herself. She has to keep going, enduring whatever fun Matt wants to have with her in an endless stream of increasingly brutal rope bondage positions. Marica gets spanked, choked, and caned continuously, and each time, she lets out a little squeak or shriek encouraging her handler to keep going.\r\n\r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=07_27mhase3&amp;u=Hardtied-Marica-Hase-Morph\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttps://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:3eb9319b10ff29afc751b65e314d5395ce22002c","amp;dn":"Hardtied--Morph++Marica+Hase+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb9319b10ff29afc751b65e314d5395ce22002c","infoHashBuffer":{"type":"Buffer","data":[62,185,49,155,16,255,41,175,199,81,182,94,49,77,83,149,206,34,0,44]},"announce":[],"urlList":[]}}