{"title":"Larry Carlton albums","uid":4650538,"size":1718782971,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f0e49887553e9a54554850438eca32e4d9b09da&amp;dn=Larry+Carlton+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"SecondOpinion","files":-1,"time":1232033176,"description":"((((((((((((((((((((((((   D..E..M..U..N..O..I..D   ))))))))))))))))))))))))\n\n\nI get all my releases from the above tracker follow the forwarded url to check out the latest zero day releases!!!!\n\n                          &lt;a href=&quot; http://www.btzip.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.btzip.com&lt;/a&gt;\n\n     [[[  another fine release by the D..E..M..U..N..O..I..D   Team   ]]]\n\n\n   .....................................INFO................................\n\nLarry Carlton (born 2 March 1948) is an American jazz fusion, pop, and rock \nguitarist and a singer, dividing his recording time between solo recordings and session appearances with various well-known bands. Over his career, Carlton has won three Grammys for his performances and compositions, including the theme music for the hit television series, &quot;Hill Street Blues&quot; (1981).\nCarlton started learning to play guitar when he was six years old, studying under Slim Edwards near his Torrance, CA, home. Taking an interest in jazz while at high school, his playing style was most influenced by guitarists Joe Pass, Wes Montgomery, Barney Kessel, and B. B. King. Saxophonist John Coltrane has also made a notable impression on Carlton, and Carlton's live albums have featured cuts from Miles Davis's hallmark Kind of Blue.\nDuring the 1970s and early 1980s, Carlton was a busy session musician in Los Angeles, making up to five hundred recordings a year, including albums by Steely Dan, Joni Mitchell, Billy Joel, Quincy Jones, the Partridge Family, and Charly GarcÃƒÂ­a's Clics Modernos. His loopy, dazzling guitar work on Steely Dan's &quot;Kid Charlemagne&quot; from their 1976 LP The Royal Scam has been listed as the third best guitar solo on record by Rolling Stone Magazine. From 1971 to 1976 he played with the jazz-rock group The Crusaders. In 1977 he signed with Warner Bros. Records for a solo career. Although still relatively unknown outside his fan-base, Carlton produced six albums from 1978 to 1984, during which his adaptation of Santo Farina's &quot;Sleepwalk&quot; climbed the pop and adult contemporary charts and his 1983 LP Friends garnered a Grammy nomination.\nHis solo career took a twist in 1985 when he signed with MCA Master Series for an acoustic jazz album. The result was Alone/But Never Alone, which featured sparse but emotive arrangements, including a rendition of The Lord's Prayer. From 1985 to 1990 Carlton did various solo projects, the 1986 live Last Nite being one of his best recordings and winning another Grammy for his cover of the McDonald/Abrams song &quot;Minute by Minute&quot; from the successful LP Discovery.\nIn 1988, while working on his electric guitar LP On Solid Ground, which was released in 1989, Carlton was the victim of random gun violence, shot in the throat outside Room 335, his private studio in Southern California. The bullet shattered his vocal cord and caused significant nerve trauma. Amazingly, Carlton managed to recover quickly and completed On Solid Ground by the end of the year. He continued his work with the electric guitar in 1991 when he started to record a blues album, but decided to delay the project to meet demand for a more commercially-oriented jazz offering, which resulted in Kid Gloves. The rawer, southern-blues infused Renegade Gentleman was finally released in 1993, featuring Nashville harmonica legend Terry McMillan on several tracks.\nFrom 1994 to 1997 Carlton participated in various tours (notably with Toto guitar supremo Steve Lukather) and released an album with similar Los Angeles-based guitarist Lee Ritenour, which featured Remembering J. P., a tribute to the recently deceased Joe Pass. Shortly thereafter, in 1997, he took Ritenour's place in the successful smooth jazz quartet, Fourplay, even adopting a softer, Wes Montgomery-flavored style similar to Ritenour's work.\nIn 2000, Carlton furthered his solo career with the polished Fingerprints, which at its strongest points demonstrated his continued growth as a composer and also downplayed his blues-roots in favor of jazz-chordal playing and octaves. His career received another considerable boost the following year when his live performance with Toto lead guitarist Steve Lukather, No Substitutions: Live At Osaka, garnered his third Grammy.\nCarlton's most recent work includes the guest-appearance laden Deep Into It, the aggressive jazz-blues cut Sapphire Blue, and Firewire, his hardest album yet.\nAt the beginning of 2007 Carlton released two CDs. A live recording together with blues guitarist Robben Ford, Live in Tokyo, and The Jazz King album. The Jazz King record is the result of a composition Carlton wrote for H. M. King Bhumibol Adulyadej of Thailand. The Jazz King project was initiated to celebrate the 60th anniversary of King Bhumibol's accession to the throne as well as his 80th birthday in 2007. Carlton was commissioned to write this composition by the Royal Project Foundation and Rotary Club of Bangkok. These compositions were released on CD only in Thailand, the net proceeds of the CD will be used to support the indigenous hill-tribe children of Thailand. Carlton's compositions for this Jazz King project resulted in a concert. This special performance featured, besides Carlton, other notable jazz musicians. The concert was held on January 28, 2007 at BEC-Tero Hall, Suan Lum Night Bazaar, Bangkok.\nGibson produces a signature Larry Carlton model based on Carlton's own 1968 Gibson ES-335, hence his nickname: Mr. 335. His other guitars include an iconic 1951 blackguard Fender Telecaster. He's also played the Gibson Les Paul. Today, Carlton plays Dumble Amplifiers. During the 1970's he often used an MXR Distortion+, MXR DynaComp compressor, Echoplex tape delay, and a Fender Princeton Reverb Amplifier. Carlton also played Valley Arts Guitars for many years; in the early 1990s Valley Arts produced a signed and limited-edition Larry Carlton guitar, a solid-body instrument that was something of a hybrid between a Les Paul and Fender Telecaster. Valley Arts is now part of the Gibson family.\nCarlton is married to the contemporary Christian music artist Michele Pillar. He is also the uncle of singer, songwriter Vanessa Carlton\n\n","torrent":{"xt":"urn:btih:3f0e49887553e9a54554850438eca32e4d9b09da","amp;dn":"Larry+Carlton+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0e49887553e9a54554850438eca32e4d9b09da","infoHashBuffer":{"type":"Buffer","data":[63,14,73,136,117,83,233,165,69,84,133,4,56,236,163,46,77,155,9,218]},"announce":[],"urlList":[]}}