{"title":"Plastics Technology Handbook, Fourth Edition","uid":7311685,"size":13315695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f1b3e8521619739cbc87d66924aff078b7370a8&amp;dn=Plastics+Technology+Handbook%2C+Fourth+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"594mgnav","files":27,"time":1338367420,"description":"Plastics Technology Handbook, Fourth Edition (Plastics Engineering)[Team Nanban][TPB]\n\n4 edition (December 19, 2006) | ISBN: 0849370396 | Pages: 896 | PDF | \n\nDESCRIPTION:\n\nBecause the field of plastics is one of the fastest changing areas today, the need arises to offer relevant, comprehensive material on polymers. \nAn established source of information on modern plastics, the Plastics Technology Handbook continues to provide up-to-date coverage on the properties, \nprocessing methods, and applications of polymers. Retaining the easy-to-follow structure of the previous editions, this fourth edition includes new topics of interest that reflect recent developments \nand lead to better insights into the molecular behavior of polymers.\n\nNew to the Fourth Edition\n* Advances in supramolecular polymerization, flame retardancy, polymer-based nanomedicines, and drug delivery\n\n* The new concept of oxo-biodegradable polymers\n\n* Broadened discussion on plastic foams and foam extrusion processes\n\n* More information on the processing and applications of industrial polymers, including the emerging field of nanoblends\n\n* Developments in polymer synthesis and applications, such as polymeric sensors, hydrogels and smart polymers, hyperbranched polymers, \nshape memory polymers, polymeric optical fibers, scavenger resins, polymer nanocomposites, polymerization-filled composites, and wood-polymer composites\n\n* A state-of-the-art account of the various available methods for plastics recycling\n\n* Advances in the use of polymers in packaging, construction, the automotive and aerospace industries, agriculture, electronics and \nelectrical technology, biomedical applications, corrosion prevention, and sports and marine applications\n\n\nPLZ SEED WHILE AND AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;\n\n\n\nvisit me on facebook -  just type &quot;TEAM NANBAN TPB&quot; in FACEBOOK search bar..","torrent":{"xt":"urn:btih:3f1b3e8521619739cbc87d66924aff078b7370a8","amp;dn":"Plastics+Technology+Handbook%2C+Fourth+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f1b3e8521619739cbc87d66924aff078b7370a8","infoHashBuffer":{"type":"Buffer","data":[63,27,62,133,33,97,151,57,203,200,125,102,146,74,255,7,139,115,112,168]},"announce":[],"urlList":[]}}