{"title":"Head First Object Oriented Analysis and Design","uid":8281159,"size":33037532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f9176d76bc30552026ae3708a73e92aa275385f&amp;dn=Head+First+Object+Oriented+Analysis+and+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"dpirate79","files":1,"time":1363839304,"description":"Tired of reading Object Oriented Analysis and Design books that only makes sense after you're an expert? You've heard OOA&amp;D can help you write great software every time-software that makes your boss happy, your customers satisfied and gives you more time to do what makes you happy.\n\nHead First Object-Oriented Analysis &amp; Design shows you how to analyze, design, and write serious object-oriented software: software that's easy to reuse, maintain, and extend; software that doesn't hurt your head; software that lets you add new features without breaking the old ones. Inside you will learn how to:\n\nUse OO principles like encapsulation and delegation to build applications that are flexible\nApply the Open-Closed Principle (OCP) and the Single Responsibility Principle (SRP) to promote reuse of your code\nLeverage the power of design patterns to solve your problems more efficiently\nUse UML, use cases, and diagrams to ensure that all stakeholders are communicating clearly to help you deliver the right software that meets everyone's needs.\nBy exploiting how your brain works, Head First OOA&amp;D compresses the time it takes to learn and retain complex information. Expect to have fun, expect to learn, expect to be writing great software consistently by the time you're finished reading this!","torrent":{"xt":"urn:btih:3f9176d76bc30552026ae3708a73e92aa275385f","amp;dn":"Head+First+Object+Oriented+Analysis+and+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f9176d76bc30552026ae3708a73e92aa275385f","infoHashBuffer":{"type":"Buffer","data":[63,145,118,215,107,195,5,82,2,106,227,112,138,115,233,42,162,117,56,95]},"announce":[],"urlList":[]}}