{"title":"Without Conscience - Robert D. Hare","uid":11652742,"size":936855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3fa635344a8faf998d7fb0ad69a3960c1f3028c6&amp;dn=Without+Conscience+-+Robert+D.+Hare&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Spud17","files":-1,"time":1417891268,"description":"Without Conscience: The Disturbing World of the Psychopaths Among Us - by Robert D. Hare\n\nPublished by The Guilford Press in 1999\n\nEPUB, 236 pages, English\n\nMost people are both repelled and intrigued by the images of cold-blooded, conscienceless murderers that increasingly populate our movies, television programs, and newspaper headlines. \n\nWith their flagrant criminal violation of society's rules, serial killers like Ted Bundy and John Wayne Gacy are among the most dramatic examples of the psychopath.\n\nIndividuals with this personality disorder are fully aware of the consequences of their actions and know the difference between right and wrong, yet they are terrifyingly self-centered, remorseless, and unable to care about the feelings of others. \n\nPerhaps most frightening, they often seem completely normal to unsuspecting targets - and they do not always ply their trade by killing. \n\nPresenting a compelling portrait of these dangerous men and women based on 25 years of distinguished scientific research, Dr. Robert D. Hare vividly describes a world of con artists, hustlers, rapists, and other predators who charm, lie, and manipulate their way through life. \n\nAre psychopaths mad, or simply bad? How can they be recognized? And how can we protect ourselves? This book provides solid information and surprising insights for anyone seeking to understand this devastating condition. \n\nRead, seed, and share with others. :)","torrent":{"xt":"urn:btih:3fa635344a8faf998d7fb0ad69a3960c1f3028c6","amp;dn":"Without+Conscience+-+Robert+D.+Hare","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fa635344a8faf998d7fb0ad69a3960c1f3028c6","infoHashBuffer":{"type":"Buffer","data":[63,166,53,52,74,143,175,153,141,127,176,173,105,163,150,12,31,48,40,198]},"announce":[],"urlList":[]}}