{"title":"Ea Sports Cricket 2007 By Ghost Master","uid":3759747,"size":1119191040,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3fd4982d6a9cbea36059820ad1581b478329bd74&amp;dn=Ea+Sports+Cricket+2007+By+Ghost+Master&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"UndeadLord","files":2,"time":1185989746,"description":"Codes\nFull Stamina Bowlers: Enter ASIF on the MAINMENU by keeping your mouse cursor at the MY CRICKET Option. Play &amp; You will observe that your BOWLERS always have 100% stamina. \n\nFull Stamina Batmen: Enter INZAMAM on the MAINMENU by keeping your mouse cursor at the MY CRICKET Option. Play &amp; you will see that Your BATSMEN always have FULL Stamina. \n\nSuper Speed: Enter AKHTER on the MAINMENU by keeping your mouse cursor at MY CRICKET Option. Play with Fast or Fast Madium or Medium Pace Bowler (No Spinner) &amp; You will observe that You bowler bowl with Super speed which has never been seen before &amp; may be equal to 200 Km/h or greator... .By using this cheat, you can out your opponents very easily except the PAKISTAN TEAM. \n\nEmpire Quitness: Enter HAIER on the at MAINMENU by keeping your mouse cursor at MY CRICKET Option. Play &amp; You will observe that Empire don&amp;#039;t give NOBALL despite parameter of your Bowler&amp;#039;s SpeedMeter reaches in RED ZONE,so in this way, you can increase your bowler&amp;#039;s speed but not equal to 200 Km/h or greater. \n\nFly Mode: Enter MALIK on the at MAINMENU by keeping your mouse cursor at MY CRICKET Option &amp; While playing you will observe that your fielders have some enough Flying abblities to catch the bowl. In AUTO FIELDING. Press the SHIFT key to fly your Fielder chasing the ball. \n\nSpecial Deliveries: Enter GUL on the at MAINMENU by keeping your mouse cursor at MY CRICKET Option . Play,Bowl &amp; you will see that your Bowler always has all Special Deliveries. \n\nMagic Move: Enter SAQLAIN on the at MAINMENU by keeping your mouse cursor at MY CRICKET Option. Play &amp; you will see that your (All kind of) bowlers bowl with magic move. \n\nFast Running: Enter RAZZAQ on the at MAINMENU by keeping your mouse cursor at MY CRICKET Option &amp; You will see that your runners run so fast such as a horse. \n\nThese codes work in any difficulty. Deactivate them by doing them again on the PAUSE MODE (Press ESC While Playing). To activate them, you need to do the codes on the main menu. \n\nSubmitted by me THE GHOST MASTER","torrent":{"xt":"urn:btih:3fd4982d6a9cbea36059820ad1581b478329bd74","amp;dn":"Ea+Sports+Cricket+2007+By+Ghost+Master","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fd4982d6a9cbea36059820ad1581b478329bd74","infoHashBuffer":{"type":"Buffer","data":[63,212,152,45,106,156,190,163,96,89,130,10,209,88,27,71,131,41,189,116]},"announce":[],"urlList":[]}}