{"title":"Castable Polyurethane Elastomers","uid":12404047,"size":1651193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4026f1d139fda25651483d6cbb166c57273faa40&amp;dn=Castable+Polyurethane+Elastomers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1442066445,"description":"Castable Polyurethane Elastomers - I.R. Clemitson (CRC, 2008).pdf\n\nISBN 9781420065763\n\nCurrently, raw material suppliers are the sole providers of polyurethane processing information. In most cases, they give instruction only on how to mix products and do not always include an explanation of the accompanying logic as to why these recommendations are being made.\nCastable Polyurethane Elastomers explains the production process of polyurethane components from both the theoretical and practical point of view. It describes the underlying concepts for the raw material supplier recommendations and explains how to achieve application-specific properties in polyurethane. The book explains the production of prepolymers with special focus on health and safety issues. It presents the different types of methods available on both the micro and macro levels and explains the rationale behind choosing the system needed to create a cost-effective, application-specific product.\n\nOffering an inside look at the logic behind the formation of polyurethane components, Castable Polyurethane Elastomers enables materials scientists, engineers, and chemists to understand the total production process and reproduce the procedures to achieve desired results","torrent":{"xt":"urn:btih:4026f1d139fda25651483d6cbb166c57273faa40","amp;dn":"Castable+Polyurethane+Elastomers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4026f1d139fda25651483d6cbb166c57273faa40","infoHashBuffer":{"type":"Buffer","data":[64,38,241,209,57,253,162,86,81,72,61,108,187,22,108,87,39,63,170,64]},"announce":[],"urlList":[]}}