{"title":"Great Science Fiction &amp; Fantasy Short-Short Stories Collection","uid":6512232,"size":4871932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:416f90709102a9e313bfa227f4c8971322d90098&amp;dn=Great+Science+Fiction+%26+Fantasy+Short-Short+Stories+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Arrrrrrrrrr","files":-1,"time":1309676114,"description":"Four books of 350 short-short sci-fi and fanstasy stories from many authors ranging in size from zero words to about seven pages. Perfect e-Book material for our distracted age. All books share in common having Isaac Asimov as an editor and three of the four contain one or more of his stories.\n\nContains the following books in PDF format:\n\n50 Short Science Fiction Tales\nISBN 0-68484-296-3\n1963\n\n100 Great Science Fiction Short Short Stories\nISBN 0-86051-035-2\n1978\n\nMicrocosmic Tales - 100 Wondrous Science Fiction Short Short Stories.pdf\nISBN 0-8008-5238-9\n1980\n\n100 Great Fantasy Short Short Stories\nISBN 0-380-69917-6\n1984\n\nNotes:\n\n - These e-Books are not reposts of available commercial PDF's. Instead, they were lovingly scanned from the original books, OCR'ed, proofread, spellchecked, formatted and PDF'ed by me over the course of two months. This is because they have never, to my knowledge, ever appeared in electronic form anywhere before this, so I thought it would be nice to undo this oversight as I enjoyed these little stories when I was young and some of them are good enough to be considered classics, or perhaps the seed of a future movie... who knows what will grow in fertile minds.\n \n - These books are long out-of-print and not even available in most libraries, except in special collections due to the fragility of the paperbacks, and as noted above, have never been released in electronic form. They can only be bought used at inflated prices from used retailers if they can be found at all. Yet they are still under copyright and will be for over fifty years! Thus, here we have an excellent example of how the copyright system is broken and why this site and others like it must continue to exist.\n \n - Because e-readers already provide them and they have working hyperlinks, I removed all the hard-coded page numbers from the tables of contents and there are no headers. Other than this, I tried to preserve the original text as closely as possible. I did correct a few dozen single-character mistakes in the original books, however.\n \n - I wanted to also present these books as EPUBs, but I wasn't happy at all with the output. Saving as PDF preserved all the formatting including fonts, hyperlinks, pictures, tables and even equations; converting to EPUB destroyed all of that. Feel free to try your hand as, of course, the PDF's are completely open.\n \n - If you enjoy these books and wish to thank me for the effort I've put into them: please make sure to seed, hit that &quot;+&quot;, and maybe even recommend me for my skull'n'bones. If Vertikal wasn't enough to earn it, this certainly was. :^)","torrent":{"xt":"urn:btih:416f90709102a9e313bfa227f4c8971322d90098","amp;dn":"Great+Science+Fiction+%26+Fantasy+Short-Short+Stories+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"416f90709102a9e313bfa227f4c8971322d90098","infoHashBuffer":{"type":"Buffer","data":[65,111,144,112,145,2,169,227,19,191,162,39,244,200,151,19,34,217,0,152]},"announce":[],"urlList":[]}}