{"title":"Magic, The Gathering - Ravnica Cycle","uid":8213020,"size":6758196,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:418c432ce1f7518ed4ce084c16575371c70a8097&amp;dn=Magic%2C+The+Gathering+-+Ravnica+Cycle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Cradwel","files":12,"time":1362277454,"description":"- Magic the Gathering: Ravnica Cycle\n\nAuthor: Cory J. Herndon\nLanguage: English\n\nFile Formats: .mobi, .epub, .pdf\n\nNothing ever changes in Ravnica. For countless millennia, cities have covered the entire plane. Eventually, they ran together into one vast megalopolis -- a patchwork of grand halls, decrepit slums, ancient ruins, and layer upon layer of stonework structures. Of the world's countless civic centers, one looms above all others: the City of Ravnica, a metropolis so vast that its name has become synonymous with the world itself. It is here -- amid mazes of streets and towering gothic spires -- that the guilds vie for power and control.\n\n- Ravnica: City of Guilds\nRelease Date: 2005-08-30\n\nA Labyrinth of Intrigue\n\nLieutenant Agrus Kos enjoys his work. A top-notch officer of the city guard, he's been on the force over fifty years. He works alone. And the League of Wojek never had problems with him or his work. Until now.\n\nThey gave him a partner to train, who promptly got himself killed. And the more he looks into the death, the less he likes it.\n\nSomething dark is moving within the guilds of Ravnica.\n\n- Guildpact\nRelease Date: 2006-01-10\n\nA Savage Wasteland\n\nOne guild ravages the streets. Teysa leads another to &quot;cleanse&quot; them. And Agrus Kos doesn't give a damn.\n\nBut as he watches the guilds nip and tear at each other like snakes . . . something clicks.\n\nNow his mind is clear, as are his options. A disaster grows under the city's crowded streets. He knows what he must do.\n\n\n* Dissension\nRelease Date: 2006-05-09\n\nStreets of War\n\nThe streets of Ravnica run red with blood. Guild fights guild and horrifying monsters ravage the city, destroying all who stand in their way.\n\nBut as Ravnica crumbles, a method emerges from the madness, and it becomes clear that the city's chaos was calculated.\n\nSomething must be done. And unfortunately for Kos, being dead doesn't mean you don't have a job to do.","torrent":{"xt":"urn:btih:418c432ce1f7518ed4ce084c16575371c70a8097","amp;dn":"Magic%2C+The+Gathering+-+Ravnica+Cycle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"418c432ce1f7518ed4ce084c16575371c70a8097","infoHashBuffer":{"type":"Buffer","data":[65,140,67,44,225,247,81,142,212,206,8,76,22,87,83,113,199,10,128,151]},"announce":[],"urlList":[]}}