{"title":"Astronauts in Trouble (AiT/Planet Lar)","uid":5422341,"size":136959186,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:41f0d1e96fcbc1fe692583dfa5c2e78c874e751e&amp;dn=Astronauts+in+Trouble+%28AiT%2FPlanet+Lar%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"brodahisou","files":-1,"time":1268130864,"description":"Astronauts in Trouble is the title of a series of comic books and graphic novels created by Larry Young.\nCharlie Adlard is the artist for the bulk of the stories, with Matthew Dow Smith providing the artwork for early chapters, and Kieron Dwyer, Steven Weissman, Darick Robertson, Brian Wood, Scott Johnson, John Heebink, and Matt Hollingsworth contributing.\n\nAstronauts in Trouble is also the AiT in publisher name AiT/Planet Lar.\n\nAstronauts in Trouble: Live From the Moon\nThe first story arc is set in 2019, 50 years after the first Moon landing.  Eccentric millionaire Ishmael Hayes has decided to launch his own mission to return to the moon, and claim it as his own property.  To ensure that he receives the right amount of publicity, Hayes brings along the Channel 7 news crew to film the mission.  Along the way Hayes must deal with eco-terrorists, and a nuclear bomb wielding Mafia.\n\nAstronauts in Trouble: One Shot, One Beer\nTen years after the events of Live From the Moon, the Moon is the home to Cool Ed's, the only bar for 240,000 miles. Prospectors, settlers, and others gather there to tell stories and swaps lies.  The first part of this one-shot was originally published in Astronauts in Trouble: Cool Ed's.\n\nAstronauts in Trouble: Space: 1959\nIn 1959, Colonel Lloyd Macadam's top-secret moon-shot program in Peru is discovered when the Channel Seven news team investigates the death of a janitor. The space launch is put into jeopardy when a Russian spy commandeers the rocket and Colonel Macadam must choose between his country and his life.\n\nAlso included is Astronauts In Trouble #1, published in 1995 when the company was simply &quot;PlaNetLar&quot;, before it adopted AiT as part of it's name.\n\n\nReleased on http://ComicPirates.info\t","torrent":{"xt":"urn:btih:41f0d1e96fcbc1fe692583dfa5c2e78c874e751e","amp;dn":"Astronauts+in+Trouble+%28AiT%2FPlanet+Lar%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f0d1e96fcbc1fe692583dfa5c2e78c874e751e","infoHashBuffer":{"type":"Buffer","data":[65,240,209,233,111,203,193,254,105,37,131,223,165,194,231,140,135,78,117,30]},"announce":[],"urlList":[]}}