{"title":"Analog Circuit Design, Vol 2: Immersion in the Black Art [PDF]","uid":9674832,"size":97492742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:420e01e12096715f492e2d0b35838859cc14fc91&amp;dn=Analog+Circuit+Design%2C+Vol+2%3A+Immersion+in+the+Black+Art+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1393541663,"description":"Editor(s): Bob Dobkin, Jim Williams\nPublisher: Newnes\nDate: January 9, 2013\nPages: 1250\nFormat: PDF\nLanguage: English\nISBN-10: 0123978882\nISBN-13: 978-0123978882\nSize: 92.9 MB\n\nDescription:\n\nAnalog circuit and system design today is more essential than ever before. With the growth of digital systems, wireless communications, complex industrial and automotive systems, designers are being challenged to develop sophisticated analog solutions.\n\nThis comprehensive source book of circuit design solutions aids engineers with elegant and practical design techniques that focus on common analog challenges. The book's in-depth application examples provide insight into circuit design and application solutions that you can apply in today's demanding designs.\n\nThis is the companion volume to the successful Analog Circuit Design: A Tutorial Guide to Applications and Solutions (October 2011), which has sold over 5000 copies in its the first 6 months of since publication. It extends the Linear Technology collection of application notes, which provides analog experts with a full collection of reference designs and problem solving insights to apply to their own engineering challenges.\n\nFull support package including online resources (LTSpice).\n\nContents include more application notes on power management, and data conversion and signal conditioning circuit solutions, plus an invaluable circuit collection of reference designs.\n\nAbout the Editors:\n\nBob Dobkin is a founder and Chief Technical Officer of Linear Technology Corporation. Prior to 1999, he was responsible for all new product development at Linear. Before founding Linear Technology in 1981, Dobkin was Director of Advanced Circuit Development at National Semiconductor for eleven years.\n\nHe has been intimately involved in the development of high performance linear integrated circuits for over 30 years and has generated many industry standard circuits. Dobkin holds over 100 patents pertaining to linear ICs and has authored over 50 articles and papers. He attended the Massachusetts Institute of Technology.\n\nJim Williams, who worked for Linear Technology for nearly three decades, was a talented and prolific circuit designer and author in the field of analog electronics until his untimely passing in 2011. In nearly 30 years with Linear, he had the unique role of staff scientist with interests spanning product definition, development and support. Before joining Linear Technology in 1982, Williams worked in National Semiconductor's Linear Integrated Circuits Group for three years.\n\nWilliams was a legendary circuit designer, problem solver, mentor and writer with writings published as Linear application notes and EDN magazine articles. In addition, he was writer/editor of four books. Williams was named Innovator of the Year by EDN magazine in 1992, elected to Electronic Design Hall of Fame in 2002, and was honored posthumously by EDN and EE Times in 2012 as the first recipient of the Jim Williams Contributor of the Year Award.\n","torrent":{"xt":"urn:btih:420e01e12096715f492e2d0b35838859cc14fc91","amp;dn":"Analog+Circuit+Design%2C+Vol+2%3A+Immersion+in+the+Black+Art+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420e01e12096715f492e2d0b35838859cc14fc91","infoHashBuffer":{"type":"Buffer","data":[66,14,1,225,32,150,113,95,73,46,45,11,53,131,136,89,204,20,252,145]},"announce":[],"urlList":[]}}