{"title":"PS3 Amiga Emulator With Games MEGAPACK - One Click Install","uid":9876241,"size":12491718056,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:427b74a88169adc64ade5847845e184110937e29&amp;dn=PS3+Amiga+Emulator+With+Games+MEGAPACK+-+One+Click+Install&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"dududus","files":437,"time":1396481760,"description":"PS3 Amiga Emulator With Games Pack - One Click Install\n\nThanks to ransom, doctorwho and Ole from ps3repack.net who made all these.\n\nAll games preconfigured to work with the included emulator.\nNo need to set up chipset, RAM, video etc.\n\nIf you don't want to copy all games to root directory, copy to\nany folder on external FAT32. On PS3 use mmOS (press start+select in MultiMan)\nthen just browse to the folder and double-click X on the desired game.\n\nHave fun!\n\n-dududus\n\n\nControls:\n\n- press R2 to activate virtual keyboard (vkb), release R2 to hide it.\nIf vkb is shown press left/right digital pad to select the current\nkey. Press the 'up' digital pad button to actually simualte key press\nof the current key. L1, L2, R1 ann CIRCLE buttons are user defined keys.\nIf vkb is shown press L1 to define L1 button, press L2 to define L2 button\nand press R1 to define R1 button.\n- joypad 1 (emulates joystick 1 and mouse 1)\n- joypad 2 (emulates joystick 2) - if you want to enable 2-joystick mode, plug-in\nthe second joy pad, restart uae and switch the port mode to &quot;joy-1 &amp; joy-2&quot; in the\noptions dialog.\n- left analog pad emulates the mouse movement. You can speed-up the mouse movement\nin the options dialog.\n- CROSS - joystick button 1\n- SQUARE - mouse button 1\n- TRIANGLE - mouse button 2\n- press Start to enter application menu, here you can load ADF files.\n- press CIRCLE to exit the application menu \n\n\nAMIGA to PS3 PACKAGES\n\nHuge Thank you to doctorwho for your work you do with this project day and night, and in the early hours of the morning, you truly are a master at what you do.\n- Thank you to Ole for e-UAE 0.8.29 r10\n\n- For the first time in the world we present you Amiga Game Packages Directly into your PS3.\n- Here's a kickstart to the Absolute Legend of a gaming machine the AMIGA scene repacked into PS3 packages for all to Enjoy.\n- We have provided from our own collection a Registered version of WHDLoad which will bypass the nag screen and avoid annoying waiting times.\n- All games have Hi Definition Wallpapers, Transparent icons in XMB and Main Theme Music playing for each game\n- Tested on Rebug 4.30.2 and Rogero and Habib 4.55 and Kmwea 3.55.\n- Plug in a USB Mouse or Keyboard for Optimum performance for all those mouse &amp; Keyboard driven games.\n- As I am a HUGE Amiga fanatic you guys will be seeing more and more games in this thread in days to come.\n\n\nRequests are available. ONLY 1 Request per week by each indivudual at ps3repack.","torrent":{"xt":"urn:btih:427b74a88169adc64ade5847845e184110937e29","amp;dn":"PS3+Amiga+Emulator+With+Games+MEGAPACK+-+One+Click+Install","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"427b74a88169adc64ade5847845e184110937e29","infoHashBuffer":{"type":"Buffer","data":[66,123,116,168,129,105,173,198,74,222,88,71,132,94,24,65,16,147,126,41]},"announce":[],"urlList":[]}}