{"title":"Gary Gygax Collection Dungeons and Dragons Role Playing","uid":8964613,"size":58388203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:42c8c37de5d935fa22f36268e3e9f034535f702f&amp;dn=Gary+Gygax+Collection+Dungeons+and+Dragons+Role+Playing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1380188797,"description":"Sadly, after many, MANY years (decades, actually) of being a DM, I no longer have anyone to game with. Rather than leave the 60+ GB of files that will never be used on my external to take up space (which I could use for comic books), I'm going to burn them off to blu-ray data discs and file them away in hopes that they may be used at some point in the future.\n\nNo big descriptions or explanations with these - you either know what they are, and that you want them, or you don't.\n\nThese uploads are definitely an experiment; if there is interest, I'll seed them for a while, but if there isn't, I'll have them deleted and &quot;file&quot; this stuff away. \t\t\n\n\n----------------------------------------------------------------------------------------\n\nSelf-explanatory. It's likely none of use would be buying, reading, scanning or sharing these books, let alone playing RPGs in the way we are now, if it wasn't for this man. \n\nThe first two books, as Gary Gygax, are older, but still make for great reading (essential even). The other three, as Gary Gygax's (some with or by Dan Cross), are mind-blowingly awesome! \n\nAs I said in some of the other uploads, players should never hesitate to read as much as they can (as long as they're not specifically reading information their DM's don't want them to have), so by all means they should check these out. But for the dungeon or game master these three books should be REQUIRED reading. They cover a vast amount of the information including in literally dozens of the other books I uploaded, but Gary Gygax and Dan Cross are awesome, so they get it all to you simply and clearly in just three books.","torrent":{"xt":"urn:btih:42c8c37de5d935fa22f36268e3e9f034535f702f","amp;dn":"Gary+Gygax+Collection+Dungeons+and+Dragons+Role+Playing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42c8c37de5d935fa22f36268e3e9f034535f702f","infoHashBuffer":{"type":"Buffer","data":[66,200,195,125,229,217,53,250,34,243,98,104,227,233,240,52,83,95,112,47]},"announce":[],"urlList":[]}}