{"title":"{The New 52} Batman: Death of the Family (True Complete)","uid":8443016,"size":938517502,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4327784da25e2ede1d30df787cb1827d07f2f72d&amp;dn=%7BThe+New+52%7D+Batman%3A+Death+of+the+Family+%28True+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"OsimusFlux","files":-1,"time":1367817682,"description":"Introducing my first upload:\nBatman: Death of the Family complete storyline\n\n\n---------------------------\n\nAfter a year of isolation, The Joker has returned to plague Gotham, Batman, and his extended crime-fighting family in the next major story after Night of The Owls. Named Death of The Family, the first issue arrived October 10, 2012, and crossed over into many other DC, Batman-Related titles. Death of The Family comes from Scott Synder and Greg Capullo\n\nIt's been one year since we've seen him. He's been completely untraceable and the only thing we remembered was that Batman's greatest nemesis was last seen in Arkham Asylum, and in the process of having the flesh from his face removed. Now The Joker has returned...and he's not the same. There's a whispering of secrets revealed and even Batman has to reevaluate his long-time enemy in this epic story. \n\n---------------------------\n\nThis Torrent contains a re-organized reading order which includes both official and non-official tie-ins including the Prologues and Epilogues. Although some may argue a few issues are out of order, some are placed as such for continuity and ease (feel free to rename/reorder).\n\nThis contains 33 comics, ordered from 00a-030.\n\nI do NOT claim any of this work as my own. ALL CREDIT GOES TO ORIGINAL SCANNERS AND UPLOADERS AS WELL AS THE CREATORS AND DC COMICS.\n\nThank you and feel free to comment :)","torrent":{"xt":"urn:btih:4327784da25e2ede1d30df787cb1827d07f2f72d","amp;dn":"%7BThe+New+52%7D+Batman%3A+Death+of+the+Family+%28True+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4327784da25e2ede1d30df787cb1827d07f2f72d","infoHashBuffer":{"type":"Buffer","data":[67,39,120,77,162,94,46,222,29,48,223,120,124,177,130,125,7,242,247,45]},"announce":[],"urlList":[]}}