{"title":"The Resilience Dividend - Judith Rodin - Audiobook MP3","uid":11693679,"size":326056137,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:446438a66ae437cbef45be7cdc7ddcc7b8c78453&amp;dn=The+Resilience+Dividend+-+Judith+Rodin+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Squiddy82","files":13,"time":1423627467,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Resilience Dividend: Being Strong in a World Where Things Go Wrong\n\nWritten by: Judith Rodin\nNarrated by: Cyndee Maxwell\nLength: 11 hrs and 16 mins\nUnabridged Audiobook\nRelease Date:11-26-14\n\nBuilding resilience - the ability to bounce back more quickly and effectively - is an urgent social and economic issue. Our interconnected world is susceptible to sudden and dramatic shocks and stresses: a cyber-attack, a new strain of virus, a structural failure, a violent storm, a civil disturbance, an economic blow.\nThrough an astonishing range of stories, Judith Rodin shows how people, organizations, businesses, communities, and cities have developed resilience in the face of otherwise catastrophic challenges:\nMedellin, Colombia, was once the drug and murder capital of South America. Now it's host to international conferences and an emerging vacation destination.\nTulsa, Oklahoma, cracked the code of rapid urban development in a floodplain.\nAirbnb, Toyota, Ikea, Coca-Cola, and other companies have realized the value of reducing vulnerabilities and potential threats to customers, employees, and their bottom line.\nIn the Mau Forest of Kenya, bottom-up solutions are critical for dealing with climate change, environmental degradation, and displacement of locals.\nFollowing Superstorm Sandy, the Rockaway Surf Club in New York played a vital role in distributing emergency supplies.\nAs we grow more adept at managing disruption and more skilled at resilience-building, Rodin reveals how we are able to create and take advantage of new economic and social opportunities that offer us the capacity to recover after catastrophes and grow strong in times of relative calm","torrent":{"xt":"urn:btih:446438a66ae437cbef45be7cdc7ddcc7b8c78453","amp;dn":"The+Resilience+Dividend+-+Judith+Rodin+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"446438a66ae437cbef45be7cdc7ddcc7b8c78453","infoHashBuffer":{"type":"Buffer","data":[68,100,56,166,106,228,55,203,239,69,190,124,220,125,220,199,184,199,132,83]},"announce":[],"urlList":[]}}