{"title":"[Clips4Sale / Family-Therapy] Melanie Hicks (Experimental Slut S","uid":13681921,"size":321072602,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:448f0ababfa48705fea02bb7417ff9744ccc4ff4&amp;dn=%5BClips4Sale+%2F+Family-Therapy%5D+Melanie+Hicks+%28Experimental+Slut+S&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1456482965,"description":"[Clips4Sale / Family-Therapy] Melanie Hicks (Experimental Slut Serum Makes Mother My Whore) 480p [Roleplay]\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/k7z\r\n \nhttp://imgsnaps.com/image/k77\r\n\r\nMother is always nagging me. &quot;Clean your room,&quot; &quot;Stop playing video games and do your homework,&quot; &quot;Take out the trash,&quot; Clean your room again, it looks like s#*t.&quot; Nothing is ever good enough for her. I really try to be a good son, but Mother is never happy. I decided I'M FUCKING DONE. No more yes Mom, whatever you say Mom. I decided Mother will do WHATEVER I SAY from now on. I'll admit it wasn't entirely my own idea. I have a friend at college who knows about my problem. He had a problem similar to mine - except it was his girlfriend who was nagging him all the time. Last week he told me he bought a strange experimental serum that turns any woman who drinks it into a subservient slut who will do anything and everything they are told. He wouldn't tell me where he got it - but he did sell me some. I didn't believe it would actually work but my buddy's never lied to me before. I tried it the next day. Mother was bitching at me about how lazy she thinks I am and then told me to get her some iced tea, it was the perfect opportunity. My Mom only drank a little of the special tea I gave her, but I was astonished, in less than a minute she was completely under my control and sucking my cock!!! Mother did exactly as I instructed her. I fucked my Mom in every way I pleased and then came inside her. The effects of the serum wore off after a few hours, leaving Mother groggy and with a slight headache. She had no memory of what happened and was back to her normal bitchy self. All I know is I need to get a part time job ASAP. I need more money. I'm going to buy as much slut serum as I can get my hands on!!! ***Starring Melanie Hicks &amp; a REAL creampie from her angry horny son***","torrent":{"xt":"urn:btih:448f0ababfa48705fea02bb7417ff9744ccc4ff4","amp;dn":"%5BClips4Sale+%2F+Family-Therapy%5D+Melanie+Hicks+%28Experimental+Slut+S","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"448f0ababfa48705fea02bb7417ff9744ccc4ff4","infoHashBuffer":{"type":"Buffer","data":[68,143,10,186,191,164,135,5,254,160,43,183,65,127,249,116,76,204,79,244]},"announce":[],"urlList":[]}}