{"title":"Lonely Planet Washington and Oregon (AZW3,Retail)","uid":10968421,"size":10587848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44ed21d08bfb45ea301464595203e285f9dd5938&amp;dn=Lonely+Planet+Washington+and+Oregon+%28AZW3%2CRetail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"32Skulls","files":-1,"time":1409772750,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\nLonely Planet Washington, Oregon &amp; the Pacific Northwest is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Explore the funky shops of Pike Place Market, experience Portland's music and culture, or take in the beauty of Vancouver's glorious mountains; all with your trusted travel companion. Get to the heart of Washington, Oregon &amp; the Pacific Northwest and begin your journey now!\n\nInside Lonely Planet's Washington, Oregon &amp; the Pacific Northwest Travel Guide:\n\n\nColor maps and images throughout\n\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n\nInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\n\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n\nCultural insights give you a richer and more rewarding travel experience - including customs, history, art, music, architecture, politics, flora, wildlife, outdoor activities, road trips, cuisine, beer and wine\n\nFree, convenient pull-out Seattle map (included in print version), plus over 50 maps\n\n\nCovers: Seattle, Bellingham, the San Juan Islands, Olympic Peninsula, Washington Cascades, Central &amp; Eastern Washington, Portland, Wine Country, Ashland, Eastern Oregon, Vancouver, Whistler, Vancouver Island, and more\n\n\n\nBy Lonely Planet, Celeste Brash, Sandra Bao, John Lee, Brendan Sainsbury\nPublished by Lonely Planet in 2014\nAZW3, Retail, 488 pages, English\n","torrent":{"xt":"urn:btih:44ed21d08bfb45ea301464595203e285f9dd5938","amp;dn":"Lonely+Planet+Washington+and+Oregon+%28AZW3%2CRetail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44ed21d08bfb45ea301464595203e285f9dd5938","infoHashBuffer":{"type":"Buffer","data":[68,237,33,208,139,251,69,234,48,20,100,89,82,3,226,133,249,221,89,56]},"announce":[],"urlList":[]}}