{"title":"Modern Physical Metallurgy and Materials Engineering by R. E. Sm","uid":10893119,"size":8839756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:44f6fdd2beab64d1fe5a9c3d7105537e5d8556ba&amp;dn=Modern+Physical+Metallurgy+and+Materials+Engineering+by+R.+E.+Sm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"thilanga123","files":1,"time":1409144843,"description":"Modern Physical Metallurgy and Materials Engineering\n\nby R. E. Smallman, R J Bishop\n\n\n\n\nPrint Length: 448 pages\nPublisher: Butterworth-Heinemann; 6 edition (November 22, 1999)\nLanguage: English\nASIN: B00DG25A8Q\nISBN: 9780080511993\n\nBook Description\nPublication Date: November 22, 1999\nFor many years, various editions of Smallman's Modern Physical Metallurgy have served throughout the world as a standard undergraduate textbook on metals and alloys. In 1995, it was rewritten and enlarged to encompass the related subject of materials science and engineering and appeared under the title Metals &amp; Materials: Science, Processes, Applications offering a comprehensive amount of a much wider range of engineering materials. Coverage ranged from pure elements to super alloys, from glasses to engineering ceramics, and from everyday plastics to in situ composites, Amongst other favorable reviews, Professor Bhadeshia of Cambridge University commented: &quot;Given the amount of work that has obviously gone into this book and its extensive comments, it is very attractively priced. It is an excellent book to be recommend strongly for purchase by undergraduates in materials-related subjects, who should benefit greatly by owning a text containing so much knowledge.&quot;\n\n\nThe book now includes new chapters on materials for sports equipment (golf, tennis, bicycles, skiing, etc.) and bio materials (replacement joints, heart valves, tissue repair, etc.) - two of the most exciting and rewarding areas in current materials research and development. As in its predecessor, numerous examples are given of the ways in which knowledge of the relation between fine structure and properties has made it possible to optimize the service behavior of traditional engineering materials and to develop completely new and exciting classes of materials. Special consideration is given to the crucial processing stage that enables materials to be produced as marketable commodities. Whilst attempting to produce a useful and relatively concise survey of key materials and their interrelationships, the authors have tried to make the subject accessible to a wide range of readers, to provide insights into specialized methods of examination and to convey the excitement of the atmosphere in which new materials are conceived and developed.\n\nSEED as long as you can","torrent":{"xt":"urn:btih:44f6fdd2beab64d1fe5a9c3d7105537e5d8556ba","amp;dn":"Modern+Physical+Metallurgy+and+Materials+Engineering+by+R.+E.+Sm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"44f6fdd2beab64d1fe5a9c3d7105537e5d8556ba","infoHashBuffer":{"type":"Buffer","data":[68,246,253,210,190,171,100,209,254,90,156,61,113,5,83,126,93,133,86,186]},"announce":[],"urlList":[]}}