{"title":"Zcut Kettlebell Start Workout","uid":12212864,"size":1244665568,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:45221c24accbe65848be05c40ba96cc41bb9a26f&amp;dn=Zcut+Kettlebell+Start+Workout&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MrTVGuy","files":16,"time":1439160317,"description":"ZCUT KETTLEBELL START WORKOUT PROGRAM\n\nThe kettlebell is one of the most dynamic, versatile and beneficial pieces of equipment on the market. Take advantage of all that the kettlebell has to offer with this ZCUT Kettlebell Start series for beginners. Online fitness sensation, Zuzka Light, introduces you to basic moments and leads you through 12 short, moderate-intensity workouts that will give you twice the results in half the time it would take you to drive to the gym.\n\nThese total-body kettlebell workouts combine all the benefits of strength, cardio, flexibility, core stability, and endurance training. The exercises focus on controlled moment, challenging your core and effectively engaging your muscles throughout each workout. This 4-DVD series promotes rapid fat loss, an increase in functional strength, and lean, sexy muscle definition.\n\nWith over half a billion YouTube views, Zuzka leads by example when it comes to working out and staying fit. Her ZCUT series of workout DVDs have provided amazing results of millions of people worldwide.\n\nGrab a kettlebell and get ready to change your body","torrent":{"xt":"urn:btih:45221c24accbe65848be05c40ba96cc41bb9a26f","amp;dn":"Zcut+Kettlebell+Start+Workout","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45221c24accbe65848be05c40ba96cc41bb9a26f","infoHashBuffer":{"type":"Buffer","data":[69,34,28,36,172,203,230,88,72,190,5,196,11,169,108,196,27,185,162,111]},"announce":[],"urlList":[]}}