{"title":"The Hobbit By J. R. R. Tolkien - BBC Radio 4 Dramatisation","uid":5478750,"size":243013258,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:456a72a1cf03f7cd47406fac81aa49abb9472ccb&amp;dn=The+Hobbit+By+J.+R.+R.+Tolkien+-+BBC+Radio+4+Dramatisation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"artpepper","files":-1,"time":1270295990,"description":"The Hobbit By J. R. R. Tolkien \n\n\nPublisher: BBC Audiobooks  2008-07-29 | ISBN: 1602834547 | Language: English | \n\nAudio CD in MP3 | 243 MB\n\n\nThe original  full dramatization as first broadcast on BBC Radio.\n\n\nBonus archival interview with J.R.R. Tolkien included.\n\n\nOriginally on 5 CDs, Duration: 4 hours, 13 minutes\n\n\nThe Hobbit, or There and Back Again, better known by its abbreviated title The Hobbit, is a fantasy novel and children's book by J. R. R. Tolkien. Set in a time &quot;Between the Dawn of FÃƒÂ¦rie and the Dominion of Men&quot;, The Hobbit follows the quest of home-loving Bilbo Baggins to win a share of the treasure guarded by the dragon, Smaug. It was published on 21 September 1937 to wide critical acclaim, being nominated for the Carnegie Medal and awarded a prize from the New York Herald Tribune for best juvenile fiction. The book remains popular and is recognized as a classic children's book.\n\n\nBilbo's journey takes him from light-hearted, rural surroundings into darker, deeper territory. The story is told in the form of an episodic quest, and most chapters introduce a specific creature, or type of creature, of Tolkien's Wilderland. By accepting the disreputable, romantic, fey and adventurous side of his nature (the &quot;Tookish&quot; side) and applying his wits and common sense, Bilbo develops a new level of maturity, competence and wisdom.\n\n\nThe final chapters deal with the climactic Battle of Five Armies, where many of the characters and creatures from earlier chapters re-emerge to engage in conflict. Critics have cited Tolkien's own experiences and the themes of other writers who fought in World War I, along with the author's professional knowledge of Anglo-Saxon literature and personal interest in fairy tales, as the chief influences.\n\n\nDue to the book's critical and financial success, Tolkien's publishers requested a sequel. As work on the The Lord of the Rings progressed, Tolkien made retrospective accommodations for it in one chapter of The Hobbit. These few but significant changes were integrated into the second edition. Further editions followed with minor emendations, including those reflecting Tolkien's changing concept of the world into which Bilbo stumbled.\n\n\nThe work has never been out of print, except during the paper shortages of the Second World War.","torrent":{"xt":"urn:btih:456a72a1cf03f7cd47406fac81aa49abb9472ccb","amp;dn":"The+Hobbit+By+J.+R.+R.+Tolkien+-+BBC+Radio+4+Dramatisation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456a72a1cf03f7cd47406fac81aa49abb9472ccb","infoHashBuffer":{"type":"Buffer","data":[69,106,114,161,207,3,247,205,71,64,111,172,129,170,73,171,185,71,44,203]},"announce":[],"urlList":[]}}