{"title":"KL: A History of the Nazi Concentration Camps (2015) epub","uid":11828764,"size":7815422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:456be7fd76892d726ad0f65d871f8f9fc6555ded&amp;dn=KL%3A+A+History+of+the+Nazi+Concentration+Camps+%282015%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bookzilla","files":1,"time":1429569264,"description":"The first comprehensive history of the Nazi concentration camps\n\n In a landmark work of history, Nikolaus Wachsmann offers an unprecedented, integrated account of the Nazi concentration camps from their inception in 1933 through their demise, seventy years ago, in the spring of 1945. The Third Reich has been studied in more depth than virtually any other period in history, and yet until now there has been no history of the camp system that tells the full story of its broad development and the everyday experiences of its inhabitants, both perpetrators and victims, and all those living in what Primo Levi called &quot;the gray zone.&quot;\n In KL, Wachsmann fills this glaring gap in our understanding. He not only synthesizes a new generation of scholarly work, much of it untranslated and unknown outside of Germany, but also presents startling revelations, based on many years of archival research, about the functioning and scope of the camp system. Examining, close up, life and death inside the camps, and adopting a wider lens to show how the camp system was shaped by changing political, legal, social, economic, and military forces, Wachsmann produces a unified picture of the Nazi regime and its camps that we have never seen before.\n A boldly ambitious work of deep importance, KL is destined to be a classic in the history of the twentieth century.\n\nepub \n880 pages","torrent":{"xt":"urn:btih:456be7fd76892d726ad0f65d871f8f9fc6555ded","amp;dn":"KL%3A+A+History+of+the+Nazi+Concentration+Camps+%282015%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"456be7fd76892d726ad0f65d871f8f9fc6555ded","infoHashBuffer":{"type":"Buffer","data":[69,107,231,253,118,137,45,114,106,208,246,93,135,31,143,159,198,85,93,237]},"announce":[],"urlList":[]}}