{"title":"Reflexercise_ Train Your Brain to be LESS Reactive tn, Trauma an","uid":9159797,"size":716378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45cae0dba801641a52491cbc575a0efbf956023a&amp;dn=Reflexercise_+Train+Your+Brain+to+be+LESS+Reactive+tn%2C+Trauma+an&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"420weedman","files":1,"time":1383854222,"description":"Reflexercise is an instructional manual that will provide you the background information to understand the science behind the technique and the simple instructions to perform in order to train your brain to be less reactive to stress, anxiety, chronic pain, depression, trauma and post traumatic stress.\nDon't buy this instructional manual if you are looking for a &quot;miracle cure&quot; for your problems. Sadly, no miracle cure exists. However, if you are looking for a tool that is founded upon science, easy to perform and proven effective, then you are in the right place.\nReflexercise is the first step of a revolutionary new treatment approach designed specifically to treat chronic conditions, called Associative Awareness Techniqueâ„¢ (AAT). This manual provides you access to the first step of AAT so you can begin training your nervous system to change the patterns that contribute to chronic conditions right from home. \nBecause Reflexercise is self applied, takes less than 30 seconds to perform and is so effective for those that use it as directed, I've written this manual for anyone to benefit from the first step of AAT. Please understand, that one performance of Reflexercise won't change anything in the long run. Consistent performance of Reflexercise is required to retrain your brain's learned habits regarding stress and pain. \nWhile relaxation is a fantastic benefit of Reflexercise, it is not the ultimate goal. The primary use of this tool is to influence neuroplasticity within your own brain and change old, habituated responses to stress, pain, depression, anxiety and post traumatic stress. \nUltimately, Reflexercise produces homeostasis, or balance, within the Central Nervous System. This means balance within your brain. With consistent performance, you can actually train your brain to remain balanced, even during stressful or painful events. When your brain is able to maintain a state of balance, your body will follow its lead. For many of you suffering from the chronic conditions already mentioned, this is when and how true healing can begin. \nWhat do Stress, Anxiety, Chronic Pain, Depression, Trauma and even Post Traumatic Syndrome all have in common? All of these conditions are caused by the Central Nervous System. When any Human Being is exposed to a potential or perceived life threat situation, the Central Nervous System activates our Survival Instincts to take over and protect our lives. Cutting edge neuroscience has allowed us to understand this process with new insights, including: Why and how our Survival Instincts are activated and how these repeated patterns of protection create chronic problems within our bodies. \nWe've discovered that once these protective patterns are turned on, for many people they don't turn off. The long term result of living in this state of neurologically driven protection includes changes to almost every system within the body. This long term disruption of normal function within multiple body systems is the cause of most chronic conditions.\nThe problem with designing an intervention that produces lasting results for the millions of people suffering from chronic conditions, is trying to effectively communicate with the Central Nervous System. This is the primary stumbling block to developing effective treatment programs for chronic conditions.\nReflexerciseÂ® is designed to communicate to our Central Nervous System that we no longer require these instinctively driven protective patterns, resulting in the restoration of balance within the brain. When the brain is balanced, then and only then, will the body's systems be allowed to return to normal function. This brain / body balance, when reproduced regularly, allows for remarkable healing to occur. Even for many suffering from complex, long term conditions that have not responded to anything else. \nGenre: Non-Fiction&gt; Disorders &amp; Diseases&gt; Physical Impairments\n","torrent":{"xt":"urn:btih:45cae0dba801641a52491cbc575a0efbf956023a","amp;dn":"Reflexercise_+Train+Your+Brain+to+be+LESS+Reactive+tn%2C+Trauma+an","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45cae0dba801641a52491cbc575a0efbf956023a","infoHashBuffer":{"type":"Buffer","data":[69,202,224,219,168,1,100,26,82,73,28,188,87,90,14,251,249,86,2,58]},"announce":[],"urlList":[]}}