{"title":"Lords of Xulima-RELOADED","uid":11462053,"size":1685946368,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:45eb1cb6f0150214f46be86621d20a272fc51293&amp;dn=Lords+of+Xulima-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"extremezone","files":-1,"time":1415999179,"description":" &lt;a href=&quot;http://i.imgur.com/I44t7fI.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/I44t7fI.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://i.imgur.com/T51hL8S.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/T51hL8S.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/5QEO8Lv.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/5QEO8Lv.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i.imgur.com/fK27mA4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/fK27mA4.jpg&lt;/a&gt;\n\nLords of Xulima-RELOADED\nLords of Xulima (c) Numantian Games\n\n11/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Adventure, Indie\nRPG\n\nAbout This Game  Lords of Xulima  is an original Fantasy RPG set on the\nmythical continent of Xulima, where Gods and humans once walked side by side\nBecome the Herald of the Gods and travel to an uncharted land to fulfill your\nmission of restoring balance in the known world.\n\nThis edition includes the game Lords of Xulima and the Talisman of Golot DLC,\nthe Talisman of Golot DLC and the Special Digital Rewards DLC.\n\nMore than 100 hours of authentic Role-Playing Experience\nLooking for a challenging adventure?\nIn Lords of Xulima, we do not hold your hand through the journey. We have\ncreated a world of diverse regions that are as vibrant with life as they are\nfraught with danger from the alluring Golden Woods, through the Great Desert\nof Pernitia, to the daunting icy peaks of Karraga. You are free to explore\nand choose which path to follow, but be careful about where the adventure\ntakes you. Your success or failure in Lords of Xulima all depends on your\nstrategies and ability lead your customized party. Immerse yourself in the\nplayability and depth of old school classics, presented through modern\nvisuals and a user-friendly interface.\n\nA Tale of Gods and Humans\nDiscover one of the most epic stories ever written and follow it to its\ntwisted conclusion\nLegend has it that many years ago, people lived in peace on the great\ncontinent of Rodinia a peace that would not last. Soon, the Great War broke\nout, dragging every kingdom and village down an endless spiral of ruin and\ndesolation. The people prayed for salvation from the Nine Gods, whose\nunreachable homeland lay beyond the Great Sea, on the forbidden continent of\nXulima.\n\nEventually, the conflict came to a point where it threatened to ruin all\ncreation. Thus Golot, Lord of Works and Dreams, appeared to Gaulen, a\nseasoned Explorer who lived on a remote island off the coast of Rodinia. The\nLord of Works appointed Gaulen to be his Herald on Earth and to set sail for\nXulima, so that balance could be restored to the world. Thus begins the\nadventure of our young protagonist.\n\nCreate your group of characters\nCreate and customize five characters to accompany Gaulen on your journey\nWith 9 character classes and over 100 useful skills, the possibilities are\nendless.  Each group will be unique. Who will you decide to take with you\nChoose among familiar classes such as the Mage, Cleric, Barbarian, Soldier,\nThief, Bard and Paladin or try out the Arcane Soldier and Divine Summoner\nDevelop your characters' abilities to suit your play style as they gain\nexperience and grow stronger to face the trials ahead.\n\nStrategic, fluid, turn-based combat\nDiscover an addictive combat system. Over 100 unique types of enemies roam\nthe wilds of Xulima , each capable of posing their own kinds of threats to\nyour divine mission. There are thousands of possible strategies to lead the\ngroup to victory, including the use of scrolls and divine blessings. Will you\nbe able to match the strength of Nilfonte, the Ocean Titan? Or survive an\nencounter with Xabraluz, the Demon King of Vilak?\n\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\nNote: We need anything you can offer as early releases,seedboxes, source links,\naccounts, contact us on &lt;a href=&quot; http://torentz.3xforum.ro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://torentz.3xforum.ro&lt;/a&gt; or \nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nLords of Xulima-RELOADED Torrent Free Download\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,upgrade pc,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET","torrent":{"xt":"urn:btih:45eb1cb6f0150214f46be86621d20a272fc51293","amp;dn":"Lords+of+Xulima-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45eb1cb6f0150214f46be86621d20a272fc51293","infoHashBuffer":{"type":"Buffer","data":[69,235,28,182,240,21,2,20,244,107,232,102,33,210,10,39,47,197,18,147]},"announce":[],"urlList":[]}}