{"title":"Peter Hook, Unknown Pleasures: Inside Joy Division (Epub)","uid":12353278,"size":2609630,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46c5093dc83ee74b9a10769ce145e05e267b32b8&amp;dn=Peter+Hook%2C+Unknown+Pleasures%3A+Inside+Joy+Division+%28Epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Hand_of_Doom","files":3,"time":1441451320,"description":"Peter Hook, Unknown Pleasures: Inside Joy Division (Epub)\n\n\n\nJoy Division changed the face of music. The sound of music. The meaning of music. Godfathers of the current alternative scene, they reinvented rock in the post-punk era, creating a new sound -- dark, hypnotic, intense - that would influence U2, Morrissey, R.E.M., Radiohead and many others. The band's image, once subversive and alienating, has become an internationally renowned 'look' well documented by photographers Anton Corbijn, Kevin Cummins and graphic designer Peter Saville. Inspired by the attitude, energy and sound of Punk, particularly the Sex Pistols, Peter Hook and his old school friend Bernard Sumner started a band which continues to influence popular music 35 years later, uniting with a gifted lead-singer and lyricist, Ian Curtis, and a brilliant drummer, Stephen Morris. With some cobbled together instruments and a clapped out old van, four young lads from Manchester and Salford shared the same vision and created their own unique sound in pubs and clubs first across the north-west, then across the whole of Britain, until in 1980 they had released two albums and were on the cusp of touring America. Then Ian Curtis committed suicide leaving everyone around him bereft. Best known for the propulsive bass guitar melodies of 'Love Will Tear Us Apart' Hooky was at the heart of the sound that came to define an era and inspire a generation. In the frank, no-holds-barred style that has seen his previous book The Hacienda: How Not to Run a Club hailed as one of the best music books of 2009, Peter 'Hooky' Hook gives us the inside story of life with Joy Division. He talks with eye-opening candor and reflection about the suicide of Ian Curtis: often seen as the &quot;intellectual one&quot;, to Peter and the band he was just &quot;one of the lads&quot; and the burden of balancing his epilepsy and the demands of his domestic life only really emerged when it was too late. He covers the band's friendships and fall-outs; their rehearsals and recording sessions; and the larger-than-life characters who formed a vital part of the Joy Division legend: Tony Wilson, Rob Gretton, Martin Hannett, and more","torrent":{"xt":"urn:btih:46c5093dc83ee74b9a10769ce145e05e267b32b8","amp;dn":"Peter+Hook%2C+Unknown+Pleasures%3A+Inside+Joy+Division+%28Epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46c5093dc83ee74b9a10769ce145e05e267b32b8","infoHashBuffer":{"type":"Buffer","data":[70,197,9,61,200,62,231,75,154,16,118,156,225,69,224,94,38,123,50,184]},"announce":[],"urlList":[]}}