{"title":"anydwg pack","uid":8767941,"size":34182431,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:46f91ddb0e14d8a504481f33e72b866e019a7e55&amp;dn=anydwg+pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"_gonzo_","files":13,"time":1375377709,"description":"Batch convert DWG and DXF files to vector PDF files without the need of AutoCAD. (It is stand-alone AutoCAD drawing file conversion program, you do not need AutoCAD or Adobe Acrobat to use this PDF Converter).\n\nA full featured PDF to DWG/DXF converter that allows you to easy convert PDF to DWG and PDF to DXF without the need of AutoCAD and Adobe Acrobat. It compatible with any popular CAD systems.\n\nA batch DWG and DXF bi-directional converter and file version converter, it allows you to convert DWG to DXF, DXF to DWG without the need of AutoCAD. It supports every version of DWG/DXF files (supports R2.5 to 2013 formats).\n\nBatch convert DWG and DXF files to TIF (TIFF), JPG (JPEG), BMP, GIF, PNG, TGA, PCX, EMF and WMF without the need of AutoCAD. Allows you to convert your drawings into image files easily without purchasing expensive software programs.\n\nIt allows you to convert DWF files to AutoCAD DWG and DXF file formats, you can recover DWF entities to corresponding DWG entities easily. It supports the DWF layers, multi-page specification and all entity types.\n\nConvert DWG and DXF files to DWF files, you do not need AutoCAD to use this converter. It supports DWG R2.5 to R2013 files.\n\nP.S.\n\nAll software are PRO 2013 version.\n","torrent":{"xt":"urn:btih:46f91ddb0e14d8a504481f33e72b866e019a7e55","amp;dn":"anydwg+pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46f91ddb0e14d8a504481f33e72b866e019a7e55","infoHashBuffer":{"type":"Buffer","data":[70,249,29,219,14,20,216,165,4,72,31,51,231,43,134,110,1,154,126,85]},"announce":[],"urlList":[]}}