{"title":"Desperate Pleasures - Your Favorite Fantasies - DVDRip Split Sce","uid":14188452,"size":1444140834,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:472b7dd769b5073d64c7ccd01ef9a987a8ed504d&amp;dn=Desperate+Pleasures+-+Your+Favorite+Fantasies+-+DVDRip+Split+Sce&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ImgSnaps","files":5,"time":1459864893,"description":"Desperate Pleasures - Your Favorite Fantasies - DVDRip Split Scenes ** NEW RELEASE 2016 **\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/image/iNN\r\n \nhttp://imgsnaps.com/image/iNT\r\n \nhttp://imgsnaps.com/image/iNb\r\n \nhttp://imgsnaps.com/image/iNc\r\n \nhttp://imgsnaps.com/image/iN1\r\n \nhttp://imgsnaps.com/image/iN2\r\n\r\nCast: Amy Faye, Camille Black, Hope Harper\r\n\r\nSynopsis:\r\nFans Sent Us Their Naughty Fantasies And We Performed Them Exactly As They Wanted!\r\nHey Guys, this DVD was created from scenes fans have sent in scripts for and we made them just the way they wanted. Theres everything from Vampires and Supergurl sex scenes to a very hot 3some. Check out all these hot scenes and email me your ideas toHere's 3 of the many scenes you'll find inside:\r\nBetter Than Flying Supergurl rescued a civilian and when he asks how he can repay her she tells him to lick her pussy. Turned on beyond belief, Supergurl peels of his pants and sucks his cock quickly. Supergurl lays him back and sits on his face for an intense 69 then she glides to his cock. She rides him hard and fast then he picks her up and they bounce off the walls. Supergurl lies on her back taking every thrust until he explodes deep inside her.\r\nNo More Complaints Working part time as a hotel manager I run into some wild situations. Last week, I was getting noise complaints so I went to check on it personally. This cute guy was very apologetic but I couldn't help noticing the bulge in his shorts. I started fucking him right there on the sofa. This sexy tattooed chic came into the room and after a wild threesome I headed back to the desk to move his neighbors so we'd get no more complaints.\r\nBitten And Enslaved I was on my way to a party when someone grabbed me, threw me over their shoulder and carried me back to my bed. He threw me down and climbed on top then bit my neck of all things. I started feeling faint and soon was yielding to his every command. He pleased me orally and then ordered me to do the same for him. His commands were irresistible and I became his willing sex slave","torrent":{"xt":"urn:btih:472b7dd769b5073d64c7ccd01ef9a987a8ed504d","amp;dn":"Desperate+Pleasures+-+Your+Favorite+Fantasies+-+DVDRip+Split+Sce","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"472b7dd769b5073d64c7ccd01ef9a987a8ed504d","infoHashBuffer":{"type":"Buffer","data":[71,43,125,215,105,181,7,61,100,199,204,208,30,249,169,135,168,237,80,77]},"announce":[],"urlList":[]}}