{"title":"Metallica - Kill 'Em All (1983) WMA320","uid":6151110,"size":163394063,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:473b2020ee2c5a7316170eaa49ed282d402e6494&amp;dn=Metallica+-+Kill+%5C%27Em+All+%281983%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1296881720,"description":"Metallica's 1983 debut wasn't exactly a good representation of them. &quot;Kill `Em All&quot; isn't nearly as dark as Metallica's later releases, like &quot;Ride the Lightning.&quot; Plus, this album is a lot faster and thrashier. &quot;Kill `Em All&quot; is the sound of original thrash metal. Now, this band didn't give birth to speed metal (Motorhead did), but Metallica were the first to release a studio LP. Later in the 1980's, thrash would become very popular and bands like Anthrax, Testament, and Slayer would crop up. \n\nSince this is the first available album that James, Kirk, Lars, and Cliff played together, it is somewhat immature. James' vocals are high pitched and some of his lyrics (i.e. &quot;We'll never stop/we'll never quit/'cause we're Metallica!&quot;) are pretty amateur, but it's interesting to see what Metallica were like 20-some years ago. And &quot;Kill `Em All&quot; is still a very entertaining listen and great thrash. It may not be as brutal or rapid as say Slayer, but it's very catchy and full of fiery, breakneck-speed, buzzsaw guitar riffs and scorching solos. \n\n1. &quot;Hit the Lights&quot; begins with the guitars slowly fading in, then, after Lars does a little smattering drum pattern, Kirk and James set their fret boards on fire with fast running riffs. This song has an audible, beeping bassline, but the real highlight is the several careening, almost screeching guitar solos. \n2. &quot;Four Horsemen&quot; is Metallica's very first single, and it's still in regular rotation at radio stations (where I live, at least). It's not as fast as the first track, but it's quite catchy. It has an almost galloping beat, at times, and two more long, winding, classical sounding guitar solos. \n3. &quot;Motorbreath&quot; begins with a drum intro, and a thumping snare drum runs throughout, but the really fast chugging guitar riffs are what dominate, here. \n4. &quot;Jump in the Fire&quot; has more fast, chugging guitar work, but these riffs are different because they're groove-y and very catchy. Plus, there's another long, increasingly fast guitar solo near the end. \n5. &quot;(Anesthesia) Pulling Teeth&quot; is primarily, just one long solo. But it's not the work of Kirk or James... it's a bass solo! Cliff plays low, gluey, rumbling notes which make for a buzzing, beeping, ascending, occasionally wailing and wah-wah solo. A relaxed drum beat kicks in around the 2:40 mark, but Cliff makes this song world renowned among the metal community. \n6. &quot;Whiplash&quot; begins with a low thumping of a bass drum, then James and Kirk come aboard and light up this track with &quot;whiplash&quot; speed guitar work and tempo changes. I enjoy how the beat builds to a point, then pauses, and James shouts &quot;Here we go!&quot; Briefly, at the end of this song, it becomes a stop-start beat. \n7. &quot;Phantom Lord&quot; has another stop-start rhythm and riffs, and a couple pick slides, but James' vocals are almost inaudible because they're drowned out by the guitars. The beat then slows way down, but some heavy riffs and a pair of cascading Hammett solos speed it back up. \n8. &quot;No Remorse&quot; is still a staple of Metallica's live show. It has rhythmic chug and churn riffs and one more, long, wailing guitar solo which makes this song gain density and speed. \n9. &quot;Seek &amp; Destroy&quot; has another very famous opening guitar melody, before it turns to crunchy riffs. This song is, musically, fairly repetitive, but it's still plenty catchy thanks to James' vocals. \n10. &quot;Metal Militia&quot; is highlighted by more insane, rip-roaring guitar work. \n\nSo, &quot;Kill `Em All&quot; is a great thrash record and it has great musicianship. Even though it may not be the best representation of Metallica, and it's not as classic or essential as Metallica's second and third albums, it's still a great listen and it is very highly recommend for all metalheads. Plus, this is a very influential, original, and a milestone album, so if you want a complete heavy metal or thrash-metal collection, you definitely need to pick this up. \n\nby A. Stutheit &quot;Teyad&quot;\n\nTRACKLIST:\n\n01 - Hit The Lights.wma                                \n02 - The Four Horsemen.wma                             \n03 - Motorbreath.wma                                   \n04 - Jump In The Fire.wma                              \n05 - (Anesthesia) Pulling Teeth.wma                    \n06 - Whiplash.wma                                      \n07 - Phantom Lord.wma                                  \n08 - No Remorse.wma                                    \n09 - Seek &amp; Destroy.wma                                \n10 - Metal Militia.wma                                 \n11 - Am I Evil.wma                                     \n12 - Blitzkrieg.wma   \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:473b2020ee2c5a7316170eaa49ed282d402e6494","amp;dn":"Metallica+-+Kill+%5C%27Em+All+%281983%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"473b2020ee2c5a7316170eaa49ed282d402e6494","infoHashBuffer":{"type":"Buffer","data":[71,59,32,32,238,44,90,115,22,23,14,170,73,237,40,45,64,46,100,148]},"announce":[],"urlList":[]}}