{"title":"Harry.Nilsson,.Ringo.Starr.-.the.son.of.Dracula.OST.1974","uid":8127378,"size":87729847,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:47bb2c5d7548c13be010a4b340f5634283ba13a8&amp;dn=Harry.Nilsson%2C.Ringo.Starr.-.the.son.of.Dracula.OST.1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MP4SUX","files":-1,"time":1360520922,"description":"Well, I'm so heady over the 8-show pawn stars up in two and a half hours (stopped to gab).\n.\nI think now is a fine time to start answering my own question (in last night's Cops desc).\n.\nObscure Nilsson - it doesn't get much more obscure than this one.\nEver hear of a movie callled &quot;The Son Of Dracula&quot;?\nOf course you have - but I'm not talking about THAT one (no Lon Chaney here).\n.\nHarry Nilsson, Ringo Star. I even saw it once, in 1974-ish.\n.\nSadly, I do not have the movie ... But here's the OST:\nFull of bad acting and familiar songs ... Enjoy,\n.\nAVIGUY\n\nfajMMaaEh\n\nComing soon: &quot;Nilsson Sings Newman&quot; &quot;Nilsson sings Yoko&quot; (gotta find a missing song)\n&quot;The Point&quot; - hah, you think you know what I'm talking about  - but which one of three?\nOne each narrated by: Ringo Starr, Dustin Hoffman, Harry Nilsson.\nThe Ringo DVD claims Dustin in the liner credits - but he aint there!\nI made such a stink the DVD company just refunded my money to shut me up. Free DVD!\nAnyone know if the movie &quot;The Point&quot; here is a DVD rip or something prior?\nGonna have to think and maybe do a LOT of work on a poor VHS rip of Dustin (you know\nhow VHS tapes can crackle if the recorded sound is not quite aligned with the wrong VCR?\nHave the very sub-standard video file - Don't know if the tape itself is still extant.\nBut the really GOOD news is a fine copy of the Nilsson album where HE narrates &quot;The Point&quot;.\nYou've heard &quot;Hendrix at the Beeb&quot;? (BBC), how about &quot;Nilsson at the Beeb&quot;?\nOh, and a couple more OSTs - &quot;Popeye&quot; and &quot;Skidoo&quot; where Nilsson has a bit part as a\nTower guard being eloquent with &quot;yaddadaada yaddaa da&quot;. He also wonderfully sings the\nend credits (including MCMLXVIII) 1968. How's your\n.\nI Think I've searched for these all exhaustively on KAT and TPB - they don't seem to exist.\nI think this &quot;Son Of Dracula&quot; orignally came from the seemingly defunct Demonoid.\nThere are also a couple of other really obscure thingies I haven't made up my mind obout..\nAnybody interested in 25 verwsions of &quot;Minnie the Moocher&quot;?\nAnybody interested in 22 verwsions of &quot;Amazing Grace&quot;?\nAnybody interested in 20 verwsions of &quot;I fought the law and the law won&quot;?\n\nOh, almost forgot (so it'll be next) Harry Nilsson, John Lennon - Pussycats.","torrent":{"xt":"urn:btih:47bb2c5d7548c13be010a4b340f5634283ba13a8","amp;dn":"Harry.Nilsson%2C.Ringo.Starr.-.the.son.of.Dracula.OST.1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47bb2c5d7548c13be010a4b340f5634283ba13a8","infoHashBuffer":{"type":"Buffer","data":[71,187,44,93,117,72,193,59,224,16,164,179,64,245,99,66,131,186,19,168]},"announce":[],"urlList":[]}}