{"title":"Coraline - Neil Gaiman","uid":11770393,"size":2333379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47fb3a981e08cab86a01ebc2bb2775cc56fc3cf3&amp;dn=Coraline+-+Neil+Gaiman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1427050192,"description":"Coraline's often wondered what's behind the locked door in the drawing room. It reveals only a brick wall when she finally opens it, but when she tries again later, a passageway mysteriously appears. Coraline is surprised to find a flat decorated exactly like her own, but strangely different. And when she finds her &quot;other&quot; parents in this alternate world, they are much more interesting despite their creepy black button eyes. When they make it clear, however, that they want to make her theirs forever, Coraline begins a nightmarish game to rescue her real parents and three children imprisoned in a mirror. With only a bored-through stone and an aloof cat to help, Coraline confronts this harrowing task of escaping these monstrous creatures.\n\nGaiman has delivered a wonderfully chilling novel, subtle yet intense on many levels. The line between pleasant and horrible is often blurred until what's what becomes suddenly clear, and like Coraline, we resist leaving this strange world until we're hooked. Unnerving drawings also cast a dark shadow over the book's eerie atmosphere, which is only heightened by simple, hair-raising text. Coraline is otherworldly storytelling at its best","torrent":{"xt":"urn:btih:47fb3a981e08cab86a01ebc2bb2775cc56fc3cf3","amp;dn":"Coraline+-+Neil+Gaiman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47fb3a981e08cab86a01ebc2bb2775cc56fc3cf3","infoHashBuffer":{"type":"Buffer","data":[71,251,58,152,30,8,202,184,106,1,235,194,187,39,117,204,86,252,60,243]},"announce":[],"urlList":[]}}