{"title":"The German Army at Passchendaele","uid":15744613,"size":3818867,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:482d17a9ffa16bbb8d5343b6954749e782c78216&amp;dn=The+German+Army+at+Passchendaele&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"marty14","files":1,"time":1472953434,"description":"The German Army at Passchendaele by Jack Sheldon [epub]\r\n\r\nEven after the passage of almost a century, the name Passchendaele has lost none of its power to shock and dismay. Reeling from the huge losses in earlier battles, the German army was in no shape to absorb the impact of the Battle of Messines and the subsequent bitter attritional struggle.\r\n\r\nThroughout the fighting on the Somme the German army had always felt that it had the ability to counter Allied thrusts, but following the shock reverses of April and May 1917, much heart searching had led to the urgent introduction of new tactics of flexible defense. When these in turn were found to be wanting, the psychological damage shook the German defenders badly. But, as this book demonstrates, at trench level the individual soldier of the German Army was still capable of fighting extraordinarily hard, despite being outnumbered, outgunned and subjected to relentless, morale-sapping shelling and gas attacks.\r\n\r\nThe German army drew comfort from the realization that, although it had had to yield ground and had paid a huge price in casualties, its morale was essentially intact and the British were no closer to a breakthrough in Flanders at the end of the battle than they had been many weeks earlier","torrent":{"xt":"urn:btih:482d17a9ffa16bbb8d5343b6954749e782c78216","amp;dn":"The+German+Army+at+Passchendaele","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"482d17a9ffa16bbb8d5343b6954749e782c78216","infoHashBuffer":{"type":"Buffer","data":[72,45,23,169,255,161,107,187,141,83,67,182,149,71,73,231,130,199,130,22]},"announce":[],"urlList":[]}}