{"title":"When.We.Go.to.War.S01E01-E02.HDTV.x264-FiHTV.mp4","uid":11850937,"size":763595818,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4862dd26178bf17ba06b73b252a1f8d7a554ad73&amp;dn=When.We.Go.to.War.S01E01-E02.HDTV.x264-FiHTV.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"TlanImass","files":1,"time":1430084951,"description":"When We Go To War focuses on the impact the war has on a middle New Zealand, Pakeha family and a Maori brother and sister.\n\nThis spectacular six-hour television drama cuts between life at home, Gallipoli and Egypt. The series begins in a time of optimism and hope, on the eve of war. New Zealand has one of the highest living standards in the world, is part of the mighty British Empire and few can foresee the horrors soon to come.\n\nAs the series - and the war - progress, the changing lives of those back home are contrasted with the experiences of New Zealand soldiers in the trenches and the lives of nurses in makeshift hospitals in Egypt. The war puts an enormous strain on existing relationships - while new ones develop.\n\nThe story centres around a powerful and conflicted love story between Bea Smith, a woman ahead of her time who is nursing in Egypt alongside her lover William, a dedicated doctor. The series also explores the effect the battlefield has on Charles Smith, a lawyer turned officer, his brother Harry, the family's black sheep, and family friend Manaaki Kokiri, a preacher turned lethally effective soldier. The effects of war at home cover the grief of the bereaved, anti-German hatred, anti-conscription activism and the survival of the family's economic base, Smith's Emporium.\n\n\n\n\nWhen We Go to War - Season 1, Episodes 1 &amp; 2\n\n\n\nBea's Letter / Manaaki's Letter\n\nCharles clashes with Harry when he returns to Gallipoli; Cissy is seduced by an admirer; George breaks James' heart; and Manaaki and Harry go 'over the top' with tragic results.\n\n\n\n\nOriginal Air Date: 26-Apr-2015","torrent":{"xt":"urn:btih:4862dd26178bf17ba06b73b252a1f8d7a554ad73","amp;dn":"When.We.Go.to.War.S01E01-E02.HDTV.x264-FiHTV.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4862dd26178bf17ba06b73b252a1f8d7a554ad73","infoHashBuffer":{"type":"Buffer","data":[72,98,221,38,23,139,241,123,160,107,115,178,82,161,248,215,165,84,173,115]},"announce":[],"urlList":[]}}