{"title":"The 36-Hour Course - Finance for Non-Financial Managers - H. Geo","uid":9270064,"size":4420233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:48b098fcefef20741abd7d7037dde0c31c34566c&amp;dn=The+36-Hour+Course+-+Finance+for+Non-Financial+Managers+-+H.+Geo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1385758059,"description":"Make simple sense of complex financial information!\n\nThe high-profile accounting scandals of recent years have made one thing clear: You can't know too much about the company for which you work. What are the numbers? Where do you find them? How do they affect you and your staff?\n\nThis fully revised and updated third edition of The McGraw-Hill 36-Hour Course: Finance for Nonfinancial Managers provides a firm grasp on what all the numbers really mean. Designed to let you learn at your own pace, it walks you through:\nThe essential concepts of finance, so you can ask intelligent questions and understand the answers\n\nVital statements and reports, with sections on pro forma financial statements and expensing of stock options \n\nThe auditing process--what is measured, how it's measured, and how you can help ensure accuracy and completeness\n\nWith chapter-ending quizzes and an online final exam, The McGraw-Hill 36-Hour Course: Finance for Nonfinancial Managers serves as a virtual professor, providing the curriculum you need to crunch the numbers like a pro!","torrent":{"xt":"urn:btih:48b098fcefef20741abd7d7037dde0c31c34566c","amp;dn":"The+36-Hour+Course+-+Finance+for+Non-Financial+Managers+-+H.+Geo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48b098fcefef20741abd7d7037dde0c31c34566c","infoHashBuffer":{"type":"Buffer","data":[72,176,152,252,239,239,32,116,26,189,125,112,55,221,224,195,28,52,86,108]},"announce":[],"urlList":[]}}