{"title":"SweetScape 010 Hex Editor V 5.0","uid":11264381,"size":13523302,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4919c437120e72c2fc641e248b9929add3e656d0&amp;dn=SweetScape+010+Hex+Editor+V+5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"zorchtorrent","files":-1,"time":1414007340,"description":"010 Editor V5.0 Â© 2002-2014 SweetScape Software Inc.\n\n\nEdit Anything\n\nProfessional text and hex editing\nwith Binary Templates technology.\n\n\n * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * \n\n\n\t\t010 Editor is a...\n\n\n*** Text Editor\nEdit text files, XML, HTML, Unicode and UTF-8 files, C/C++ source code, etc. Unlimited undo and powerful editing and scripting tools.\n\t\n\n*** Hex Editor\nUnequalled binary editing performance. Edit any file of any size. Use powerful Binary Templates technology to understand binary data.\n\n\n*** Disk Editor\nFind and fix programs with hard drives, memory keys, flash drives, CD-ROMs, etc.\n\t\t\n\n*** Process Editor\nInvestigate and modify memory from processes.\n\n\n * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * \n\n\n\t\tWhy is 010 Editor so powerful?\n\t\t\n\n*** Binary Templates - Hex Editing to a New Level\n\nUnlike traditional hex editors which only display the raw hex bytes of a file (1), 010 Editor can also parse a file into a hierarchical structure using a Binary Template (2). The results of running a Binary Template are much easier to understand and edit than using just the raw hex bytes.\n\n* Binary Templates are easy to write and look similar to C/C++ structs except they\n  may contain if, for, or while statements as well as functions or complex\n  expressions.\n* Powerful enough to parse almost any binary file format.\n* Can be set to run automatically when files are opened.\n* Templates may be shared and a list of templates for download is available in our\n  Template Archive.\n\t\t\n\n*** Analysis Tools - Drill into your Data\n\nA number of sophisticated tools are included with 010 Editor for analyzing and\nediting binary files:\n\n* Full Find, Replace, Find in Files, and Replace in Files functionality for many\n  different data types.\n* Powerful Binary Comparison tool for analyzing byte-by-byte differences between\n  two files.\n* Use the Histogram tool to count byte occurrences and visualize data.\n* Computes Check Sum/Hash Algorithms including CRC-16, CRC-32, Adler32, MD2, MD4, MD5, RIPEMD160, SHA-1, SHA-256, TIGER, etc.\n\t\t\n\n*** Scripting - Automate your Editing\n\n* Simple or complex editing operations can be automated using a syntax similar to\n  C/C++.\n* Features over 275 different functions for operating on data.\n* Integrated with Binary Templates to intuitively edit files. Simply assign to\n  variables defined in a Binary Template to modify a file.\n* Scripts may be shared and a list of scripts for download is available in our\n  Script Archive.\n* Run scripts from the command line with no user interface for batch processing.\n\t\t\n\n*** plus much more.\n\n* Powerful Workspace view including file explorer.\n* Convert data between ASCII, EBCDIC, Unicode, UTF-8, etc.\n* Inspector allows data to be quickly interpreted in different formats.\n* Mark important bytes using Bookmarks.\n* Full integrated expression calculator.\n* Apply Highlighting rules to identify bytes in a file.\n* Import or export data in Intel Hex Format, Motorola S-Records, Hex Text,\n  C/C++/Java Code, Base64, Uuencoding, RTF, or HTML.\n* Printing with full print preview, headers, footers, and margins. \n\n\n1) Install software.\n2) Use one of the keys.\n3) haxx binaries.\n\n\nSUPPORT THE SOFTWARE DEVELOPERS. If you like/find this app useful, BUY IT!","torrent":{"xt":"urn:btih:4919c437120e72c2fc641e248b9929add3e656d0","amp;dn":"SweetScape+010+Hex+Editor+V+5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4919c437120e72c2fc641e248b9929add3e656d0","infoHashBuffer":{"type":"Buffer","data":[73,25,196,55,18,14,114,194,252,100,30,36,139,153,41,173,211,230,86,208]},"announce":[],"urlList":[]}}