{"title":"Resolume Arena v5.0 MAC OSX-d33p57a7u5","uid":12657777,"size":1163447105,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:4976d415f06075dc00bbe5e6e85ce04147d722fc&amp;dn=Resolume+Arena+v5.0+MAC+OSX-d33p57a7u5&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"deepstatus","files":4,"time":1446261213,"description":"Resolume Arena v5.0 MACOSX-d33p57a7u5\r\n              ------------------------------------------------------\r\n                                    (UNION)\r\n\r\n         URL.......: http://resolume.com/blog/12462/arena-5-point-ooooh\r\n\r\n   \r\n    Live HD Video Mixing\r\n    Resolume puts you in charge. You can play your videos when you want, how\r\n    you want. Forwards, backwards, scratch and adjust tempo to the beat. Mix\r\n    and match your visuals quickly and easily and play Resolume like an\r\n    instrument.\r\n\r\n    Intuitive Interface\r\n    Whatever your style is, Resolume offers you an easy interface to rock it.\r\n    Use as little or as many videos and effects as you like. The only limit is\r\n    your computer's raw power and your imagination.\r\n\r\n    From Your Local Club to Main Stage\r\n    You can play on any amount of screens. From a simple screen behind the DJ\r\n    in your local club to main stage at Ultra. As long as your computer can\r\n    recognise it as an output, Resolume will let you use it.\r\n\r\n    Projection Mapping with Arena\r\n    Project video on any type of surface. Complex geometrical structures or\r\n    whole buildings. Resolume does all the hard work, so you can concentrate\r\n    on the important part: being creative.\r\n\r\n    Blend Projectors with Arena\r\n    With edge blending you can seamlessly project one beautiful widescreen\r\n    image with two or more projectors. It can even wrap around for a full\r\n    360 degree experience.\r\n\r\n    Project on Cars, Buildings or Pumpkins\r\n    With Arena you can take on any size mapping project. From projecting on\r\n    DJ booths to cars, buildings and LED mappings on giant stages like Ultra.\r\n\r\n    Led There Be Light\r\n    Think outside the screen and colour the lights too! With Arena 5 you can\r\n    send out colours to DMX fixtures and the lights will be in sync with your\r\n    visuals.\r\n\r\n    Live Composite &amp; Effects\r\n    Adjust the scale and position of your clips to suit your needs. Apply\r\n    effects to drastically change the look of your video. Everything runs\r\n    on the video card so you get the fastest performance and best image\r\n    quality possible.\r\n\r\n    Real Time Rendering\r\n    Apply effects, blend, mix, cut and edit, everything happens on the spot.\r\n    Resolume also plays your generative content made in Flash or Quartz\r\n    Composer.\r\n\r\n    Audio &amp; Visual Plugins\r\n    All visual effects in Resolume are plugins and you can easily add more\r\n    effects by download 3rd party plugins. You can even program your own using\r\n    OpenGL. On the audio side you can use VST plugins to play your favorite\r\n    effects.\r\n\r\n    Integrate With Other Apps\r\n    With Syphon on the Mac and Spout on Windows you can stream visuals in\r\n    real-time between Resolume and other apps. You can even program your own\r\n    apps that integrate with Resolume.\r\n\r\n    Live Cameras\r\n    Connect a plug and play webcam. Capture a high end HD-SDI signal.\r\n    Feed the output of one computer into another. Whatever you need.\r\n \r\n    Blackmagic Capture Devices\r\n    Resolume supports all Blackmagic Design capture cards for both input\r\n    and output. On Mac OS X and Windows you get maximal quality with minimal\r\n    latency.\r\n\r\n    Audio Visual Playback\r\n    Resolume plays both audio and video files. Juggle pixels and composite\r\n    beats, combine any video file with any audio file.\r\n\r\n    Audio Visual Effects\r\n    Resolume has both audio effects and video effects. Use them separately\r\n    or combine them to create exciting new audio visual effects. \r\n\r\n    Audio Analysis\r\n    Make clips and effects dance to the beat. Resolume can analyse audio\r\n    to make any parameter bounce to the music. \r\n\r\n    &quot;Yes I AM actually DJing Live&quot;\r\n    With SMPTE Timecode input in Arena you can run you clips in sync with\r\n    the DJ.\r\n\r\n    All Hands on Deck\r\n    Liberate yourself from the mouse. Use your favourite MIDI controller\r\n    or get physical with your iPhone via OSC.\r\n\r\n    Control from a Lighting Desk\r\n    You can control Arena from a lighting desk using DMX. Use our standard\r\n    personality or configure your own.\r\n\r\n\r\n    System Requirements\r\n    Version 4.2.x Mac OS X 10.6 or later\r\n    Version 4.5 and 5.x OS X 10.7 or later\r\n    OpenCL-capable graphics card or Intel Iris Pro or later.\r\n    256MB of VRAM\r\n    2GB RAM\r\n\r\n\r\n\r\n                  1) Unrar \r\n                            \r\n                  2) Install.\r\n                           \r\n                  3) Replace with cracked one.\r\n\r\n                  4) Open Preferences / Registration\r\n                     and choose Offline Registration\r\n\r\n                  5) Select the included Arena.avr\r\n\r\n\r\n\r\n\r\n                  • Thats it! Done.\r\n\r\n                    • Supp0rt th3 D3v3lop3r if you liK3 it.\r\n\r\n                                                      3Nj0Y !!!","torrent":{"xt":"urn:btih:4976d415f06075dc00bbe5e6e85ce04147d722fc","amp;dn":"Resolume+Arena+v5.0+MAC+OSX-d33p57a7u5","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4976d415f06075dc00bbe5e6e85ce04147d722fc","infoHashBuffer":{"type":"Buffer","data":[73,118,212,21,240,96,117,220,0,187,229,230,232,92,224,65,71,215,34,252]},"announce":[],"urlList":[]}}