{"title":"My.Kitchen.Rules.s06e08.WS.PDTV.x264.BF1.mkv","uid":11696694,"size":613223049,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:49b29183e5ce2b3b01716d8348683e6d72b595aa&amp;dn=My.Kitchen.Rules.s06e08.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"bigfish5","files":1,"time":1423700610,"description":"My Kitchen Rules Australia Series 6 Episode 8\n\nWe're back to Western Australia with workmates Eva and Debra ready to cook up a storm at their Instant Restaurant. Hosted by Pete Evans and Manu Feildel.\n\nEva and Debra Western Australia\nWe feed off each other's vibe very easily. \nSince Eva and Debra started working together three years ago, literally sitting side by side every day in the marketing department of an energy company, they have been obsessing over what to eat for lunch.\n&quot;We clicked because of food,&quot; says Debra. &quot;We like the same type of food and that's how we clicked.&quot;\nAdds Eva: &quot;We deliberate about where we're going to go for lunch every day. It's always Asian. And Asian food because we both love Asian food and we both have quite strong heritage and culture from India, Singapore and Malaysia.&quot;\nEva, 32, moved to Perth 12 years ago from Singapore to attend university. She craves the curries of her childhood and credits her mum with helping her to recreate them in the kitchen.\n&quot;My mum will never ever give me the recipes. She'll be like, 'Stand in the kitchen, watch me cook it' and that's how I've learnt. It's by look, it's by feel, smell, taste,&quot; she says.\n&quot;I definitely prefer to cook off the cuff but that's when you have experience and knowledge which I'm still learning.&quot;\nNow living with partner of three years, Andy, she has increased his tolerance to high levels of chilli through her cooking.\nSimilarly, Debra, 26, says she cooks through taste rather than following a recipe and her culinary mentor is her dad Mervyn.\n&quot;Dad doesn't have a recipe really, it's all in his head. But it's not like you measure things, it's all by taste. Especially with Asian cooking, you've got to balance the flavours.&quot;\nThe girls see their only disadvantage as their lack of time together in the kitchen.\nSays Eva: &quot;On our own we do a lot of cooking. But together it's a little bit different.&quot;\nGive them a wok and a mortar and pestle and some fresh ingredients such as garlic, ginger, chili and spices and they'll be comfortable in the kitchen. Both love eating savoury foods, while Eva also has a sweet tooth. Interestingly though, Debra is more at ease creating desserts.\n&quot;I've got a real sweet tooth. I will crave for something sweet after every single meal,&quot; Eva confesses.\n&quot;To be honest we're probably more of a savoury cook,&quot; Debra says. &quot;I've just dabbled more in desserts. When I was young I used to bake a lot, but now when you're older you don't really have that time to bake. Who's going to eat a whole cake really!&quot;\nIn addition to working together, they also share a lot of other interests including travel and dance.\nDeb, 26, who lives with her boyfriend of five years Alex, is a semi professional dancer and dance teacher, performing on the weekends and around her day job. Eva likes to go camping, travel and has recently started taking some dance classes herself too","torrent":{"xt":"urn:btih:49b29183e5ce2b3b01716d8348683e6d72b595aa","amp;dn":"My.Kitchen.Rules.s06e08.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49b29183e5ce2b3b01716d8348683e6d72b595aa","infoHashBuffer":{"type":"Buffer","data":[73,178,145,131,229,206,43,59,1,113,109,131,72,104,62,109,114,181,149,170]},"announce":[],"urlList":[]}}