{"title":"Dr Melanie Fennell - Overcoming Low Self-Esteem (ebook, pdf)","uid":7184311,"size":1877692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49c32c1746b654bae517ce4434cb096e030c70c7&amp;dn=Dr+Melanie+Fennell+-+Overcoming+Low+Self-Esteem+%28ebook%2C+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":-1,"time":1334375772,"description":"Product Description\n\nAmazon.co.uk Review\n\nCognitive Behavioural Therapy treats emotional disorders by changing negative patterns of thought. It is now internationally established as a key method of helping overcome longstanding conditions such as panic attacks, depression, anxiety, gambling addictions and some eating disorders.\nThe first thing that is attractive about this book is the total lack of &quot;technicalese&quot;; this, coupled with its logical construction makes it not only interesting but also easily accessible to the lay reader.\n\nTo begin with, a guest author explains the history, meaning and relevance of cognitive therapy. This is followed by Melanie Fennell focusing on &quot;Low Self Esteem&quot; as an introduction to the main body of the book. The reader is then asked to participate in a self-assessment exercise. Having proven to have low self esteem, the reader is shown not only the impact self-esteem can have on their lives, but also many of the resultant issues--physical, emotional and social.\n\n&quot;Having cleared the ground&quot;, the author proceeds to explain the importance of and means to identifying triggers to bouts of low self-esteem. This can be as a long-established predilection or as the result of learned behaviour. Once this is achieved, Fennell goes on to advise ploys to overcome these triggers.\n\nThere follows a reinforcement to overcoming the triggers by the use of a Daily Action Diary (DAD), where the reader plans their daily routine. Once these &quot;tasks&quot; have been accomplished, they can be ticked off, proving not only self worth by achievement but also acting as a self-distracter.\n\nThe book concludes by offering suggestions for &quot;Putting Life Together&quot; and &quot;Planning for the Future&quot;. This is done by the use of simple graticules as an easy way of spotting self- critical thoughts and a &quot;Precaution Record Sheet&quot;\n\nThis is a very useful book that achieves its stated aims of explaining the nature of low self esteem and self- destructive thinking, providing a complete self-help programme and monitoring sheets and basing its advice on clinically proven techniques of cognitive therapy","torrent":{"xt":"urn:btih:49c32c1746b654bae517ce4434cb096e030c70c7","amp;dn":"Dr+Melanie+Fennell+-+Overcoming+Low+Self-Esteem+%28ebook%2C+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49c32c1746b654bae517ce4434cb096e030c70c7","infoHashBuffer":{"type":"Buffer","data":[73,195,44,23,70,182,84,186,229,23,206,68,52,203,9,110,3,12,112,199]},"announce":[],"urlList":[]}}