{"title":"Alkynes in Cycloadditions - Irina A. Maretina et al.","uid":16037713,"size":17512398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a597237d73386aaf5b1a4f9cf1a35cbd5f944b9&amp;dn=Alkynes+in+Cycloadditions+-+Irina+A.+Maretina+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"clouderone","files":1,"time":1476492310,"description":"Alkynes in Cycloadditions - Irina A. Maretina et al. (Wiley, 2014).pdf\r\n\r\nAcetylene systems present a new route to cyclic compounds as an alternative to more traditional methods employed in classical organic chemistry. The synthesis of cyclic structures based on acetylene systems has important applications in the formation of nanostructures, naturally occurring compounds and chemosensory materials for the design of nonlinear optics, electronic and photonic devices.\r\n\r\nAlkynes in Cycloadditions presents a modern review of regioselective synthesis of aromatic and non-aromatic carbocyclic and heterocyclic ring systems based primarily on [2+2+2] and [4+2] cycloadditions, and other reactions of acetylenic units including enediynes and enyne-allenes.\r\n\r\nTopics covered include:\r\n\r\nNew strategies for the formation of aromatic and polynuclear hydrocarbons based on (Z)-hex-3-en-1,5-diyne and (Z)-hepta-1,2,4-triene-6-yne blocks.\r\nOne-step synthesis of benzene derivatives, β-substituted naphthalenes and acenes by the cycloaromatization of enediynes and enyne-allenes by Bergman, Myers-Saito and Shmittel.\r\nMechanisms of cycloaromatization resulting in the formation of fulvene and indene systems.\r\nHeterocyclization involving enyne-carbodiimides.\r\nNew achievements in classical cycloaddition reactions such as the Diels-Alder condensation with acetylenic dienophiles and [2+2] cycloadditions with acetylene components\r\nAlkynes in Cycloadditions presents a comprehensive summary of the literature on methods for the synthesis of ring systems from acetylenes for academic researchers working in the fields of organic synthesis, physical organic chemistry, organometallic chemistry, catalysis, materials science, nanomaterials and biochemistry","torrent":{"xt":"urn:btih:4a597237d73386aaf5b1a4f9cf1a35cbd5f944b9","amp;dn":"Alkynes+in+Cycloadditions+-+Irina+A.+Maretina+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a597237d73386aaf5b1a4f9cf1a35cbd5f944b9","infoHashBuffer":{"type":"Buffer","data":[74,89,114,55,215,51,134,170,245,177,164,249,207,26,53,203,213,249,68,185]},"announce":[],"urlList":[]}}