{"title":"Delicatessen [ENG SUB] (1991) 720p BrRip x264 - CLOWNSEC (Phreak","uid":9493672,"size":2729368423,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:4a955d0a7569c0c8b611c5e53ac2b9ca15303b24&amp;dn=Delicatessen+%5BENG+SUB%5D+%281991%29+720p+BrRip+x264+-+CLOWNSEC+%28Phreak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"clownsec","files":-1,"time":1390052396,"description":"Delicatessen [ENG SUB] (1991) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\nA post-apocalyptic future becomes the setting for pitch black humor in this visually intricate French comedy. The action takes place within a single apartment complex, which is owned by the same man that operates the downstairs butcher shop. It's a particularly popular place to live, thanks to the butcher's uncanny ability to find excellent cuts of meat despite the horrible living conditions outside. The newest building superintendent, a former circus clown, thinks he has found an ideal living situation. All that changes, however, when he discovers the true source of the butcher's meat, and that he may be the next main course. This dark tale is played out in a brilliantly designed, glorious surreal alternate world reminiscent of the works of director Terry Gilliam, who co-presented the film's American release. Like Gilliam, co-directors Jean-Pierre Jeunet and Marc Caro hail from an animation background, and have a fondness for extravagant visuals, absurdist plot twists, and a sense of humor that combines sharp satire with broad slapstick and gross-out imagery. This mixture may displease the weak of stomach, but those attuned to the film's sensibility will be delighted by the obvious technical virtuosity and wicked sense of humor. \n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:4a955d0a7569c0c8b611c5e53ac2b9ca15303b24","amp;dn":"Delicatessen+%5BENG+SUB%5D+%281991%29+720p+BrRip+x264+-+CLOWNSEC+%28Phreak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a955d0a7569c0c8b611c5e53ac2b9ca15303b24","infoHashBuffer":{"type":"Buffer","data":[74,149,93,10,117,105,192,200,182,17,197,229,58,194,185,202,21,48,59,36]},"announce":[],"urlList":[]}}