{"title":"[XBOX 360] PayDay 2 [RegionFree] (ENG) COMPLEX","uid":8798093,"size":7838695467,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:4aa7c804eb61b42724c27ede8fc25aea5202f219&amp;dn=%5BXBOX+360%5D+PayDay+2+%5BRegionFree%5D+%28ENG%29+COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"DMeTaLx","files":2,"time":1376125351,"description":"General Information:\nâ™¦ Year Of Release : 2013\nâ™¦ Genre : Action (Shooter) / 3D / Online\nâ™¦ Developer : Overkill Software / Starbreeze Studios\nâ™¦ Publisher : 505 Games\nâ™¦ Region : Region Free\nâ™¦ Publication Type : License\nâ™¦ Firmware : LT +1.9 / LT +2.0 / LT +3.0 / LTU1 .2 ( 16202 )\nâ™¦ Language : English\nâ™¦ Type Of Translation : No\nâ™¦ Release Date : 13 August 2013\n\nDescription:\nPayDay 2 - co-op shooter game for four players, allowing everyone to get used again to the role of the heroes of the original PayDay - Dallas, Hoxton, Cheynsa and Wulff. The new network Crimenet offers a wide variety of cases - from the relatively simple attacks on shops and kidnapping children, robbing stores to banks. As you progress through missions, a team of four players sent to the more complex and profitable mission. At the same time there are more possibilities of customization and crafting, which allows the group to use unique equipment.\n\nFeatures:\nâ™¦ Rob banks with friends - Invite your friends to share plunder, but note that the successful completion of the work you will need a completely different skill set. \nâ™¦ Shooting and game mechanics to a whole new level - the fire of different guns and tie the hands of the hostages has never been so fun! \nâ™¦ Dynamic scenario - no robbery will not work the same way twice. Every job, assignment, each have their own script features random geometry and even rare events. \nâ™¦ Progress characters - Starting as an ordinary burglars shops and bazaar stalls, players will evolve, learning new skills, gaining access to new masks and a new outfit, gradually becoming legends of the underworld PAYDAY 2. \nâ™¦ Play the way you like it - every job can be done in different ways. Sneak, or burst forth with guns blazing. The decision is yours. \nâ™¦ New artificial intelligence - In PAYDAY 2 of the players will need much more coordinated and well thought-out game than before, because the new AI controlled enemies will skillfully seek shelter and change tactics depending on the player's actions. In addition to the release of hostages enemies will now be able to steal bags of booty!","torrent":{"xt":"urn:btih:4aa7c804eb61b42724c27ede8fc25aea5202f219","amp;dn":"%5BXBOX+360%5D+PayDay+2+%5BRegionFree%5D+%28ENG%29+COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa7c804eb61b42724c27ede8fc25aea5202f219","infoHashBuffer":{"type":"Buffer","data":[74,167,200,4,235,97,180,39,36,194,126,222,143,194,90,234,82,2,242,25]},"announce":[],"urlList":[]}}