{"title":"Caribbean Undercover (2000,xvid) - anal, Tera Patrick","uid":4749576,"size":734572544,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ae0b8435754247bbdc58fd0022dc9c0960340f2&amp;dn=Caribbean+Undercover+%282000%2Cxvid%29+-+anal%2C+Tera+Patrick&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":6,"uploader":"pure_screens","files":1,"time":1236106634,"description":"Caribbean Undercover (2000,DVDrip.xvid)\n\n\n\n\n\n\nscreens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://eurox.blogbugs.org/7570554/Caribbean-Undercover---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://eurox.blogbugs.org/7570554/Caribbean-Undercover---screens.html&lt;/a&gt;\n\n\n\n\n\n\n\nThieves are smuggling computer chips out of St. Maartens Island. What better reason for a cast of drop-dead gorgeous babes to drop their clothes for secret agent men and each other? Sweet Vanda loves to give head and open her rear for taboo anal entries - all atop a jeep! Judy, Caroline Cage and Shelly Elson get into a bi-sex pile-up with well-endowed Marc on a yacht. Olive-skinned beauty Tara Patrick (what curves!) breaks regulations with Mickey G. then does her first backdoor scene with Tony Crane! Pretty Sheila chooses a waterfall for her style of wet slippery butt love!&quot;\n\n\n\nActresses\n\n    * Caroline Cage                   [Anal Bald]\n    * Jessica Drake                   [Facial]\n    * Judith Kostner (as Judy)        [Anal]\n    * C.G. Summer (as Selly Elson)\n    * Sheila Rossi                    [Anal]\n    * Tera Patrick                    [Anal]\n    * Vanda Vitus                     [Anal]\n\n\n   \nScene Breakdowns\n\n    * Scene 1. Evan Stone, Vanda Vitus\n    * Scene 2. C.G. Summer, Judith Kostner, Mark Davis\n    * Scene 3. Mickey G., Tera Patrick\n    * Scene 4. Brick Majors, Caroline Cage\n    * Scene 5. Evan Stone, Judith Kostner\n    * Scene 6. Mark Davis, Sheila Rossi\n    * Scene 7. Evan Stone, Jessica Drake\n    * Scene 8. Anthony Crane, Tera Patrick\n\n\n\nStudio:    Adam &amp; EVe\nDirector:  Nicholas Steele\nReleased:  2000\nFormat:    AVI\nDuration:  01:53:46\n\n\n\n\nREVIEW:\n\n\nScene One: The first scene was between Vanda (called &quot;Nita&quot; in the documentary) and Evan in a jeep. They basically pulled off the road and had sex after they parked. This scene was the worst in terms of plants getting in the way. It also was shot in a slow motion kind of photography that drained the heat from the scene like it drained the blood from my crotch. I liked it for a little while but it got on my nerves after a few minutes. I suppose they were trying to shoot a couples movie and this is a standard element of those types of films but a little goes a long way and director Nicholas Steele is known for his numerous uses of such photography in almost all of his films.\n\nScene Two: The next scene was between Shelly, Caroline, Judy and Mark on a boat. Once again I saw the lighting problem introduced by having such a bright background and a relatively dark bunch of bodies. The women looked better than Vanda (who was attractive nonetheless) but they lacked her passion for sex. It was not a bad scene but certainly a waste of talent such a talented group of performers.\n\nScene Three: The scene that followed was with Tera and Mickey having a fairly warm scene for her. I can see why they put Tera on the cover of the box; she looks great, but it would've been nice if her scenes were longer and if she learned to let loose a little bit. Her fans will no doubt defend her lack of passion as part of her charm but a lame fuck is just that and no amount of ass kissing fans is going to change this fact.\n\nScene Four: The next scene was with Caroline and Brick on a rocky alcove while Evan and Shelly(?) screwed on the boat. The scene was edited to go back and forth between them and to be honest-I didn't like the approach. Both couples had their own merit and this style detracted from each but the scenery was fine and those who haven't watched much porn might enjoy the romp.\n\nScene Five: The next scene was with Sheila and Mark under a waterfall. By this time, you'll be ready to write a letter to Adam &amp; Eve telling them to kick Nicholas in the ass for the slow motion stuff. The couple looked good but was hampered by the technical side of things. If you enjoy the tamer side of sex this type of scene gives you, more power to you but Adam &amp; Eve has done a lot better with far less resources both before and after this movie was made.\n\nScene Six: Jessica and Evan (he sure got lots of screen time in this movie) were up next in and around the pool. While the lighting wasn't always the best, the scene was pretty good. The two should star in a sequel; shot by someone else of course. While I've long been a fan of hers, I wouldn't be untruthful to say that she was probably the most talented gal of the movie both in terms of her passionate sex as well as her ability to coax a load. Is it any wonder that these two were married (although have since broken up) given their work here?\n\nScene Seven: The last scene was between Tera and Anthony. This is the scene that everyone seems to love. We get to see Tera taking it anally. I'll admit that she's a hotty but a few of the others here were at least as good looking and all were better sexually. In any case, it was a good scene for her fans but others may want to keep a fresh pair of batteries handy; either for their remote control or their pocket rocket, depending on what they're looking to do.\n\n\nSummary: \nThis is another big budget porn movie where you wonder what went wrong. It had all the elements of what should succeed on a number of levels but fell far short of a good time in most cases. After giving it some consideration I decided that the problem was that they tried to make everyone happy. The old saying is: &quot;You can't please everyone and if you try, you'll please no one.&quot; You may now use this movie as a perfect example of the adage. It seems obvious that the movie was designed to be edited for and sold to cable. When a porn director or producer wants to make a movie with plot and acting, they need to pick the right cast. This cast was made up mostly of people that didn't speak English (you learn this during the documentary) and most of the ones who can have no acting ability. That doesn't mean they can't be great porn stars, most of them are already acknowledged as such, it just means that you shouldn't use them in roles with more depth. Maybe if the cast spent more time reading the script and less time goofing off in the pool (we see that in the documentary too), they could have acted better than they did. The technical matters got in the way as well. Maybe the crew was too busy having a big party during the shoot but some of the mistakes would be obvious to a first year film student. To be fair, most porn is shot with little regard for technical details but with a reported budget this large, I certainly expect more than what I saw onscreen. You'll be working out the old remote control hand as much as the &quot;other&quot; hand here. This is a case where the ambition of the producer/director was greater than their ability. I'm going to rate it as a Rent It but fans of Tera's will be needing to see what she was like before the hype took over and propelled her into the spotlight. \n\n\n\n\n\n\n.\n\n","torrent":{"xt":"urn:btih:4ae0b8435754247bbdc58fd0022dc9c0960340f2","amp;dn":"Caribbean+Undercover+%282000%2Cxvid%29+-+anal%2C+Tera+Patrick","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae0b8435754247bbdc58fd0022dc9c0960340f2","infoHashBuffer":{"type":"Buffer","data":[74,224,184,67,87,84,36,123,189,197,143,208,2,45,201,192,150,3,64,242]},"announce":[],"urlList":[]}}