{"title":"Make: Electronics - Learn by Discovery","uid":9058132,"size":17599677,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4af8e5e87eaf7d3e4a4c30b0259d293ea5468813&amp;dn=Make%3A+Electronics+-+Learn+by+Discovery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"cosmicvoy","files":1,"time":1381993844,"description":"Want to learn the fundamentals of electronics in a fun, hands-on way? With Make: Electronics, you'll start working on real projects as soon as you crack open the book. Explore all of the key components and essential principles through a series of fascinating experiments. You'll build the circuits first, then learn the theory behind them!\n\nBuild working devices, from simple to complex You'll start with the basics and then move on to more complicated projects. Go from switching circuits to integrated circuits, and from simple alarms to programmable microcontrollers. Step-by-step instructions and more than 500 full-color photographs and illustrations will help you use -- and understand -- electronics concepts and techniques.\n\n    Discover by breaking things: experiment with components and learn from failure\n    Set up a tricked-out project space: make a work area at home, equipped with the tools and parts you'll need\n    Learn about key electronic components and their functions within a circuit\n    Create an intrusion alarm, holiday lights, wearable electronic jewelry, audio processors, a reflex tester, and a combination lock\n    Build an autonomous robot cart that can sense its environment and avoid obstacles\n    Get clear, easy-to-understand explanations of what you're doing and why","torrent":{"xt":"urn:btih:4af8e5e87eaf7d3e4a4c30b0259d293ea5468813","amp;dn":"Make%3A+Electronics+-+Learn+by+Discovery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4af8e5e87eaf7d3e4a4c30b0259d293ea5468813","infoHashBuffer":{"type":"Buffer","data":[74,248,229,232,126,175,125,62,74,76,48,176,37,157,41,62,165,70,136,19]},"announce":[],"urlList":[]}}