{"title":"Brad P. - The Underground Dating Seminar","uid":3988291,"size":230738032,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b1924bfd64305884e8c7f72dbc43738b0110b81&amp;dn=Brad+P.+-+The+Underground+Dating+Seminar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"snipz1t","files":107,"time":1200926357,"description":"The Underground Dating Seminar\n\nWhile most guys flail around in the dark when it comes to women, there are a few guys who just &quot;get it.&quot; They know how to drive women crazy. They get everything they want out of women, and they get it on their own terms. Brad P. is one of those guys. \n\nToday, at the Underground Dating Seminar, he would unveil the secrets to attracting and dating beautiful women. Lessons he had learned from some of the greatest players around. Lessons he had learned from boiling down the most cutting edge evolutionary psychology modern science has to offer into a reliable, repeatable method. Lessons he had learned by going out 7 days a week approaching and seducing women all over the USA and Canada. \n\n&quot;Sit back and relax,&quot; Brad said. &quot;I have some pizza and beer coming up in a few minutes. Welcome to the Underground Dating Seminar. Some of you are here because you want a great girlfriend, others want one night stands, some of you want to have 3 or 4 uncommitted girlfriends. Over the next 6 sessions, I&amp;#039;m going to give you the tools to accomplish all of your goals with women, whatever they may be.&quot;\n\n_________________________________________\n\nNow you too can own the complete recordings of The Underground Dating Seminar. This classic seminar gives you all the info you could ever need to be successful with women. \n\nBrad P. walks you through a COMPLETE methodology including: \n\nSession 1 Approaching Women\nSession 2 Approach and Follow Up\nSession 3 Meeting Up\nSession 4 Getting Physical\nSession 5 Single Night Seductions\nSession 6 Healthy Relationships, Healthy Lifestyles\n\nDon&amp;#039;t miss this chance to own the COMPLETE SYSTEM. It will change your life forever.\n\n_________________________________________\n\nTorrent also includes:\n\nClub Game - Brad P.&amp;#039;s new club game/social circle system is finally here..\n\nBuzzy Interview - Interviews with Naturals: Buzzy. This guy has had over 30 threesomes. It&amp;#039;s his specialty. Learn about threesomes and more...\n\nPheromone Kid Interview - The Pheremone Kid is a seduction genius who get&amp;#039;s women naked in 10 minutes or less. Listen in on 2 laid back interviews where he divulges seduction secrets the world has never known before!\n\nPlanning the Perfect Date - Get the newest cutting edge techniques on how to plan dates that SCORE every time.\n\nBrad&amp;#039;s Fashion Bible\n\n_________________________________________\n\nWARNING TO ALL BITTORRENT USERS: \n\nDo not download torrents containing DAA or UIF. These file(s) contains viruses that will be activated when opened with PowerISO or MagicISO.\n\nThese torrents are duplicates of existing torrents, re-packaged to contain a virus. If you want the clean torrent version, do another search for the title of the torrent. An existing clean one will ALWAYS be found.\n\nTorrent sites are being SPAMMED continously with torrents using these formats to spread their shit. LET&amp;#039;S STOP THIS NONSENSE.\n\n** Do not use POWERISO or MAGICISO. SPREAD THE WORD. BEWARE. **","torrent":{"xt":"urn:btih:4b1924bfd64305884e8c7f72dbc43738b0110b81","amp;dn":"Brad+P.+-+The+Underground+Dating+Seminar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b1924bfd64305884e8c7f72dbc43738b0110b81","infoHashBuffer":{"type":"Buffer","data":[75,25,36,191,214,67,5,136,78,140,127,114,219,196,55,56,176,17,11,129]},"announce":[],"urlList":[]}}