{"title":"Faces - 'Ooh La La' [320k MP3]","uid":4724107,"size":73218760,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4b2071011ad7683b261d9ed23656aa3c070efec3&amp;dn=Faces+-+%5C%27Ooh+La+La%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"smbdownload","files":-1,"time":1234654103,"description":"Ooh La La is the final studio album by the rock and roll band Faces, released in April 1973.\n\n\nWith his career in the stratosphere due to successes from his solo albums, Rod Stewart became increasingly distanced from his band mates, who were by the time of the album's recording little more than his backing group in concerts. As a result, according to Ian McLagan, Ooh La La was &quot;Ronnie (Lane)'s album&quot;, Stewart distracted enough to have missed the first fortnight's worth of sessions. The album's recording would be plagued by Stewart's absence. Nonetheless, producer Glyn Johns held the group together, helping to placate tensions as he had with the Beatles during their Get Back sessions and helping the group to record a strong album in the style of its predecessor as opposed to the group's first two releases, which were self-produced and rather lengthy.\n\nShortly after the album's release, Stewart reported to New Musical Express that he felt that Ooh La La was a &quot;stinking rotten album&quot;, later making things worse by telling Rolling Stone that what he had actually said was that the group was capable of &quot;doing a better album than we've done&quot;. The rest of the group was understandably hurt by the comments. Ronnie Lane, especially hurt and not looking forward to being even more increasingly relegated to the sidelines, quit in June and was replaced shortly thereafter by former Free bassist Tetsu Yamauchi. The group recorded three subsequent singles, but never again recorded an album, disbanding in late 1975.\n\nThe cover is a photo of &quot;Gastone&quot;, a stage character of Ettore Petrolini, an Italian comedian of the 1920s. The original LP cover was designed in such a way that when pressed down the eyes would move and jaw dropped.\n\nTrack Listing: [320k MP3]\n\n01 &quot;Silicone Grown&quot; (Stewart/Wood) - 3:05 \n02 &quot;Cindy Incidentally&quot; (McLagan/Stewart/Wood) - 2:37 \n03 &quot;Flags and Banners&quot; (Lane/Stewart) - 2:00 \n04 &quot;My Fault&quot; (McLagan/Stewart/Wood) - 3:05 \n05 &quot;Borstal Boys&quot; (McLagan/Stewart/Wood) - 2:52 \n06 &quot;Fly in the Ointment&quot; (Jones/Lane/McLagan/Wood) - 3:49 \n07 &quot;If I'm on the Late Side&quot; (Lane/Stewart) - 2:36 \n08 &quot;Glad and Sorry&quot; (Lane) - 3:04 \n09 &quot;Just Another Honky&quot; (Lane) - 3:32 \n10 &quot;Ooh La La&quot; (Lane/Wood) - 3:30 \n\n----------------------------------------------------------------------------------\n\nThe Tracks\nThere was one composition by the band save for Stewart, the instrumental &quot;Fly In The Ointment&quot;. The only composition by the four to make it onto any of their albums, it is a mid-tempo riff-laden groove, featuring the forceful bass of Lane, chunky rhythm and slide guitar work of Wood, soulful organ and driving electric piano of McLagan, ably supported by the steady drumwork of Jones and guest percussionist Neemoi &quot;Speedy&quot; Aquaye.\n\nStewart's four tracks were written mostly in tandem with Wood and McLagan. Characteristically, three (&quot;Silicone Grown&quot;, &quot;My Fault&quot;, &quot;Borstal Boys&quot;) are up-tempo numbers that serve to showcase the liquored-up looseness that the group ably provided Stewart, a looseness he never again would be able to replicate after the group's disbanding and his subsequent move to America in 1975. &quot;Cindy Incidentally&quot;, driven by the prevalent piano of McLagan and the rhythm guitar of Wood, also showcases the looseness, though the vocal performance is more akin to one Stewart would usually reserve for his solo albums. They take up the bulk of the first side of the record, separated by one Lane composition which Stewart had helped to complete.\n\nLane's five tracks (four on the second side, one on the first) showcased the tender, folky side of the singer-songwriter, the tracks rooted in acoustics with Lane and Stewart singing some of the most endearing vocals that they ever would. The title track, a Lane composition, was unique in the Faces' repertoire. Instead of featuring Stewart or Lane on vocals, it featured the first-ever vocal from guitarist Ronnie Wood. Though Lane had written the bulk of the ode to carefree living and its inevitable payback, he had written it for Stewart to sing, as it had been written for a singer out of his range. Stewart, meanwhile, claimed that the song was in the wrong key for him. Wood's somewhat uneasy tenor, which the group jested him about during the song's playback , closed the album. Ironically, Stewart would cover the song on his 1998 album When We Were the New Boys.\n\nPersonnel:\n\nGlyn Johns - producer, engineer \nRod Stewart - lead vocals, rhythm guitar \nRonnie Wood - lead, slide and rhythm guitar, bass, vocals \nIan McLagan - piano, organ, harmonium \nRonnie Lane - bass, rhythm guitar, tambourine, vocals \nKenney Jones - drums \nNeemoi &quot;Speedy&quot; Aquaye - congas, shakers (track 6) \n\n\n\n\n\n","torrent":{"xt":"urn:btih:4b2071011ad7683b261d9ed23656aa3c070efec3","amp;dn":"Faces+-+%5C%27Ooh+La+La%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b2071011ad7683b261d9ed23656aa3c070efec3","infoHashBuffer":{"type":"Buffer","data":[75,32,113,1,26,215,104,59,38,29,158,210,54,86,170,60,7,14,254,195]},"announce":[],"urlList":[]}}