{"title":"Satellite Basics For Everyone - Epub - Yeal","uid":9385366,"size":3856851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b53dcb63e019e8032cf0abb1e90c77809baa35c&amp;dn=Satellite+Basics+For+Everyone+-+Epub+-+Yeal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"KhushSidhu","files":1,"time":1387795316,"description":"\n\nSatellite Basics For Everyone: An Illustrated Guide to Satellites for Non-Technical and Technical People\n\nBy C. Robert Welti\n\n148 pages - Publisher: iUniverse\nYear - 2012 - Language: English\nISBN-10: 147592593X - ISBN-13: 978-1475925937\n\n\n\nLearn about satellites that affect us every day, how they work, and how we can place and keep them on orbit.\n\nSatellite Basics for Everyone presents an introduction and overview to satellites. It's written as clearly and understandably as possible for a wide audience. It provides a learning tool for grade school students. High school and college students can use it for helping them decide on career fields. It's for people with curious minds who want to know about satellites that affect their daily lives. And, it provides a training tool and an overview for people who build, operate, and use data collected by satellites.\n\nSatellite Basics for Everyone describes satellite missions, orbits, population, closeness, debris, collision risk, builders, owners, operators, launch vehicles, and costs. Focus then turns to describing the orbit, components, environment, and operation of the geostationary communications satellite because it affects our daily lives the most by providing television, radio, commercial business, Internet and telephone services. A description of satellite motion prepares for the included Mission Planning Example of how to place and keep this satellite on orbit and keep the antennas pointing in the right direction to perform its mission.\n\nThe main objective of this book is to stimulate a broad interest in engineering and science.\n","torrent":{"xt":"urn:btih:4b53dcb63e019e8032cf0abb1e90c77809baa35c","amp;dn":"Satellite+Basics+For+Everyone+-+Epub+-+Yeal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b53dcb63e019e8032cf0abb1e90c77809baa35c","infoHashBuffer":{"type":"Buffer","data":[75,83,220,182,62,1,158,128,50,207,10,187,30,144,199,120,9,186,163,92]},"announce":[],"urlList":[]}}