{"title":"utorrent 2.2.1 Build 25302    2011  (best for file sharing)","uid":11836281,"size":399736,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4bbadb011163dabd4f42aca857f095502f6464ff&amp;dn=utorrent+2.2.1+Build+25302++++2011++%28best+for+file+sharing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"analogkid6103","files":1,"time":1429750284,"description":"What can I say Im a music uploader, and I have had to answer some different questions from the peeps.\n \nWell a few of the most common ones are: What torrent client is best?\nAnd which one do you use? \n\nWell this is the answer to both of those questions. Utorrant 2.2.1\n\nAnd its the same answer that you will get from most of your serious uploaders and heavy seeders.\nIt dont crash often and it can handle a massive amount of torrent activity.\n\nBoth uploading and dcwnloading.\n\nI have run it at its limit just so I could know how far I could take it.\n\nIt can handle a prolonged load without problems anywhere from 700-1000 active torrents.\nI don't recommend a brand new user to try that in there first week or even month. \nAnd most will never go past 20-50.\nIts not a media center If you waant a MC get one. This is a torrent client,yet It will allow you to  play the finished torrents.\nAnyway I have posted this get it if you want. Just ask anyone that knows and this or one of the other builds from the 2,2 series are the answer and  No this one did not and does not have the advertising that came in the 3.models and up.\n\nEnough get it already,  and one more piece of advice: bitcomet is not the one Avoid it.\n Stick to lil utorrant 2.2.1\nand you will avoid the problems that are endlessly irritating those who dont.\n\nenjoy and seed if ya want. WAIT! just one last thing that ad that says upgrade your torrant client. Thats incorrect This is the answer. So it should say trouble torrenting? downgrade that piece of bloatware and go with 2.2.1\n\nanalogkid6103","torrent":{"xt":"urn:btih:4bbadb011163dabd4f42aca857f095502f6464ff","amp;dn":"utorrent+2.2.1+Build+25302++++2011++%28best+for+file+sharing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bbadb011163dabd4f42aca857f095502f6464ff","infoHashBuffer":{"type":"Buffer","data":[75,186,219,1,17,99,218,189,79,66,172,168,87,240,149,80,47,100,100,255]},"announce":[],"urlList":[]}}