{"title":"In the President's Secret Service - Ronald Kessler - Audiobook","uid":10817882,"size":255126075,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4be1af7753551e253ae75db03fbf708090b280bb&amp;dn=In+the+President%27s+Secret+Service+-+Ronald+Kessler+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1408484154,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nIn the President's Secret Service: Behind the Scenes with Agents in the Line of Fire and the Presidents They Protect\n\nWritten by: Ronald Kessler\nNarrated by: Alan Sklar\nLength: 8 hrs and 50 mins\nFormat: Unabridged\nRelease Date:08-18-09\n\nSecret Service agents, acting as human surveillance cameras, observe everything that goes on behind the scenes in the president's inner circle. Ronald Kessler reveals what they have seen, providing startling, previously untold stories about the presidents, from John F. Kennedy and Lyndon Johnson to George W. Bush and Barack Obama, as well as about their families, Cabinet officers, and White House aides.\n\nKessler portrays the dangers that agents face and how they carry out their missions---from how they are trained to how they spot and assess potential threats. With fly-on-the-wall perspective, he captures the drama and tension that characterize agents' lives. In this headline-grabbing book, Kessler discloses assassination attempts that have never before been revealed. He shares inside accounts of past assaults that have put the Secret Service to the test, including a heroic gun battle that took down the would-be assassins of Harry S. Truman, the devastating day that John F. Kennedy was killed in Dallas, and the swift actions that saved Ronald Reagan after he was shot. While Secret Service agents are brave and dedicated, Kessler exposes how Secret Service management in recent years has betrayed its mission by cutting corners, risking the assassination of President Barack Obama, Vice President Joe Biden, and their families. Given the lax standards, &quot;It's a miracle we have not had a successful assassination,&quot; a current agent says. ,p&gt;Since an assassination jeopardizes democracy itself, few agencies are as important as the Secret Service---and few subjects are as tantalizing as the inner sanctum of the White House. Only tight-lipped Secret Service agents know the real story, and Kessler is the only journalist to have won their trust. ","torrent":{"xt":"urn:btih:4be1af7753551e253ae75db03fbf708090b280bb","amp;dn":"In+the+President%27s+Secret+Service+-+Ronald+Kessler+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be1af7753551e253ae75db03fbf708090b280bb","infoHashBuffer":{"type":"Buffer","data":[75,225,175,119,83,85,30,37,58,231,93,176,63,191,112,128,144,178,128,187]},"announce":[],"urlList":[]}}