{"title":"Our.Daily.Bread-Unser.Taglich.Brot.2005.PAL-DVDR","uid":4398584,"size":4108735301,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:4c0f1611fd6ccd87afd43cebb3bb183b7adf0057&amp;dn=Our.Daily.Bread-Unser.Taglich.Brot.2005.PAL-DVDR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"BhangWalla","files":-1,"time":1221563044,"description":"Our Daily Bread-Unser TÃƒÂ¤glich Brot-2005-PAL-DVDR\n\n\n\n IMDb.............: http://www.imdb.com/title/tt0765849/\n Year.............: 2005\n Country..........: Germany | Austria\n Runtime..........: 92 Minutes\n Audio............: Yes, but NO narrative - None needed (Dolby Digital 2.0)\n Subtitles........: None Necessary and None Provided \n Video Format.....: PAL\n Aspect Ratio.....: 16:9\n Duration.........: 01h31m58s\n\n\nMenus............: [x] Untouched\nVideo............: [x] Untouched\nDVD-extras.......: [x] Untouched\nDVD-Audio........: [x] Untouched\n\n\nWelcome to the world of industrial food production and high-tech farming! To the rhythm of conveyor belts and immense machines, the film looks without commenting into the places where food is produced in Europe: monumental spaces, surreal landscapes and bizarre sounds - a cool, industrial environment which leaves little space for individualism. People, animals, crops and machines play a supporting role in the logistic of this system which provides our society's standard of living. OUR DAILY BREAD is a wide-screen tableau of a feast which isn't always easy to digest - and in which we all take part. A pure, meticulous and high-end film experience that enables the audience to form their own ideas\n\nThe film depicts the mechanical monotony of industrialized food production, where the difference between a cow and an apple is a matter of equipment, and where humans are employed only when there isn't yet a machine efficient enough to replace them. Each section of the 92-minute film is composed with attention to the scale and symmetry of these food factories, making it as much an art film as a political statement.\n\nIn Mr. Geyrhalter's long, static shots, chicks shoot from a tube into baskets on a conveyor belt in an endless peeping blur. Pigs are processed in a ghoulish mechanical ballet.  Vine ripened vegetables grow in neat rows inside a vast greenhouse complex, planted in plastic-wrapped pallets of nutrient-soaked matter and suspended by strings from a network of cables. Salmon sucked from a fjord are sawed open, eviscerated and vacuumed clean in seconds.\n\nOur Daily Bread is a documentary that could probably find a place in a course on science fiction films, said Richard PeÃƒÆ’Ã‚Â±a, the chairman of the selection committee of the New York Film Festival, where the movie was shown to acclaim this fall. Geyrhalter presents a world that looks like ours but seems one step removed from it. Of course the conceit is that indeed what hes showing us is our world, whether we know it or not. And whether we like it or not.\n\nAt 34, Mr. Geyrhalter has directed six documentaries on such subjects as the first year of peace in Bosnia and life in the restricted zone near Chernobyl. He made Our Daily Bread in Europe. Getting permission to film wasn't always easy, but he said that when he wasn't allowed to enter a poultry plant in, say, Germany, he would simply find another, nearly identical, place in Spain or Poland.\n\nDuring editing, Mr. Geyrhalter removed all the interviews. Even the workers who are seen eating alone on lunch breaks effectively marking the end of the conveyor belt do not speak.\n\nI had the feeling that as soon as somebody starts talking, even if it's interviews, the audience expects explanations and somebody to be blamed, the director said last month from a hilltop near his weekend home in the Austrian countryside, where he had driven to find a cellphone signal.\n\nAnd since food has to do with everybody, I just didn't want to give the audience any chance to escape because they all have the responsibility for what they buy.\n\nSince completing the film, Mr. Geyrhalter said, he eats less meat and buys organic food when he can. While he said that the recent spate of books and films that take on agribusiness could have some impact on certain consumers, he is not optimistic about more sweeping changes.\n\nYou will never reach the majority, he said. Whatever we see in the movie is just part of our reality, and it will always stay part of our reality.\n\nMore related material:  &lt;a href=&quot;\nhttp://thepiratebay.se/user/BhangWalla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/BhangWalla&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4c0f1611fd6ccd87afd43cebb3bb183b7adf0057","amp;dn":"Our.Daily.Bread-Unser.Taglich.Brot.2005.PAL-DVDR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c0f1611fd6ccd87afd43cebb3bb183b7adf0057","infoHashBuffer":{"type":"Buffer","data":[76,15,22,17,253,108,205,135,175,212,60,235,179,187,24,59,122,223,0,87]},"announce":[],"urlList":[]}}