{"title":"GAIAM'S TOTAL BODY CARDIO - WORKOUT DVD","uid":11282477,"size":4473355153,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4c5e880830efd418ac517b3b4a91837ee0d0d805&amp;dn=GAIAM%27S+TOTAL+BODY+CARDIO+-+WORKOUT+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"stirgy1","files":-1,"time":1414236310,"description":"...\n\nGAIAM'S TOTAL BODY CARDIO - WORKOUT DVD\n\nSlim. Sculpt. Stretch - in 10, 30 and 50 minute intense cardio sequences.\nwith Tanja Djelevic.\n\nProduct Details:\nActors: Tanja Djelevic (and friends)\nDirectors: Dave Simmons\nFormat: Color, NTSC\nLanguage: English\nRegion: Region 1 (U.S. and Canada only.)\nAspect Ratio: 1.33:1\nNumber of discs: 1\nRated: NR (Not Rated)\nStudio: Gaiam\nDVD Release Date: September 25, 2007\nUPC: 018713523563\nISBN: 978076620729\nRun Time: 95 minutes\nIncludes: Special Features and Interviews\n\nAmazon Product Reviews:\nBy Caliaha:\n&quot;I love this workout and can't wait to try the other DVDs in this series. It is a carto-strength training-yoga-pilates fusion, but no sun-salutes here, yeah! The instructor (Tanja Djelevic ) is not too chatty, but motivates to get you going. The music really is not disco, it is modern, upbeat, and wonderful. The setting is beautiful in the mountains of Utah. You get 50, 30, and 10 min workouts. In the 50, she'll start you with a fun warm-up; move on to challenging cardio, then weighted movements (with or without weights), pilates abs, and yoga/stretch cool down. The moves are easy to learn and perfectly paced. I'm not much of a pilates fan, but her moves were fun and just my speed. I have been looking for a challenging workout like this and I was in a sweat as time flew by. Tanja makes it so fun. If you want good results, definitely get this DVD. I have also tried her new balance ball DVD and you can read my review...it's great too! I can't wait to try the other DVD's in this new series from Gaiam and will post reviews soon...&quot;\n\nBy Turbo6x2:\n&quot;I normally don't like Yoga based workouts, they're just not my thing. I prefer kick boxing and lots of sweating and kicks. However this workout I found to be a great combination and lead by one very long and lean instructor. I chose this workout due to the reviews posted here on Amazon and have been very pleased with this purchase. Everything everyone has written if very true. I find I get a great cardio workout from this and have an overall great feeling of strength when complete. I found the moves to be doable and enjoyable. I think the setting is very scenic and a nice change of pace from the hum drum studio set you normally get. I can only wish I looked like Tanja and had those amazing long limbs. The workout leaves me refreshed and energized and feeling more flexible then I have in a long time from a workout...&quot;\n\nBy R. Holt:\n&quot;I don't normally write reviews but this is one purchase I'm super pleased with. When I get a new workout video I like to watch it first so there's no surprises my first time through. Just watching it I thought, &quot;There's no way someone as uncoordinated as me could follow that!&quot; Well surprise, I managed to make it through the whole workout first try and when I did miss a step or two it was very easy to pick back up. Tanja's queuing is spot on and she makes the workout fun. She is genuinely happy without a trace of that fake perkiness that turns me off so many instructors. I also felt like the workout was really solid. The fusion of cardio, weight traning (if you want it), and yoga is just my style. If you're wondering whether you should get this I say go for it; you won't be disappointed.&quot;\n\n\nTO PLAY DVD:\nJust mount the video folder with Power ISO, MagicISO or equivalant program and burn to DVD using any number of DVD burning software, like DVDdecrypter, Nero, DVDfab, etc... OR just open the video file folder with VLC (or equivilant program) and watch on your computer!\n\nPlease seed this torrent enjoy and get healthy!","torrent":{"xt":"urn:btih:4c5e880830efd418ac517b3b4a91837ee0d0d805","amp;dn":"GAIAM%27S+TOTAL+BODY+CARDIO+-+WORKOUT+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5e880830efd418ac517b3b4a91837ee0d0d805","infoHashBuffer":{"type":"Buffer","data":[76,94,136,8,48,239,212,24,172,81,123,59,74,145,131,126,224,208,216,5]},"announce":[],"urlList":[]}}