{"title":"Slate Digital Virtual Tape","uid":13895708,"size":107735726,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c79958aab031a2781c4d5fa9fc477dda6014a98&amp;dn=Slate+Digital+Virtual+Tape&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"querque","files":5,"time":1458245337,"description":"Visão geral\r\n\r\ngravação digital é agora o padrão para produção musical profissional. Mas muitos engenheiros e músicos muito tempo para os dias de gravação analógica, e por boas razões.\r\n\r\nAnalógicas máquinas de fita têm um som.\r\n\r\nGrande, gordo, quente, profunda, rica e emocionante são apenas alguns dos termos usados ​​para descrever o que a gravação em um pedaço de fita magnética parece. Acima de tudo, a fita é mais musical.\r\n\r\nPara capturar o som da fita é capturar a vida, o som que reage de forma dinâmica para a música ir para ele respirar. Slate Chief Digital Technology Officer Fabrice Gabriel utilizou sua graduação em engenharia elétrica como base para seu estudo abrangente dos processos físicos que ocorrem durante a gravação em fita analógica através de uma máquina de fita. O que começou com a ciência levou à descoberta das propriedades quase mágicas de fita de Fabrice e inspirou a criar seus mais avançados, algoritmos dinâmicos ainda. Duas máquinas padrão da indústria foram precisamente modelada. O que se seguiu foi um ano de escuta crítica e algoritmo de ajustes, com alguma ajuda dos ouvidos peritos do Slate CEO Digital, Steven Slate.\r\n\r\nO resultado é o Virtual Machines fita plugin. Com modelos de ambos uma faixa de 2 polegadas 16 de NRG Recording, e uma máquina de rasto ½ polegada 2 de Howie Weinberg Mastering, o VTM dará suas misturas uma vibração analógica absolutamente autêntico, que terá suas mixagens para o próximo nível. Com dimensão adicional, gordura, profundidade e calor, você vai saber como você nunca misturados sem ele!\r\nDetalhes do produto\r\n\r\n    Dois tipos de máquinas de fita:\r\n        2 &quot;track 16\r\n        1/2 &quot;plataforma de masterização \r\n    Duas formulações em fita\r\n    Duas velocidades: 15 ips e 30 ips\r\n    controle de redução de ruído e auto mute\r\n    controle e vibração\r\n    controle do alinhamento de graves\r\n    configurações Normal, baixa e alta em Bias\r\n    Calibração nível\r\n    VU balística\r\n    agrupamento de controle\r\n    Configurações global ou por canal\r\n    rolos de fita iniciar e parar em sincronia com o transporte DAW","torrent":{"xt":"urn:btih:4c79958aab031a2781c4d5fa9fc477dda6014a98","amp;dn":"Slate+Digital+Virtual+Tape","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c79958aab031a2781c4d5fa9fc477dda6014a98","infoHashBuffer":{"type":"Buffer","data":[76,121,149,138,171,3,26,39,129,196,213,250,159,196,119,221,166,1,74,152]},"announce":[],"urlList":[]}}