{"title":"Letlive - The Blackest Beautiful (2013) [FLAC]","uid":8659690,"size":339465481,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4cb7f0cd67f968edd1c2e33f718fd2b7e90382ef&amp;dn=Letlive+-+The+Blackest+Beautiful+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"politux","files":-1,"time":1373295752,"description":"\n  Letlive - The Blackest Beautiful (2013) [FLAC]\n \n  Genre: Pop/Rock\n  Style: Post Hardcore\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Banshee (Ghost Fame)\n  02 Empty Elvis\n  03 White America's Beautiful Black Market\n  04 Dreamers Disease\n  05 That Fear Fever\n  06 Virgin Dirt\n  07 Younger\n  08 The Dope Beat\n  09 The Priest and Used Cars\n  10 Pheromone Cvlt\n  11 27 Club\n\n  L.A.-based hardcore unit Letlive broke through in a big way with their 2010 album Fake History, finally capturing some of the bone-breaking energy of their live show in a way that translated to album as well as developing their arrangement skills with atypical song structures and inventive expansion of the sometimes formulaic post-hardcore sound. Follow-up fourth album The Blackest Beautiful takes the strengths of Fake History even further, offering up 11 tracks of technically dazzling and soulfully delivered aggression. Frontman Jason Butler's vocal twists fuel the fire throughout The Blackest Beautiful, jumping acrobatically from screaming rage to tight, sophisticated harmonies to frenzied funky riffing to emotively melodic parts, often all within the same song. Beginning with opening track &quot;Banshee (Ghost Fame),&quot; Butler's lyrics are as inventive and thoughtful as the group's song structures, tackling the complex topic of chasing fame and losing integrity through a series of chants, screams, offhandish laughter, and smooth, soulful lines. \n\n  The pace never really lets up from there, with Butler attacking topics like corporate greed, racism, and the heavy weight of growing up in a broken home. Musically, Letlive are equally restless, moving through heavy, pummeling riffs reminiscent of Refused or Glassjaw, while breaking into a groove on almost every track, sometimes even melting down into acoustic sections without ever losing intensity. Standout tracks are plentiful, but absolute must-hears include the Soundgarden-meets-Deftones frenzy of &quot;The Dope Beat,&quot; the relentless high-speed blasting of &quot;The Priest and Used Cars,&quot; and a brilliantly arranged critique of corporatized health care and government corruption on &quot;White America's Beautiful Black Market.&quot; The Blackest Beautiful is not just more ambitious, interesting, thoughtful, and boundary-pushing than any of Letlive's previous work, the album is engaging and surprisingly hooky for any record falling under the hardcore umbrella. Fans will be overjoyed and those unfamiliar with Letlive or even modern hardcore circa 2013 should begin with this compelling document of anger, loss, and struggle.","torrent":{"xt":"urn:btih:4cb7f0cd67f968edd1c2e33f718fd2b7e90382ef","amp;dn":"Letlive+-+The+Blackest+Beautiful+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb7f0cd67f968edd1c2e33f718fd2b7e90382ef","infoHashBuffer":{"type":"Buffer","data":[76,183,240,205,103,249,104,237,209,194,227,63,113,143,210,183,233,3,130,239]},"announce":[],"urlList":[]}}