{"title":"Games Of Thrones Season 2","uid":9344201,"size":4058698403,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d4845a7ec33fea9e4afa6718c5dd3247f5a08ec&amp;dn=Games+Of+Thrones+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"rukin2","files":-1,"time":1386997705,"description":"Thanks for choosing my torrent!! ENJOY!!\n\nGames Of Thrones S02E01-The North remember\nTyrion arrives at Kings Landing to take his father's place as Hand of the King. Stannis Baratheon plans to take the Iron Throne for his own. Robb tries to decide his next move in the war. The Night's Watch arrive at the house of Craster.\nAired April 1st, 2013\n\nGames Of Thrones S02E02-The Night Lands\nArya makes friends with Gendry. Tyrion tries to take control of the small council. Theon arrives at his home, Pyke, in order to persuade his father into helping Robb with the war. Jon tries to investigate Craster's secret.\nAired April 8th, 2012\n\nGames Of Thrones S02E03-What Is Dead May Never Die\nTyrion tries to see who he can trust in the small council. Catelyn visits Renly to try and persuade him to join Robb in the war. Theon must decide if his loyalties lie with his own family or with Robb.\nAired April 15th, 2012\n\nGames Of Thrones S02E04-garden of Bones\nLord Baelish arrives at Renly's camp just before he faces off against Stannis. Daenerys and her company are welcomed into the city of Qarth. Arya, Gendry, and Hot Pie find themselves imprisoned at Harrenhal.\nAired April 22nd, 2012\n\nGames Of Thrones S02E05-The Ghost of Harrenhal\nRenly is dead, and his army has merged with Stannis. Tyrion investigates a secret weapon that King Joffery plans to use against Stannis. Meanwhile, as a token for saving his life, Jaqen H'ghar offers to kill three people that Arya chooses.\nAired April 29th, 2012\n\nGames Of Thrones S02E06-The Old Gods and the New\nTheon seizes control of Winterfell. Jon captures a wildling, named Ygritte. The people of King's Landing begin to turn against King Joffery. Daenerys looks to buy ships to sail for the Seven Kingdoms.\nAired May 6th, 2012\n\nGames Of Thrones S02E07-A Man Without Honor\nBran and Rickon have escaped Winterfell. Theon tries to hunt them down. Daenerys' dragons have been stolen. Jon travels through the wilderness with Ygritte as his prisoner. Sansa has bled and is now ready to have Joffery's children.\nAired May 13th, 2012\n\nGames Of Thrones S02E08-The Price of Winterfell\nStannis is just days from King's Landing. Tyrion prepares for his arrival. Jon and Qhorin are taken prisoner by the wildlings. Catelyn is arrested for releasing Jamie. Arya, Gendry, and Hot Pie plan to escape from Harrenhal.\nAired May 20th, 2012\n\nGames Of Thrones S02E09-BlackWater\nStannis has arrived at King's Landing. The battle has come!\nAired May 27th, 2012\n\nGames Of Thrones S02E10-Valar Morghulis\nJoffrey names Tywin the new Hand of the King. Robb marries Talisa Maegyr. Jon prepares to meet Mance Rayder. Arya says farewell to Jaqen H'ghar. Daenerys tries to rescue her dragons.\nAired June 3rd, 2012\n\nAbout:\nSeven noble families fight for control of the mythical land of Westeros","torrent":{"xt":"urn:btih:4d4845a7ec33fea9e4afa6718c5dd3247f5a08ec","amp;dn":"Games+Of+Thrones+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d4845a7ec33fea9e4afa6718c5dd3247f5a08ec","infoHashBuffer":{"type":"Buffer","data":[77,72,69,167,236,51,254,169,228,175,166,113,140,93,211,36,127,90,8,236]},"announce":[],"urlList":[]}}