{"title":"Paul Mckenna - I Can Make You Rich","uid":4385181,"size":33452739,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4da99c9b4b83d73d842452037c5e2af02cd94ad3&amp;dn=Paul+Mckenna+-+I+Can+Make+You+Rich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"prince213","files":4,"time":1220881987,"description":"Product details\n\n    * Type: Audio Book (PDF also included)\n    * Format: WMA @ 128 Kbps\n    * Author: Paul Mckenna\n\nProduct Description\n\nAre you ready to become rich? If you've ever wondered why it is that some people find it easy to make money while others struggle, it's not because they are more intelligent, work harder or have better - luck - it's simply because they think and act differently. Do you want to make more money? Do you want to improve the quality of your life? Do you believe you can be rich? What if it was easier than you think? Over the past decade, Paul McKenna PhD has made a unique study of the mindset of people rich not only in money but also in happiness and quality of life. In this groundbreaking new book, he makes use of proven psychological techniques to help you install that same rich mind-set inside yourself. Soon, you will be seeing the world in an entirely new way, thinking and living richer than ever before! In assembling this system he has had personal access to a number of the wealthiest people in the world including: Sir David Barclay, Sir Richard Branson, Stelios Haji-Ioannou, Sir Philip Green, Peter Jones, Sol Kerzner and Dame Anita Roddick. What he's learned is that making money is just a skill - but becoming rich is an art. This book will help you to develop that skill while mastering the art of living with more freedom and greater passion than ever before. If you're ready to experience the same levels of creativity, confidence and business genius as the super achievers, the system in this book can make you truly rich!\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:4da99c9b4b83d73d842452037c5e2af02cd94ad3","amp;dn":"Paul+Mckenna+-+I+Can+Make+You+Rich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4da99c9b4b83d73d842452037c5e2af02cd94ad3","infoHashBuffer":{"type":"Buffer","data":[77,169,156,155,75,131,215,61,132,36,82,3,124,94,42,240,44,217,74,211]},"announce":[],"urlList":[]}}