{"title":"Hero Siege v1.4.0.5","uid":12012298,"size":134818442,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4dacb19526cb1ae2b273c50f0beba0cd26765a29&amp;dn=Hero+Siege+v1.4.0.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"dauphong","files":1,"time":1434230862,"description":"About This Game\n\nHero Siege is a Hack 'n' Slash game with roguelike- &amp; RPG elements. Annihilate hordes of enemies, grow your talent tree, grind better loot and explore up to 6 Acts enhanced with beautiful Pixel Art graphics! This game offers countless hours of gameplay and up to 4 player online multiplayer!\n\nWe developers are interested in your feedback. So if you choose to get the game see you on the forums! - Vexorian\n\n\n\nIn the depths of Tarethiel a group of monks united the four pieces of the brimstone talisman, waking up the slendering demons below... The Act was fortold in the Ancient Book of Revelations and that Satan would raise from Hell to rule the earth... Someone needs to stop him or else the mankind will soon face extinction!\n\n\n- ONLINE MULTIPLAYER with up to 4 players!\n- Randomly generated levels, items, dungeons, bosses, secrets and events. Every game session you play is different!\n- Over 170 unique crafted items that are either passive, usable or orbiting.\n- Over 80 different enemies with the possibility to spawn as rare or elite with extra hp/damage and abilities, but dropping better loot and giving more exp!\n- Over 30 Achievements to unlock!\n- Customize your character with over 60 different hats!\n- 4 Acts to play through! Extra acts come with Expansion sets!\n- Random Dungeons and Crypts to explore and clear from loot and enemies!\n- 7 playable classes! Extra classes come with Expansion sets!\n- 4 different difficulty levels to unlock!\n- Tons of random! Start discovering all the wonderful secrets and content!\n- Loot system with: normal, superior, rare and legendary loot!","torrent":{"xt":"urn:btih:4dacb19526cb1ae2b273c50f0beba0cd26765a29","amp;dn":"Hero+Siege+v1.4.0.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dacb19526cb1ae2b273c50f0beba0cd26765a29","infoHashBuffer":{"type":"Buffer","data":[77,172,177,149,38,203,26,226,178,115,197,15,11,235,160,205,38,118,90,41]},"announce":[],"urlList":[]}}