{"title":"The.Take.2004.LiMiTED.DVDRip.XviD-FiCO","uid":3899795,"size":733437069,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4eaf07d0f46a8bab952458da8fd0ff40827cc290&amp;dn=The.Take.2004.LiMiTED.DVDRip.XviD-FiCO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"julipan","files":2,"time":1195499651,"description":" &lt;a href=&quot;http://www.thetake.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.thetake.org/&lt;/a&gt;\n\nIn suburban Buenos Aires, thirty unemployed auto-parts workers walk into their idle factory, roll out sleeping mats and refuse to leave.\n\nAll they want is to re-start the silent machines. But this simple act - The Take - has the power to turn the globalization debate on its head.\n\nIn the wake of Argentina&amp;#039;s dramatic economic collapse in 2001, Latin America&amp;#039;s most prosperous middle class finds itself in a ghost town of abandoned factories and mass unemployment. The Forja auto plant lies dormant until its former employees take action. They&amp;#039;re part of a daring new movement of workers who are occupying bankrupt businesses and creating jobs in the ruins of the failed system.\n\nBut Freddy, the president of the new worker&amp;#039;s co-operative, and Lalo, the political powerhouse from the Movement of Recovered Companies, know that their success is far from secure. Like every workplace occupation, they have to run the gauntlet of courts, cops and politicians who can either give their project legal protection or violently evict them from the factory.\n\nThe story of the workers&amp;#039; struggle is set against the dramatic backdrop of a crucial presidential election in Argentina, in which the architect of the economic collapse, Carlos Menem, is the front-runner. His cronies, the former owners, are circling: if he wins, they&amp;#039;ll take back the companies that the movement has worked so hard to revive.\n\nArmed only with slingshots and an abiding faith in shop-floor democracy, the workers face off against the bosses, bankers and a whole system that sees their beloved factories as nothing more than scrap metal for sale.\n\nWith The Take, director Avi Lewis, one of Canada&amp;#039;s most outspoken journalists, and writer Naomi Klein, author of the international bestseller No Logo, champion a radical economic manifesto for the 21st century. But what shines through in the film is the simple drama of workers&amp;#039; lives and their struggle: the demand for dignity and the searing injustice of dignity denied.","torrent":{"xt":"urn:btih:4eaf07d0f46a8bab952458da8fd0ff40827cc290","amp;dn":"The.Take.2004.LiMiTED.DVDRip.XviD-FiCO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eaf07d0f46a8bab952458da8fd0ff40827cc290","infoHashBuffer":{"type":"Buffer","data":[78,175,7,208,244,106,139,171,149,36,88,218,143,208,255,64,130,124,194,144]},"announce":[],"urlList":[]}}