{"title":"Into the wild_ITA_2007(DVDRip)","uid":4847505,"size":1339420278,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4eed9f75690b39562832880fc27a045041da605b&amp;dn=Into+the+wild_ITA_2007%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"mrgiox","files":2,"time":1239740474,"description":"Into the Wild - Nelle terre selvagge\nDa Wikipedia, l'enciclopedia libera.\n\n\nTitolo originale: \tInto the Wild\nLingua originale: \tInglese\nPaese: \tStati Uniti d'America\nAnno: \t2007\nDurata: \t140 min\nColore: \tcolore\nGenere: \tavventura, drammatico\nRegia: \tSean Penn\n\nInto the Wild - Nelle terre selvagge ÃƒÂ¨ un film del 2007 diretto da Sean Penn, basato sul romanzo di Jon Krakauer Nelle terre estreme, in cui viene raccontata la storia vera di Christopher McCandless, giovane proveniente dal West Virginia che subito dopo la laurea abbandona la famiglia e intraprende un lungo viaggio di due anni attraverso gli Stati Uniti, fino a raggiungere le terre sconfinate dell'Alaska.\n\nIl libro ÃƒÂ¨ stato pubblicato negli Stati Uniti nel 1996, mentre in Italia ÃƒÂ¨ stato distribuito dalla Rizzoli nel 1997. Il romanzo ÃƒÂ¨ stato poi rieditato da Corbaccio in concomitanza con l'uscita del film.[1]\n\nProtagonista della pellicola ÃƒÂ¨ l'attore californiano Emile Hirsch, che per la sua drammatica interpretazione ha vinto il premio come migliore attore dal National Board of Review. La colonna sonora del film ÃƒÂ¨ stata composta da Michael Brook, con canzoni di Eddie Vedder. Il brano Guaranteed ha vinto il Golden Globe per la miglior canzone originale.\n\nIl film ÃƒÂ¨ uscito il 21 settembre 2007 negli Stati Uniti, mentre in Italia ÃƒÂ¨ uscito il 25 gennaio 2008 dopo essere stato presentato alla Festa Internazionale di Roma il 20 ottobre 2007, aggiudicandosi il Premio Fastweb nella sezione PremiÃƒÂ¨re.[2]\n\nTrama\n\nIl film racconta la storia vera di Christopher McCandless, un giovane benestante che, subito dopo la laurea in scienze sociali all'UniversitÃƒÂ  di Emory nel 1990, dona i suoi risparmi all'Oxfam e abbandona amici e famiglia per sfuggire ad una societÃƒÂ  consumista e capitalista in cui non riesce piÃƒÂ¹ a vivere. La sua inquietudine, in parte dovuta al pessimo rapporto con la famiglia e in parte alle letture di autori anticonformisti come Thoreau e London, lo porta a viaggiare per due anni negli Stati Uniti e nel Messico del nord, con lo pseudonimo Alexander Supertramp.\n\nDurante il suo lungo viaggio verso l'Alaska incontrerÃƒÂ  sulla sua strada diversi personaggi: una coppia hippie, un giovane trebbiatore del South Dakota, una giovane cantautrice hippie ed un anziano veterano chiuso nei suoi ricordi, a cui cambierÃƒÂ  la vita con il suo messaggio di libertÃƒÂ  e amore fraterno e dai quali riceverÃƒÂ  la formazione necessaria per affrontare le immense terre dell'Alaska. Qui trova la natura selvaggia ed incontaminata che, con il passare del tempo, gli fa comprendere che la felicitÃƒÂ  non ÃƒÂ¨ nelle cose materiali che circondano l'uomo o nelle esperienze intese come eventi indipendenti e fini a sÃƒÂ© stessi, ma nella piena condivisione e nell'incontro incondizionato con l'altro.\n\nA conferma di questo Christopher, poco tempo prima di morire, scriverÃƒÂ  su uno dei libri che era solito leggere &quot;Happiness is real only when shared&quot;: la felicitÃƒÂ  ÃƒÂ¨ autentica solo se condivisa. MorirÃƒÂ , infine, nel 1992 di stenti o di freddo proprio in Alaska: le cause della morte sono tutt'ora incerte, ma ÃƒÂ¨ probabile che essa sia dovuta ad un'intossicazione alimentare, come mostrato nel film. Prima di morire troverÃƒÂ  nel suo cuore il perdono per i suoi genitori e riconoscerÃƒÂ  la sua vera identitÃƒÂ , dopo aver toccato con mano la libertÃƒÂ  piÃƒÂ¹ estrema.","torrent":{"xt":"urn:btih:4eed9f75690b39562832880fc27a045041da605b","amp;dn":"Into+the+wild_ITA_2007%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4eed9f75690b39562832880fc27a045041da605b","infoHashBuffer":{"type":"Buffer","data":[78,237,159,117,105,11,57,86,40,50,136,15,194,122,4,80,65,218,96,91]},"announce":[],"urlList":[]}}