{"title":"Wim Mertens - Discography  1981-2004 [Mp3 128-320 kbps] TNT Vill","uid":6249584,"size":2739690506,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ef2bf5c8c923c911a11a64a79221616c77b8304&amp;dn=Wim+Mertens+-+Discography++1981-2004+%5BMp3+128-320+kbps%5D+TNT+Vill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"l.diliberto","files":489,"time":1300360297,"description":"Wim Mertens - Discography  1981-2004 [Mp3 128-320 kbps] TNT Village\n\n.: Release Originale :.\n &lt;a href=&quot;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54768&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=54768&lt;/a&gt;\n\nMertens was born in Neerpelt, Belgium. He studied social and political science at the University of Leuven (graduating in 1975) and musicology at Ghent University; he also studied music theory and piano at the Ghent Conservatory and the Royal Conservatory of Brussels.\n\nIn 1978, he became a producer at the then BRT (Belgian Radio and Television, now called Vlaamse Radio- en Televisieomroep). For Radio 2 (Radio Brabant) he produced concerts by Philip Glass, Steve Reich, Terry Riley, Meredith Monk, Urban Sax and others, and hosted a program called Funky Town together with Gust De Meyer (with whom he recorded the experimental album For Amusement Only).\n\nKnown primarily as a composer since the early 1980s, Mertens is best known for his opus &quot;Struggle for Pleasure&quot;. He is also well known for his piece &quot;Maximizing the Audience&quot;, which was composed for Jan Fabre's play The Power of Theatrical Madness, which premiered in 1984 in Venice, Italy.\n\nMertens' style has continually evolved during the course of his prolific career, starting from downright experimental and avant-garde, always gravitating around minimalism, usually, however, preserving a melodic foundation to the forays that he makes into the worlds that he is exploring. His compositional quality has often overweighted the &quot;labelling issue&quot; and reached wider audiences although stemming from a far-from-mainstream musical context (see section In popular culture).\n\nMertens has released more than 50 albums to date, the majority of which were issued by Les Disques du CrÃƒÂ©puscule from 1980 until 2004. Mertens also produced a number of CrÃƒÂ©puscule releases and consulted with the label on its choice of works by contemporary composers such as Michael Nyman, Gavin Bryars, and Glenn Branca. Mertens also curated a series of releases for a CrÃƒÂ©puscle imprint, Lome ArmÃƒÂ©, that featured works from the classical era as well as contemporary jazz.\n\nMertens' music was used in the 1987 Peter Greenaway film The Belly of an Architect, along with that of Glenn Branca also in the Dutch-British film Shadow Man (1988), directed by Piotr Andrejew, as well as in the Brazilian documentary NÃƒÂ³s que Aqui Estamos por VÃƒÂ³s Esperamos (Here We Are Waiting for You), directed by Marcelo MasagÃƒÂ£o.\n\nMertens is the author of American Minimal Music, which looks at the school of American repetitive music and the work of LaMonte Young, Terry Riley, Steve Reich, and Philip Glass.\n\nIn March 1998 Mertens became the Cultural Ambassador of Flanders.\n\nMertens can be heard on the CD Indeterminate Activity of Resultant Masses of Glenn Branca, which published an interview of Mertens with John Cage.\n\nIn August 2007 Mertens signed a contract with EMI Classics for his entire catalog. The label re-released his entire back-catalog beginning in January 2008. EMI Music Belgium has also released Mertens' new work, beginning with the 9-track album Receptacle on 24 September 2007. For this album Mertens decided to work with an orchestra consisting of only women, 17 in total. It is not the first time that Mertens has worked together with EMI. Already in 1999 Mertens released the soundtrack to the Paul Cox film Molokai: The Story of Father Damien via EMI Classics.\n\nNew work released in 2008 includes the CD L'heure du loup which, similar to some of his experimental works, contains a series of tracks based on variations around one composition, the previously released Hors nature. Mertens also released a box set of six volumes from his live Years Without History series, the sixth volume of which (The Promise Kept in Advance) is only available with the box set. A seventh volume, Nosotros, was also released in 2008. It contains a recording from July 2002 at the Kasteeldomein van Gaasbeek in Belgium, the live premiere of material that would later be released on the Skopos CD. Other live albums and a DVD concert performance have been released as well.\n\nIn April 2010 Mertens released his first new compositions in several years on the CD Zee Versus Zed.\n\n.: Wim Mertens :.\n &lt;a href=&quot;\nhttp://www.caligola.it/public/news/images/Wim%20Mertens%201.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.caligola.it/public/news/images/Wim%20Mertens%201.jpg&lt;/a&gt;\n\n.: Albums :.\n\nUsura: Early Works - 1981\nVer Veranderingen - 1981\nAt home, not at home - 1982\nFor Amusement Only - 1982\nVergessen - 1982\nStruggle for pleasure - 1983\nMaximizing the Audience - 1985\nClose cover - 1986\nInstrumental songs - 1986\nA Man Of No Fortune And With A Name To Come\nAnno: 1986\nThe belly of an architect - 1987\nAlle dinghe - 1991\nShot and echo - 1993\nA sense of place - 1993\nGave van niets - Anno: 1994\nLisa - 1996\nSin embargo - 1997\nBest Of - 1997\nCave musicam - 1998\nFather Damien - 1999\nInteger valore(integrale) - 1999\nDer Heisse Brei - 2000\nAre - 2001\nIf Five Is Part Of Ten - 2001\nKaosmos - 2001\nIn The Absence Of Hindrance - Anno: 2002\nNot Yet No Longer - Anno: 2003\nSkopos - Anno: 2003\nWith no need for seeds (Years without history Vol. 5) - 2004","torrent":{"xt":"urn:btih:4ef2bf5c8c923c911a11a64a79221616c77b8304","amp;dn":"Wim+Mertens+-+Discography++1981-2004+%5BMp3+128-320+kbps%5D+TNT+Vill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef2bf5c8c923c911a11a64a79221616c77b8304","infoHashBuffer":{"type":"Buffer","data":[78,242,191,92,140,146,60,145,26,17,166,74,121,34,22,22,199,123,131,4]},"announce":[],"urlList":[]}}