{"title":"Almost Famous (2000) (Patrick Fugit, Kate Hudson)","uid":4328609,"size":768318302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f91a3f5f0fe7add3a00dfb20a8b161650201aca&amp;dn=Almost+Famous+%282000%29+%28Patrick+Fugit%2C+Kate+Hudson%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"JayRay","files":-1,"time":1217916828,"description":"ALMOST FAMOUS -2000\n\nIMDb Rating: 8.0\nhttp://www.imdb.com/title/tt0181875/\n\n  Almost Famous is the movie Cameron Crowe has been waiting a lifetime to tell. The fictionalization of Crowe's days as a teenage reporter for Creem and Rolling Stone magazines.\n  A 15 year old boy named William Miller (Patrick Fugit) gets an opportunity to travel with a rock band, Stillwater on a 1973 tour. As a younger boy, his sister (Zooey Deschanel) and his widowed mother Elaine (Frances McDormand) had fought about the mother's control over the family and her denial of rock music. The sister leaves home and leaves the young boy her record collection, which immediately seizes his attention. As a teen, he makes record reviews for an underground newspaper. He submits those to Creem magazine writer Lester Bangs (Phillip Seymour Hoffman) and gets his attention. The two become fast friends and Bangs acts as his mentor as Rolling Stone magazine comes calling. Slipping into an inner group connected with Stillwater, Rolling Stone agrees to bankroll him on a trip with the group. There he meets the &quot;Band Aids&quot;, a group of girls that refuse to be called groupies because they are dedicated only to specific bands. &quot;Penny Lane&quot; (Kate Hudson), the Band Aid's leader is enamored with the group leader (Billy Crudup), but befriends the teen. He responds with complete infatuation with her, but he is equally enamored with the charismatic guitarist. While accepted by the band (other members are Jason Lee, John Fedevich and Mark Kozeleck), they nonetheless refer to him as &quot;the enemy - a rock critic&quot;.\n\n  Starring: Patrick Fugit, Kate Hudson, Frances McDormand, Philip Seymour Hoffman, Billy Crudup, Zooey Deschanel.\n\n  Directed by: Cameron Crowe.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 2hr. 3min.\n\n  Language: English.\n\n  Size: 720 x 416\n\n  Frame Rate: 23fps","torrent":{"xt":"urn:btih:4f91a3f5f0fe7add3a00dfb20a8b161650201aca","amp;dn":"Almost+Famous+%282000%29+%28Patrick+Fugit%2C+Kate+Hudson%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f91a3f5f0fe7add3a00dfb20a8b161650201aca","infoHashBuffer":{"type":"Buffer","data":[79,145,163,245,240,254,122,221,58,0,223,178,10,139,22,22,80,32,26,202]},"announce":[],"urlList":[]}}