{"title":"Tom Waits - Bone Machine  [1992]  [Robbie60] [FLAC]","uid":6219077,"size":313173573,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4fa25a0bdec4d89b5c1610dd691b5a0beeb6a9c9&amp;dn=Tom+Waits+-+Bone+Machine++%5B1992%5D++%5BRobbie60%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299270229,"description":"Tom Waits\nBone Machine\n\nLabel: Island Records\nReleased: 1992\nSource: Original CD \nSize Torrent: 298 MB\nFormat: FLAC\n\n\n\n\n\n\nBone Machine is a critically acclaimed and award-winning album by Tom Waits, released in 1992 on Island Records. It won a Grammy Award for Best Alternative Music Album, and features guest appearances by Los Lobos' David Hidalgo, Primus' Les Claypool, and The Rolling Stones' Keith Richards.\n\nBone Machine marked a return to studio material for Waits, coming a full five years after his previous studio album, Franks Wild Years (1987). The album is often noted for its dark lyrical themes of death and murder, and for its rough, stripped-down, percussion-heavy blues rock style.\n\nBone Machine was recorded and produced entirely at the Prairie Sun Recording studios in Cotati, California in a room of Studio C known as &quot;the Waits Room,&quot; in the old cement hatchery rooms of the cellar of the buildings.\n\nMark &quot;Mooka&quot; Rennick, Prairie Sun studio chief said:\n\nWaits gravitated toward these &quot;echo&quot; rooms and created the Bone Machine aural landscape. [...] What we like about Tom is that he is a musicologist. And he has a tremendous ear. His talent is a national treasure.\n\nWaits said of the bare-bones studio, &quot;I found a great room to work in, it's just a cement floor and a hot water heater. Okay, we'll do it here. It's got some good echo.&quot; References to the recording environment and process were made in the field-recorded interview segments made for the promotional CD release, Bone Machine: The Operator's Manual, which threaded together full studio tracks and conversation for a pre-recorded radio show format.\n\n\nThe cover photo, which consists of a blurred black-and-white, close-up image of Waits in a leather skullcap with horns and protective goggles, was taken by Jesse Dylan, the son of Bob Dylan. He wears this same outfit in the video for &quot;Goin' Out West&quot; and &quot;I Don't wanna Grow up&quot;.\n\nA number of the songs from Bone Machine have been used in a number of high profile movie soundtracks, and have been covered by artists in varying genres.\n\nThe album opener &quot;Earth Died Screaming&quot; is featured in the 1995 film Twelve Monkeys, while &quot;Jesus Gonna Be Here&quot; is featured in the 2005 film Domino, in which Waits appears. &quot;Goin' Out West&quot; is featured in the 1999 film Fight Club and has been covered by Queens of the Stone Age, Gomez, Widespread Panic, Gov't Mule, and Australian blues guitarist Ash Grunwald. &quot;I Don't Wanna Grow Up&quot; was covered by The Ramones for their album, Adios Amigos, by Petra Haden and Bill Frisell on their album collaboration Petra Haden &amp; Bill Frisell (2003), with a recent version on Hayes Carll's Trouble In Mind ( 2008 ), and by Scarlett Johansson on her debut album, Anywhere I Lay My Head ( 2008 ).\n\n\n\nPersonnel\n\nTom Waits - Vocals, Chamberlin, Percussion, Guitar, Sticks, Piano, Upright Bass, Conundrum, Drums, Acoustic Guitar\nBrain - Drums\nKathleen Brennan - Sticks\nRalph Carney - Alto Sax, Tenor Sax, Bass Clarinet\nLes Claypool - Electric Bass\nJoe Gore - Guitar\nDavid Hidalgo - Violin, Accordion\nJoe Marquez - Sticks, Banjo\nDavid Phillips - Pedal Steel Guitar, Steel Guitar\nKeith Richards - Guitar, Vocal\nLarry Taylor - Upright Bass, Guitar\nWaddy Wachtel - Guitar\n\n\n\nTrack Listing\n\n1.Earth Died Screaming ( 3:36 )\n2.Dirt in the Ground ( 4:07 )\n3.Such a Scream ( 2:08 )\n4.All Stripped Down ( 3:03 )\n5.Who Are You ( 3:54 )\n6.The Ocean Doesn't Want Me ( 1:49 )\nGonna Be Here ( 3:18 )\n8.A Little Rain ( 2:58 )\n9.In the Colosseum ( 4:50 )\n10.Goin' Out West ( 3:20 )\n11.Murder in the Red Barn ( 4:28 )\n12.Black Wings ( 4:35 )\n13.Whistle Down the Wind ( 4:35 )\n14.I Don't Wanna Grow Up ( 2:31 )\n15.Let Me Get Up on It ( 0:53 )\n16.That Feel ( 3:13 )\n","torrent":{"xt":"urn:btih:4fa25a0bdec4d89b5c1610dd691b5a0beeb6a9c9","amp;dn":"Tom+Waits+-+Bone+Machine++%5B1992%5D++%5BRobbie60%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fa25a0bdec4d89b5c1610dd691b5a0beeb6a9c9","infoHashBuffer":{"type":"Buffer","data":[79,162,90,11,222,196,216,155,92,22,16,221,105,27,90,11,238,182,169,201]},"announce":[],"urlList":[]}}