{"title":"The Autobiography of Malcolm X (pdf)","uid":8532838,"size":3846711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50f48f3e051f152cff7fa69e86528212fbf8847d&amp;dn=The+Autobiography+of+Malcolm+X+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"pharmakate","files":-1,"time":1370198102,"description":"The Autobiography of Malcolm X (as told to Alex Haley)(Ballantine Books, 1965). 527 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nExisting digital versions of this book were low quality -- as far as I know this new one is the first to retain the formatting of the printed book.\n\n\ndescription:\n\n&quot;Extraordinary. A brilliant, painful, and important book.&quot;\nTHE NEW YORK TIMES\n\nIf there was any one man who articulated the anger, the struggle, and the beliefs of African Americans in the 1960s, that man was Malcolm X. His AUTOBIOGRAPHY is the result of a unique collaboration between Alex Haley and Malcolm X, whose voice and philosophy resonate from every page, just as his experience and his intelligence continue to speak to millions.\n\nReview\n\nMalcolm X's searing memoir belongs on the small shelf of great autobiographies. The reasons are many: the blistering honesty with which he recounts his transformation from a bitter, self-destructive petty criminal into an articulate political activist, the continued relevance of his militant analysis of white racism, and his emphasis on self-respect and self-help for African Americans. And there's the vividness with which he depicts black popular culture--try as he might to criticize those lindy hops at Boston's Roseland dance hall from the perspective of his Muslim faith, he can't help but make them sound pretty wonderful. These are but a few examples. The Autobiography of Malcolm X limns an archetypal journey from ignorance and despair to knowledge and spiritual awakening. When Malcolm tells coauthor Alex Haley, &quot;People don't realize how a man's whole life can be changed by one book,&quot; he voices the central belief underpinning every attempt to set down a personal story as an example for others. Although many believe his ethic was directly opposed to Martin Luther King Jr.'s during the civil rights struggle of the '60s, the two were not so different. Malcolm may have displayed a most un-Christian distaste for loving his enemies, but he understood with King that love of God and love of self are the necessary first steps on the road to freedom.\n","torrent":{"xt":"urn:btih:50f48f3e051f152cff7fa69e86528212fbf8847d","amp;dn":"The+Autobiography+of+Malcolm+X+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50f48f3e051f152cff7fa69e86528212fbf8847d","infoHashBuffer":{"type":"Buffer","data":[80,244,143,62,5,31,21,44,255,127,166,158,134,82,130,18,251,248,132,125]},"announce":[],"urlList":[]}}