{"title":"Lynda - Introduction to Graphic Design with Justin Seeley","uid":14034716,"size":1900913962,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:51265ded1ad62394f5a39d1ff6b3b245268cc41c&amp;dn=Lynda+-+Introduction+to+Graphic+Design+with+Justin+Seeley&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"2boweb","files":164,"time":1458966680,"description":"Lynda - Introduction to Graphic Design with Justin Seeley\r\n\r\n\r\nFYI : This Course will be good to the Best for DL within 30 days after has been posed, after that it might not be good DL already, please do me favour to continue seeding to keep this torrent alive.\r\n\r\n\r\nCourse Duration:6h 4m Level: Beginner Updated: Feb 26, 2016\r\n| Uploaded in Mar 26, 2016 by 2boweb\r\n\r\nWhat does it take to be a graphic designer? Design is a complex art that involves many different skills and tools, but by breaking down the core topics and software, Justin Seeley shows how you can get your start in the design world. First, he covers theory, including high-level concepts like layout, typography, and color. Then it's your chance to get hands-on, using Illustrator to build a custom logo from scratch and practice your vector-drawing techniques. Next, Justin takes you into Photoshop, where he shows you how to creatively adjust, repair, and retouch the kinds of images you'll use in design projects. Last, he visits InDesign for an overview of the layout and print preparation processes. By the end, you'll have a better grasp of what graphic designers do and what you'll need to learn next. It's a great jumping off point for any graphic design career.  Note: These tutorials were revised in 2016 to make sure they are current with the latest version of Adobe Creative Cloud. Mini Bridge was retired this year, so Justin uses alternate methods to open and organize assets","torrent":{"xt":"urn:btih:51265ded1ad62394f5a39d1ff6b3b245268cc41c","amp;dn":"Lynda+-+Introduction+to+Graphic+Design+with+Justin+Seeley","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51265ded1ad62394f5a39d1ff6b3b245268cc41c","infoHashBuffer":{"type":"Buffer","data":[81,38,93,237,26,214,35,148,245,163,157,31,246,179,178,69,38,140,196,28]},"announce":[],"urlList":[]}}