{"title":"Andrew Bird - Things Are Really Great Here, Sort of...","uid":10293537,"size":206995356,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:519ad49503017c1c8c8c8b88fd3b4861fdc23993&amp;dn=Andrew+Bird+-+Things+Are+Really+Great+Here%2C+Sort+of...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1401891021,"description":"\n  Andrew Bird - Things Are Really Great Here, Sort of... \n\n  Genre: Pop/Rock\n  Styles: Singer/Songwriter, Indie, Folk\n  Source: WEB\n  Codec: FLAC \n  Bitrate: ~ 900 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Cathedral in the Dell \n  02 Tin Foiled \n  03 Giant of Illinois \n  04 So Much Wine, Merry Christmas \n  05 My Sister's Tiny Hands \n  06 The Sad Milkman\n  07 Don't Be Scared\n  08 Frogs Singing \n  09 Drunk By Noon \n  10 Far From Any Road (Be My Hand) \n\n  Chicago singer/songwriter/violinist Andrew Bird updates the traditions of small-group swing, German lieder, and New Orleans jazz, mixing Gypsy, folk, and rock elements into his distinctive style. Bird's projects include his group the Bowl of Fire (which also includes drummer Kevin O'Donnell, bassist Josh Hirsch, and guitarist Colin Bunn) and performing as an auxiliary member of the Squirrel Nut Zippers; in turn, the Zippers' Katharine Whalen and James Mathus appeared on the Bowl of Fire albums Thrills and Oh! the Grandeur. Bird has also recorded with artists like Pinetop Seven and Lil' Ed Williams, teaches music at the Old Town School of Folk Music, and performed on the score and soundtrack from the 1999 Tim Robbins film The Cradle Will Rock.\n\n  His third album, 2001's The Swimming Hour, surprisingly found the Bowl of Fire turning to pop music, and with excellent results. As bandmembers remained active in their various other projects, the group continued, and work on a follow-up began in 2002. To tide fans over, Bird self-released a limited-edition EP, Fingerlings, which documented live performances of some old and new songs by the band and solo. Early 2003 brought the release of another LP, Weather Systems, on the independent Grimsey label. Bird debuted on Ani DiFranco's Righteous Babe imprint in 2005 with Andrew Bird &amp; the Mysterious Production of Eggs. He switched to Fat Possum for 2007's Armchair Apocrypha and 2009's Noble Beast, both of which were ambitious and eclectic albums even by Bird's standards. The latter of the two was also available in a deluxe version that included a bonus CD of instrumental works. The second disc, dubbed Useless Creatures, was released independently from its predecessor in October of 2010.\n\n  The following year, Bird composed the score for Jonathan Segal's independent coming-of-age film Norman. The film's score was released in October on the Mom + Pop label. Bird's highly anticipated sixth studio album, Break it Yourself, arrived in March of 2012, followed by the companion piece Hands of Glory in early October.","torrent":{"xt":"urn:btih:519ad49503017c1c8c8c8b88fd3b4861fdc23993","amp;dn":"Andrew+Bird+-+Things+Are+Really+Great+Here%2C+Sort+of...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"519ad49503017c1c8c8c8b88fd3b4861fdc23993","infoHashBuffer":{"type":"Buffer","data":[81,154,212,149,3,1,124,28,140,140,139,136,253,59,72,97,253,194,57,147]},"announce":[],"urlList":[]}}