{"title":"Buffett - The Making of an American Capitalist","uid":6939054,"size":38634882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51ae0bf26bef89f71f473f62ea37cfa828b4c8db&amp;dn=Buffett+-+The+Making+of+an+American+Capitalist&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"gnv65","files":-1,"time":1325894982,"description":"Buffett - The Making of an American Capitalist\nBy Roger Lowenstein\nRandom House Trade Paperbacks | April 2008 | ISBN-10: 0812979273 | 512 pages | PDF | 20.6 mb\n\n\nStarting from scratch, simply by picking stocks and companies for investment, Warren Buffett amassed one of the epochal fortunes of the twentieth century--an astounding net worth of $10 billion, and counting. His awesome investment record has made him a cult figure popularly known for his seeming contradictions: a billionaire who has a modest lifestyle, a phenomenally successful investor who eschews the revolving-door trading of modern Wall Street, a brilliant dealmaker who cultivates a homespun aura.\nThis illuminating biography reveals a man whose conscientiousness, integrity, and good humor exist alongside an odd emotional isolation. Buffett also masterfully traces his life: his enormously successful partnership; his early, inspired investments in American Express and Geico; his companionship and investment with Katharine Graham of the Washington Post; his role in the Capital Cities purchase of ABC; his unique relationship with his wife and mistress; and his rescue of the scandal-ridden Salomon Brothers.\nSince its hardcover publication in August of 1995, Buffett has appeared on the Wall Street Journal, New York Times, San Francisco Chronicle, Los Angeles Times, Seattle Times, Newsday and Business Week bestseller lists. The incredible landmark portrait of Warren Buffett's uniquely American life is now available in paperback, revised and updated by the author.\n\nJournalist Roger Lowenstein draws on three years of unprecedented access to Buffett's family, friends, and colleagues to provide the first definitive, inside account of the life and career of this American original. Buffett  explains Buffett's' investment strategy--a long-term philosophy grounded in buying stock in companies that are undervalued on the market and hanging on until their worth invariably surfaces--and shows how it is a reflection of his inner self.\n\nContents\nINTRODUCTION xi\n1. OMAHA 3\n2. RUNAWAY 21\n3. GRAHAM 36\n4. BEGINNINGS 60\n5. PARTNERS 78\n6. GO-GO 96\n7. BERKSHIRE HATHAWAY 121\n8. RETURN OF THE NATIVE 140\n9. ALTER EGO 162\n10. WASHINGTON REDUX 181\n11. PRESS LORD 203\n12. PARTNERS, REDUX 224\n13. THE CARPET WOMAN 246\n14. THE EIGHTIES 257\n15. PUBLIC AND PRIVATE 275\n16. CRASH 292\n17. A BRIF.P INTRODUCTION TO DAR IS\n18. SECRETS OF THE I^MPLE 329\n19. HOWIE BUFFETT'S CORN 354\n20. RHINOPHOBIA 351\n21. THE KING 368\n22. SALOMON'S COURT 386\n23. BUFFETT'S TROLLEY 411\nAITERWORD: JANUARY 2008 427\nNOTES 433\nINDEX 469","torrent":{"xt":"urn:btih:51ae0bf26bef89f71f473f62ea37cfa828b4c8db","amp;dn":"Buffett+-+The+Making+of+an+American+Capitalist","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ae0bf26bef89f71f473f62ea37cfa828b4c8db","infoHashBuffer":{"type":"Buffer","data":[81,174,11,242,107,239,137,247,31,71,63,98,234,55,207,168,40,180,200,219]},"announce":[],"urlList":[]}}