{"title":"Darktown - Thomas Mullen [EN EPUB AZW3] [ebook] [p_s]","uid":15822290,"size":1400706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:52871fb4bf5dbe549f90dea58ad190b059b11bcb&amp;dn=Darktown+-+Thomas+Mullen+%5BEN+EPUB+AZW3%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"perfect_stan","files":2,"time":1473786092,"description":"Darktown: A Novel by Thomas Mullen\r\nEnglish | 2016 | Mystery &amp; Thriller | 1.3 MB\r\n\r\n\r\nThe award-winning author of The Last Town on Earth delivers a riveting and elegant police procedural set in 1948 Atlanta, exploring a murder, corrupt police, and strained race relations that feels ripped from today’s headlines.\r\nResponding to orders from on high, the Atlanta Police Department is forced to hire its first black officers, including war veterans Lucius Boggs and Tommy Smith. The newly minted policemen are met with deep hostility by their white peers; they aren’t allowed to arrest white suspects, drive squad cars, or set foot in the police headquarters.\r\nWhen a black woman who was last seen in a car driven by a white man turns up dead, Boggs and Smith suspect white cops are behind it. Their investigation sets them up against a brutal cop, Dunlow, who has long run the neighborhood as his own, and his partner, Rakestraw, a young progressive who may or may not be willing to make allies across color lines. Among shady moonshiners, duplicitous madams, crooked lawmen, and the constant restrictions of Jim Crow, Boggs and Smith will risk their new jobs, and their lives, while navigating a dangerous world—a world on the cusp of great change.\r\nSet in the postwar, pre-civil rights South, and evoking the socially resonant and morally complex crime novels of Dennis Lehane and Walter Mosley, Darktown is a vivid, smart, intricately plotted crime saga that explores the timely issues of race, law enforcement, and the uneven scales of justice.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:52871fb4bf5dbe549f90dea58ad190b059b11bcb","amp;dn":"Darktown+-+Thomas+Mullen+%5BEN+EPUB+AZW3%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52871fb4bf5dbe549f90dea58ad190b059b11bcb","infoHashBuffer":{"type":"Buffer","data":[82,135,31,180,191,93,190,84,159,144,222,165,138,209,144,176,89,177,27,203]},"announce":[],"urlList":[]}}