{"title":"Luxure, Initiation De Jeunes Libertines (NEW 2015 Marc Dorcel) [","uid":11991570,"size":1501088633,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:52d202ba3c2862e0b5a87845296408e18fb720fa&amp;dn=Luxure%2C+Initiation+De+Jeunes+Libertines+%28NEW+2015+Marc+Dorcel%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"chkm8te","files":1,"time":1433522562,"description":"Luxure, Initiation De Jeunes Libertines (NEW 2015 Marc Dorcel) [Web-DL]\n\nClaire Castel, Manon Martin, Chloe Lacourt, Valentina Nappi, Ava Courcelles, Mike Angelo, James Brossman, Yanick Shaft, Renato, Tony Carrera, Rico Simmons\n\nClaire Castel, Chloe Lacourt, Ava Courcelles, Valentina Nappi and the young Manon Martin have got all dressed up as sophisticated and sexy women to please their husbands. They invite you to enjoy five exciting sex games and follow them closely in their initiation as libertines and their first experiences of &quot;candaulism&quot;. Prepare yourselves for a completely new way of tasting the forbidden fruit as a couple... Today, Manon gave a blowjob to her intern in the office toilets just like her husband asked her to. So why is he now punishing her? Because she liked it of course. And above alll because she wants even more. And so does her man! This evening, under the watchful gaze of her perverted husband, Manon is going to allow herself to be taken by her virile lover until she is brought to orgasm thanks to magnificent anal sex. The young Chloe catches the gaze of a handsome man while she is drinking a glass of wine with her husband. When her husband, caught up in this sex game, tells her to go and seduce this perfect stranger and take him into the toilets so that he can fuck her like a little bitch, Chloe is surprised to say the least. But she is also very excited... And bear in mind that this hot Parisian night has only just started: from anal sex and double penetration with strangers to episodes of couple exhibitionism in taxis, these five sublime creatures will go beyond their limits just for you.\n\nCovers: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8zn5elfcwg0n1jsreq54.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8zn5elfcwg0n1jsreq54.jpg&lt;/a&gt;\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=fpoejmen3hymnmejbs23.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=fpoejmen3hymnmejbs23.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:52d202ba3c2862e0b5a87845296408e18fb720fa","amp;dn":"Luxure%2C+Initiation+De+Jeunes+Libertines+%28NEW+2015+Marc+Dorcel%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d202ba3c2862e0b5a87845296408e18fb720fa","infoHashBuffer":{"type":"Buffer","data":[82,210,2,186,60,40,98,224,181,168,120,69,41,100,8,225,143,183,32,250]},"announce":[],"urlList":[]}}