{"title":"Avatar - The Last Airbender - The Promise COMPLETE","uid":9215346,"size":165429057,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5340635654df41d835ed86cc6cf10cc73fdfdc4e&amp;dn=Avatar+-+The+Last+Airbender+-+The+Promise+COMPLETE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Zagorath","files":-1,"time":1384852314,"description":"Avatar - The Last Airbender - The Promise\nParts 1, 2, and 3 are all extracted from .CBR files into a series of .JPGs.\nPart 1 contains 74 images\nPart 2 contains 84 images\nPart 3 contains 82 images\n\nPart 1:\n\nA year after the Hundred Year War's conclusion, Aang and Zuko are working in collaboration with Earth King Kuei to remove the Fire Nation colonies from Earth Kingdom shores in the Harmony Restoration Movement. Worried that he would one day become like his father, Zuko forced Aang to make a life-changing promise to him soon after the War ended. When Zuko attempts to go against the wishes of Aang and Kuei by allowing one unusually well-integrated Fire Nation colony to remain in the Earth Kingdom, which also leads Zuko to believe that all the colonies should stay, the promise Aang made is put to the test as he attempts to keep balance between the Four Nations.\n\nPart 2:\n\nWhile Aang and Katara stay the night at a Ba Sing Se fan club dedicated to Aang and his Air Nomad culture in wait for their audience with Earth King Kuei, Toph takes Sokka to her metalbending school, only to discover that Toph and her students are being evicted by a firebender with plans to use the building to teach other children his bending art. Meanwhile, Zuko seeks advice from Ozai in concern of the colonial peoples' plight, a decision that, coupled with Kuei's change in perspective, may pit the Fire Nation and Earth Kingdom against one another once more.\n\nPart 3:\n\nThe Harmony Restoration Movement has taken a turn for the worst as Earth King Kuei and Fire Lord Zuko lead their armies into battle in order to achieve their opposite intentions for the Yu Dao colony: Kuei wants the colonials to leave for the Fire Nation, and Zuko plans to keep his people where they believe they belong. As the two nations enter conflict once more, Aang and Katara attempt to negotiate peace within the city's walls while Sokka and Toph meet with an old friend at the Metalbending Academy. If war is to be averted, Team Avatar must find a way to resolve the Yu Dao crisis. Aang may be able to do so with his only option: keeping his promise to Fire Lord Zuko.","torrent":{"xt":"urn:btih:5340635654df41d835ed86cc6cf10cc73fdfdc4e","amp;dn":"Avatar+-+The+Last+Airbender+-+The+Promise+COMPLETE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5340635654df41d835ed86cc6cf10cc73fdfdc4e","infoHashBuffer":{"type":"Buffer","data":[83,64,99,86,84,223,65,216,53,237,134,204,108,241,12,199,63,223,220,78]},"announce":[],"urlList":[]}}