{"title":"Dark (Carpathians) Series #1-25 Christine Feehan (multi)","uid":9506019,"size":46000221,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:536f53c6aafc58bed63f08bdbbc402ff0a2c26d8&amp;dn=Dark+%28Carpathians%29+Series+%231-25+Christine+Feehan+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":13,"uploader":"7","files":-1,"time":1390318887,"description":"Dark (Carpathians) Series #1-25 Christine Feehan\n\n\nFormat: mobi/epub/azw3\nGenre: Paranormal Romance\nDate: 8 March 1999 - 7 January 2014\n\nThe Carpathians. The extraordinary nature of these men and women make it a pleasure for this writer to revisit their land again and again in my novels. The Carpathians fire my imagination! Their stories allow me to explore everything from shapeshifting, to wild, exotic and dangerous animals, to the nature of true love (and passion).\n\nThis is a romance-focused vampire series - but with lots of action and danger.\n\nDark Prince (#1) (1999) (Author's Cut Special)\nDark Prince (#1) (1999)\n\nPrince of the Night.\n\nHe came to her in the night, a predator -- strength and power chiseled his features. The seduction was deep and elemental; he affected her soul. His need. His darkness. His terrible haunting loneliness. Her senses aroused, she craved the dangerous force of his body. Burned for him. And he had only touched her with his mind.\n\nLady of the Light.\n\nShe came to him at dawn, his bleakest hour. As the beast raged inside him, threatening to consume him, he vented his centuries-old despair in an anguished cry that filled the waning night. And she answered, a ray of light, piercing his darkness. A beautiful angel. Her compassion, courage, and innocence awakened in him an exquisite longing and tenderness. He knew he must possess her, for only she could tame his savage side and lift the dark shadow from his soul. Apart they were desolate, bereft. Intertwined physically and spiritually, they could heal one another and experience an eternity of nights filled with love.\n\nRaven Whitney is a psychic who has used her gift to help the police track down a serial killer. Now she is determined to escape the glare of recent publicity for the peace and quiet of the Carpathian Mountains. Prince Mikhail Dubrinsky is the leader of his people but, as his ancient Carpathian race grows ever closer to extinction, he is close to giving in to the heavy weight of loneliness and despair. From the moment their minds touch, Raven and Mikhail form a connection. But there are those who incorrectly view all Carpathians as vampires, and are determined to give their extinction a helping hand.\n\nDark Desire (#2) (1999)\nDark Gold (#3) (2000)\nDark Magic (#4) (2000)\nDark Challenge (#5) (2000)\nDark Fire (#6) (2001)\nDark Dream (#7) (2001)\nDark Dream (#7) (2010)\nDark Legend (#8) (2002)\nDark Guardian (#9) (2002)\nDark Symphony (#10) (2003)\nDark Descent (#11) (2003)\nDark Descent (#11) (2010)\nDark Melody (#12) (2003)\nDark Destiny (#13) (2004)\nDark Hunger (#14) (2004)\nDark Secret (#15) (2005)\nDark Demon (#16) (2006)\nDark Celebration (#17) (2006)\nDark Possession (#18) (2007)\nDark Curse (#19) (2008)\nDark Slayer (#20) (2009)\nDark Peril (#21) (2010)\nDark Predator (#22) (2011)\nDark Storm (#23) (2012)\nDark Lycan (#24) (2013)\nDark Wolf (#25) (2014)\n &lt;a href=&quot;\nhttp://www.christinefeehan.com/dark_series&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.christinefeehan.com/dark_series&lt;/a&gt;\n\nAuthor:\n\n#1 New York Times bestselling author Christine Feehan has over 40 novels published, including four series. Each of her four series has hit #1 on the NY Times Best-Seller List. Her debut novel Dark Prince received 3 of the 9 Paranormal Excellence Awards in Romantic Literature for 1999. Since then she has been published by Leisure Books, Pocket Books, and currently is writing for Berkley/Jove. She also has earned 7 more PEARL awards.\n","torrent":{"xt":"urn:btih:536f53c6aafc58bed63f08bdbbc402ff0a2c26d8","amp;dn":"Dark+%28Carpathians%29+Series+%231-25+Christine+Feehan+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"536f53c6aafc58bed63f08bdbbc402ff0a2c26d8","infoHashBuffer":{"type":"Buffer","data":[83,111,83,198,170,252,88,190,214,63,8,189,187,196,2,255,10,44,38,216]},"announce":[],"urlList":[]}}