{"title":"The Ocean Ecosystem, Lipsen - Marine Biology 9th, Castro","uid":15767799,"size":110116220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53bcd7dba7ce76d6dddf24ba5375a542a17b879f&amp;dn=The+Ocean+Ecosystem%2C+Lipsen+-+Marine+Biology+9th%2C+Castro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ritaline","files":1,"time":1473175854,"description":"This is a custom course edition of Castro and Hubers' Marine Biology Ninth Edition for EOSC 315 (Earth and Ocean Sciences) at the University of British Columbia.\r\n\r\n\r\n\r\n1. Chemical and Physical Features of Seawater and the World Ocean: Chapter 3 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t2 \r\n\r\n2. Fundamentals of Biology: Chapter 4 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t26 The Organisms of the Sea\t47 \r\n\r\n3. Note Pages: Instructor submitted material\t48 \r\n\r\n4. The Microbial World: Chapter 5 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t51 \r\n\r\n5. Multicellular Primary Producers: Seaweeds and Plants: Chapter 6 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t68 \r\n\r\n6. Marine Animals Without a Backbone: Chapter 7 from Marine Biology, Ninth Edition by Castro, Huber, 2013 81 \r\n\r\n7. Marine Fishes: Chapter 8 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t117 \r\n\r\n8. Marine Reptiles, Birds, and Mammals: Chapter 9 from Marine Biology, Ninth Edition by Castro, Huber, 2013 143 Structure and Function of Marine Ecosystems\t177 \r\n\r\n9. Note Pages: Instructor submitted material\t178 \r\n\r\n10. An Introduction to Marine Ecology: Chapter 10 from Marine Biology, Ninth Edition by Castro, Huber, 2013 181 \r\n\r\n11. Special Report: Our Changing Planet: Chapter from Marine Biology, Ninth Edition by Castro, Huber, 2013 201 \r\n\r\n12. Between the Tides: Chapter 11 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t214 \r\n\r\n13. Estuaries: Where Rivers Meet the Sea: Chapter 12 from Marine Biology, Ninth Edition by Castro, Huber, 2013 238 \r\n\r\n14. Life on the Continental Shelf: Chapter 13 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t257 \r\n\r\n15. Coral Reefs: Chapter 14 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t277 \r\n\r\n16. Life Near the Surface: Chapter 15 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t302 \r\n\r\n17. The Ocean Depths: Chapter 16 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t331 Humans and the Sea\t353 \r\n\r\n18. Resources from the Sea: Chapter 17 from Marine Biology, Ninth Edition by Castro, Huber, 2013\t355 \r\n\r\nA. Appendix: Units of Measurement: Chapter A from Marine Biology, Ninth Edition by Castro, Huber, 2013 379 \r\n\r\nB. Glossary: Chapter from Marine Biology, Ninth Edition by Castro, Huber, 2013\t380 \r\n\r\nC. Index: Chapter from Marine Biology, Ninth Edition by Castro, Huber, 2013 392","torrent":{"xt":"urn:btih:53bcd7dba7ce76d6dddf24ba5375a542a17b879f","amp;dn":"The+Ocean+Ecosystem%2C+Lipsen+-+Marine+Biology+9th%2C+Castro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53bcd7dba7ce76d6dddf24ba5375a542a17b879f","infoHashBuffer":{"type":"Buffer","data":[83,188,215,219,167,206,118,214,221,223,36,186,83,117,165,66,161,123,135,159]},"announce":[],"urlList":[]}}