{"title":"Design for Hackers (gnv64)","uid":7965533,"size":35913680,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:53c08582f96c8b64bf4d4cf83e863f070b03bdd8&amp;dn=Design+for+Hackers+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"gnv65","files":-1,"time":1356684189,"description":"Design for Hackers: Reverse Engineering Beauty \nby David Kadavy\nWiley | September 2011 | ISBN-10: 1119998956 | ePUB | 34.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Design-Hackers-Reverse-Engineering-Beauty/dp/1119998956&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Design-Hackers-Reverse-Engineering-Beauty/dp/1119998956&lt;/a&gt;\n\nIf you want to learn to create great design yourself...there simply is no way to do so with lists of rules. Instead, I want to provide you with a new set of eyes through which you can see the world anew.\nHackers are able to accomplish so much in so little time because they come from a community that's built upon sharing knowledge. When it comes to programming, they can learn whatever they need to learn by reading manuals, or simply typing in a Google search. But learning design isn't so simple.\nMany design books try to teach design through lists of &quot;do's&quot; and &quot;don'ts.&quot; But hackers know you need a deeper understanding of something to really do it well. Design for Hackers takes apart design by &quot;reverse-engineering&quot; Impressionist painting, Renaissance sculpture, the Mac OS X Aqua interface, Twitter's web interface, and much more. You'll learn about color theory, typography, proportions, and design principles. This theoretical advice is mixed with concrete, actionable advice such as suggestions for color scheme tools, and a chart of &quot;all of the fonts you'll ever need.&quot;\nIt's amazing what you can learn about great web design by asking questions like these. Award-winning designer David Kadavy uses this &quot;reverse-engineering&quot; process in Design for Hackers to deconstruct classical design principles and techniques for web designers. Using an eclectic array of reverse-engineered examples, ranging from Twitter's latest redesign, to Target's red shopping carts, and ancient graffiti from the walls of Pompeii, he explains:\n-    Color Theory: How can you enliven your designs by understanding how colors interact?\n-    Proportion and Geometry: How can you establish a grid that is suitable for the device on which your design with be displayed?\n-    Size and Scale: How can you create clean design just by choosing the right type sizes?\n-    White Space: How can you use it elegantly to communicate clearly?\n-    Composition and Design Principles: How can you use them to make your designs more compelling?\n-    Typographic Etiquette: What tiny typographic details can make a huge difference in what you're communicating?\nBy the end of the book, you'll be seeing design through new eyes.","torrent":{"xt":"urn:btih:53c08582f96c8b64bf4d4cf83e863f070b03bdd8","amp;dn":"Design+for+Hackers+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53c08582f96c8b64bf4d4cf83e863f070b03bdd8","infoHashBuffer":{"type":"Buffer","data":[83,192,133,130,249,108,139,100,191,77,76,248,62,134,63,7,11,3,189,216]},"announce":[],"urlList":[]}}