{"title":"Alternative Energy Technologies An Introduction with Computer Si","uid":11659641,"size":12003579,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:543b8ce5e5316a31237cee57e7b0f22a072bcf38&amp;dn=Alternative+Energy+Technologies+An+Introduction+with+Computer+Si&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"zombie_rox","files":1,"time":1417978021,"description":"Alternative energy sources are becoming increasingly important in a world striving for energy independence, clean air, and a reprieve from global warming. Solar cells, wind power, and biofuels are some of the competing alternative energy sources hoping to gain a foothold in our future energy mix, and the economic advantages of these technologies are continually increasing as costs are reduced and efficiencies increased.\n\nAlternative Energy Technologies: An Introduction with Computer Simulations explores the science and engineering behind a number of emerging alternative energy technologies, including polymer solar cells, algae biofuels, and artificial leaves. It also addresses the environmental need for these technologies. However, unlike its predecessors, this book employs simple computer models implemented within spreadsheet environments to simulate different aspects of the alternative energy technologies and therefore teach the subject matter.\n\nThis unique approach:\n\nProvides a dual introduction to alternative energy technologies and computer simulation\nElucidates the fundamental behaviors and complex interactions within the alternative energy systems\nMakes computer simulation straightforward and accessible to readers with no prior programming experience\n\nFeaturing investigative exercises that deepen understanding and inspire further research, Alternative Energy Technologies: An Introduction with Computer Simulations makes an ideal introductory textbook for undergraduate students and a valuable professional reference for experimental researchers.\n\nPublisher: CRC Press (December 19, 2014)\nLanguage: English\nISBN-10: 1482217031\nISBN-13: 978-1482217032\n\nEditorial Reviews\n\nAbout the Author\n\nGavin A. Buxton is assistant professor of physics in the Science Department at Robert Morris University, Moon Township, Pennsylvania, USA. Previously, he was visiting assistant professor at Case Western Reserve University, Cleveland, Ohio, USA; postdoctoral research associate at Durham University, UK; and postdoctoral research associate at University of Pittsburgh, Pennsylvania, USA. He holds an M.Sci in engineering physics (hons) and a Ph.D in computational physics from Sheffield Hallam University, UK. His work has been published in numerous prestigious journals and books including Soft Matter, Encyclopedia of Energy Engineering and Technology, Langmuir, and The Journal of Chemical Physics, among others","torrent":{"xt":"urn:btih:543b8ce5e5316a31237cee57e7b0f22a072bcf38","amp;dn":"Alternative+Energy+Technologies+An+Introduction+with+Computer+Si","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"543b8ce5e5316a31237cee57e7b0f22a072bcf38","infoHashBuffer":{"type":"Buffer","data":[84,59,140,229,229,49,106,49,35,124,238,87,231,176,242,42,7,43,207,56]},"announce":[],"urlList":[]}}