{"title":"Ken Kesey - One Flew Over the Cuckoo's Nest (retail epub, mobi)","uid":10494453,"size":774648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:54c2b13ef3e6b4eb0545a0cb0a43d373f54e988b&amp;dn=Ken+Kesey+-+One+Flew+Over+the+Cuckoo%27s+Nest+%28retail+epub%2C+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":4,"uploader":"pharmakate","files":-1,"time":1404591822,"description":"Ken Kesey - One Flew Over the Cuckoo's Nest: 50th Anniversary Edition (Viking, 1962, 2012).\n\nRetail quality epub, mobi.\n\n\nI think &quot;50th Anniversary Edition&quot; means it has a new cover. That's it.\n\n\ndescription:\n\nA fiftieth-anniversary edition of Ken Kesey's searing American classic.\n\nBoisterous, ribald, and ultimately shattering, Ken Kesey's One Flew Over the Cuckoo's Nest has left an indelible mark on the literature of our time. Turning conventional notions of sanity and insanity on their heads, the novel tells the unforgettable story of a mental ward and its inhabitants, especially tyrannical Big Nurse Ratched and Randle Patrick McMurphy, the brawling, fun-loving new inmate who resolves to oppose her. We see the story through the eyes of Chief Bromden, the seemingly mute half-Indian patient who witnesses and understands McMurphy's heroic attempt to do battle with the powers that keep them all imprisoned.\n\nHailed upon its publication as &quot;a glittering parable of good and evil&quot; (The New York Times Book Review) and &quot;a roar of protest against middlebrow society's Rules and the invisible Rulers who enforce them&quot; (Time), Kesey's powerful book went on to sell millions of copies and remains as bracing and insightful today as when it was first released. This new deluxe hardcover edition commemorates the fiftieth anniversary of the original publication of the novel on February 1, 1962, and will be a must have for any literature lover.\n\nFrom Library Journal\n\nKesey's new introduction to this anniversary edition could very well be the last thing he worked on before shuffling off this mortal coil in 2001. Additionally, 25 sketches he drew while working at a mental institution in the 1950s, the inspiration for the novel, are littered throughout. Critics are divided on the meaning of the book: Is it a tale of good vs. evil, sanity over insanity, or humankind trying to overcome repression amid chaos? Whichever, it is a great read. \n\nReview\n\n'Kesey can be funny, he can be lyrical, he can do dialogue, and he can write a muscular narrative. In fact there's not much better come out of America in the sixties... If you haven't already read this book, do so. If you have, read it again' SCOTSMAN","torrent":{"xt":"urn:btih:54c2b13ef3e6b4eb0545a0cb0a43d373f54e988b","amp;dn":"Ken+Kesey+-+One+Flew+Over+the+Cuckoo%27s+Nest+%28retail+epub%2C+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54c2b13ef3e6b4eb0545a0cb0a43d373f54e988b","infoHashBuffer":{"type":"Buffer","data":[84,194,177,62,243,230,180,235,5,69,160,203,10,67,211,115,245,78,152,139]},"announce":[],"urlList":[]}}