{"title":"WinfaxPro 10.04 The best PC fax software ever made! XP/win95","uid":5143802,"size":58309917,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:567599f4f18fcbcd6b1c16c6eb3bf8dae8a71878&amp;dn=WinfaxPro+10.04+The+best+PC+fax+software+ever+made%21+XP%2Fwin95&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257102561,"description":"WinfaxPro is the best faxing software ever made. We have used it for decades and have sent tens of thousands of faxes and even set up various businesses and cultural institutions to make use of it over the years.\n\nThose who have had complaints of it have only been so as a reult of using non compatible modem settings. You get the desired results by using &quot;US Robotics&quot; compatible mode so please ensure you have a competent internal or external modem\nfor this great software creation. They cost a reasonable sum and can be purchased \nlocally or on ebay certainly from perhaps ten USDollars and up. (In Toronto anyways).\n\nThis version was modified with a patch for XP (the previous version 10.02 was for Windows 95 instead). However it does work with Win95 if need be (see the readme.txt file for installation notes).\n\nIt integrates with Microsoft Outlook 2000/2003 phone books and contact lists to send mass faxes to groups and or individuals in beautiful style as it manages the entire campaign with great professionalism.\n\nYou need to enable &quot;show as an e-mail address book&quot; feature in each list within &quot;properties&quot; of each sublisting within MS Outlook master database in order to see the listings available to you when you are ready to fax. Install Winfax after outlook and indicate &quot;enable integration&quot; when installing.\n\nWinfaxPro installs itself as a &quot;printer&quot; in your Windows installation so that when you want to fax rather than print, its as easy as following the same procedure as doing a print, in fact!\n\nApparently Symantec is abandoning this software thats been around for decades in\nvarious versions, as they are getting tired of still explaining the modem \ncompatibility needs to everyone involved. How sad that is. We intend to get this \nsoftware out of the garbage can and instead bundle it for free wth our intended \npublic domain release of a revamped XP!\n\nwith compliments!\n\nMichael Rizzo Chessman \n\n\n\n","torrent":{"xt":"urn:btih:567599f4f18fcbcd6b1c16c6eb3bf8dae8a71878","amp;dn":"WinfaxPro+10.04+The+best+PC+fax+software+ever+made%21+XP%2Fwin95","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"567599f4f18fcbcd6b1c16c6eb3bf8dae8a71878","infoHashBuffer":{"type":"Buffer","data":[86,117,153,244,241,143,203,205,107,28,22,198,235,59,248,218,232,167,24,120]},"announce":[],"urlList":[]}}