{"title":"My.Kitchen.Rules.s06e17.WS.PDTV.x264.BF1.mkv","uid":11723344,"size":641413436,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:568e8b2a6e81ae0cdb7d5010d9fe562980610312&amp;dn=My.Kitchen.Rules.s06e17.WS.PDTV.x264.BF1.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"bigfish5","files":1,"time":1424911733,"description":"My Kitchen Rules Australia Series 6 Episode 17\n\nTwo teams have been sent packing from the competition already and now a curveball could throw them all off their game. Hosted by Pete Evans and Manu Feildel.\n\nWill and Steve New South Wales\nWe focus on the old school dishes that we grew up with. \nBritish lads Will and Steve both moved to Sydney in the same month, to work for the same investment company, but it wasn't until Steve shared his gourmet tuna sandwich in the office kitchen with Will that they become friends.\n&quot;Everybody else just makes a ham and cheese sandwich,&quot; says Will. &quot;But Steve's there with the fine ingredients, the ciabattas, the olives and capers. It was an amazing gourmet sandwich.&quot;\nThat sandwich started a conversation about their broader love of food and cooking. And soccer.\n&quot;He got me into the football team. But I'm rubbish at football,&quot; says Will.\nAnd as luck would have it, they were both made redundant at the same time. Even redundancy can have a silver lining because without it they probably would not have applied for My Kitchen Rules.\nEssex boy Steve, 31, hasn't spent all of his unemployed days surfing. Many of them have been cooking up a storm and experimenting in the kitchen.\n&quot;For me, (redundancy) was exactly what I wanted. I decided I could no longer sit in an office job doing the stuff I was doing,&quot; admits Steve. &quot;It was just a means to an end to travel and earn enough money to have a nice life.\nI realised how much I want to cook and get into the food industry. All my ideas revolve around the food industry and I thought I owed it to myself to give it a crack.&quot;\nSo he dragged his mate Will, 36, along for the MKR ride. Will, who has been doing some volunteering work with Oz Harvest since losing his job, has also taken over the cooking more fulltime at home.\nWhile he started cooking at the age of 12 with a little guidance from his grandparents to perfect English dishes such as shepherd's pie, nowadays he strays into a lot of slow cooking Iranian style thanks to his wife's heritage.\n&quot;I cook a lot of lamb because in the Iranian culture they eat a lot of lamb. I've obviously learned a lot from her family, what they eat and the sort of flavours and spices they use. And lots of slow cooking,&quot; says Will.\nSteve credits watching cooking programs as a child for helping him to learn to cook. With his parents working long hours in their own business, it often fell to him to prepare dinners.\n&quot;Often if I didn't get dinner on then we wouldn't be eating to 9-10pm so my mum would just talk me through the processes and I'd get it all going. I never minded; it was something I actually enjoyed,&quot; he says.\nTheir experience together in the kitchen is, however, limited to making sandwiches at work.\nBut self-appointed head chef Steve is eager to teach his sous chef everything he knows to get them far in the competition","torrent":{"xt":"urn:btih:568e8b2a6e81ae0cdb7d5010d9fe562980610312","amp;dn":"My.Kitchen.Rules.s06e17.WS.PDTV.x264.BF1.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"568e8b2a6e81ae0cdb7d5010d9fe562980610312","infoHashBuffer":{"type":"Buffer","data":[86,142,139,42,110,129,174,12,219,125,80,16,217,254,86,41,128,97,3,18]},"announce":[],"urlList":[]}}