{"title":"Condannato a morte [DVDrip ITA] TNT Village","uid":5598889,"size":726941696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:569ab805d4873b9a446be536cc97a4bde467b3bd&amp;dn=Condannato+a+morte+%5BDVDrip+ITA%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"l.diliberto","files":1,"time":1275175043,"description":" &lt;a href=&quot;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=26494&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=26494&lt;/a&gt;\n\nUn condannato a morte riceve la visita di una suora; il suo caso ÃƒÂ¨ disperato, manca poco al giorno dell'esecuzione. Matthew Poncelet, insieme ad un suo complice, avrebbe ucciso una coppia di giovani fidanzati sorpresi in un boschetto e lo avrebbe fatto con una ferocia inaudita, dopo aver violentato la ragazza. Continua a professarsi innocente e scarica tutta la responsabilitÃƒÂ  sul presunto complice, che &quot;se l'ÃƒÂ¨ cavata&quot; con l'ergastolo. La suora, pur nutrendo da subito sospetti sulla dichiarazione di innocenza del giovane condannato, fa di tutto per rinviare il giorno dell'esecuzione, in attesa di un riesame del caso. Tutti i tentativi sono vani. Non bastasse questo, Suor Helen, per nulla aiutata dal condannato stesso, che in una intervista televisiva si dichiara razzista e terrorista, deve anche subire l'ira dei genitori dei ragazzi trucidati che si sentono beffati dal tanto interesse che lei riserva ad un assassino piuttosto che alle vittime dei suoi crimini. Si aggiunga poi a tutto questo il poco apprezzamento della famiglia di Helen per tutta la vicenda, e il fatto che le povere bambine nere delle quali normalmente si occupava a tempo pieno, ora la scansano in quanto amica di un loro nemico...\n\nTitolo originale: Dead Man Walking\nNazionalitÃƒÂ : USA\nAnno: 1995\nGenere: Drammatico\nRegia: Tim Robbins\nProduzione: Jon Kilik,Tim Robbins, Rudd Simmons per Havoc - Polygram Filmed Entertainment - Working Title Films\nDistribuzione: Uip (1996) - Rcs Films &amp; Tv\nData di uscita: 1996\nCast: Susan Sarandon (Suor Helen Prejean) Sean Penn (Matthew Poncelet)\nRobert Prosky (Hilton Barber) Lois Smith (Madre Di Helen)\nR. Lee Ermey (Clyde Percy) Jon Abrahams (Sonny Ponchelet)\nEva Amurri (Helen A 9 Anni) Ray Aranha (Luis Montoya)\nRaymond Barry (Earl Delacroix) Jack Black (Craig Poncelet)\nNesbitt Blaisdell (Secondino Hartman) Steve Boles (Serg. Neal Trapp)\nArthur Bridgers (Troy Poncelet) Clancy Brown (Agente Di Polizia)\nSteve Carlisle (Fratello Di Helen) Kevin Cooney (Governatore Benedict)\nMichael Cullen (Carl Vitello) Helen Hester (Sorella Di Helen)\nBarton Heyman (Capitano Beliveau) Jenny Krochmal (Emily Percy)\nMargo Martindale (Suor Colleen) Roberta Marxwell (Lucille Poncelet)\nLarry Pine (Guy Gilardi) Adele Robbins (Infermiera)\nGil Robbins (Vescovo Norwich) Peter Sarsgaard (Walter Delacroix)\nCelia Weston (Mary Beth Percy) Scott Wilson (Cappellano Farley)\nMissy Yager (Hope Percy)\n\nDimensione: 693 mb\nDurata: 1 h, 57 m, 4 s (175,599 fr)\n\nVideo Codec: DivX 3 Low-Motion\nVideo Bitrate: 694 kb/s\nRisoluzione: 544x304 (1.79:1) [=34:19]\nFPS (Frames/sec):25.000\nQF (Frame quality): 0.168 bits/pixel\n\nAudio Codec: 0x0055(MP3) ID'd as MPEG-2 Layer 2\nAudio Bitrate: 128 kb/s (64/ch, stereo) VBR\nFreq Audio: 44100 Hz","torrent":{"xt":"urn:btih:569ab805d4873b9a446be536cc97a4bde467b3bd","amp;dn":"Condannato+a+morte+%5BDVDrip+ITA%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"569ab805d4873b9a446be536cc97a4bde467b3bd","infoHashBuffer":{"type":"Buffer","data":[86,154,184,5,212,135,59,154,68,107,229,54,204,151,164,189,228,103,179,189]},"announce":[],"urlList":[]}}