{"title":"Billy Jack Collection","uid":5097330,"size":2865009286,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:56a2afa123db517a5bd8ed164fd182c187e02b04&amp;dn=Billy+Jack+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Bigfoot420","files":4,"time":1253687847,"description":"Born Losers:\n\n\nA malicious motorcycle gang harasses the residents of a small California town, intimidating most residents to not report them to the police. Among the gang's crimes is the rape of four young women. As the gang attempts to threaten the women into not testifying at the indictment hearing, one of the women, Vicki, comes under the protection of Billy Jack, who has also had several altercations with the gang. The gang escalates their pressure on both Vicki and Billy Jack to keep her out of the courtroom.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0061420/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0061420/&lt;/a&gt;\n\n\nBilly Jack:\n\n\nBilly Jack is a half-Indian/half-white ex-Green Beret who is being drawn more and more toward his Indian side. He hates violence, but can't get away from it in the white man's world. Pitting the good guys, the students of the peace-loving free-arts school in the desert vs. the conservative bad guys in the near-by town, the movie plays definitive late-60s themes/messages: anti-establishment, make love not war, the senseless slaughter of God's creatures, the rape of society (figuratively and literally), two-sided justice, racial segregation and prejudices, and basic socialist ideals.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0066832/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0066832/&lt;/a&gt;\n\n\nThe Trial of Billy Jack:\n\n\nAfter Billy Jack in sentenced to four years in prison for the &quot;involuntary manslaughter&quot; of the first film, the Freedom School expands and flourishes under the guidance of Jean Roberts. The utopian existence of the school is characterized by everything ranging from &quot;yoga sports&quot; to muckracking journalism. The diverse student population airs scathing political exposes on their privately owned television station. The narrow-minded townspeople have different ideas about their brand of liberalism. Billy Jack is released and things heat up for the school. Students are threatened and abused and the Native Americans in the neighboring village are taunted and mistreated. After Billy Jack undergoes a vision quest, the governor and the police plot to permanently put an end to their liberal shenanigans, leaving it up to Billy Jack to save the day.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0072317/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0072317/&lt;/a&gt;\n\n\nBilly Jack Goes to Washington:\n\n\nAfter a senator suddenly dies after completing (and sealing) an investigation into the nuclear power industry, the remaining senator and the state governor must decide on a person who will play along with their shady deals and not cause any problems. They decide on Billy Jack, currently sitting in prison after being sent to jail at the end of his previous film, as they don't expect him to be capable of much, and they think he will attract young voters to the party. Billy is pardoned, released and nominated, after which he begins his duties. He soon notices that things aren't right, and starts trying to find out just what is going on.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0075754/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0075754/&lt;/a&gt;\n\n\nHope You Enjoy Them :)\n\n\n","torrent":{"xt":"urn:btih:56a2afa123db517a5bd8ed164fd182c187e02b04","amp;dn":"Billy+Jack+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56a2afa123db517a5bd8ed164fd182c187e02b04","infoHashBuffer":{"type":"Buffer","data":[86,162,175,161,35,219,81,122,91,216,237,22,79,209,130,193,135,224,43,4]},"announce":[],"urlList":[]}}