{"title":"Sexually Broken--Jennifer White Helplessly bound, deep throated ","uid":7989915,"size":1249873325,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:56fbbc1904123152570718e65d6bdf0c88de58e1&amp;dn=Sexually+Broken--Jennifer+White+Helplessly+bound%2C+deep+throated+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"merzedes","files":-1,"time":1357346608,"description":"Jennifer White Helplessly bound, deep throated, fucked, finger blasted to massive squirting orgasms | Jennifer White | Matt Williams\n\nJanuary 4, 2013 \n \n\nMP4 only\n   \n \nWelcome the beautiful Jennifer White to the pages of Sexually Broken. Jennifer has an all natural body, bit tits, amazing ass and the cutest most innocent smile you will ever see. \n\nThis is our Meet and Greet, our first time working with Jennifer. We do all the bondage and tying on screen, there is really no plan, the scene just evolves before your eyes. The most realistic Bondage and sex you will ever see, no acting no script.\n\nWe start by binding her wrist together and pulling them above her head stretching her out and pulling her to her toes. We roughly grope her hot helpless body, spread her legs and vibrate her to near orgasm. We don't let her cum yet, we are saving that for the squirt fest to follow. \n\nWe untie her wrists and pull the rope through her legs in front, making a tight crotch rope. If she tries to move the rope burns into her delicate pussy. We knock her to her knees and fuck her beautiful face deep and hard. With her hand trapped by her pussy, she can't move her hands an inch as we skull fuck her. We fuck that pretty face over and over, jamming it balls deep, cutting off her ability to breath. We control when she breaths with hard cock. She struggles but her throat takes it, she is amazing.\n\nWe bring in a chair and bind her to it so she is in the ultimate fuck me position. We vibrate and tease her pussy, she wants to cum so bad, but she is denied her orgasms. She needs it, we tease. When we think she might go insane we finger blast her to the largest squirting screaming orgasm we have ever filmed. The squirt goes flying many feet into the air and rains down like heavenly ambrosia. We make Jennifer squirt and cum over and over. In the end we leave her lying in her own cum, soaked and exhausted... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_04jwhite/SexuallyBroken-Jennifer-White-Matt-Williams-Jennifer-White-Helplessly-bound-deep-throated-fucked-finger-blasted-to-massive-squirting-orgasms.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/01_04jwhite/SexuallyBroken-Jennifer-White-Matt-Williams-Jennifer-White-Helplessly-bound-deep-throated-fucked-finger-blasted-to-massive-squirting-orgasms.php&lt;/a&gt;\n\n9000 uploads and counting, 10k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:56fbbc1904123152570718e65d6bdf0c88de58e1","amp;dn":"Sexually+Broken--Jennifer+White+Helplessly+bound%2C+deep+throated+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56fbbc1904123152570718e65d6bdf0c88de58e1","infoHashBuffer":{"type":"Buffer","data":[86,251,188,25,4,18,49,82,87,7,24,230,93,107,223,12,136,222,88,225]},"announce":[],"urlList":[]}}