{"title":"The Atlantis Plague - A Thriller - Riddle, A.G [ePub] - Traitor","uid":9580931,"size":546801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:57239ad0572bdbdb1f563cbfe4213a4ced7c86ad&amp;dn=The+Atlantis+Plague+-+A+Thriller+-+Riddle%2C+A.G+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Xetron","files":1,"time":1391765937,"description":"A PANDEMIC 70,000 YEARS IN THE MAKING...\nWILL CHANGE HUMANITY...\nFOREVER.\n__________________________________________________________________\n\nIn Marbella, Spain, Dr. Kate Warner awakens to a horrifying reality: the human race stands on the brink of extinction. A pandemic unlike any before it has swept the globe. Nearly a billion people are dead--and those the Atlantis Plague doesn't kill, it transforms at the genetic level. A few rapidly evolve. The remainder devolve.\n\nAs the world slips into chaos, radical solutions emerge. Industrialized nations offer a miracle drug, Orchid, which they mass produce and distribute to refugee camps around the world. But Orchid is merely a way to buy time. It treats the symptoms of the plague but never actually cures the disease.\n\nImmari International offers a different approach: do nothing. Let the plague run its course. The Immari envision a world populated by the genetically superior survivors--a new human race, ready to fulfill its destiny.\n\nWith control of the world population hanging in the balance, the Orchid Alliance and the Immari descend into open warfare. Now humanity's last hope is to find a cure, and Kate alone holds the key to unraveling the mystery surrounding the Atlantis Plague. The answer may lie in understanding pivotal events in human history--events when the human genome mysteriously changed. Kate's journey takes her across the barren wastelands of Europe and northern Africa, but it's her research into the past that takes her where she never expected to go. She soon discovers that the history of human evolution is not what it seems--and setting it right may require a sacrifice she never imagined.\n__________________________________________________________________\n\n&quot;The human race must remain as one. All other roads lead to ruin.&quot;\n- The Orchid Alliance\n\n&quot;Evolution is inevitable. Only fools fight fate.&quot;\n- Immari International\n__________________________________________________________________\n\nABOUT:\nTHE ATLANTIS PLAGUE is a story of human survival and perseverance in the face of extinction. This global adventure takes readers back into the world of The Origin Mystery, which began with A.G. Riddle's debut sci-fi thriller, THE ATLANTIS GENE. THE ATLANTIS PLAGUE delivers the same kind of little-known science and history readers applauded in THE ATLANTIS GENE and deepens the core mystery many can't stop talking about.\n\nNOTE:\nThe Atlantis Plague is the second book in A.G. Riddle's Origin Mystery Series. Readers are strongly advised to read The Atlantis Gene (Book 1) before &quot;infecting themselves&quot; with the plague. In this series, it seems, it's survival of those who read the first book. :)","torrent":{"xt":"urn:btih:57239ad0572bdbdb1f563cbfe4213a4ced7c86ad","amp;dn":"The+Atlantis+Plague+-+A+Thriller+-+Riddle%2C+A.G+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57239ad0572bdbdb1f563cbfe4213a4ced7c86ad","infoHashBuffer":{"type":"Buffer","data":[87,35,154,208,87,43,219,219,31,86,60,191,228,33,58,76,237,124,134,173]},"announce":[],"urlList":[]}}