{"title":"Hogs Of War( PC GAME)","uid":4279382,"size":37726205,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:57d1a2e7a02d800bd98b515aedecc671050dee70&amp;dn=Hogs+Of+War%28+PC+GAME%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"kingswoodtown","files":1,"time":1215342076,"description":"Hogs Of War( PC GAME)  Install and play\n\n\nLocated smack in the middle of the Pigsific Ocean lies an island continent known as Saustralasia, a land rich in both resources and culture. Unfortunately, six rival nations find themselves locked in a bitter power struggle for sole control of the region, pulling the continent into the depths of war. Cross Worms with Army Men and swap the plastic soldiers for pigs, and you have the premise behind Infogrames&amp;#039; Hogs of War, a 3D turn-based war simulation. \n\nHogs of War offers two main gameplay modes: a single-player campaign and multiplayer deathmatch. In the single-player campaign, you start from the ground up, siding with a nation, enlisting its troops, and progressing through a series of 25 increasingly difficult missions until victory is achieved. Along the way, you&amp;#039;ll earn promotion points, which you can use to improve your troops, as well as acquire a number of painful weapons. On the flipside is the multiplayer mode, which is where the game&amp;#039;s true beauty lies. While there&amp;#039;s a certain satisfaction attained by defeating a CPU opponent, nothing beats taking on three of your closest friends in a series of random piggy skirmishes. With team choice, weapon distribution, and even level design as user-defined variables, Hogs of War literally has limitless replay value. \n\nStill, you might have noticed that the aforementioned paragraph didn&amp;#039;t exactly tout the virtues of the game&amp;#039;s single-player mode. There&amp;#039;s a good reason for this: the single-player mode is dull, tedious, dreary, and uninteresting. The number of levels is fine, and each of the six continent portions is diverse, but the overall pacing worsens as time goes on. For the first five levels, you&amp;#039;re acquiring new weapons, promoting your men, and otherwise having a nice time. Past that point, however, promotions become scarce, weapon diversity drops, and mission parameters begin to border on obtuse. It&amp;#039;s one thing to have to capture a series of bridges or sneak into an enemy base, but it&amp;#039;s quite another to end up on a collection of tiny islands surrounded by mine fields while the enemy sits atop high ground with mortars. So the first ten levels fly by, while the latter 15 may take you days, even weeks to complete - not because they&amp;#039;re tough, but because they induce massive amounts of boredom along the way. \n\nCompounding the game&amp;#039;s pacing problem, Hogs of War&amp;#039;s graphics do nothing to elicit inspiration or excitement for the task at hand. Due to the subject matter, one could say that the game is aimed at younger audiences, but even that doesn&amp;#039;t account for how bland and primitive Hogs of War&amp;#039;s visuals are. The pigs themselves are adequate, smiling and cowering with a unique aura of cartoon-inspired hilarity, but the background environments and standing structures constantly distract with their blocky, jagged, and choppy appearances. Additionally, the hills, valleys, trenches, islands, and bridges in Hogs of War don&amp;#039;t even live up to the baseline visual standards set by 3DO&amp;#039;s Army Men series, instead resembling earlier PlayStation efforts such as Warhawk or Assault Rigs. \n\nOther than the aforementioned single-player pacing issues and the subpar visuals, Hogs of War does have a lot going for it. First, the weapon diversity is astounding. Your pigs can follow one of four career paths, enabling them to carry up to 15 weapons, most of which are exclusive to their profession. Furthermore, as you&amp;#039;re promoted, you&amp;#039;ll enhance your arsenal with even stronger weapons, which then become available in multiplayer as well. Rifles, grenades, shrapnel mines, air strikes, gas grenades, rocket launchers, gun turrets, and cannons are just a few of the many, many weapons at your disposal. Adding to this diversity, the game&amp;#039;s sound effects are just drop-dead funny. Similar to Worms, when one of the hogs attacks another, gets killed, or otherwise has something to say, they&amp;#039;ll let loose with a witty catch phrase or retort. Hearing a pig utter &quot;This one&amp;#039;s for Uncle fricken&amp;#039; Sam&quot; with a Bronx accent is nothing short of sidesplitting. \n\nFlat out, Hogs of War just isn&amp;#039;t a game to respect for its single-player offerings. The pacing is such that only younger gamers will have the wherewithal to complete all six campaigns, and they&amp;#039;ll likely have no interest in repeating the task once they&amp;#039;ve finished. However, the game&amp;#039;s multiplayer aspects successfully redeem the game. With four people joining in, the number of onscreen explosions, pig-speech comments, and all-around nuttiness nearly lifts the game into the same sphere of quality as Worms or Bomberman. In short, if you own a Multitap, you could be in for some fun times.","torrent":{"xt":"urn:btih:57d1a2e7a02d800bd98b515aedecc671050dee70","amp;dn":"Hogs+Of+War%28+PC+GAME%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d1a2e7a02d800bd98b515aedecc671050dee70","infoHashBuffer":{"type":"Buffer","data":[87,209,162,231,160,45,128,11,217,139,81,90,237,236,198,113,5,13,238,112]},"announce":[],"urlList":[]}}