{"title":"The Secrets of Quantum Physics - 1. Einstein's Nightmare HDTV x2","uid":12139582,"size":355842055,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:57fa3fb107f416c72c9f26e37ee05a5337c7b2ec&amp;dn=The+Secrets+of+Quantum+Physics+-+1.+Einstein%27s+Nightmare+HDTV+x2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"marxph","files":2,"time":1437318575,"description":"The Secrets of Quantum Physics[/i][/b] follows Professor Jim Al-Khalili as he investigates the most accurate and yet perplexing scientific theory - quantum theory. It was at the beginning of the 20th century, scientists were led into the hidden workings of matter. They had discovered a realm where things can be in many places at once- chance and probability call the shots and reality appears to only truly exist when we can observe it. \n\nEpisode 1 of 2 - Einstein's Nightmare:\n\nProfessor Jim Al-Khalili traces the story of arguably the most important, accurate and yet perplexing scientific theory ever - quantum physics.\n\nThe story starts at the beginning of the 20th century with scientists trying to better understand how light bulbs work. This simple question led them deep into the hidden workings of matter, into the sub-atomic building blocks of the world around us. Here they discovered phenomena unlike any encountered before - a realm where things can be in many places at once, where chance and probability call the shots and where reality appears to only truly exist when we observe it.\n\nAlbert Einstein hated the idea that nature, at its most fundamental level, is governed by chance. Jim reveals how, in the 1930s, Einstein thought he'd found a fatal flaw in quantum physics because it implies that sub-atomic particles can communicate faster than light in defiance of the theory of relativity.\n\nFor thirty years his ideas were ignored. Then in the 1960s a brilliant scientist from Northern Ireland called John Bell showed there was a way to test if Einstein was right and quantum mechanics was actually mistaken. In a laboratory in Oxford, Jim repeats this critical experiment - does reality really exist or do we conjure it into existence by the act of observation.\n\nThe results are shocking!\n\n===================================================================================\nSource.......: HDTV\nSize.........: 339MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:57fa3fb107f416c72c9f26e37ee05a5337c7b2ec","amp;dn":"The+Secrets+of+Quantum+Physics+-+1.+Einstein%27s+Nightmare+HDTV+x2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57fa3fb107f416c72c9f26e37ee05a5337c7b2ec","infoHashBuffer":{"type":"Buffer","data":[87,250,63,177,7,244,22,199,44,159,38,227,126,224,90,83,55,199,178,236]},"announce":[],"urlList":[]}}