{"title":"Dirty Sanchez:The Movie(2007)DVDRip.AC3(ENG)-DROCK","uid":6228768,"size":732902653,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:587b1b6c67cf300b82ed52674051780b404dbbdc&amp;dn=Dirty+Sanchez%3AThe+Movie%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"drock232","files":-1,"time":1299620841,"description":"MTV Films Europe and Vertigo Films partner to bring the Jackass-flavored MTV Europe series to the screen as director Jim Hickey follows a group of four daredevils who are challenged by the devil to discover and endure the seven deadly sins. A raunchy world tour of depravity and hilarity, Dirty Sanchez: The Movie combines the extreme stunts of Johnny Knoxville and company with a narrative structure by telling the tale of a stunt gone horribly awry. When an attempt to crash a car through a caravan results in the death of Dainton, Joycey, Pancho, and Pritchard, the fearless foursome are sent straight into deepest depths of hell. It seems that Satan wants to check their credentials before they are allowed to carry on with their reckless lifestyles, and now in order to return to their familiar plane of reality they must embark on a global tour of sin and debauchery. From confronting &quot;anger&quot; in Moscow to greeting &quot;gluttony&quot; in San Miguel and challenging &quot;lust&quot; in Bangkok, the boys all set out to greet and conquer the very sins that mankind has struggled against since the beginning of time. If they win, their prize is immortality and global domination; if they lose, they must bend to the will of Satan himself. With such stomach turning stunts as beer enema shotguns and liposuction drinking games, Dirty Sanchez: The Movie is not for the faint of heart. \n\nRipped with Handbrake.\n\nLength: 1 Hour 34 Minutes\n\nFile Type: MP4","torrent":{"xt":"urn:btih:587b1b6c67cf300b82ed52674051780b404dbbdc","amp;dn":"Dirty+Sanchez%3AThe+Movie%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"587b1b6c67cf300b82ed52674051780b404dbbdc","infoHashBuffer":{"type":"Buffer","data":[88,123,27,108,103,207,48,11,130,237,82,103,64,81,120,11,64,77,187,220]},"announce":[],"urlList":[]}}