{"title":"udemy - Become A Web Developer From Scratch!","uid":10973087,"size":2375712473,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:58adda671ea4720e72e1ef6c2a86ae4c8d1e81e6&amp;dn=udemy+-+Become+A+Web+Developer+From+Scratch%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"NepsterJay","files":231,"time":1409816931,"description":"Ever wondered how Mark Zuckerberg created Facebook or how Jack Dorsey built Twitter?\n\nWell, with &quot;Become A Web Developer From Scratch&quot;, you will learn everything about Web Development, even if you've never programmed before!\nThis incredible course has more than 240 lectures, divided into 8 chapters. Each chapter will give you a new level of knowledge in Web Development. We'll start from the basics with HTML, XHTML, CSS and Javascript to more advanced and the most popular/requested programming languages nowadays, such as PHP, XML, jSON, AJAX, jQuery the MySQL database and HTML5+CSS3!\n\nAt the end of each chapter or &quot;level&quot;, I will show you how to create a simple application using the languages you've learned so far. The source code of each final project will be available for you to download as well. You will also have exercises for each chapter as well as pdf manuals and reference guides.\n&quot;Become a Web Developer from Scratch&quot; will give you a new perspective on how the Internet works and after you completed the course you will be able to create your own websites and apps with the latest technology. Hope you enjoy!","torrent":{"xt":"urn:btih:58adda671ea4720e72e1ef6c2a86ae4c8d1e81e6","amp;dn":"udemy+-+Become+A+Web+Developer+From+Scratch%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58adda671ea4720e72e1ef6c2a86ae4c8d1e81e6","infoHashBuffer":{"type":"Buffer","data":[88,173,218,103,30,164,114,14,114,225,239,108,42,134,174,76,141,30,129,230]},"announce":[],"urlList":[]}}