{"title":"The Skeptic's Annotated Bible by Steve Wells","uid":9653250,"size":2251248,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58b8c29a783ad519622784bd6272c2631ccc0b77&amp;dn=The+Skeptic%27s+Annotated+Bible+by+Steve+Wells&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"PirateBook","files":1,"time":1393130344,"description":"\n&quot;Finally, Wells has published his famous online resource in book form. This volume belongs in every thinking person's library - and in every hotel room in America...&quot; --Sam Harris, author of the New York Times bestsellers The End of Faith, Letter to a Christian Nation, The Moral Landscape, and Free Will.\n\nREVIEWS:\n\n&quot;A stunning achievement ... I have an entire bookshelf of bibles and biblical commentaries, concordances, appendices, and the like, but the SAB is by far the best tool for biblical research I have ever come across.&quot; --Dr. Michael Shermer, Founding Publisher of Skeptic magazine and Executive Director of the Skeptics Society.\n\n&quot;I've been waiting for this book for my entire life! Finally, the Bible with organized notes and critique - pointing out the profane, the craziness, the tribalism, the murder, the incestuous episodes, and the beautiful and the sublime. All in one book!&quot; --Julia Sweeney, writer and performer of &quot;Letting Go of God&quot; and &quot;God Said Ha!&quot; and the book, If It's Not One Thing, It's Your Mother.\n\n&quot;The Skeptic's Annotated Bible offers an invaluable presentation of the bible that doesn't hide the cruelties, contradictions, absurdities, misogyny, and everything else that makes the 'Good Book' bad. It is an indispensable resource and the only book I keep on my desk.&quot; --Dr. Peter Boghossian, Dept. of Philosophy, Portland State University. Author of: A Manual for Creating Atheists.\n\nGenre: Non-Fiction/General\n","torrent":{"xt":"urn:btih:58b8c29a783ad519622784bd6272c2631ccc0b77","amp;dn":"The+Skeptic%27s+Annotated+Bible+by+Steve+Wells","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58b8c29a783ad519622784bd6272c2631ccc0b77","infoHashBuffer":{"type":"Buffer","data":[88,184,194,154,120,58,213,25,98,39,132,189,98,114,194,99,28,204,11,119]},"announce":[],"urlList":[]}}