{"title":"True Crime Online - Shocking Stories Of Scamming, Stalking, Murd","uid":9593268,"size":5204625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58ca70ced919840b076b2d145866cb06af0079a9&amp;dn=True+Crime+Online+-+Shocking+Stories+Of+Scamming%2C+Stalking%2C+Murd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1391957129,"description":"True Crime Online: Shocking Stories of Scamming, Stalking, Murder, and Mayhem by J. A. Hitchcock\n\n\nFormat: mobi/epub/azw3\nLength: 176 pages\nGenre: Non-Fiction/Internet/True Crime\nDate: 1 January 2013\n\nThis new book by a top cybercrime expert and victim?s advocate explores horrific real-life crimes with roots in cyberspace. Author J. A. Hitchcock (Net Crimes &amp; Misdemeanors) is celebrated for her work to pass tough cybercrime legislation, train law enforcement, and help victims fight back. In True Crime Online, she journeys into the darkest recesses of the internet to document the most depraved criminals imaginable, from bullies and stalkers to scam artists, sexual predators, and serial killers. \n\nThis collection of real-life horror stories is a must-read for true crime aficionados and fans of such television fare as 48 Hours Mystery, Forensic Files, and the Investigation Discovery channel. Guaranteed to shock and entertain, you'll never think about your online &quot;friends&quot; the same way again! \n\nAuthor:\n\nJ. A. Hitchcock is an internationally recognized cybercrime expert and the author of &quot;Net Crimes &amp; Misdemeanors: Outmaneuvering Web Spammers, Stalkers, and Con Artists.&quot; She has appeared as a contributor to episodes of &quot;48 Hours,&quot; &quot;America's Most Wanted,&quot; &quot;Good Morning America,&quot; &quot;&quot;and &quot;Primetime.&quot; She lives in York, Maine. ","torrent":{"xt":"urn:btih:58ca70ced919840b076b2d145866cb06af0079a9","amp;dn":"True+Crime+Online+-+Shocking+Stories+Of+Scamming%2C+Stalking%2C+Murd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58ca70ced919840b076b2d145866cb06af0079a9","infoHashBuffer":{"type":"Buffer","data":[88,202,112,206,217,25,132,11,7,107,45,20,88,102,203,6,175,0,121,169]},"announce":[],"urlList":[]}}