{"title":"The Interesting History Of Income Tax - William J. Federer","uid":11715252,"size":637641,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5955495e11d5c4772e5496846af810c5fc1b6f7c&amp;dn=The+Interesting+History+Of+Income+Tax+-+William+J.+Federer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"starxteel","files":1,"time":1424540236,"description":"\n The Interesting History of Income Tax William J. Federer &quot;The only things certain are death and taxes&quot; - Benjamin Franklin Yet few know America's interesting history of Income Tax, such as: *1787 - U.S. Constitution prohibited a &quot;direct&quot; Federal tax *1862 - &quot;Revenue Tax&quot; on incomes went into effect to finance the Union during the Civil War *1895 - Supreme Court made Income Tax unconstitutional *Woodrow Wilson thought tariffs on imports caused wars, so he worked to replace them with an Income Tax. *1913 - Income Tax was only a 1% tax on the top 1% richest people in America. *1943 - Paycheck Withholding began as an emergency effort to get funds to finance WWII. John F. Kennedy - &quot;Lower rates of taxation will stimulate economic activity and so raise the levels of personal and corporate income as to yield within a few years an increased flow of revenues to the Federal Government.&quot; (Annual Budget Message, Jan. 17, 1963) Thomas Jefferson - &quot;It is an encouragement to proceed as we have begun in substituting economy for taxation&quot; (2nd Annual Message, 1802) (176 pages, includes pictures)\n\nAbout the author:\nWilliam J. Federer is an American writer, and former evangelical pastor.\nFederer was born October 1, 1957, and raised in south St. Louis, Missouri, the fifth of eleven children. He graduated from Saint Louis University in 1980 with a degree in Accounting/Business Administration.\nHis works include George Washington Carver - His Life and Faith in His Own Words, America's God and Country: Encyclopedia of Quotations, The Faith of FDR, The Ten Commandments and Their Influence on American Law, Three Secular Reasons Why America Should Be Under God, What Every American Needs to Know About the Quran: A History of Islam and the United States.\nHe hosts the daily program Faith in History on the TCT Network and has a daily radio show, The American Minute, which summarizes what happened on a certain day in history.\nIn 2000, Federer ran unsuccessfully for Minority Leader Dick Gephardt's St. Louis-based seat in Congress.\nFederer has signed a November 2009 ecumenical statement known as the Manhattan Declaration: A Call of Christian Conscience","torrent":{"xt":"urn:btih:5955495e11d5c4772e5496846af810c5fc1b6f7c","amp;dn":"The+Interesting+History+Of+Income+Tax+-+William+J.+Federer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5955495e11d5c4772e5496846af810c5fc1b6f7c","infoHashBuffer":{"type":"Buffer","data":[89,85,73,94,17,213,196,119,46,84,150,132,106,248,16,197,252,27,111,124]},"announce":[],"urlList":[]}}