{"title":"The Wit and Wisdom of Tyrion Lannister [2013][mobi/epub]","uid":9160600,"size":2408838,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5976b909921f3751a93d0cee7cf69fb63cd7e285&amp;dn=The+Wit+and+Wisdom+of+Tyrion+Lannister+%5B2013%5D%5Bmobi%2Fepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"AN0NYMOUS142857","files":-1,"time":1383867348,"description":" &lt;a href=&quot;http://lookpic.com/O/i2/1731/8Y3Bqev.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://lookpic.com/O/i2/1731/8Y3Bqev.jpeg&lt;/a&gt;\nThe Wit &amp; Wisdom of Tyrion Lannister by George RR Martin\n\n\nFormat: mobi/epub\nLength: 192 pages\nGenre: Fantasy\nDate: 29 October 2013\n\nFrom George R. R. Martin's A Song of Ice and Fire novels and HBO's Game of Thrones: a collection of wicked one-liners from the incomparable Imp of Casterly Rock, fully illustrated by Jonty Clark!\n\n&quot;My mind is my weapon. My brother has his sword, King Robert has his warhammer, and I have my mind...and a mind needs books as a sword needs a whetstone if it is to keep its edge.&quot;\n\nThe jealous masses of the Seven Kingdoms may call him Halfman, but none have ever accused Tyrion Lannister of being a halfwit. His golden tongue has saved his skin slightly more often than it has landed him in mortal peril. Now, this special illustrated volume preserves his most essential knowledge for future generations, featuring time-tested guidance on such varied subjects as...\n\nThe art of persuasion\n&quot;The best lies are seasoned with a bit of truth.&quot;\n\nFine dining\n&quot;A little honest loathing can be refreshing, like a tart wine after too much sweet.&quot;\n\nThe fair sex\n&quot;The young ones smell much better, but the old ones know more tricks.&quot;\n\nRoyal politics\n&quot;Crowns do queer things to the heads beneath them.&quot;\n\nCommon ailments\n&quot;A sword through the bowels. A sure cure for constipation.&quot;\n\nAt once charming, insightful, and ruthlessly irreverent, The Wit &amp; Wisdom of Tyrion Lannister is short on pretense and overflowing with finely crafted gems - just like the man himself.\nAuthor:\n]http://image.bayimg.com/02749de6213282044155fb957e40000a9322cd07.jpg\nGeorge Raymond Richard Martinis the #1 New York Times bestselling author of many novels, including the acclaimed series A Song of Ice and Fire - A Game of Thrones - as well as Tuf Voyaging, Fevre Dream, The Armageddon Rag, Dying of the Light, Windhaven (with Lisa Tuttle), and Dreamsongs Volumes I and II. As a writer-producer, Martin has worked on The Twilight Zone, Beauty and the Beast, and various feature films and pilots that were never made. He lives with the lovely Parris in Santa Fe, New Mexico.\n\nAll thanks goes to the original uploaders","torrent":{"xt":"urn:btih:5976b909921f3751a93d0cee7cf69fb63cd7e285","amp;dn":"The+Wit+and+Wisdom+of+Tyrion+Lannister+%5B2013%5D%5Bmobi%2Fepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5976b909921f3751a93d0cee7cf69fb63cd7e285","infoHashBuffer":{"type":"Buffer","data":[89,118,185,9,146,31,55,81,169,61,12,238,124,246,159,182,60,215,226,133]},"announce":[],"urlList":[]}}