{"title":"The Guess Who - The Best Of (Remastered 2006) - Rock","uid":3510697,"size":76704906,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:59b800b3dd25e6f56b859e2dd6cfa257847f7ce7&amp;dn=The+Guess+Who+-+The+Best+Of+%28Remastered+2006%29+-+Rock&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Apeface","files":17,"time":1155108976,"description":"RELEASE DATE: 2006-01-17\nRIP DATE: 2006-01-12\n\nTrack List\n----------\n01. These Eyes                      3:46\n02. Laughing                        2:42\n03. Undun                           3:25\n04. No Time                         3:48\n05. American Woman                  3:54\n06. No Sugar Tonight/New Mother     4:54\n    Nature\n07. Hand Me Down World              3:28\n08. Bus Rider                       2:57\n09. Share The Land                  3:55\n10. Do You Miss Me Darlin           3:56\n11. Hang On To Your Life            4:10\n12. Albert Flasher (bonus track)    2:27\n13. Broken (bonus track)            3:08\n14. Rain Dance (bonus track)        2:44\n\nRelease Notes:\n\n1971 album remastered, with three bonus tracks.  Enjoy!\n\nWhile the Guess Who did have several hits in America, they were superstars in their\nhome country of Canada during the 1960s and early &amp;#039;70s. The band grew out of\nvocalist/guitarist Chad Allan (born Allan Kobel) and guitarist Randy Bachman&amp;#039;s\nWinnipeg-based group Chad Allan and the Expressions, originally known as first the\nSilvertones and then the Reflections. The remainder of the lineup featured bassist\nJim Kale, pianist Bob Ashley, and drummer Garry Peterson. The Expressions recorded\na cover of Johnny Kidd and the Pirates&amp;#039; &quot;Shakin&amp;#039; All Over&quot; in 1965, which became a\nsurprise hit in Canada and reached the U.S. Top 40. When the Expressions recorded\nan entire album of the same name, its record company, Quality, listed their name\nas &quot;Guess Who?&quot; on the jacket, hoping to fool record buyers into thinking that the\nBritish Invasion-influenced music was actually by a more famous group in disguise.\nAshley had been replaced by keyboardist/vocalist Burton Cummings, who became lead\nvocalist when Allan departed in 1966. The Guess Who embarked on an unsuccessful\ntour of England and returned home to record commercials and appear on the\ntelevision program Let&amp;#039;s Go, hosted by Chad Allan. However, further American\nsuccess eluded the Guess Who until the 1969 Top Ten hit &quot;These Eyes&quot;; the\nrecording session for the accompanying album, Wheatfield Soul, was paid for by\nproducer Jack Richardson, who mortgaged his house to do so. Canned Wheat Packed by\nthe Guess Who produced three Top 40 singles later that year. In 1970, the Guess\nWho released the cuttingly sarcastic riff-rocker &quot;American Woman,&quot; which, given\nits anti-American putdowns, ironically became their only U.S. chart-topper. The\nalbum of the same name became their first U.S. Top Ten and first gold album, and\nthe group performed for President and Mrs. Nixon and Prince Charles at the White\nHouse. (Pat Nixon requested that &quot;American Woman&quot; be dropped from the set list.)\n\nTrouble was brewing on the horizon, though. Guitarist Bachman, having recently\nconverted to Mormonism, took issue with the band&amp;#039;s typical rock &amp; roll lifestyle,\nleading to clashes with Cummings. Finding the atmosphere unbearable, Bachman left\nthe group in July 1970 and formed Brave Belt with Chad Allan, which later evolved\ninto Bachman-Turner Overdrive. His place in the Guess Who was taken by Kurt Winter\nand Greg Leskiw, and the title track from their next album, &quot;Share the Land,&quot;\nclimbed into the Top Ten later that year, and several more singles charted\nafterwards. The group returned to the Top Ten one last time in 1974 with the\nnovelty single &quot;Clap for the Wolfman,&quot; featuring dialogue by deejay Wolfman Jack.\nBurdened by shifting personnel and loss of direction, Cummings broke up the band\nin 1975 and tried a solo career. The lineup from the Guess Who&amp;#039;s glory years\nreunited in 1983, and a version of the group with constantly shifting musicians\n(occasionally original members) continues to tour.","torrent":{"xt":"urn:btih:59b800b3dd25e6f56b859e2dd6cfa257847f7ce7","amp;dn":"The+Guess+Who+-+The+Best+Of+%28Remastered+2006%29+-+Rock","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59b800b3dd25e6f56b859e2dd6cfa257847f7ce7","infoHashBuffer":{"type":"Buffer","data":[89,184,0,179,221,37,230,245,107,133,158,45,214,207,162,87,132,127,124,231]},"announce":[],"urlList":[]}}