{"title":"Sam Loyd's Cyclopedia of 5000 Puzzles Tricks and Conundrums with","uid":14171360,"size":42723703,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a5c16d4f7ba4b2cdb28b06d3492116ffbb24c87&amp;dn=Sam+Loyd%27s+Cyclopedia+of+5000+Puzzles+Tricks+and+Conundrums+with&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"gnv65","files":4,"time":1459762792,"description":"Sam Loyd's Cyclopedia of 5000 Puzzles Tricks and Conundrums with Answers\r\nBy Sam Loyd\r\nLamb Publishing Co.| ISBN: N/A | 1914 | scanned PDF | 384 pages | 40.7 mb\r\n\r\nThe Cyclopedia of Puzzles (full title Sam Loyd's Cyclopedia of 5000 Puzzles Tricks and Conundrums with Answers) is probably the largest collection of puzzles ever collected in one volume. Sam Loyd (1841-1911) was a man of many talents. He was called by Martin Gardner, &quot;America's greatest puzzler.&quot; In 1898 the The Strand dubbed him &quot;the prince of puzzlers.&quot; He was an excellent, but unorthodoxed chess player and composer of chess puzzles. Unfortunately, he was also known for lies and self promotion. These things do not, however, detract from the value of this collection. It is comprised of a large number of excellent puzzles and puns both mathematical and otherwise. It is also valuable for the peek it give us into the culture of the late 1800's and early 1900's. This also means that Loyd's work, unfortunately, reflects the negative cultural stereotypes common at that time.\r\nThe Cyclopedia was compiled by Sam Loyd's son (Sam Loyd, Jr., but he dropped the Jr. before the book was published) after his death in 1914. It has now passed into the public domain. This work is plagued with a number of flaws (aside from the cultural issues mentioned above) including typographical errors, missing and incorrect answers. Some of the answers may have been left out intentionally, since a prize was offered for certain &quot;Prize Puzzles.&quot; I have provided corrections where I have noticed problems, but many remain. Significant changes by me have been noted in italicized brackets [...]. I have likely introduced a few errors of my own in the process of converting the text to electronic form. I will be happy to correct errors and/or omissions if the alert reader will notify me via the feedback link above","torrent":{"xt":"urn:btih:5a5c16d4f7ba4b2cdb28b06d3492116ffbb24c87","amp;dn":"Sam+Loyd%27s+Cyclopedia+of+5000+Puzzles+Tricks+and+Conundrums+with","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a5c16d4f7ba4b2cdb28b06d3492116ffbb24c87","infoHashBuffer":{"type":"Buffer","data":[90,92,22,212,247,186,75,44,219,40,176,109,52,146,17,111,251,178,76,135]},"announce":[],"urlList":[]}}