{"title":"Jamie Smart - Secrets of Hypnosis 4 DVDs","uid":9057382,"size":4475152189,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5a8aa59c810c1ed4650523dea2499baf270734c1&amp;dn=Jamie+Smart+-+Secrets+of+Hypnosis+4+DVDs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"acer47x","files":-1,"time":1381978131,"description":"Product Description\nYou may already be aware of just how powerful hypnosis is for helping you get the results you want in every area of your life. In fact, one of the things you're going to love about these recordings is just how practical &amp; easy it is for you to learn to hypnosis &amp; hypnotic communication skills in everyday contexts, youre going to discover: How hypnosis works, Ten rapid inductions, The three barriers, The language of trance, Nested loops and stacking realities, Embedded commands, Your most powerful hypnosis tool, Utilisation, Conversational Techniques, Conscious / unconscious dissociation, Self hypnosis, Ericksonian Techniques, Pattern interrupts and tons of live demos!\n\n\nSynopsis\nYou may already be aware of just how powerful hypnosis is for helping you get the results you want in every area of your life. In fact, one of the things you're going to love about these recordings is just how practical and easy it is for you to learn to hypnosis and hypnotic communication skills in everyday contexts, you're going to discover: how hypnosis works, ten rapid inductions, the three barriers, the language of trance, nested loops and stacking realities, embedded commands, your most powerful hypnosis tool, utilisation, conversational techniques, conscious / unconscious dissociation, self hypnosis, ericksonian techniques, pattern interrupts and tons of live demos!","torrent":{"xt":"urn:btih:5a8aa59c810c1ed4650523dea2499baf270734c1","amp;dn":"Jamie+Smart+-+Secrets+of+Hypnosis+4+DVDs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a8aa59c810c1ed4650523dea2499baf270734c1","infoHashBuffer":{"type":"Buffer","data":[90,138,165,156,129,12,30,212,101,5,35,222,162,73,155,175,39,7,52,193]},"announce":[],"urlList":[]}}