{"title":"Orhan Pamuk - Nobel Prize in Literature, 2006 (16 books)","uid":14534057,"size":104155346,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5aff1fbd98d3579ea1201d73a7b25e4450fc80b4&amp;dn=Orhan+Pamuk+-+Nobel+Prize+in+Literature%2C+2006+%2816+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"workerbee","files":37,"time":1462480828,"description":"ORHAN PAMUK (b. 1952) is a best-selling Turkish novelist, screenwriter, and academic.  Upon receipt of the 2006 Nobel Prize in Literature, the Swedish Academy characterized him as an author &quot;who in the quest for the melancholic soul of his native city has discovered new symbols for the clash and interlacing of cultures.&quot;\n\nMany of Pamuk's novels, often autobiographical and intricately plotted, show an understanding of traditional Turkish Islamic culture tempered by a belief that Turkey's future lies in the West. SILENT HOUSE (1983) relies on multiple narrators to shape the story of a family gathering on the eve of the Turkish military coup of 1980. Pamuk achieved international fame with THE WHITE CASTLE (1985), about the frictions and friendship between a Venetian slave and an Ottoman scholar in 17th-century Istanbul. THE BLACK BOOK (1990), in which the streets, past, chemistry and texture of Istanbul are described through the story of a lawyer seeking his missing wife, enlarged Pamuk's fame both in Turkey and internationally as an author at once popular and experimental.\n\nHis novel THE NEW LIFE (1994), about young university students influenced by a mysterious book, became one of the most widely read books in Turkish literature. MY NAME IS RED (1998) depicts Ottoman and Persian artists and their ways of seeing and portraying the non-western world, told through a love story and family story. From the mid-1990s Pamuk took a critical stance towards the Turkish state in articles about human rights and freedom of thought, although he took little interest in politics. SNOW (2002), which he described as &quot;my first and last political novel&quot;, is set in a poor town in northeastern Turkey and tells the story of violence and tension between political Islamists, soldiers, secularists, and Kurdish and Turkish nationalists.\n\nTHE MUSEUM OF INNOCENCE (2008) is a novel about a man's lifelong infatuation with a young woman and his attempt to build a museum housing the objects associated with his love. Pamuk replicated the titular museum in reality, using a house in Istanbul to display a range of items amassed while plotting the story; it opened to the public in 2012, accompanied by the lavishly-illustrated catalogue THE INNOCENCE OF OBJECTS. His most recent and ninth novel, A STRANGENESS IN MY MIND (2015), is a love story set in Istanbul and a modern epic.\n\nAmong Pamuk's non-fiction works are OTHER COLORS (1999), a selection of articles on literature and culture written for newspapers and magazines in Turkey and abroad, together with a selection of writings from his private notebooks. ISTANBUL: MEMORIES AND THE CITY (2004), a partly fictionalized memoir, combines the author's early memoirs up to the age of 22 and an essay about the city of Istanbul, illustrated with photographs from his own album, and pictures by western painters and Turkish photographers. THE NAIVE AND SENTIMENTAL NOVELIST (2010), his Norton lectures delivered at Harvard University, explicates Pamuk's theories on the novel as a literary form.\n\nPamuk has been persecuted and prosecuted for his criticism of some episodes in the Turkish past, including genocide against the Kurds and Armenians. In 2005, he was charged with &quot;denigrating Turkishness&quot; and put on trial in Turkey. The charges, which produced international controversy, were eventually dropped. \n\n\nThe following books are in PDF and/or ePUB format as indicated:\n\n\n                                  == FICTION ==\n\n* Black Book, The (Faber &amp; Faber, 2006).  Translated by Maureen Freely. -- ePUB + PDF (courtesy of @pharmakate)\n\n* Black Book, The (FSG, 2014).  Translated by Güneli Gün. -- ePUB\n\n* Museum of Innocence, The (Knopf, 2009).  Translated by Maureen Freely. -- ePUB\n\n* My Name is Red (Vintage, 2002).  Translated by Erdag Göknar. -- ePUB\n\n* New Life, The (Vintage, 1998 / FSG, 2014).  Translated by Güneli Gün. -- ePUB + PDF (courtesy of @pharmakate)\n\n* Silent House (Knopf, 2012).  Translated by Robert Finn. -- ePUB\n\n* Snow (Vintage, 2005).  Translated by Maureen Freely. -- ePUB\n\n* Strangeness in My Mind, A (Knopf, 2015).  Translated by Ekin Oklap. -- ePUB\n\n* White Castle, The (Vintage, 1998).  Translated by Victoria Holbrook. -- ePUB\n\n\n                             == ESSAYS &amp; NON-FICTION ==\n\n* Along the Bosphorus [excerpt from &quot;Istanbul&quot;] (Vintage, 2016).  Translated by Maureen Freely. -- ePUB\n\n* Art of Fiction, The (Paris Review, Fall/Winter 2005).  Interview by Angel Gurria-Quintana. -- PDF\n\n* Innocence of Objects, The (Abrams, 2012).  Translated by Ekin Oklap. -- PDF\n\n* Istanbul: Memories and the City (Vintage, 2006).  Translated by Maureen Freely. -- ePUB\n\n* My Father's Suitcase: The Nobel Lecture (Route, 2007).  Translated by Maureen Freely. -- PDF\n\n* Naive and Sentimental Novelist, The (Vintage, 2011).  Translated by Nazim Dikbas. -- ePUB\n\n* Other Colors: Essays and a Story (Knopf, 2007).  Translated by Maureen Freely. -- ePUB\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account): \nhttps://pirates-forum.org/User-workerbee\n\nPLEASE HELP TO SEED! If you like these books and want others to have access to them, please help to seed for as long as you can. The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content. Thank you!","torrent":{"xt":"urn:btih:5aff1fbd98d3579ea1201d73a7b25e4450fc80b4","amp;dn":"Orhan+Pamuk+-+Nobel+Prize+in+Literature%2C+2006+%2816+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aff1fbd98d3579ea1201d73a7b25e4450fc80b4","infoHashBuffer":{"type":"Buffer","data":[90,255,31,189,152,211,87,158,161,32,29,115,167,178,94,68,80,252,128,180]},"announce":[],"urlList":[]}}