{"title":"1,227 QI Facts to Blow Your Socks Off + QI: The Book of General ","uid":8744647,"size":3454128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b038af7a3543b5456c2fedf8ebf29a3666a399d&amp;dn=1%2C227+QI+Facts+to+Blow+Your+Socks+Off+%2B+QI%3A+The+Book+of+General+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MANTESH","files":2,"time":1374891891,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51ScDh1ynZL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51ScDh1ynZL.jpg&lt;/a&gt;\n\n\n1,227 QI Facts to Blow Your Socks OFF\n\nPublisher: Faber and Faber\nJohn Lloyd, John Mitchinson\n2012\nLanguage: English\nISBN-10: 0571297919\nISBN-13: 978-0571297917\nPDF\n336 Pages\n879 KB\n\n&quot;QI&quot; is the smartest comedy show on British television, but few people know that we're also a major legal hit in Australia, New Zealand, Israel and Africa and an illegal one on BitTorrent. We also write books and newspaper columns; run a thriving website, a Facebook page, a Twitter feed; and produce an iPhone App and a sister Radio 4 programme. At the core of what we do is the astonishing fact - painstakingly researched and distilled to a brilliant and shocking clarity. In Einstein's words: 'Everything should be as simple as possible, but not simpler.' Did you know that: cows moo in regional accents; the entire internet weighs less than a grain of sand; the dialling code from Britain to Russia is 007; potatoes have more chromosomes than human beings; the London Underground has made more money from its famous map than it has from running trains; Tintin is called Tantan in Japanese because TinTin is pronounced 'Chin chin' and means penis; the water in the mouth of a blue whale weighs more than its body; Scotland has twice as many pandas as Conservative MPs; Saddam's bunker was designed by the grandson of the woman who built Hitler's bunker; Under the Wildlife and Countryside Act of 1981, it is explicitly illegal in Britain to use a machinegun to kill a hedgehog. &quot;1,227 QI Facts To Blow Your Socks Off&quot; will make you look at the universe (and your socks) in an alarming new way.\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51eg8RBrDiL.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51eg8RBrDiL.jpg&lt;/a&gt;\n\n\nQI: The Book of General Ignorance\n\nPublisher: Faber and Faber\nStephen Fry,John Lloyd, John Mitchinson\n2008\nLanguage: English\nISBN-10: 0571246923\nISBN-13: 978-0571246922\n416 Pages\nPDF\n2.43 MB\n\nThe indispensable compendium of popular misconceptions, misunderstandings and common mistakes culled from the hit BBC show, QI.\n\n\nThe noticeably stouter QI Book of General Ignorance sets out to show you that a lot of what you think you know is wrong. If, like Alan Davies, you still think the Henry VIII had six wives, the earth has only one moon, that George Washington was the first president of the USA, that Bangkok is the capital of Thailand, that the largest living thing is a blue whale, that Alexander Graeme Bell invented the telephone, that whisky and bagpipes come from Scotland or that Mount Everest is the world's tallest mountain, then there are at least 200 reasons why this is the book for you.\n\n","torrent":{"xt":"urn:btih:5b038af7a3543b5456c2fedf8ebf29a3666a399d","amp;dn":"1%2C227+QI+Facts+to+Blow+Your+Socks+Off+%2B+QI%3A+The+Book+of+General+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b038af7a3543b5456c2fedf8ebf29a3666a399d","infoHashBuffer":{"type":"Buffer","data":[91,3,138,247,163,84,59,84,86,194,254,223,142,191,41,163,102,106,57,157]},"announce":[],"urlList":[]}}