{"title":"TRANSVISION VAMP - Baby I Don't Care ( Greatest Hits )","uid":3971736,"size":113720290,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5b63c5b7b80428ac0b62e4aef7d6ee03b09ef99f&amp;dn=TRANSVISION+VAMP+-+Baby+I+Don%5C%27t+Care+%28+Greatest+Hits+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"badbigdog","files":-1,"time":1200049006,"description":"01. I Want Your Love\n02. Baby I Don't Care\n03. Tell That Girl to Shut Up\n04. Revolution Baby\n05. Sister Moon\n06. (I Just Wanna)Be With You\n07. Only One\n08. Landslide of Love\n09. If Looks Could Kill\n10. Kiss Their Sons\n11. Every Little Thing\n12. Bad Valentine\n13. Velveteen\n14. Born to Be Sold\n15. Revolution Baby [Electra Glide Mix]\n16. Tell That Girl to Shut Up [Knuckle Duster Mix]\n17. Baby I Don't Care [Abigail's Party Mix]------------------------------------------------------TRANSVISION VAMP  was a popular UK alternative rock group. Formed in 1986 by Nick Christian Sayer and Wendy James, the band enjoyed a brief period of success in the late 1980s, fusing elements of punk, art rock and the &quot;big band&quot; sound of Phil Spector. James, the lead singer and focal-point of the group, attracted media attention with her sexually-charged and rebellious image.\n\nTogether with Dave Parsons and Anthony Doughty (AKA Tex Axile) made up the band's four permanent members. Additional members Pol Burton, James Piper and Martin Hallett were musicians engaged to play during live concerts: Burton, then later Hallett (AKA Mallet), on drums, and Piper on guitar.\n\nThe band was signed by MCA and released a cover single of the Holly and the Italians song &quot;Tell That Girl To Shut Up&quot; in April 1988, but it only reached number 45 in the UK singles chart. A month later the follow-up single &quot;I Want Your Love&quot;, with its pop/punk crossover appeal, entered the Top 10, and peaked at number 5 in the United Kingdom. Minor success was achieved with 2 further singles, titled Revolution Baby &amp; Sister Moon, which reached 30 &amp; 41 respectively in the UK singles chart in 1988. The band went on to release the hit album Pop Art in October. It stayed on the album chart for 32 weeks, peaking at number 4.\n\n1989 was the band's most successful year, with the number 3 hit single &quot;Baby I Don't Care&quot; and hit album Velveteen, which went straight into the UK album chart at No.1 and stayed on the chart for 26 weeks\n\nIn 1990 MCA refused to release Transvision Vamp's third album Little Magnets Versus The Bubble Of Babble in the UK, reportedly disliking the mellower direction of the music. Wendy James has stated ''...it came out in America and did better than the other two albums in America. But then we decided to split up, during which time the English record label had said they weren't convinced about this record, we're going to hold off on it and see how well it does in other countries first. By the time they were ready to release it, we'd already decided to split up, and so it never came out.''\n\nJames went on to a solo career and in 2004 formed the band Racine.[W I K I P E D I A_http://en.wikipedia.org/wiki/Transvision_Vamp]","torrent":{"xt":"urn:btih:5b63c5b7b80428ac0b62e4aef7d6ee03b09ef99f","amp;dn":"TRANSVISION+VAMP+-+Baby+I+Don%5C%27t+Care+%28+Greatest+Hits+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b63c5b7b80428ac0b62e4aef7d6ee03b09ef99f","infoHashBuffer":{"type":"Buffer","data":[91,99,197,183,184,4,40,172,11,98,228,174,247,214,238,3,176,158,249,159]},"announce":[],"urlList":[]}}