{"title":"The Stranger I Married - Sylvia Day","uid":7825569,"size":1795102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b7b5e0a0c9fb366cd50be6641992cb4b8bc2a5c&amp;dn=The+Stranger+I+Married+-+Sylvia+Day&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"acidr0p","files":4,"time":1352919564,"description":"Epub mobi and pdf format\n\nBook Description: \n\nLady Pelham could not have designed a husband more suited to her needs. The Marquess of Grayson is a dear and enchanting friend and an unrepentant ladies man. Their union is solid; their hearts safe from one another. But every marriage has its surprises...\n\nThey Were Together For All The Wrong Reasons\n\nThey are London's most scandalous couple. Isabel, Lady Pelham, and Gerard Faulkner, Marquess of Grayson, are well matched in all things - their lusty appetites, constant paramours, wicked wits, provocative reputations, and their absolute refusal ever to ruin their marriage of convenience by falling in love with one another. Isabel knows such a charming rake will never appeal to her guarded heart, nor will she sway his philandering one. It is a most agreeable sham - until a shocking turn of events sends Gerard from her side.\n\nNow, four years later, Gerard has come home to Isabel. But the carefree, boyish rogue who left has been replaced by a brooding, powerful, irresistible man who is determined to seduce his way into her affections. Gone is the devil-may-care companion who shared her friendship and nothing more, and in his place is temptation itself - a husband who desires Isabel body and soul and who will stop at nothing to win her love. No, this is not at all the man she had married. But he is the man who might finally steal her heart....","torrent":{"xt":"urn:btih:5b7b5e0a0c9fb366cd50be6641992cb4b8bc2a5c","amp;dn":"The+Stranger+I+Married+-+Sylvia+Day","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b7b5e0a0c9fb366cd50be6641992cb4b8bc2a5c","infoHashBuffer":{"type":"Buffer","data":[91,123,94,10,12,159,179,102,205,80,190,102,65,153,44,180,184,188,42,92]},"announce":[],"urlList":[]}}