{"title":"James Patterson -Step On a Crack","uid":15799147,"size":497139890,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5b9d0dcd1783e5ea027667029264d0c7ac12d4c2&amp;dn=James+Patterson+-Step+On+a+Crack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"twocows","files":9,"time":1473483493,"description":"Step on a Crack\r\nby James Patterson \r\n\r\nPatterson and Ledwidge introduce a new hero in an exciting thriller set in the heart of Manhattan. NYPD detective Michael Bennett is concentrating on getting his family through a particularly difficult Christmas: he and his 10 adopted children are facing the loss to cancer of his brave wife, Maeve. But a major crisis calls him away: the funeral of a former First Lady at St. Patrick's Cathedral goes horribly awry when men storm the church and take hundreds of attendees hostage. Michael is asked to try to reason with a sinister man named Jack. Jack releases all but the most famous people, and makes his demands: he wants several million dollars from each celebrity hostage, including the mayor, a popular comedic actor, a beloved talk show host, and a pop starlet. Once Jack starts killing, Michael realizes he's up against a truly diabolical foe. Patterson has a knack for creating genuinely likable heroes, and Michael fits the bill. As readers rapidly turn the pages to learn how the tense hostage drama plays out, they will also be sympathizing with Michael as he faces the agonizing loss of his wife. Totally gripping and downright impossible to put down, this is a promising start to a potential new series","torrent":{"xt":"urn:btih:5b9d0dcd1783e5ea027667029264d0c7ac12d4c2","amp;dn":"James+Patterson+-Step+On+a+Crack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b9d0dcd1783e5ea027667029264d0c7ac12d4c2","infoHashBuffer":{"type":"Buffer","data":[91,157,13,205,23,131,229,234,2,118,103,2,146,100,208,199,172,18,212,194]},"announce":[],"urlList":[]}}