{"title":"PostgreSQL 9 High Availability Cookbook","uid":11952669,"size":13634092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bbe369011847d38e938b4efb69495d33e466c74&amp;dn=PostgreSQL+9+High+Availability+Cookbook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"scorpioX75","files":1,"time":1432230178,"description":"PostgreSQL 9 High Availability Cookbook by Shaun M. Thomas\nEnglish | July 25, 2014 | ISBN: 1849516960 | 403 Pages | AZW3/EPUB/MOBI/PDF (conv) | 13 MB\n\nPostgreSQL, often known as simply &quot;Postgres&quot;, is an object-relational database management system (ORDBMS) with an emphasis on extensibility and standards-compliance.\n\nOver 100 recipes to design and implement a highly available server with the advanced features of PostgreSQL\n\nOverview\n\nCreate a PostgreSQL cluster that stays online even when disaster strikes\nAvoid costly downtime and data loss that can ruin your business\nPerform data replication and monitor your data with hands-on industry-driven recipes and detailed step-by-step explanations\n\nFrom hardware selection to software stacks and horizontal scalability, this book will help you build a versatile PostgreSQL cluster that will survive crashes, resist data corruption, and grow smoothly with customer demand. We start with selecting the necessary hardware to handle multiple failure scenarios with redundancy. Then, we discuss how to automate and visualize these checks with Nagios, check_mk, and Graphite. We'll finally round off by tackling the complex problem of data scalability.\n\nWhat you will learn from this book\n\nProtect your data with PostgreSQL replication and management tools such as Slony, Bucardo, and Londiste\nChoose the correct hardware for redundancy and scale\nPrepare for catastrophes and prevent them before they happen\nReduce database resource contention with connection pooling\nAutomate monitoring and alerts to visualize cluster activity using Nagios and collectd\nConstruct a robust software stack that can detect and fix outages\nDesign a scalable schema architecture to handle billions of queries\nApproach\n\nA comprehensive series of dependable recipes to design, build, and implement a PostgreSQL server architecture free of common pitfalls that can operate for years to come. Each chapter is packed with instructions and examples to simplify even highly complex database operations.\n\nWho this book is written for\n\nIf you are a PostgreSQL DBA working on Linux systems who want a database that never gives up, this book is for you. If you've ever experienced a database outage, restored from a backup, spent hours trying to repair a malfunctioning cluster, or simply want to guarantee system stability, this book is definitely for you.\n\nPlease support the authors and buy the book if you find it useful","torrent":{"xt":"urn:btih:5bbe369011847d38e938b4efb69495d33e466c74","amp;dn":"PostgreSQL+9+High+Availability+Cookbook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bbe369011847d38e938b4efb69495d33e466c74","infoHashBuffer":{"type":"Buffer","data":[91,190,54,144,17,132,125,56,233,56,180,239,182,148,149,211,62,70,108,116]},"announce":[],"urlList":[]}}