{"title":"Capitalism Hits the Fan - Richard D.Wolff - EPUB PDF","uid":15750009,"size":1770014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bd5b9de98a94448f75cd60fecd1dcea87ea33bb&amp;dn=Capitalism+Hits+the+Fan+-+Richard+D.Wolff+-+EPUB+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"nosnavis","files":2,"time":1473024022,"description":"Capitalism Hits the Fan: The Global Economic Meltdown and What to Do About It\r\nRichard D. Wolff\r\n2009, Olive Branch Press\r\n\r\n\r\nCapitalism Hits the Fan chronicles one economist’s growing alarm and insights as he watched, from 2005 onwards, the economic crisis build, burst, and then dominate world events. The argument here differs sharply from most other explanations offered by politicians, media commentators, and other academics. Step by step, Professor Wolff shows that deep economic structures—the relationship of wages to profits, of workers to boards of directors, and of debts to income—account for the crisis. The great change in the US economy since the 1970s, as employers stopped the historic rise in US workers’ real wages, set in motion the events that eventually broke the world economy.\r\n\r\nThe crisis resulted from the post-1970s profit explosion, the debt-driven finance-industry expansion, and the sequential stock market and real estate booms and busts. Bailout interventions by the Federal Reserve and the US Treasury have thrown too little money too late at a problem that requires more than money to solve.\r\n\r\nWe must now ask basic questions about capitalism as a system that has now convulsed the world economy into two great depressions in 75 years (and countless lesser crises, recession, and cycles in between). The book’s essays engage the long-overdue public discussion about basic structural changes and systemic alternatives needed not only to fix today’s broken economy but to prevent future crises.\r\n\r\nIf you want to support the author: \nhttp://www.rdwolff.com/books#capitalismhitsthefan\r\n\r\nDr Wolff lecture &quot;Capitalism Hits the Fan&quot;","torrent":{"xt":"urn:btih:5bd5b9de98a94448f75cd60fecd1dcea87ea33bb","amp;dn":"Capitalism+Hits+the+Fan+-+Richard+D.Wolff+-+EPUB+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bd5b9de98a94448f75cd60fecd1dcea87ea33bb","infoHashBuffer":{"type":"Buffer","data":[91,213,185,222,152,169,68,72,247,92,214,15,236,209,220,234,135,234,51,187]},"announce":[],"urlList":[]}}