{"title":"Randy Newman - Guilty- 30 Years of Randy Newman [V2]","uid":7881868,"size":430904755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c4b534870234632fd2faef6d8590a7860e6714e&amp;dn=Randy+Newman+-+Guilty-+30+Years+of+Randy+Newman+%5BV2%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"rambam1776","files":-1,"time":1354518966,"description":"---------------------------------------------------------------------\nRandy Newman - Guilty: 30 Years of Randy Newman \n---------------------------------------------------------------------\n\nArtist...............: Randy Newman\nAlbum................: Guilty: 30 Years of Randy Newman\nGenre................: Rock\nSource...............: CD\nYear.................: 1995\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: LAME 3.98\nVersion..............: MPEG 1 Layer III\nQuality..............: Standard, (avg. bitrate: 186kbps)\nChannels.............: Joint Stereo / 44100 hz\nTags.................: , ID3 v2.3\nInformation..........: \nRipped by............: Rambam on 12/2/2012\nPosted by............: Rambam on 12/2/2012\nIncluded.............: NFO, M3U, LOG, CUE\nCovers...............: Front \n\n---------------------------------------------------------------------  &lt;a href=&quot;\nhttp://www.ew.com/ew/article/0,,63845,00.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ew.com/ew/article/0,,63845,00.html&lt;/a&gt;\n\nPlenty of our greatest composers have had their gloriously romantic music notoriously counterbalanced by completely ill tempers in real life. Randy Newman has as fine a flair for a lovely melody as anyone since Richard Rodgers, but -- fortunately for his fellow misanthropes -- he's never felt the need to privatize his bad will toward man. And so &quot;Guilty: 30 Years of Randy Newman&quot; is chockful of all the loneliness, godlessness, cruelty, misery, and misunderstanding the species can muster, wrapped in orchestrations so spectacularly beautiful they can only be described as transcendent. Go figure.\n\nGuilty's first two discs effectively reprise the brilliance of his nine character-driven studio albums. A fun if spotty third CD collects live tracks, outtakes, and rarities (including an early Pat Boone-produced single), while a fourth summarizes his increasingly prodigious film scoring, where he can be Coplandesque in earnest. His movie songs tend to be Newman defanged; you keep waiting -- hoping? -- for some profane kicker to &quot;I Love to See You Smile&quot; or the theme from Michael. But revisiting the pre-Disney catalog, from &quot;Mama Told Me Not to Come&quot; to &quot;I Want You to Hurt Like I Do,&quot; is the essential draw in a box that gives short and tall people alike at least short-term reason to live.\n  &lt;a href=&quot;\nhttp://www.allmusic.com/album/guilty-30-years-of-randy-newman-mw0000044388&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/guilty-30-years-of-randy-newman-mw0000044388&lt;/a&gt;\n\nThere was no Randy Newman compilation available in America until Rhino released the four-disc box set Guilty: 30 Years of Randy Newman in the fall of 1998. Boasting two discs of album highlights, a disc of rarities, and a disc devoted to &quot;Film Music,&quot; Guilty attempts to be a definitive artistic portrait, yet it winds up a little frustrating. Dedicated fans don't have much need for the first two discs; even if they provide an excellent summary, they're designed for casual listeners, who won't have much interest in the other two discs. &quot;Odds &amp; Ends,&quot; the third disc, is the jewel in this crown for longtime fans, since it contains a wealth of rarities, including the excellent &quot;Gone Dead Train&quot; from Performance, a weird Pat Boone-produced single from 1961 (&quot;Golden Gridiron Boy&quot;), a selection of 1968 songwriting demos, a host of working tracks for films, and a revelatory &quot;Masterman and Baby J,&quot; which contains no rapping. &quot;Film Music,&quot; the fourth disc, is another welcome addition to his catalog. Newman is a sensitive, accomplished film composer in the classic Hollywood style, and not only are his scores are rewarding on their own merits (as are the excerpts here), he's written a handful of great songs, such as &quot;I Love to See You Smile&quot; (Parenthood) and &quot;You've Got a Friend in Me&quot; (Toy Story), which have not appeared on a Newman album until now. These final discs are valuable for serious fans, yet they may not want to purchase the entire box in order to acquire the rarities. And that's the problem with Guilty -- the package is lovely and the execution first-rate, but both casual and dedicated fans would have been better served if the set had been divided into two different compilations.\t\t","torrent":{"xt":"urn:btih:5c4b534870234632fd2faef6d8590a7860e6714e","amp;dn":"Randy+Newman+-+Guilty-+30+Years+of+Randy+Newman+%5BV2%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4b534870234632fd2faef6d8590a7860e6714e","infoHashBuffer":{"type":"Buffer","data":[92,75,83,72,112,35,70,50,253,47,174,246,216,89,10,120,96,230,113,78]},"announce":[],"urlList":[]}}