{"title":"Maeve Kerrigan Series - Jane Casey","uid":9406034,"size":1843782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c76083f040a539c2383147a125efa155a45b69f&amp;dn=Maeve+Kerrigan+Series+-+Jane+Casey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1388160680,"description":"1. The Burning - Maeve Kerrigan is an ambitious detective constable, keen to make her mark on the murder task force. Her male colleagues believe Maeve's empathy makes her weak, but the more she learns about the latest victim, Rebecca Haworth, from her grieving friends and family, the more determined Maeve becomes to bring her murderer to justice.\n\n2. The Reckoning - To the public, he's a hero: a killer who targets convicted pedophiles. \nTwo men are dead already - tortured to death.\n\nEven the police don't regard the cases as a priority. Most feel that two dead pedophiles is a step in the right direction. \n\nBut to DC Maeve Kerrigan, no one should be allowed to take the law into their own hands. Young and inexperienced, Kerrigan wants to believe that murder is murder no matter what the sins of the victim. Only, as the killer's violence begins to escalate, she is forced to confront exactly how far she's prepared to go to ensure justice is served...\n\n3. The Last Girl\nHigh summer. Wimbledon. 14-year-old Lydia Kennford returns home to discover the bodies of her mother and twin sister in the family living room, while her father, Philip, lies unconscious and bleeding in an upstairs bedroom.\n\nDC Maeve Kerrigan and DI Josh Derwent begin to investigate, discounting a burglary quickly and focusing instead on Philip Kennford QC himself. There is no easy explanation for why he survived when the others were shown no mercy, and they suspect he might have staged the attack on himself after killing his wife and daughter. But Kennford is a self-possessed, intelligent man who knows criminal law inside out; proving that he's guilty will be difficult.\n\n4. The Stranger You Know\nHe meets women. He gains their trust. He kills them.\n\nThat's all Maeve Kerrigan knows about the man she is hunting. Two women were strangled in their homes, and with no sign of a break-in, there's no clue as to who might be responsible. Until there's a third murder, and the finger is pointed at DCI Josh Derwent, Maeve's colleague.\n\nIt isn't the first time Derwent has been a suspect in a murder case, and these deaths bear an unsettling similarity to the last one he was accused of. Maeve refuses to believe he could be involved, but the secrets of his past begin to unravel. How well does she really know him?","torrent":{"xt":"urn:btih:5c76083f040a539c2383147a125efa155a45b69f","amp;dn":"Maeve+Kerrigan+Series+-+Jane+Casey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c76083f040a539c2383147a125efa155a45b69f","infoHashBuffer":{"type":"Buffer","data":[92,118,8,63,4,10,83,156,35,131,20,122,18,94,250,21,90,69,182,159]},"announce":[],"urlList":[]}}