{"title":"Malibu's Most Wanted(2003)DVDRip.AC3(ENG)-DROCK","uid":6561392,"size":733109608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d7236b41ec0678744cc0db3a526bc855524311b&amp;dn=Malibu%5C%27s+Most+Wanted%282003%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"drock232","files":-1,"time":1311494931,"description":"A rich kid who likes to pretend he's from the wrong side of the tracks gets a taste of the real thing in this comedy. Brad Gluckman (Jamie Kennedy) is the son of a wealthy and socially prominent couple (Ryan O'Neal and Bo Derek) and grew up in the lap of luxury in Malibu, CA. However, Brad likes to imagine he's a street-smart gangsta from the mean streets of L.A., and he's been trying to launch a career as a hardcore rapper under the name &quot;B-Rad.&quot; Mr. Gluckman is running for Governor of California, and both he and his campaign manager (Blair Underwood) are convinced Brad's antics could have a negative impact on the election, so they come up with a scheme to change his mind about the supposed glamour of street life. Mr. Gluckman hires a pair of African-American actors (Taye Diggs and Anthony Anderson) to impersonate a pair of gang-bangers from Compton who carjack Brad's SUV and take him to the 'hood, where he'll learn just how scary the thug life can be. However, it soon becomes obvious the actors don't know much more about life in Compton than Brad does, and as Brad gets used to his new surroundings, he falls for a girl from the neighborhood (Regina Hall) who has her own plans for moving up in the world. Malibu's Most Wanted was inspired by a character Jamie Kennedy created for his sketch comedy series The Jamie Kennedy Experiment. \n\nRipped with Handbrake.\n\nLength: 1 Hour 26 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps\n\n","torrent":{"xt":"urn:btih:5d7236b41ec0678744cc0db3a526bc855524311b","amp;dn":"Malibu%5C%27s+Most+Wanted%282003%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d7236b41ec0678744cc0db3a526bc855524311b","infoHashBuffer":{"type":"Buffer","data":[93,114,54,180,30,192,103,135,68,204,13,179,165,38,188,133,85,36,49,27]},"announce":[],"urlList":[]}}