{"title":"Art Pepper meets The Rhythm Section / 1957","uid":10468039,"size":106628827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d8950a33288c36415d6d09a1de4aa28465962fe&amp;dn=Art+Pepper+meets+The+Rhythm+Section+%2F+1957&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Drebben","files":11,"time":1404225582,"description":"\nArt Pepper\n\nMeets The Rhythm Section\n\n1957\n\n\n\nCD / 2010 / 320Kbps\n\n\n\nTracklist:\n\n1\tYou'd Be So Nice To Come Home To\n\t\n2\tRed Pepper Blues\n\t\n3\tImagination\n\t\n4\tWaltz Me Blues\n\t\n5\tStraight Life\n\t\n6\tJazz Me Blues\n\t\n7\tTin Tin Deo\n\t\n8\tStar Eyes\n\t\n9\tBirks Works\t\n \t \t\n\n\nOriginal Album Produced By Lester Koenig\n \nRecorded In Hollywood, CA, Jan 19th, 1957\n \nOriginally Released On Contemporary Records (C 3532)\n\n\n\n\nPersonnel:\n\nArt Pepper - Alto Saxophone\n\nRed Garland - Piano\n\nPaul Chambers - Bass\n\nPhilly Joe Jones - Drums\n\n\n\n\nArt Pepper Meets the Rhythm Section is a mythic recording. \n\nThe circumstances surrounding its genesis were first revealed in Pepper's steely autobiography Straight Life and reproduced countless times in articles and liner notes. Here it goes, one more time. On the morning of the recording session, January 19, 1957, Pepper's then-wife Diane informed him that she had secured an afternoon recording session with the Miles Davis rhythm section who were in Los Angeles appearing with Davis. Unhappily surprised and with a horn in bad need of repair, Pepper fixed an extra large amount of heroin and was off to the session. The music produced from this chaos has been described as &quot;a diamond of recorded jazz history.&quot; \n\nThe material for the session previously selected by the artists. After some discussion, drummer Philly Joe Jones suggested Cole Porter's &quot;You'd Be So Nice To Come Home To&quot; and the historic session was off and running. The date gradually began to take shape. Red Garland provided an original &quot;Red Pepper Blues.&quot; The Burke/Van Heusen ballad &quot;Imagination&quot; was included. The quartet mixed things up with the New Orleans classic &quot;Jazz Me Blues&quot; played against Chano Pozo?s Afro-Cubano credo &quot;Tin Tin Deo&quot; (featuring some solid drumming by Jones) A pair of blues juxtaposes as well. &quot;Waltz Me Blues&quot; was a session original composed by Pepper and bassist Paul Chambers. It is lilting and light. It stands in great contrast to John Birks &quot;Dizzy&quot; Gillespie?s smoky minor blues &quot;Birks? Works.&quot; Perhaps central to the recording was the Pepper original &quot;Straight Life.&quot; This Pepper classic is a complex and fast paced piece of West Coast Be Bop. It, along with &quot;Somewhere over the Rainbow,&quot; would become his signature song \n\nArt Pepper Meets the Rhythm Section is one of those singular events that can only occur in a blaze like reading King Lear by a lightning flash. \n\n\n\n\n\n\n \n","torrent":{"xt":"urn:btih:5d8950a33288c36415d6d09a1de4aa28465962fe","amp;dn":"Art+Pepper+meets+The+Rhythm+Section+%2F+1957","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d8950a33288c36415d6d09a1de4aa28465962fe","infoHashBuffer":{"type":"Buffer","data":[93,137,80,163,50,136,195,100,21,214,208,154,29,228,170,40,70,89,98,254]},"announce":[],"urlList":[]}}