{"title":"Feedstock Recycling of Plastic Wastes","uid":12423639,"size":14150927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5db9aa663556fbfe4513895f3c181e98d7b9df78&amp;dn=Feedstock+Recycling+of+Plastic+Wastes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"clouderone","files":1,"time":1442341816,"description":"Feedstock Recycling of Plastic Wastes (RSC, 1999).pdf\n\nISBN 0-85404-531-7\n\nThe use of plastic materials has seen a massive increase in recent years, and generation of plastic wastes has grown proportionately. Recycling of these wastes to reduce landfill disposal is problematic due to the wide variation in properties and chemical composition among the different types of plastics. Feedstock recycling is one of the alternatives available for consideration, and Feedstock Recycling of Plastic Wastes looks at the conversion of plastic wastes into valuable chemicals useful as fuels or raw materials. Looking at both scientific and technical aspects of the recycling developments, this book describes the alternatives available. Areas include chemical depolymerization, thermal processes, oxidation and hydrogenation. Besides conventional treatments, new technological approaches for the degradation of plastics, such as conversion under supercritical conditions and coprocessing with coal are discussed. This book is essential reading for those involved in plastic recycling, whether from an academic or industrial perspective. Consultants and government agencies will also find it immensely useful","torrent":{"xt":"urn:btih:5db9aa663556fbfe4513895f3c181e98d7b9df78","amp;dn":"Feedstock+Recycling+of+Plastic+Wastes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db9aa663556fbfe4513895f3c181e98d7b9df78","infoHashBuffer":{"type":"Buffer","data":[93,185,170,102,53,86,251,254,69,19,137,95,60,24,30,152,215,185,223,120]},"announce":[],"urlList":[]}}