{"title":"Space.Rangers.HD.A.War.Apart-RELOADED","uid":9070016,"size":2486129758,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5de52686231fa518fca05864c12238fe82e09e3f&amp;dn=Space.Rangers.HD.A.War.Apart-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1382142569,"description":"\nnERv\n\nSpace Rangers HD: A War Apart (c) 1C-SoftClub\n\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Action\n\nSpace Rangers HD: A War Apart remasters and expands the world of the cult\nclassic Space Rangers 2. The game is developed by the SNK-Games team in\nclose cooperation with fans of the series.\n\nThe biggest of the improved features is a new scenario dedicated to the\npirates threatening the galaxy. While the Coalition spends all of its\nresources to fight the Dominators (sentient machines who seek to eradicate\nall life), the pirates have united under the banner of a mysterious leader.\nUnder this new master they have begun their own guerrilla war to seize\npower in the weakened Galaxy. Players can now choose with whom to deal,\nthe Dominators or the pirates, or both at the same time. If you choose\nthe latter path, you will receive new story and side quests, new goals and\npromotions. After winning one of the wars, you can either finish the game\nor continue playing to win another.\n\nPlayers begin their pirate career as the lowest of the low, and will make\ntheir way to the top of the pirate hierarchy, completing story missions\nand learning new information about the organization and its unknown leader\nwhose actions threaten the very existence of the Coalition of sentient\nspecies. All player actions affect what kind of place the Galaxy will be at\nthe end, with the victorious Coalition that managed to overcome its enemies\nor with a collapsed alliance from both external Dominator and internal\npirate pressures.\nThe game has received a major technical overhaul in addition to the\naddition of new content. All of the main menu, loading screens, planet and\nspace station vistas were reworked. Now you can choose a display resolution\nof up to 19201200 and planetary battles employ modern render technologies\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:5de52686231fa518fca05864c12238fe82e09e3f","amp;dn":"Space.Rangers.HD.A.War.Apart-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5de52686231fa518fca05864c12238fe82e09e3f","infoHashBuffer":{"type":"Buffer","data":[93,229,38,134,35,31,165,24,252,160,88,100,193,34,56,254,130,224,158,63]},"announce":[],"urlList":[]}}