{"title":"MS Excel 2010 In Depth","uid":6596704,"size":69423927,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e1a36bc920fa53f28a465064472cee9e3bceb86&amp;dn=MS+Excel+2010+In+Depth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"typhoonDigital","files":-1,"time":1313051344,"description":"Excel 2010 In Depth is the beyond-the-basics, beneath-the-surface guide for everyone who wants to streamline their work with Excel 2010, and get more done in less time. Legendary Excel expert Bill Jelen provides specific, tested, proven solutions to the problems Excel users run into every day: challenges other books ignore or oversimplify. Jelen thoroughly covers all facets of working with Excel 2010, and adds new chapters on Excel Web App which allows multiple users to edit a spreadsheet simultaneously. New coverage also includes: Slicer, which offers dynamic filtering of PivotTables; Sparklines, which add data visualization to any cell; Calculation engine which improves the speed and accuracy of math, financial, and statistical functions; and the new version of Solver. As with all In Depth books, Excel 2010 In Depth presents comprehensive coverage, breakthrough techniques, exclusive shortcuts, quick access to information, troubleshooting help for tough problems, and real-world examples with nothing glossed over or left out. Step-by-step instructions with icons guide readers through essential tasks such as designing tables, entering data, importing external data, designing and executing queries, and designing data entry forms and printed reports. Additional chapters on advanced form and report design emphasize data entry efficiency and presentation clarity.","torrent":{"xt":"urn:btih:5e1a36bc920fa53f28a465064472cee9e3bceb86","amp;dn":"MS+Excel+2010+In+Depth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e1a36bc920fa53f28a465064472cee9e3bceb86","infoHashBuffer":{"type":"Buffer","data":[94,26,54,188,146,15,165,63,40,164,101,6,68,114,206,233,227,188,235,134]},"announce":[],"urlList":[]}}