{"title":"Dragon Age 2[PC] Multi6][Nautilus-bt]","uid":6433571,"size":7140053191,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5e2484084f432705971aaeb74572952aa828cf7d&amp;dn=Dragon+Age+2%5BPC%5D+Multi6%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"someuser11","files":4,"time":1306749765,"description":"Dragon Age 2 thrusts players into the role of Hawke, a refugee who survives the destruction of his homeland and becomes the Champion of Kirkwall. The lore around Hawke's rise to power is shrouded in myth and rumor and is the driving force behind this all-new story spanning 10 years in the Dragon Age universe timeline. Players will uniquely experience how this legend unfolds by gathering the deadliest of allies, making tough moral choices, amassing fame and fortune, and sealing their place in history.\n\nClick here to read the complete review\n\nDragon age 2 catapulta il giocatore nel ruolo di Hawke, un rifugiato che e' sopravvisuto alla distruzione della propria terra che diventa il campione di Kirkwall, il mistero intorno all'ascesa al potere di Hawke e' immersa in miti e fama ed e' la forza motrice di questa nuova storia lunga 10 anni nell'universo di Dragon Age. I giocatori sperimenteranno un'esperienza unica mentre la leggenda si rivelera' con il raduno di spietati alleati, facendo scelte morali, ammassando fama e fortuna, e assicurandosi un posto nella storia.\n\nClicca qui per leggere l'intera recensione\n\n\n\nDate : 08/03/11\nGenre : Role Playing Game RPG\nLanguage : Multi6 (English, French, Italian, German, Spanish, Polish, Russian)\n\nMinimum System Requirements:\n\nOperating System - Windows XP 32-bit with SP3, Windows Vista 32-bit with SP2, Windows 7 64-bit\nProcessor - Intel Core 2 Duo (or equivalent) running at 1.8 GHzr, AMD Athlon 64 X2 (or equivalent) running at 1.8 GHz\nRAM Memory - 1 GB (1.5 GB Vista and Windows 7)\nGraphics Card - Radeon HD 2600 Pro 256 MB, NVIDIA GeForce 7900 GS 256 MB cards\n\n\n\n\n\n\n\nMount or burn the ISO image\ninstall the game. Use ketgen in the crack folder of the DVD when prompted for a serial\nCopy over the content of the crack folder, with the content of your &lt;install&gt;\\bin_ship dir\nPlay!\n\nIf you want to install the DLC just launche &quot;Dragon Age 2 DLC pack 1.01.exe&quot;\n\nMonta o masterizza l'immagine ISO\nInstalla il gioco. usare il keygen nella cartella crack per calcolare il seriale quando viene chiesto.\nCopia e sostituisci il contenuto della cartella crack, nella cartella &lt;installazione&gt;\\bin_ship\nGioca!\n\nSe volete installare i DLC lanciate &quot;Dragon Age 2 DLC pack 1.01.exe&quot;\n","torrent":{"xt":"urn:btih:5e2484084f432705971aaeb74572952aa828cf7d","amp;dn":"Dragon+Age+2%5BPC%5D+Multi6%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e2484084f432705971aaeb74572952aa828cf7d","infoHashBuffer":{"type":"Buffer","data":[94,36,132,8,79,67,39,5,151,26,174,183,69,114,149,42,168,40,207,125]},"announce":[],"urlList":[]}}