{"title":"Disneys.TÃƒÂ¶rnrosa.SWEDISH.DVDRip.XviD-EXTREM-E.avi","uid":4418180,"size":732510208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e329796f2845aa4912df37d2aec1fce8f5c8d7f&amp;dn=Disneys.T%C3%83%C2%B6rnrosa.SWEDISH.DVDRip.XviD-EXTREM-E.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"EXTREM-E","files":1,"time":1222634657,"description":"When a new princess is born to King Stefan &amp; his wife, the entire kingdom rejoices. At a ceremony, three good fairies - Flora, Fauna &amp; Merryweather - bestow gifts of magic on the child. But an evil sorceress named Maleficent shows up, and because of a rude remark by Merryweather, she places a curse on the princess - that she will die on her 16th birthday after touching a poisoned spinning wheel. Merryweather tries to undo the damage by casting a spell that will allow the princess - named Aurora - to awake from an ageless sleep with a kiss from her true love. The fairies take Aurora to their cottage in the woods to keep her away from the eyes of Maleficent, and raise her as their own child, named Briar Rose. On her 16th birthday Aurora meets Prince Phillip, the son of a king whose own kingdom will soon merge with King Stefan&amp;#039;s - and falls in love. Maleficent manages to kidnap the Prince and her horrible prophecy is fulfilled when she tricks Aurora into touching a spinning wheel created by Maleficent herself! Realizing that the Prince is in trouble, the 3 good fairies head to Maleficent&amp;#039;s castle at the Forbidden Mountain, and spring the Prince loose. But the Prince soon finds himself up against Maleficent&amp;#039;s army of brutes, and the power of Maleficent&amp;#039;s evil spells - which include a thorn forest as thick as weeds around King Stefan&amp;#039;s castle, and a fight against Maleficent when she turns herself into a dragon! Is the Prince strong enough to withstand the powers of the evil sorceress?","torrent":{"xt":"urn:btih:5e329796f2845aa4912df37d2aec1fce8f5c8d7f","amp;dn":"Disneys.T%C3%83%C2%B6rnrosa.SWEDISH.DVDRip.XviD-EXTREM-E.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e329796f2845aa4912df37d2aec1fce8f5c8d7f","infoHashBuffer":{"type":"Buffer","data":[94,50,151,150,242,132,90,164,145,45,243,125,42,236,31,206,143,92,141,127]},"announce":[],"urlList":[]}}