{"title":"Audio Damage's Kombinat  v1.0.1 VST","uid":4464942,"size":2138336,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e422871f6b65897fc84c73cf1cc71ab64abcddb&amp;dn=Audio+Damage%5C%27s+Kombinat++v1.0.1+VST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"FOZZYD1970","files":2,"time":1224872919,"description":"Audio Damage&amp;#039;s Kombinat  v1.0.1 VST.this is awsome\n\nFrom mild tone-shaping or adding a bit of grit to full-on total waveform destruction, Kombinat is a complete toolbox of sonic warfare. This plugin is, in our opinion, the single most annihilating effect available today.\n\nWith seven different options in each of the three distortion engines (plus pass-through), Kombinat is capable of sophisticated and unique sounds. Want to add a ring mod to the low end, a mild saturation to the mids, and a bit-reduction algorithm to the high end? No problem. Want to run your signal through three sine-warps in series? This is your box. \n\nKombinat&amp;#039;s signal structure allows for a fairly broad palette of sounds, as each segment of the overall effect is a versatile tool in its own right. The Isolator is a full &quot;DJ-style&quot; band-killer EQ; this leads to the three distortion engines, which may be used in multi-band mode for subtle surgery, or in series mode for complete signal destruction. The engines go in to a four-pole lowpass filter of our own design, and then in to a compressor which we have configured for one-knob operation.\n\nTaken as a whole, Kombinat is a tweaker&amp;#039;s paradise, yet designed so that it is easy to just grab one of the 64 presets and touch it up a bit to suit the source material. \n\nplease seed thanks\n\nenjoy\n\n","torrent":{"xt":"urn:btih:5e422871f6b65897fc84c73cf1cc71ab64abcddb","amp;dn":"Audio+Damage%5C%27s+Kombinat++v1.0.1+VST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e422871f6b65897fc84c73cf1cc71ab64abcddb","infoHashBuffer":{"type":"Buffer","data":[94,66,40,113,246,182,88,151,252,132,199,60,241,204,113,171,100,171,205,219]},"announce":[],"urlList":[]}}