{"title":"Max Roach - We Insist! Max Roach's Freedom Now Suite","uid":3365737,"size":53804126,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5e541d4df3218dd57d6477e8511614faf5345066&amp;dn=Max+Roach+-+We+Insist%21+Max+Roach%5C%27s+Freedom+Now+Suite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"mceasy","files":5,"time":1123250602,"description":"Track Listings \n1. Driva Man\n2. Freedom Day\n3. Triptych: Prayer/Protest/Peace\n4. All Africa\n5. Tears for Johannesburg \n\n\nAmazon.co.uk Review\nBack in 1960, when Martin Luther King was guiding protest sit-ins across the USA, Max Roach and singer Abbey Lincoln recorded with passionate urgency Roach's Freedom Now Suite. Oscar Brown Junior collaborated in writing the lyrics and the undoubted star is Abbey Lincoln. Her powerful, committed vocalising can range from serenity to near-hysteria, as it does in &quot;Prayer, Protest, Peace&quot; which is a duet for voice and Roach's technically extraordinary drumming. In the opening &quot;Driva Man&quot; she's answered by a tenor solo from the great Coleman Hawkins, making his only recording in 5 / 4 time. &quot;All Africa&quot; finds her communing with Nigerian drummer Olatunji, who also chants in his own Yoruba dialect and then joins Roach and others for a lengthy percussion workout. Other instrumental voices are Booker Little's questioning trumpet, Walter Benton's wailing tenor and Julian Priester's declamatory trombone, all contributing solos to the concluding &quot;Tears for Johannesburg&quot;. Overall this is a fine example of Roach's writing and performing skills, emphasising his political involvement as well as his concern to reflect his own African origins and those of jazz. --Graham Colomb&amp;eacute;","torrent":{"xt":"urn:btih:5e541d4df3218dd57d6477e8511614faf5345066","amp;dn":"Max+Roach+-+We+Insist%21+Max+Roach%5C%27s+Freedom+Now+Suite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e541d4df3218dd57d6477e8511614faf5345066","infoHashBuffer":{"type":"Buffer","data":[94,84,29,77,243,33,141,213,125,100,119,232,81,22,20,250,245,52,80,102]},"announce":[],"urlList":[]}}