{"title":"Gex 1, 2, and 3 (FULL COLLECTION) (PSX PS1) (use ePSXe)","uid":6184064,"size":435406905,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5e6c2e8d5882de89696ad2bc3f1b1b0122f454c8&amp;dn=Gex+1%2C+2%2C+and+3+%28FULL+COLLECTION%29+%28PSX+PS1%29+%28use+ePSXe%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"FuCtUpPuNk","files":9,"time":1298057568,"description":"INSTALLATION:\nUse an Emulator to run the games.\nRecommended: ePSXe 1.6 or 1.7\n\nI have also uploaded the emulator to run this game on the following link &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6174621/ePSXe_1.7.0_%28with_working_gameshark__codebreaker__action_replay%29&lt;/a&gt;\n-----------------------------------------------\n-----------------------------------------------\n-----------------------------------------------\n\n*****GEX 1*****\n\nSTORY:\nGex and his family lived in Maui, Hawaii. His mother raised him and his three younger siblings while their father worked for NASA. Gex's hobbies included spending time with his friends, surfing, playing the ukulele, and throwing poi parties.\nOne day, Gex's mother got a phone call from NASA, explaining that Gex's father and ten human volunteers died when their rocket exploded on the launch pad (according to the fans of Gex, someone must've put a bomb on the top of the rocket). The gecko family's carefree life was shattered. While his mother and siblings dealt with their grief the usual way, Gex bottled up his emotions and took refuge in front of the television. After several unsuccessful attempts to get Gex to stop watching TV, and after consulting with a minister and friends at work, she decided it was time for a change. The gecko family was moving to Encino, California. Gex's TV was taken away here, and he ran away.\nAfter several months of living on the streets, Gex inherited an enormous amount of money. He moved back to Maui to live in a mansion, and bought the world's largest TV. One day, while watching TV, a huge hand shot out of the screen and grabbed Gex by his neck, pulling the young gecko into his own TV. The cold claw belonged to Rez, the overlord of the Media Dimension, who had intended to make Gex his new mascot and conquer the world.[1]\nGex traversed through the worlds of the Media Dimension. The first world he encountered was an enormous dome, surround by four large TVs. Gex then went through the large TVs, collected the remotes, and defeated the various worlds' guardians. Gex also collected pieces to another remote, which allowed him to travel to a mysterious Planet X. Once Gex managed to collect all the worlds' remotes, the dome opened and he could travel to Rezopolis, the capital of the Media Dimension.\nOnce inside Gex defeated Rez in a head-to-head battle, using one of Rez's own mechanical bugs. Rez transformed into a ball of energy and escaped through a hole in the dome. Gex was then teleported back to his home in Maui, and looks back and his last words in the game were &quot;Hey, cool. I wonder what's on HBO.&quot;\n\nGAMEPLAY:\nThe objective in almost every level in Gex is to explore and find television remotes hidden throughout the levels. Certain levels require you to find two remotes to access the next world. There are also hidden portals to bonus levels, and completing a bonus level perfectly gives you a piece of the Planet X remote. Though there is a bonus level in each level, you only have to beat one in each world.\nRather than a save system, Gex uses a password system to save your progress. To receive a password, the player must find a VHS tape, hidden in the level. The tapes are usually hidden in either the second or third levels of a world, and tapes can also be acquired by defeating a boss.\nOn the 3DO game system, save was available on the system itself through the internal memory.\n\nLEVELS:\nCemetery\n\n    * Frankie &amp; Heli\n    * Grave Danger\n    * Tomato Soup\n    * Disco Inferno\n    * Boss: Spin-N-Puke\n\n[edit] New Toonland\n\n    * Pow!\n    * Twin Towers\n    * Rock It!\n    * Knock! Knock! (optional)\n    * Boss: The Flatulator\n\n[edit] Jungle Isle\n\n    * Feeding Frenzy\n    * Congo Chaos\n    * Boss: Jungle Gym\n\n[edit] Kung Fuville\n\n    * Sumo City\n    * Fish Bait\n    * Chop Chop\n    * Boss: Toxic Turtle\n\n[edit] Rezopolis\n\n    * Rez Knight Fever\n    * On The Move\n    * Boss: Rez\n---------------------------------------------\n---------------------------------------------\n---------------------------------------------\n\n*****GEX 2 ENTER THE GECKO*****\n\nPLOT:\nSince his retirement from the public eye in 1996, Gex has resided himself to a life of solitude. For two years Gex started his day watching Kung-Fu Theater (Supermarket Sweep in the European release), eventually life started to feel like a telethon (he states that days, then weeks blurred into one long, sorry afternoon chat show).\nOne day, Gex was watching his TV when it suddenly went blank. The screen then began to flash a familiar face, over and over again, the face was that of Rez. The next thing Gex knows, two government agents show up at his side, requesting Gex's help. Gex denies, saying he's already saved the universe once. One of the agents then beats Gex over the head with a crowbar, knocking him unconscious.\nWhen Gex wakes up, he realizes he is in an interrogation room. The two agents ask him what he knows about Rez, Gex tells them everything. Once again they ask for his help, one of the agents reaches under the table, pulls out a briefcase and slides it over to Gex. Gex opens it and sees that it full of cash, and immediately starts counting it. Just when Gex thinks it couldn't get any better, the other agent tosses him a secret agent suit. Gex agrees to help them. The two agents give him a map, and say they want Rez to &quot;disappear&quot;, instructing him to hide the body between Jimmy Hoffa's and Spuds MacKenzie's.\nAs Gex leaves the building, a beautiful female agent walks up to him, and introduces herself as &quot;Agent Xtra&quot;, she wishes him good luck and leaves. Gex then leaves to the Media Dimension.\nOnce Gex is in the Media Dimension, he navigates through several channels. Cartoon (Toon TV); horror (Scream TV); sci-fi (The Rocket Channel); futuristic (Circuit Central); Kung-Fu (Kung-Fu Theater); Pre-history (The Pre-History Channel); Rezopolis; and Channel Z. Once Gex navigates through Rezopolis and Channel Z, he fights the overlord again. By dropping a large TV on top of him, Gex defeats Rez. Rez once again transforms into a ball of energy, and is then trapped in the same TV Gex dropped on him.\nRez tells Gex that he is his father, Gex asks how that could be possible. Rez says that he didn't always look like he does now, and that he fell into a scrap heap while trying to get free cable. Regardless, Gex picks up the remote, and is about to turn off the TV, when Rez begs him not to, saying he will do anything. Gex then shuts off the TV and makes a snide remark. To this day it still not known whether Rez truly is Gex's father, possibly meaning a retcon, or whether this was merely a reference to Star Wars.\nGex is last seen in a hotel room with (in a cameo appearance) Nikki, from the Pandemonium video games (particularly her Pandemonium 2 look).\n\nGAMEPLAY:\nEnter the Gecko is Gex's first foray into 3D world. His main moveset involves a tail whip attack, bouncing on his tail, using his tongue to eat flies, and performing a karate kick. He can also climb up on certain surfaces, and swim underwater.\nThe game takes place in a large hub filled with several TV screens based on various genres, parodying various genres from Looney Tunes to Star Wars. Each level has about three remotes to collect, as well as an additional one for collecting 120 collectibles within the level. Collecting enough remotes unlock new areas, bonus levels and boss levels.\n\nLEVELS:\n    * White Gate Area:\n          o Toon TV: Out of Tooning\n          o Scream TV: Smellraiser\n          o Gilligex Isle (Boss, requires 3 red remotes to open)\n          o Aztec 2 Step (Bonus, requires 3 silver remotes to open)\n          o Thursday the 12th (Bonus, requires 6 silver remotes to open)\n          o The Pre-History Channel: Lava Daba Doo (requires 4 gold remotes to open)\n          o Scream TV: Texas Chainsaw Manicure (requires 8 gold remotes to open)\n          o Rezopolis: Mazed and Confused (requires 12 gold remotes to open)\n    * Centre Area: (requires 1 gold remote to open)\n          o Scream TV: Frankensteinfeld\n          o Circuit Cental: www.dotcom.com\n          o Kung-Fu Theatre: Mao Tse Tongue\n          o Mooshoo Pork (Boss, requires 9 red remotes to open)\n          o In Drag Net (Bonus, requires 9 silver remotes to open)\n          o The Spy Who Loved Himself (Bonus, requires 12 silver remotes to open)\n    * Red Gate Area: (requires 2 gold remotes to open)\n          o The Rocket Channel: The Umpire Strikes Out\n          o The Pre-History Channel: Pangaea 90210\n          o Toon TV: Fine Tooning\n          o I Got the Reruns (Bonus, requires 15 silver remotes to open)\n          o Trouble in Uranus (Bonus, requires 18 silver remotes to open)\n          o Lizard in a China Shop (Bonus, requires 21 silver remotes to open))\n    * Green Gate Area: (requires 14 red remotes to open)\n          o The Pre-History Channel: This Old Cave\n          o Circuit Central: Honey I Shrunk the Gecko\n          o Scream TV: Poltergex\n          o Gexzilla Vs. Mecharez (Boss, requires 21 red remotes to open)\n          o Bugged Out (Bonus, requires 24 silver remotes to open)\n    * Blue Gate Area: (requires 3 gold remotes to open)\n          o The Rocket Channel: Pain in the Asteroids\n          o Kung-Fu Theatre: Samurai Night Fever\n          o Rezopolis: No Weddings and Funeral\n          o Channel Z (Boss, requires 33 red remotes to open)\n          o Chips and Dips (Bonus, requires 27 silver remotes to open)\n-------------------------------------------------\n-------------------------------------------------\n-------------------------------------------------\n\nGEX 3 DEEP COVER GECKO\n\nPLOT:\nWhen Gex is watching TV one day, he discovers that Rez has kidnapped Agent Xtra (the agent from Gex: Enter the Gecko's backstory), head of the TV Terrorist Defense Unit, to get to him. He teleports to the batcave-like lair he has in the Media Dimension, and begins another adventure. Each level parodies a certain aspect of television culture. Gex enters each level through a television set. He must collect remote controls to advance to the next level in order to complete his mission and rescue Xtra.\n\nGAMEPLAY:\nGameplay remains similar to the previous game, Gex: Enter the Gecko, with the addition of certain vehicles, such as a tank, a camel and a snowboard, as well as a gliding ability available with certain costumes. Levels are accessed via a more expansive hub, with more areas unlocked as the player collects remotes from each of the levels. Players can unlock and control three alternate characters, Rex, Cuz and Alfred, during bonus stages, though they play the same.\n\nCHARACTERS:\nFour new characters appear in this sequel. Agent Xtra, a live action female government Spy and whom Gex must help rescue from the clutches of Rez. Gex is also joined by his faithful butler, Alfred the tortoise who is a slight character reference to Bruce Wayne's butler Alfred Pennyworth. Alfred basically helps around and maintains Gex's secret lair which is known as &quot;Mission Control&quot;. Alfred can be found in parts of most levels and tailwhipping him gives useful advice. The two last are Rex, a red Dinosaur who Gex unfroze from a block of ice and Cuz Gex's cousin, who prove important for later use in the game.\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:5e6c2e8d5882de89696ad2bc3f1b1b0122f454c8","amp;dn":"Gex+1%2C+2%2C+and+3+%28FULL+COLLECTION%29+%28PSX+PS1%29+%28use+ePSXe%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e6c2e8d5882de89696ad2bc3f1b1b0122f454c8","infoHashBuffer":{"type":"Buffer","data":[94,108,46,141,88,130,222,137,105,106,210,188,63,27,27,1,34,244,84,200]},"announce":[],"urlList":[]}}