{"title":"Seismic Design, Assessment and Retrofitting of Concrete Building","uid":6543462,"size":13563735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e7063e22a25dbac69c30ac8b43f95a0c57599ce&amp;dn=Seismic+Design%2C+Assessment+and+Retrofitting+of+Concrete+Building&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1310772410,"description":"Seismic Design, Assessment and Retrofitting of Concrete Buildings: based on EN-Eurocode 8 (Geotechnical, Geological and Earthquake Engineering) by Michael N. Fardis\nProduct Description\nReflecting the historic first European seismic code, this professional book focuses on seismic design, assessment and retrofitting of concrete buildings, with thorough reference to, and application of, EN-Eurocode 8. Following the publication of EN-Eurocode 8 in 2004-05, 30 countries are now introducing this European standard for seismic design, for application in parallel with existing national standards (till March 2010) and exclusively after that. Eurocode 8 is also expected to influence standards in countries outside Europe, or at the least, to be applied there for important facilities. Owing to the increasing awareness of the threat posed by existing buildings substandard and deficient buildings and the lack of national or international standards for assessment and retrofitting, its impact in that field is expected to be major.\nWritten by the lead person in the development of the EN-Eurocode 8, the present handbook explains the principles and rationale of seismic design according to modern codes and provides thorough guidance for the conceptual seismic design of concrete buildings and their foundations. It examines the experimental behaviour of concrete members under cyclic loading and modelling for design and analysis purposes; it develops the essentials of linear or nonlinear seismic analysis for the purposes of design, assessment and retrofitting (especially using Eurocode 8); and gives detailed guidance for modelling concrete buildings at the member and at the system level. Moreover, readers gain access to overviews of provisions of Eurocode 8, plus an understanding for them on the basis of the simple models of the element behaviour presented in the book.\nProduct Details\nHardcover: 766 pages\nPublisher: Springer; 1 edition (September 29, 2009)\nLanguage: English\nISBN-10: 1402098413\nISBN-13: 978-1402098413","torrent":{"xt":"urn:btih:5e7063e22a25dbac69c30ac8b43f95a0c57599ce","amp;dn":"Seismic+Design%2C+Assessment+and+Retrofitting+of+Concrete+Building","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7063e22a25dbac69c30ac8b43f95a0c57599ce","infoHashBuffer":{"type":"Buffer","data":[94,112,99,226,42,37,219,172,105,195,10,200,180,63,149,160,197,117,153,206]},"announce":[],"urlList":[]}}