{"title":"Craft Beer for the Homebrewer (ePUB,Retail) {32Skulls}","uid":10822329,"size":19263900,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5eb31049064253e4ca29efa268830c1552dac63d&amp;dn=Craft+Beer+for+the+Homebrewer+%28ePUB%2CRetail%29+%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"32Skulls","files":-1,"time":1408547037,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜  \n\n\nAs the craft beer craze continues to sweep the nation, more and more people are deciding to try their hand at creating their own perfect brew. In Craft Beer for the Homebrewer, beer writer and certified cicerone (think sommelier for beer) Michael Agnew merges the passions of consumption and creation into one definitive guidebook, designed for the craft beer lover who also happens to be a homebrew enthusiast. Agnew presents dozens of recipes adapted by craft brewmasters for the homebrewer to make in his or her own kitchen, basement, garage, or patio. Based on the actual production beers of featured microbreweries, these recipes cover the entire range of beer styles--ambers and pales, IPAs, stouts and porters, Irish and Scottish ales, Belgians, and wheats--representing craft breweries from across the United States. Each recipe is accompanied by full-color photography, an ingredient list, instructions for both the mash and extract brewer, and historical and anecdotal notes about the brewery that provided it. Agnew prefaces the book with an introduction to the craft beer industry, briefly discussing the major ingredients and required equipment that homebrewers will encounter inside. With its meticulous selection of delicious beer varieties, Craft Beer for the Homebrewer offers a beautifully designed collection of microbrews for the homebrewer on the cutting edge of the craft beer scene.\n\n\n\nPublished by Voyageur Press in 2014\nEPUB, Retail, 98 pages, English","torrent":{"xt":"urn:btih:5eb31049064253e4ca29efa268830c1552dac63d","amp;dn":"Craft+Beer+for+the+Homebrewer+%28ePUB%2CRetail%29+%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb31049064253e4ca29efa268830c1552dac63d","infoHashBuffer":{"type":"Buffer","data":[94,179,16,73,6,66,83,228,202,41,239,162,104,131,12,21,82,218,198,61]},"announce":[],"urlList":[]}}