{"title":"The B52's - The B52's (1st album) .flac files","uid":6287640,"size":311280550,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5f1b219dd86c183aa3a36692949e004cb9e67466&amp;dn=The+B52%5C%27s+-+The+B52%5C%27s+%281st+album%29+.flac+files&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ulikes","files":18,"time":1301672137,"description":"The B-52's were New Wave pioneers. &quot;Rock Lobster&quot;, influenced by the vocalizations of Yoko Ono, is of course a New Wave classic. But oh, there is so much more. &quot;Planet Claire&quot; combines tacky space-horror-flick music with lyrics like &quot;Some say she's from Mars/Or one of the seven stars/That shine after 3:30 in the morning/WELL SHE ISN'T!&quot; My favorite track, &quot;Dance This Mess Around&quot;, is a brilliant mish-mosh of Shangri-Las melodrama, Supremes pop, 50's and 60's dance fads and wacky teen soap opera. It begins with great solemnity: &quot;Remember...when you held my hand/Say, remember...when you were my man&quot;, and it goes on from there. I can't begin to describe it totally. You just have to hear it. In &quot;Lava&quot;, a song about hot love, Fred announces &quot;I'm gonna jump in a crater&quot;, and Cindy and Kate respond nonchalantly &quot;See ya later&quot;. Track #6 has the very logical title &quot;There's a Moon in the Sky (Called the Moon)&quot;, but it mentions other heavenly bodies: &quot;You better move over/Here comes a super-nova.&quot; And if Petula Clark ever heard this version of &quot;Downtown&quot;, I hope her sense of humor was intact, because if not, she probably wanted to go sharpen her axe.\n\nThe songs, musically spare and slyly obliterating the then-reigning (and declining) disco sound, consist mostly of minimalist clanging guitar, choppy and/or eerie keyboards, and smashingly witty lyrics with on-target vocal delivery by all. What you have to understand is that in spite of the wackiness, this album works as serious music, or maybe I mean to say &quot;music to take seriously&quot;. How, I'm not sure. That's the beauty of it. \n\nTrack Listing:\n1. Planet Claire \n2. 52 Girls\n3. Dance This Mess Around \n4. Rock Lobster \n5. Lava \n6. There's A Moon In The Sky (Called The Moon)\n7. Hero Worship \n8. 6060-842\n9. Downtown \n\nI was shocked to noticed that this album has not been offered before on Pirate Bay. It is a rockin' classic in every sense of the word. No record collection is complete without it.\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:5f1b219dd86c183aa3a36692949e004cb9e67466","amp;dn":"The+B52%5C%27s+-+The+B52%5C%27s+%281st+album%29+.flac+files","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f1b219dd86c183aa3a36692949e004cb9e67466","infoHashBuffer":{"type":"Buffer","data":[95,27,33,157,216,108,24,58,163,163,102,146,148,158,0,76,185,230,116,102]},"announce":[],"urlList":[]}}