{"title":"S.T.A.L.K.E.R._LOST_ALPHA_v1.3000_setup","uid":10051805,"size":6440871905,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5fb856f686b5151cf2906d14247d0419bc19a738&amp;dn=S.T.A.L.K.E.R._LOST_ALPHA_v1.3000_setup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Monolyth42","files":19,"time":1398613358,"description":"Have you ever dreamt about playing the old, forgotten S.T.A.L.K.E.R. ?\n\n \nWe were amazed by GSC's work when they released the first S.T.A.L.K.E.R. screenshots in 2002. The old design, and atmosphere was stunning and we couldn't believe our eyes. Later in 2005 things has changed. They redesigned almost all old levels. Some of them became smaller, simpler (still nice, but different), and some levels were removed. After the release in 2007 we played the game a lot, and quickly noticed that some areas are missing. We opened forums, and talked countless nights about those for almost a year. Nowdays we could say, we have a full vision about GSC's old levels, due to the collected materials, videos and forgotten screenshots. We decided to remake those stunning areas, maybe they won't be the same, but we will try everything to make them look really nice, as we always wanted to see them. In early 2009, GSC released a build from 2004, which contained many old materials. We used some of the sdk objects for the level remakes, but adjusted (and bugfixed) them for our liking, also we didn't throw out our own levels. So expect to see our own Darkscape, Dead City, Rostok Factory and some more in Lost Alpha :)","torrent":{"xt":"urn:btih:5fb856f686b5151cf2906d14247d0419bc19a738","amp;dn":"S.T.A.L.K.E.R._LOST_ALPHA_v1.3000_setup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fb856f686b5151cf2906d14247d0419bc19a738","infoHashBuffer":{"type":"Buffer","data":[95,184,86,246,134,181,21,28,242,144,109,20,36,125,4,25,188,25,167,56]},"announce":[],"urlList":[]}}