{"title":"Wrapped in Lace: Knitted Heirloom Designs from Around the World","uid":11596795,"size":114498507,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5fc394fb9bdca059e476c3392a72ed7b90df0f57&amp;dn=Wrapped+in+Lace%3A+Knitted+Heirloom+Designs+from+Around+the+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"KnitLady","files":-1,"time":1417292438,"description":"The spectacular knitted lace designs of New Zealand designer Margaret Stove are truly the pinnacle of the craft. In Wrapped in Lace, dive into Margaretï¿½s love fo learning and creating knitted lace, then begin your own journey to master lace knitting with 12 original patterns. To appreciate the history of knitted lace, follow Margaretï¿½s quest to design and knit the legendary ï¿½wedding ring shawlï¿½ï¿½a large lace shawl so fine and delicate that it can be drawn through a wedding ring. Wrapped in Lace shares the art of designing patterns and the characteristics of lace traditions from around the world. Framed by an engaging narrative of learning to create knitted lace from scratch, Wrapped in Lace describes each set of lace techniques, patterns, and traditions in depth and offers Margaretï¿½s spectacular patterns for lace shawls, stoles, and scarves. These projects illustrate knitted lace from the Faroe Islands, Shetland Islands, Orenburg, Estonia, and lace motifs of New Zealand, as well as more contemporary European work. As an added bonus, Wrapped in Lace includes Margaretï¿½s tips for preserving, restoring, and remaking knitted lace heirlooms","torrent":{"xt":"urn:btih:5fc394fb9bdca059e476c3392a72ed7b90df0f57","amp;dn":"Wrapped+in+Lace%3A+Knitted+Heirloom+Designs+from+Around+the+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc394fb9bdca059e476c3392a72ed7b90df0f57","infoHashBuffer":{"type":"Buffer","data":[95,195,148,251,155,220,160,89,228,118,195,57,42,114,237,123,144,223,15,87]},"announce":[],"urlList":[]}}