{"title":"Beast Tech - Tom Horn","uid":10333064,"size":1146287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:601165b3ac86c4a6021d44e6a9b946c174c7b01f&amp;dn=Beast+Tech+-+Tom+Horn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"starxteel","files":2,"time":1402435342,"description":"Although microchip implantation might be introduced as a voluntary procedure, in time, there will be pressure to make it mandatory. A national identification system via microchip implants could be achieved in two stages. Upon introduction as a voluntary system, the microchip implantation will appear to be palatable. After there is a familiarity with the procedure and a knowledge of its benefits, implantation would be mandatory. --Dr. Elaine M. Ramesh, patent attorney for Franklin Pierce Law Center Most people today are familiar with radio-frequency identification (rfid) technology that is increasingly expanding within public and private firms as a method for verifying and tracking inventory and people. Yet how many know a plan exists for widespread adoption of human microchipping beginning in the year 2017?\nWhile testimony has been given that safeguards are in place to ensure privacy in connection with implantable biometric identification, some believe confidentiality is the last thing internal radio transmitters will protect--that in fact the plan to microchip humanity smacks of the biblical mark of the Beast. Has an end-times spirit indeed been pushing for adoption of this technology this generation? Students of eschatology (the study of end-times events) find it increasingly difficult to dismiss how this all looks and feels like movement toward fulfilling Revelation 13:16-17: &quot;And he causeth all, both small and great, rich and poor, free and bond, to receive a mark in their right hand, or in their foreheads: And that no man might buy or sell, save he that had the mark, or the name of the beast, or the number of his name.&quot;\nNow, as newer versions of rfid-like transmitters become even more sophisticated--adding other &quot;prophetic&quot; components such as merging human biological matter with transistors to create living, implantable machines, the authors of this book--a former police detective and a bestselling prophecy writer--have come to believe the possibility that the mark of the Beast will arrive through a version of this technology is substantial.\n\n\nAbout the author:\nTom Horn is an internationally recognized lecturer, radio host and best selling author of several books including his newest books, Petrus Romanus: The Final Pope Is Here, Forbidden Gates and Apollyon Rising 2012. He is a well-known columnist whose articles have been referred to by writers of the L. A. Times Syndicate, MSNBC, Christianity Today, New Man Magazine, World Net Daily, News Max, White House Correspondents and dozens of newsmagazines and press agencies around the globe. He has been interviewed by US Congressmen and Senators on his findings as well as featured repeatedly in major media including top-ten talk shows, America's Morning News for The Washington Times, The 700 Club, The Harvest Show, Coast to Coast AM, Prophecy in the News, and the Southwest Radio Church to name a few. Thomas received the highest degree honorary doctorate bestowed in 2007 from legendary professor Dr. I.D.E. Thomas for his research into ancient history, and has been endorsed by such national leaders as Dr. James Kennedy.","torrent":{"xt":"urn:btih:601165b3ac86c4a6021d44e6a9b946c174c7b01f","amp;dn":"Beast+Tech+-+Tom+Horn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"601165b3ac86c4a6021d44e6a9b946c174c7b01f","infoHashBuffer":{"type":"Buffer","data":[96,17,101,179,172,134,196,166,2,29,68,230,169,185,70,193,116,199,176,31]},"announce":[],"urlList":[]}}