{"title":"True Identity (1991) Lenny Henry Frank Langella James Earl Jones","uid":8717450,"size":898508884,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:611a21cacc188aec77199498313e7b3bc931c01b&amp;dn=True+Identity+%281991%29+Lenny+Henry+Frank+Langella+James+Earl+Jones&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Starbug81","files":1,"time":1374353495,"description":"Lenny Henry stars as a very black and very British unemployed actor who's desperately seeking his big break in the big apple. He finds himself sitting on a plane next to a highly influential Broadway Producer (Frank Langella) and his luck seems to be improving. When the flight hits some rather nasty unexpected turbulence, the Broadway Producer inadvertently reveals himself to be none other than a rather nasty criminal genius who eluded the FBI by staging an elaborate death and with the help of a little nip and tuck, managed to successfully reinvent himself. When the life-threatening turbulence settles, the wannabe actor finds himself in an arguably more life-threatening situation. What is a brother to do? If only he could somehow reinvent himself. He can't afford elaborate plastic surgery, but he does have a close friend with an impressive talent for special make-up effects. He soon finds himself giving the performance of his career as a very white and very Italian hit-man... who's been hired to whack himself.","torrent":{"xt":"urn:btih:611a21cacc188aec77199498313e7b3bc931c01b","amp;dn":"True+Identity+%281991%29+Lenny+Henry+Frank+Langella+James+Earl+Jones","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611a21cacc188aec77199498313e7b3bc931c01b","infoHashBuffer":{"type":"Buffer","data":[97,26,33,202,204,24,138,236,119,25,148,152,49,62,123,59,201,49,192,27]},"announce":[],"urlList":[]}}