{"title":"Higher Ground","uid":9859207,"size":2938937412,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:61468ae3dfd310e1d0c3302ea819f6783a4de7a9&amp;dn=Higher+Ground&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Demon_Sphinx","files":22,"time":1396265112,"description":"Located high in the mountains of the Northwestern United States and 25 miles from the nearest town, Mount Horizon High School is a sanctuary for troubled teens where they learn to overcome their fears and face their inner demons. The series focuses on one group of teens, the Cliffhangers, who battle their struggles with the aid of Peter Scarbrow (Joe Lando), a long-recovering drug-addict and former Wall Street mogul, and other school counselors. Setting the kids through their paces, not only giving them a normal high school education, but also a rigorous schedule of outdoor activities - camping, hiking, mountain climbing, biking, rafting, etc. - gives the students the confidence to face their struggles with addiction, abuse, or disorders. While navigating perilous action sequences, friendships, and romantic entanglements, the students (and some teachers) find Mnt. Horizon's world much safer than their turbulent home lives have been.\n\nStudents tackle issues such as drugs, depression, sexual, physical and verbal abuse, self-mutilation, eating disorders, gang violence, neglect, and suicide attempts.\nCharacters","torrent":{"xt":"urn:btih:61468ae3dfd310e1d0c3302ea819f6783a4de7a9","amp;dn":"Higher+Ground","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61468ae3dfd310e1d0c3302ea819f6783a4de7a9","infoHashBuffer":{"type":"Buffer","data":[97,70,138,227,223,211,16,225,208,195,48,46,168,25,246,120,58,77,231,169]},"announce":[],"urlList":[]}}