{"title":"Start - Punch Fear In The Face, Escape Average, Do Work That Mat","uid":9664565,"size":1417558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6182bee69caaf518523adf2cc3d55eb56cd9d539&amp;dn=Start+-+Punch+Fear+In+The+Face%2C+Escape+Average%2C+Do+Work+That+Mat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1393353081,"description":"Format: mobi/epub\nGenre: Self-Help/Management &amp; Leadership\nPrint Length: 288 pages\nRelease Date: 23 April 2013\n\nWall Street Journal best-selling author Jon Acuff reveals the steps to getting unstuck and back onto the path of being awesome.\n\nOver the last 100 years, the road to success for most everyone has been divided into predictable stages. But three things have changed the path to success:\n\nBoomers are realizing that a lot of the things they were promised aren't going to materialize, and they have started second and third careers.\n\nTechnology has given access to an unprecedented number of people who are building online empires and changing their lives in ways that would have been impossible years ago.\n\nThe days of 'success first, significance later' have ended.\n\nWhile none of the stages can be skipped, they can be shortened and accelerated. There are only two paths in life: average and awesome. The average path is easy because all you have to do is nothing. The awesome path is more challenging, because things like fear only bother you when you do work that matters. The good news is Start gives readers practical, actionable insights to be more awesome, more often.\n\nAuthor:\n\nJon Acuff used to be a Serial Quitter. He had eight jobs in eight years, constantly hoping the next one would be different. From writing advertising for The Home Depot to branding for companies like Bose and Staples, he's no stranger to the cubicle. In 2010, Jon closed the gap between his day job and his dream job when he joined the Dave Ramsey team to become a full-time author. He has contributed to CNN.com, speaks nationally on a variety of subjects, and is the author of three books: Quitter; Gazelles, Baby Steps And 37 Other Things Dave Ramsey Taught Me About Debt; and Stuff Christians Like. He lives in Nashville, TN, with his wife and two daughters.","torrent":{"xt":"urn:btih:6182bee69caaf518523adf2cc3d55eb56cd9d539","amp;dn":"Start+-+Punch+Fear+In+The+Face%2C+Escape+Average%2C+Do+Work+That+Mat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6182bee69caaf518523adf2cc3d55eb56cd9d539","infoHashBuffer":{"type":"Buffer","data":[97,130,190,230,156,170,245,24,82,58,223,44,195,213,94,181,108,217,213,57]},"announce":[],"urlList":[]}}