{"title":"The Tubes","uid":3898225,"size":1005989246,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:61ae1e59110c3a6588e5fd38249d15f8cc7f15e6&amp;dn=The+Tubes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"odoman","files":85,"time":1195405293,"description":"The Tubes were arch satirists of popular culture whose outrageous performance-art concepts -- which swung wildly from soft-core pornography to suit-and-tie conservatism -- frequently eclipsed their elusive musical identity. The beginnings of the group originate in Phoenix, Arizona in the late &amp;#039;60s, where guitarist Bill Spooner, keyboardist Vince Welnick and bassist Rick Anderson formed as the Beans (alternately billing themselves as the Radar Men from Uranus). After moving to San Francisco in 1972, the Beans recruited guitarist Roger Steen and drummer Prairie Prince (from Red, White &amp; Blues), and later became the Tubes with the addition of Michael Cotten on keyboards and former roadie Fee Waybill on lead vocals.\n\nOver the course of the next few years, the Tubes earned a devoted cult following on the strength of Spooner&amp;#039;s parodic songs and the group&amp;#039;s surreal live shows, which featured Waybill adopting a variety of personas including the &quot;crippled Nazi&quot; Dr. Strangekiss, country singer Hugh Heifer and Quay Lewd, a drug-addled British pop star. After signing to A&amp;M in 1975, they released their self-titled debut, followed a year later by Young and Rich; while both failed to transfer the manic energy and theatrical complexity of their live set onto record, the single &quot;White Punks on Dope&quot; became a minor hit and a radio staple.\n\nAfter 1977&amp;#039;s failed concept record The Tubes Now, the group toured England, where a series of banned performances made them a media sensation. However, during the recording of the concert LP What Do You Want From Live? Waybill broke his leg onstage while acting out his punk character Johnny Bugger; the remainder of the tour was cancelled, and with it died the band&amp;#039;s chart momentum. After returning to the U.S., they recruited producer Todd Rundgren and recorded 1979&amp;#039;s Remote Control, a concept album exploring the influence of television; when it met a similar commercial fate as its predecessors, the Tubes were dropped by A&amp;M.\n\nAfter signing to Capitol, they recorded 1981&amp;#039;s Completion Backwards Principle, an album based on an actual sales training instruction manual; both &quot;Talk to You Later&quot; and &quot;Don&amp;#039;t Want to Wait Anymore&quot; earned significant radio play, and the LP became the Tubes&amp;#039; first Top 40 hit. Thanks to its provocative video, the single &quot;She&amp;#039;s a Beauty&quot; reached the Top Ten, and pushed the 1983 LP Outside/Inside into the Top 20 Albums chart; after 1985&amp;#039;s Love Bomb stiffed, however, the Tubes disbanded, and Welnick later joined the Grateful Dead. In 1993, the Tubes reunited; consisting of Waybill, Steen, Anderson, Prince and new keyboardist Gary Cambra, they toured the U.S. and Europe before releasing a new LP, Genius of America, in 1996. Spooner also issued his own solo record, Mall to Mars. In 2000, the Tubes embarked on another extensive tour, issuing the greatest-hits-live album Tubes World Tour to commemorate the event.","torrent":{"xt":"urn:btih:61ae1e59110c3a6588e5fd38249d15f8cc7f15e6","amp;dn":"The+Tubes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61ae1e59110c3a6588e5fd38249d15f8cc7f15e6","infoHashBuffer":{"type":"Buffer","data":[97,174,30,89,17,12,58,101,136,229,253,56,36,157,21,248,204,127,21,230]},"announce":[],"urlList":[]}}