{"title":"Ben  E. King - The Ultimate Collection- Stand By Me [1987]  FLAC","uid":6598463,"size":329656915,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:61e9a7bc0b9dd743ccd64ba169f08a1745366963&amp;dn=Ben++E.+King+-+The+Ultimate+Collection-+Stand+By+Me+%5B1987%5D++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"keeybee","files":28,"time":1313114434,"description":"Please seed!\n\nBenjamin Earl King (born September 28, 1938), better known as Ben E. King, is an American soul singer. He is perhaps best known as the singer and co-composer of &quot;Stand by Me&quot;, a U.S. Top 10 hit in both 1961 and 1986 and a #1 hit in the UK in 1987, and as one of the principal lead singers of the R&amp;B vocal group The Drifters. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ben_E._King&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ben_E._King&lt;/a&gt;\n\nSo feel free to compare &quot;Save The Last Dance For Me&quot; and &quot;I count the tears&quot; from Drifters - The Drifters' Golden Hits.\nit's here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/6593862/Drifters_-_The_Drifters__Golden_Hits_[1968]__FLAC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/6593862/Drifters_-_The_Drifters__Golden_Hits_[1968]__FLAC&lt;/a&gt;\n\n\nBen E. King - Ultimate Collection Of Ben E. King - Stand By Me\noriginally released 1987\n\n01  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Stand By Me\n02  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Save The Last Dance For Me (with the Drifters)\n03  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - I (Who Have Nothing)\n04  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - That's When It Hurts\n05  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - I Could Have Danced All Night\n06  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - First Taste Of Love\n07  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Dream Lover\n08  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Moon River\n09  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Spanish Harlem\n10  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Amor\n11  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - I Count The Tears (with the Drifters)\n12  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Don't Play That Song (You Lied)\n13  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - This Magic Moment\n14  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Young Boy Blues\n15  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - It's All In The Game\n16  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Supernatural Thing (Part 1)\n17  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - On The Street Where You Live\n18  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Will You Still Love Me Tomorrow\n19  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Show Me The Way\n20  Ben E. King - Ultimate Collection Of Ben E. King - Stand By Me - Here Comes The Night\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/the-ultimate-collection-stand-by-me-best-of-ben-e-king-ben-e-king-with-the-drifters-r73904&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/the-ultimate-collection-stand-by-me-best-of-ben-e-king-ben-e-king-with-the-drifters-r73904&lt;/a&gt;\n","torrent":{"xt":"urn:btih:61e9a7bc0b9dd743ccd64ba169f08a1745366963","amp;dn":"Ben++E.+King+-+The+Ultimate+Collection-+Stand+By+Me+%5B1987%5D++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61e9a7bc0b9dd743ccd64ba169f08a1745366963","infoHashBuffer":{"type":"Buffer","data":[97,233,167,188,11,157,215,67,204,214,75,161,105,240,138,23,69,54,105,99]},"announce":[],"urlList":[]}}