{"title":"Tom Odell - Long Way Down (2013 (Deluxe) [FLAC] JLM","uid":8851238,"size":302582372,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:629bea5e47a8de3183da5c1321300e0bbc3624af&amp;dn=Tom+Odell+-+Long+Way+Down+%282013+%28Deluxe%29+%5BFLAC%5D+JLM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"politux","files":-1,"time":1377531367,"description":"\n  Tom Odell - Long Way Down (2013 (Deluxe) [FLAC] JLM\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Singer/Songwriter\n  Source: Scene\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Grow Old With Me \n  02 Hold Me \n  03 Another Love \n  04 I Know \n  05 Sense \n  06 Can't Pretend \n  07 Till I Lost \n  08 Supposed To Be \n  09 Long Way Down \n  10 Sirens \n  11 I Think Its Going To Rain Today \n  12 Storms \n  13 Heal \n  14 Till I Lost (Demo)\n  15 Grow Old With Me (Demo)\n\n  The brooding and bloodied Romeo to Jake Bugg's blue collar Brit-pop Lothario, sad sack English crooner Tom Odell's intimate, soul-searching ballads draw from an awfully deep well of ruin, especially for a man barely into his twenties. How much of that black hole was built from sheer artifice is up for debate, but there's certainly no denying the West Sussex native's knack for spinning expertly crafted tales of woe. The appropriately titled Long Way Down, his debut long-payer, aims for the nosebleed seats without riddling its audience with cannon fire. In fact, outside of the deliberately noisy &quot;Oh You Pretty Things&quot;-meets-The Black Keys cacophony of &quot;Hold Me,&quot; things remain firmly in the Tori Amos/Jeff Buckley arena of melodrama. That said, it's the latter to whom Odell pays the most reverence, as evidenced by the lush and evocative &quot;Can't Pretend,&quot; which cribs a pre-chorus melody or two from Buckley's &quot;Grace&quot; (and featured prominently in the wordless, overbearing trailer for the second season of Aaron Sorkin's The Newsroom). The jazzy, smoky, slow burn &quot;Sense&quot; and the sparse, mournful title cut mine similar territory, and while they are both at times quite lovely, they lack the palpable, haunted weight that the late Buckley brought so effortlessly to the table. It will be interesting to see how Odell grows into his character as his career advances (will he be the next Coldplay, Antony, or Lana Del Ray?) as he's got talent to spare, but at this point he's swimming in an idyllic creek, not a raging river, and no amount of howling will banish demons that have yet to be summoned.","torrent":{"xt":"urn:btih:629bea5e47a8de3183da5c1321300e0bbc3624af","amp;dn":"Tom+Odell+-+Long+Way+Down+%282013+%28Deluxe%29+%5BFLAC%5D+JLM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"629bea5e47a8de3183da5c1321300e0bbc3624af","infoHashBuffer":{"type":"Buffer","data":[98,155,234,94,71,168,222,49,131,218,92,19,33,48,14,11,188,54,36,175]},"announce":[],"urlList":[]}}