{"title":"New Japan Architecture - Recent Works by the Worlds Leading Arch","uid":9073147,"size":94761837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62ab1b3c531df449bde22607741e6adf50fbe8f9&amp;dn=New+Japan+Architecture+-+Recent+Works+by+the+Worlds+Leading+Arch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"STBGD","files":-1,"time":1382233329,"description":"Geeta K. Mehta, &quot;New Japan Architecture: Recent Works by the World's Leading Architects&quot; \nEnglish | ISBN: 4805309482 | 2011 | PDF | 224 pages | 90 MB\n\nThe global changes taking place in the architectural world are crystallizing right now in Japan, with the past five years being considered one of the most innovative periods in current Japanese design history. Observed by architects and designers from around the world, these changes are illustrated and articulated in New Japan Architecture.\n\nBy documenting 48 important projects by 42 established and avant-garde architects, this book takes the reader through a journey of current trends in contemporary Japanese architecture and predicts future directions. While some buildings strive for the ultimate Zen white cube, others exemplify the search for the 'Wow' factor. Cutting edge modernity in some buildings is countered by a concern for sustainability in others. The selection of buildings in New Japan Architecture includes projects that are big and small, private and public, residential and commercial. The informative writings complement beautiful photographs that highlight the remarkable aspects of each building. A must-have book for those interested in architecture and Japan.","torrent":{"xt":"urn:btih:62ab1b3c531df449bde22607741e6adf50fbe8f9","amp;dn":"New+Japan+Architecture+-+Recent+Works+by+the+Worlds+Leading+Arch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ab1b3c531df449bde22607741e6adf50fbe8f9","infoHashBuffer":{"type":"Buffer","data":[98,171,27,60,83,29,244,73,189,226,38,7,116,30,106,223,80,251,232,249]},"announce":[],"urlList":[]}}