{"title":"An Introduction Beginners Kung Fu Tai Chi with David Carradine","uid":11844547,"size":3199799248,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:62d581d917e00e0c96a0d872a0eb6eac3b93163d&amp;dn=+An+Introduction+Beginners+Kung+Fu+Tai+Chi+with+David+Carradine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"elessedilgirl","files":4,"time":1429906568,"description":"Let film star David Carradine lead you through this special introduction to Kung Fu, with a selection of exercises designed to help both strengthen and relax your mind and body with ancient techniques perfected over the centuries; the same techniques that would influence the choreographed fight scenes on Tarantinos Kill Bill. These ancient physical art forms use stretching, deep breathing and invigorating circular motion to gently awaken and loosen your entire body, improving balance, co-ordination and suppleness. These techniques, combining punches, kicks and posture, will enlighten the senses and refresh the spirit, stimulating your natural energy flow.\n\nTai Chi - Perfected centuries ago, Tai Chi remains one of the most efficient forms of exercise ever developed. Unlike most of todays exercises it actually increases your mental and physical energy through systematic stress reduction. But dont be fooled this is a thorough workout involving the entire body. You ll learn graceful, flowing movements which tone muscles, for the body, and enhance flexibility. Best of all, it s fun and easy to learn! Tai Chi programme includes: Extended Warm-Up Sequence, Stretching Exercises, Basic Stances, Vital Energy &amp; Fitness Exercises, Individual Tai Chi Movements, Complete Tai Chi Form, Meditation Sequence.\n\nVideo; x264; 704*578 (4:3); 2484 kbps; 25.000 fps\nAudio; aac; 160 kbps; 2 ch; 48.0 Khz","torrent":{"xt":"urn:btih:62d581d917e00e0c96a0d872a0eb6eac3b93163d","amp;dn":"+An+Introduction+Beginners+Kung+Fu+Tai+Chi+with+David+Carradine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62d581d917e00e0c96a0d872a0eb6eac3b93163d","infoHashBuffer":{"type":"Buffer","data":[98,213,129,217,23,224,14,12,150,160,216,114,160,235,110,172,59,147,22,61]},"announce":[],"urlList":[]}}