{"title":"La Banda dei Babbi Natale[BRRip XviD Ita Ac3][Nautilus-bt]","uid":6709615,"size":1468033772,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:634b8203f2ef68176d37b8de78bd4d9ca0b6d89c&amp;dn=La+Banda+dei+Babbi+Natale%5BBRRip+XviD+Ita+Ac3%5D%5BNautilus-bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"someuser11","files":1,"time":1317305479,"description":"[b][SIZE=16pt][color=blue] La banda dei Babbi Natale [/color][/SIZE][/b]\n[hr]\n[b][color=green]~~Locandina del film~~[/color][/b]\n\n[IMG]http://filmup.leonardo.it/posters/loc/500/labandadeibabbinatale.jpg[/img]\n[hr]\n[b][color=green]~~Scheda del film~~[/color][/b]\n\nLa banda dei Babbi Natale ÃƒÂ¨ un film diretto da Paolo Genovese, uscito nelle sale il 17 dicembre 2010. Si tratta dell'ottavo film interpretato dal trio comico Aldo, Giovanni &amp; Giacomo.\n\n\nTitolo originale \tLa banda dei Babbi Natale\nLingua originale \titaliano\nPaese \tItalia\nAnno \t2010\nDurata \t96 min.\nColore \tcolore\nAudio \tsonoro\nRapporto \t2,35:1\nGenere \tcommedia\nRegia \tPaolo Genovese\nSoggetto \tAldo, Giovanni &amp; Giacomo, Valerio Bariletti, Morgan Bertacca, Giordano Preda\nSceneggiatura \tAldo, Giovanni &amp; Giacomo, Valerio Bariletti, Morgan Bertacca, Giordano Preda\nProduttore \tPaolo Guerra, Giuseppe Viggiano\nCasa di produzione \tMedusa Film, A.Gi.Di.\nDistribuzione (Italia) \tMedusa Film, A.Gi.Di.\nFotografia \tGiovanni Fiore Coltellacci\nMontaggio \tMarco Spoletini\nTema musicale \tMele Kalikimaka, cantata da Mina\nScenografia \tEleonora Ponzoni\nCostumi \tBettina Pontiggia\n[hr]\n[b][color=green]~~Trama~~[/color][/b]\n\nA Milano, durante la notte di Natale, Aldo, Giovanni e Giacomo, tre amici uniti dalla passione comune per le bocce, vengono arrestati dalla Polizia durante una presunta rapina in un appartamento. Condotti in commissariato, i tre vengono considerati i membri della Banda dei Babbi Natale, che ha giÃƒÂ  svaligiato 8 appartamenti. Gli arrestati si dichiarano innocenti e raccontano all'ispettrice Bestetti il motivo per il quale si son trovati in quella equivoca situazione.\n\nLa storia si svolge nella settimana precedente al Natale. Aldo ÃƒÂ¨ uno scansafatiche con la passione per le scommesse (ma ÃƒÂ¨ anche molto bravo in cucina) che si fa mantenere dalla sua fidanzata Monica e sperpera un sacco di soldi alle corse dei cavalli con due allibratori che puntualmente lo ingannano. Oltretutto, rifiuta segretamente qualsiasi offerta di lavoro, anche quella dello zio di Monica, e quando lei scopre che il compagno, per pagarsi le scommesse, ha venduto ad un rigattiere una pregiata palla di vetro e oro appartenuta a sua nonna lo caccia di casa.\n[spoiler=continua trama]\nAldo viene quindi ospitato a casa di Giacomo, di mestiere chirurgo, rimasto vedovo da molti anni ma ancora incapace di superare il trauma, tanto da parlare con la foto della moglie e fare dei sogni nei quali lei gli impedisce di avere delle relazioni con altre donne. Per questo motivo, Giacomo rifiuta anche le attenzioni della collega Elisa, che perÃƒÂ² riesce a strappargli la promessa di uscire insieme nel caso Giacomo e la sua squadra perdano l'imminente finale di bocce che da quattro anni non riescono a vincere.\n\nSotto casa di Giacomo ha il suo ambulatorio Giovanni, un veterinario sposato che trattiene in segreto una relazione con una donna di Lugano e che si trova costretto a sopportare le angherie e le antipatie della suocera milanese e del suocero svizzero, ai quali ÃƒÂ¨ dichiaratamente inviso. Incapace di dire di no, Giovanni si ritrova a promettere ad entrambe le sue famiglie di essere presente alla cena di natale, ma dopo aver fatto una sorta di &quot;prova di resistenza&quot; facendo continuamente avanti e indietro nello stesso giorno tra Lugano e Milano capisce che cosÃƒÂ¬ non puÃƒÂ² andare avanti.\n\nIntanto arriva la sera della finale; i Charlatans sembrano favoriti, ma al tiro decisivo Aldo sbaglia e la partita ÃƒÂ¨ persa. Giacomo deve quindi onorare l'impegno preso, e durante la serata capisce, grazie anche all'aiuto dei due amici, di essere sinceramente innamorato della sua collega e che ÃƒÂ¨ giunto il momento di lasciarsi il passato alle spalle. Nel corso della stessa serata Giovanni cerca di dire la veritÃƒÂ  ad entrambe le sue compagne, ma complici la timidezza e una serie di esilaranti imprevisti alla fine non ci riesce e scappa.\n\nAl ritorno a casa i due trovano Aldo allegro e pieno di soldi, e la veritÃƒÂ  viene ben presto a galla; non solo Aldo ha sbagliato il tiro decisivo di proposito, poichÃƒÂ© aveva scommesso contro la propria squadra, ma per pagare la scommessa ha venduto al solito rigattiere uno scheletro anatomico originale al quale Giacomo era molto affezionato, essendo quello di un suo antenato. Giovanni e Giacomo lo cacciano via.\n\nAldo, tentando di redimersi, usa il resto dei soldi vinti alla scommessa per ricomprare lo scheletro e la palla di vetro, ma riesce a riavere solo lo scheletro perchÃƒÂ© la palla ÃƒÂ¨ giÃƒÂ  stata venduta. Torna quindi a casa di Giacomo vestito da Babbo Natale e gli restituisce lo scheletro, ricevendo in cambio un regalo da parte dei suoi due amici, che lo hanno giÃƒÂ  perdonato: per una curiosa coincidenza si tratta proprio della palla di vetro, cosÃƒÂ¬ ad Aldo viene l'idea giusta per riconquistare la fidanzata.\n\nI tre, vestiti tutti da Babbo Natale, raggiungono la casa di Monica, e Aldo colloca la palla di vetro sotto l'albero, ma proprio in quel momento arriva la polizia ed i tre vengono arrestati. A racconto concluso la Bestetti, non avendoci apparentemente creduto, rinchiude ugualmente i tre amici in prigione, ma proprio quando se ne sta andando viene portata in commissariato la vera Banda dei Babbi Natale, e riconosciuta la veridicitÃƒÂ  del racconto dei tre si affretta a rilasciarli.\n\nOrmai ÃƒÂ¨ la notte della vigilia, e nel commissariato viene improvvisato un cenone a cui partecipano la Bestetti e i tre amici con le rispettive compagne. Sembra andare tutto per il meglio, quando all'improvviso irrompe sulla scena la fidanzata svizzera di Giovanni, e la cena degenera in un esilarante parapiglia durante il quale Giovanni si getta dalla finestra pur di sfuggire al suo pericoloso suocero che tenta addirittura di sparargli.\n\nUn anno dopo i tre amici sono nuovamente riuniti per l'ennesima finale. Aldo ha messo la testa a posto e si ÃƒÂ¨ trovato un lavoro, anche se non ha perso il vizio delle scommesse, Giacomo ha intrapreso una relazione stabile con la sua collega Elisa e Giovanni ha chiuso per sempre con le relazioni adulterine (malgrado appaia piuttosto evidente che ne conservi una con la stessa Bestetti). La storia si conclude con i Charlatans che finalmente riescono ad aggiudicarsi l'agognata coppa.[/spoiler]\n[hr]\n[b][color=green]~~Trailer~~[/color][/b]\t\n[youtube]v8HuWllog4s[/youtube]\n[hr]\n[b][color=green]~~Screenshot~~[/color][/b]\n\n[IMG]http://i.imgur.com/JXJ15.png[/IMG]\n\n[IMG]http://i.imgur.com/P1OKa.png[/IMG] \n\n[IMG]http://i.imgur.com/Y3ihm.png[/IMG]\n\n[IMG]http://i.imgur.com/Guhkz.png[/IMG]\n[hr]\n[b][color=green]~~Scheda tecnica del DivX~~[/color][/b]\n\nAVI File Details\n ========================================\n[ About file ]\n\nName: La.Banda.Dei.Babbi.Natale.2010.iTALiAN.AC3.BRRip.XviD-GBM.avi\nDate: Wed, 28 Sep 2011 22:49:30 +0200\nSize: 1,468,033,772 bytes (1400.026 MiB)\n\n[ Magic ]\n\nTipo file: RIFF (little-endian) data, AVI, 720 x 304, 23.98 fps, video: XviD, audio: Dolby AC3 (6 channels, 48000 Hz)\n\n[ Generic infos ]\n\nDuration: 01:40:33 (6032.98 s)\nContainer: AVI\nAVI has index: Yes\nTotal tracks: 2\nTrack nr. 0: video\nTrack nr. 1: audio {audio}\n\n[spoiler]\n[ Relevant data ]\n\nResolution: 720 x 304\nWidth: multiple of 16\nHeight: multiple of 16\nAverage DRF: 3.673\nStandard deviation: 0.602\nStd. dev. weighted mean: 0.447\n\n[ Video track ]\n\nFourCC: xvid/XVID\nResolution: 720 x 304\nFrame aspect ratio: 45:19 = 2.368 (~2.35:1)\nPixel aspect ratio: 253:255 = 0.992\nDisplay aspect ratio: 759:323 = 2.35 (~2.35:1)\nFramerate: 23.976 fps\nTotal frames: 144,647\nStream size: 1,124,373,827 bytes (1072.286 MiB)\nBitrate: 1490.967 kbps\nQf: 0.284\nKey frames: 1,587 (0; 250; 488; 506; 756; ... 144615)\nNull frames: 0\nMin key int: 1\nMax key int: 250\nAvg key int: 91.145\nDelay: 0 ms\n\n[ Audio track ]\n\nAudio tag: 0x2000 (AC3)\nChannels: 6\nChunks: 94,266\nStream size: 337,849,344 bytes (322.198 MiB)\nBitstream type (bs): AC3\nFrames (bs): 188,532\nDuration (bs): 01:40:33 (6033.024 s)\nChunk-aligned (bs): Yes\nBitrate (bs): 448 kbps CBR\nSampling frequency (bs): 48000 Hz\nMode (bs): 3 front, 2 rear, 1 LFE\nPreload: 192 ms\nMax A/V diff: 249 ms\nDelay: 0 ms\n\n[ Video bitstream ]\n\nBitstream type: MPEG-4 Part 2\nUser data: XviD0050\nPacked bitstream: No\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Custom pixel shape (253:255 = 0.992)\nQuant type: MPEG\nTotal frames: 144,647\nDrop/delay frames: 0\nCorrupt frames: 0\n\nI-VOPs:  1587 (  1.097 %)\nP-VOPs: 53156 ( 36.749 %) #######\nB-VOPs: 89903 ( 62.153 %) ############\nS-VOPs:     0 (  0.000 %)\nN-VOPs:     1 (  0.001 %)\n\nMax consecutive B-VOPs: 2\n    1 consec: 12375 ( 24.199 %) #####\n    2 consec: 38764 ( 75.801 %) ###############\n\n[ DRF analysis ]\n\naverage DRF: 3.673\nstandard deviation: 0.602\nmax DRF: 5\n\nDRF&lt;2:     0 (  0.000 %)\nDRF=2:  2136 (  1.477 %)\nDRF=3: 51156 ( 35.366 %) #######\nDRF=4: 83202 ( 57.521 %) ############\nDRF=5:  8152 (  5.636 %) #\nDRF&gt;5:     0 (  0.000 %)\n\nI-VOPs average DRF: 2\nI-VOPs std. deviation: 0\nI-VOPs max DRF: 2\n\nP-VOPs average DRF: 3.222\nP-VOPs std. deviation: 0.44\nP-VOPs max DRF: 4\n\nB-VOPs average DRF: 3.969\nB-VOPs std. deviation: 0.459\nB-VOPs max DRF: 5\n\n[ Profile compliancy ]\n\nSelected profile: #undef#\nResolution: 720 x 304 &gt; #undef# x #undef#\nFramerate: Ok\n\n[/spoiler]\n[hr]\n\n[b][color=green]~~Note~~[/color][/b]\nNon sono l'autore del rip e non mi voglio prendere nessun merito al riguardo.\nBanda max 70 kbytes 24/24 7/7 :D\n\nVisita il nostro sito www.nautilus-bt.org ( Visit our site www.nautilus-bt.org )","torrent":{"xt":"urn:btih:634b8203f2ef68176d37b8de78bd4d9ca0b6d89c","amp;dn":"La+Banda+dei+Babbi+Natale%5BBRRip+XviD+Ita+Ac3%5D%5BNautilus-bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"634b8203f2ef68176d37b8de78bd4d9ca0b6d89c","infoHashBuffer":{"type":"Buffer","data":[99,75,130,3,242,239,104,23,109,55,184,222,120,189,77,156,160,182,216,156]},"announce":[],"urlList":[]}}