{"title":"Screenflick 2.2","uid":7484817,"size":3904595,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:639f13633e856dcd612e1a721acae9ec351f08fb&amp;dn=Screenflick+2.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"openarena","files":-1,"time":1343548271,"description":"Screenflick is a program for Mac OS X that features high performance screen capturing for smooth, fluid motion up to 60 fps. Screenflick can record any portion of the screen, simultaneously recording audio from internal or external microphones and the system audio.\n\nAn excellent utility for software screencasters and software trainers, Screenflick offers the ability to display keyboard commands, and highlights mouse clicks to better communicate which actions are being performed during screen recording.\n\nUnlike other solutions, Screenflick allows you to record a movie once and compress it as many times as you want at different resolutions, qualities, and with or without audio, offering you the maximum amount of flexibility when choosing which presentation options to offer to movie viewers.\n\nWhat's New\nVersion 2.2\n\nNew:\n\nOS X 10.8 support for Gatekeeper, better recording, and mouse cursor hiding.\nSupport for recording Retina displays at full or half resolution.\nAdded the ability to record at a reduce scale to save CPU and disk space.\nThe movie preview now has a player bar which can be used for scrubbing through the movie.\nAdded a recording timer option, so the recording can be stopped after a set time.\nDock and Status menu items for Pause/Resume\nUI Refinements\nCaptured movies not inside the Movies folder can be double-clicked in Finder to open in Screenflick. They're then tracked for the rest of the time the app is running. \n\nChanges:\n\nMore accurate frame rate measurement on 10.7, and improved recording performance.\nMuch more accurate mouse event to frame syncing.\nMovie being recorded while Quit is now marked as valid\nIncludes a new version of Soundflower\n\nFixes:\n\nSmall leaks\n\nRequirements\n\nIntel\nMac OS X 10.6 or later\nQuickTime 7.2 or later\n\nCourtesy of AJhacks","torrent":{"xt":"urn:btih:639f13633e856dcd612e1a721acae9ec351f08fb","amp;dn":"Screenflick+2.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"639f13633e856dcd612e1a721acae9ec351f08fb","infoHashBuffer":{"type":"Buffer","data":[99,159,19,99,62,133,109,205,97,46,26,114,26,202,233,236,53,31,8,251]},"announce":[],"urlList":[]}}