{"title":"Modeling and Simulation in Polymers","uid":12427524,"size":8729797,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63b56b4ca616ec650f38a3e3b6fee546b1b294c4&amp;dn=Modeling+and+Simulation+in+Polymers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1442362592,"description":"Modeling and Simulation in Polymers (Wiley, 2010).pdf\n\nISBN 978-3-527-32415-6\n\nModeling and simulation can be done instead of experiments as well as in combination with practical work. At present, the latter option is mainly chosen because theoretical predictions have yet to reach the level of significance necessary for as a base for important decisions.Nevertheless, due to cost pressure and environmental considerations,great emphasis is placed on constantly improving simulation methods.\nFilling a gap in the literature and all set to become the standard in this field, this monograph begins with a look at computational viscoelastic fluid mechanics and studies of turbulent flows of dilute polymer solutions. It then goes on discuss simulations of nanocomposites, polymerization kinetics, computational approaches for polymers and modeling polyelectrolytes. Further sections deal with tire optimization, irreversible phenomena in polymers, the hydrodynamics of artificial and bacterial flagella as well as modeling and simulation in liquid crystals.\nThe result is invaluable reading for polymer and theoretical chemists, chemists in industry, materials scientists and plastics technologists","torrent":{"xt":"urn:btih:63b56b4ca616ec650f38a3e3b6fee546b1b294c4","amp;dn":"Modeling+and+Simulation+in+Polymers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63b56b4ca616ec650f38a3e3b6fee546b1b294c4","infoHashBuffer":{"type":"Buffer","data":[99,181,107,76,166,22,236,101,15,56,163,227,182,254,229,70,177,178,148,196]},"announce":[],"urlList":[]}}