{"title":"A. Zee - Einstein Gravity in a Nutshell [2013][A]","uid":10502203,"size":11530063,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64773b02f5b7ca2a0a4ac494b551a70aaeb895ce&amp;dn=A.+Zee+-+Einstein+Gravity+in+a+Nutshell+%5B2013%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Anette14","files":-1,"time":1404720041,"description":"Description\nProduct Details\nBook Title: Einstein Gravity in a Nutshell\t\nBook Author: A. Zee (Author)\nSeries: In a Nutshell\nHardcover: 888 pages\nPublisher: Princeton University Press (May 5, 2013)\nLanguage: English\nISBN-10: 069114558X\nISBN-13: 978-0691145587\n\n===================================================================================\nBook Description\nPublication Date: May 5, 2013\nThis unique textbook provides an accessible introduction to Einstein's general theory of relativity, a subject of breathtaking beauty and supreme importance in physics. With his trademark blend of wit and incisiveness, A. Zee guides readers from the fundamentals of Newtonian mechanics to the most exciting frontiers of research today, including de Sitter and anti-de Sitter spacetimes, Kaluza-Klein theory, and brane worlds. Unlike other books on Einstein gravity, this book emphasizes the action principle and group theory as guides in constructing physical theories. Zee treats various topics in a spiral style that is easy on beginners, and includes anecdotes from the history of physics that will appeal to students and experts alike. He takes a friendly approach to the required mathematics, yet does not shy away from more advanced mathematical topics such as differential forms. The extensive discussion of black holes includes rotating and extremal black holes and Hawking radiation. The ideal textbook for undergraduate and graduate students, Einstein Gravity in a Nutshell also provides an essential resource for professional physicists and is accessible to anyone familiar with classical mechanics and electromagnetism. It features numerous exercises as well as detailed appendices covering a multitude of topics not readily found elsewhere.\nProvides an accessible introduction to Einstein's general theory of relativity\nGuides readers from Newtonian mechanics to the frontiers of modern research\nEmphasizes symmetry and the Einstein-Hilbert action\nCovers topics not found in standard textbooks on Einstein gravity\nIncludes interesting historical asides\nFeatures numerous exercises and detailed appendices\nIdeal for students, physicists, and scientifically minded lay readers\nSolutions manual (available only to teachers).\n\n===================================================================================\nReview\nOne of Choice's Outstanding Academic Titles for 2013\n\n&quot;Zee writes in an informal, conversational style, displaying his extensive experience and close contacts with many undergraduate and graduate students.&quot;--Choice\n\n===================================================================================\nFrom the Inside Flap\n&quot;Einstein Gravity in a Nutshell is a remarkably complete and thorough textbook on general relativity, written in a refreshing and engaging style. Zee leads us through all the major intellectual steps that make what is surely one of the most profound and beautiful theories of all time. The book is enjoyable and informative in equal measure. Quite an achievement.&quot;--Pedro Ferreira, University of Oxford\n\n&quot;Zee's new text on gravitation provides a wonderful introduction to Einstein's theory. Written at a level accessible to undergraduates, it prepares its readers for work at the research frontier, gently leading the reader to a modern and sophisticated understanding of the subject with a humorous, often conversational style. Providing broad coverage of the subject, including cosmology and black holes, it is an excellent complement to Hartle's book and good preparation for Carroll's.&quot;--Michael Dine, University of California, Santa Cruz\n\n&quot;Einstein Gravity in a Nutshell is richly infused with the author's wit and wisdom, with a refreshing emphasis on concepts rather than mathematics. Zee's writing is characteristically insightful, humorous, irreverent, and accessible.&quot;--Andrew Hamilton, University of Colorado, Boulder\n\n===================================================================================\nAbout the Author\nA. Zee is professor of physics at the Kavli Institute for Theoretical Physics at the University of California, Santa Barbara. His books include &quot;Quantum Field Theory in a Nutshell&quot; and &quot;Fearful Symmetry: The Search for Beauty in Modern Physics&quot; (both Princeton).\n===================================================================================","torrent":{"xt":"urn:btih:64773b02f5b7ca2a0a4ac494b551a70aaeb895ce","amp;dn":"A.+Zee+-+Einstein+Gravity+in+a+Nutshell+%5B2013%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64773b02f5b7ca2a0a4ac494b551a70aaeb895ce","infoHashBuffer":{"type":"Buffer","data":[100,119,59,2,245,183,202,42,10,74,196,148,181,81,167,10,174,184,149,206]},"announce":[],"urlList":[]}}