{"title":"Crisis on Infinite Earths (01 - 12) (of 12) (1985) (Digital -) (","uid":10941085,"size":605708918,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:64b3b900eb839abdde042cb9c9cfafc3bfc2d829&amp;dn=Crisis+on+Infinite+Earths+%2801+-+12%29+%28of+12%29+%281985%29+%28Digital+-%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"nemesis43","files":12,"time":1409517688,"description":"Crisis on Infinite Earths (01 - 12) (of 12) (1985) (Digital -) (TheHand-Empire)\n\n\n&quot;Crisis On Infinite Earths&quot; was DC Comics attempt to consolidate years of stories into a single shared universe. This series also brought in characters that DC Comics had acquired from other companies, such as Blue Beetle, Question, Captain Atom, Peacemaker and Nightshade (whom DC had purchased from Charlton Comics).\n\nComics didn't come any bigger than this. &quot;Crisis on Infinite Earths&quot; was a 12 issue maxi-series featuring nearly every character in DC comics' 50 year history, written and drawn by two of the industry's biggest name talents: Marv Wolfman and George Perez. It was a story that saw hundreds of heroes meet their deaths, worlds literally collide, and a bold streamlining of an entire line of super hero books. Not only the biggest event of the year, it would have ramifications for years to come, dividing DC's history into two halves dubbed Pre and Post Crisis.\n\nThe original idea behind Crisis was to create a more fixed universe for the heroes and villains of DC comics to occupy. Over the years, the formerly exciting idea of parallel universes was viewed by some as a convoluted mess. The heroes of the Justice League of America lived on Earth-1, while their older counterparts, the Justice Society of America, fought crime on Earth-2. Earth-3 housed the Crime Syndicate (evil versions of the JLA), while Earth Prime was a world where would-be heroes were relegated to the pages of comic books. There was an Earth for Captain Marvel's exploits, one for the Freedom Fighters and even one for the funny animal adventures of Captain Carrot, among many others.\n\nThe universes had grown out of control, and so Wolfman and Perez organized a grand scale team-up. Heroes from all time periods and all walks of life united under the powerful guidance of the Monitor. Many heroes sacrificed their lives in the ensuing battles. Finally, the Anti-Monitor was defeated - but at a great cost. In place of an infinite number of realities, only one remained: a new earth with an untold story and unlimited potential.","torrent":{"xt":"urn:btih:64b3b900eb839abdde042cb9c9cfafc3bfc2d829","amp;dn":"Crisis+on+Infinite+Earths+%2801+-+12%29+%28of+12%29+%281985%29+%28Digital+-%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64b3b900eb839abdde042cb9c9cfafc3bfc2d829","infoHashBuffer":{"type":"Buffer","data":[100,179,185,0,235,131,154,189,222,4,44,185,201,207,175,195,191,194,216,41]},"announce":[],"urlList":[]}}