{"title":"The Secret Life of Childrens Books 2of2 1080p HDTV x264-MVGroup","uid":15375542,"size":738753921,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:64ea7b5936b4f5231aac622bd97b1bd219004ca3&amp;dn=The+Secret+Life+of+Childrens+Books+2of2+1080p+HDTV+x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"MVGroup","files":1,"time":1469187086,"description":"BBC The Secret Life of Childrens Books 2of2 The Water-Babies 1080p HDTV x264-MVGroup\r\n\r\nPart 2. The Water-Babies\r\nWritten in 1862 by the Reverend Charles Kingsley, The Water-Babies tells the story of a young chimney sweep called Tom who finds redemption amongst the pulsing life of the open ocean when he is transformed into an aquatic creature. Church of England vicar and former pop star Reverend Richard Coles dives beneath the surface of this children's classic to reveal the revolutionary science behind the story, the influence it had on social reform in Victorian England and how the author's racist viewpoints impacted its reputation.\r\n\r\nCharles Kingsley was a man of contradictions - as changeable as the tide. He was a passionate outdoorsman who had to lock himself away during bouts of depression, a public speaker who suffered from a lifelong stammer, a social reformer who distrusted democracy, and a sensitive scholar with the instincts of a street-fighter. His most famous book, The Water-Babies, is as eccentric and compelling as he was.\r\n\r\nRichard finds out how the book was born out of a sense of outrage at the suffering of young sweeps, and how its success led to a change in the law. He grapples with the dark side of The Water-Babies, exploring how the book's 'muscular Christianity' was tainted by racial prejudice. And he discovers how, at the same time, Kingsley's classic contained a sense of feminine spirituality seemingly at odds with whiskery Victorian stereotypes.\r\n\r\nRichard meets Prof Steve Jones to discuss the close friendship between Charles Kingsley and Charles Darwin, whose On the Origin of Species Kingsley had been one of the first to praise. He talks to fellow Church of England priest Reverend Marie-Elsa Bragg about the book's mystical side, and visits the rectory where Kingsley wrote the first chapter of the work in half an hour under the insistence of his son.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 21 (~3247Kbps)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.47 VBR 48KHz (~128Kbps)\r\nAudio Channels: 2\r\nRun-Time: 29 min\r\nNumber Of Parts: 2\r\nTotal Size: 701 MB (average)\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:64ea7b5936b4f5231aac622bd97b1bd219004ca3","amp;dn":"The+Secret+Life+of+Childrens+Books+2of2+1080p+HDTV+x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64ea7b5936b4f5231aac622bd97b1bd219004ca3","infoHashBuffer":{"type":"Buffer","data":[100,234,123,89,54,180,245,35,26,172,98,43,217,123,27,210,25,0,76,163]},"announce":[],"urlList":[]}}