{"title":"Our Dark Side: A History of Perversion (2009) epub","uid":10447292,"size":398675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6519d2b510aa2a4ac16bb459c72508536370808f&amp;dn=Our+Dark+Side%3A+A+History+of+Perversion+%282009%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bookzilla","files":1,"time":1403979101,"description":"Where does perversion begin? Who is perverse? Ever since the word first appeared in the Middle Ages, anyone who delights in evil and in the destruction of the self or others has been described as 'perverse'. But while the experience of perversion is universal, every era has seen it and dealt with it in its own way.\n\n The history of perversion in the West is told here through a study of great emblematic figures of the perverse - Gilles de Rais, the mystical saints and the flagellants in the middle ages, the Marquis de Sade in the eighteenth century, the masturbating child, the male homosexual and the hysterical woman nineteenth century, Nazism in the twentieth century, and the complementary figures of the paedophile and the terrorist in the twenty-first.\n\n The perverse are rarely talked about and when they are it is usually only to be condemned. They are commonly viewed as monstrous and cruel, as something alien to the very nature of being human. And yet, perversion can also attest to creativity and self-transcendence, to the refusal of individuals to submit to the rules and prohibitions that govern human life. Perversion fascinates us precisely because it can be both abject and sublime. Whether they are sublime because they turn to art or mysticism, or abject because they surrender to their murderous impulses, the perverse are part of us because they exhibit something that we always conceal: our own negativity and our dark side.","torrent":{"xt":"urn:btih:6519d2b510aa2a4ac16bb459c72508536370808f","amp;dn":"Our+Dark+Side%3A+A+History+of+Perversion+%282009%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6519d2b510aa2a4ac16bb459c72508536370808f","infoHashBuffer":{"type":"Buffer","data":[101,25,210,181,16,170,42,74,193,107,180,89,199,37,8,83,99,112,128,143]},"announce":[],"urlList":[]}}