{"title":"Thurston Moore - The Best Day (2014) [FLAC]","uid":11262367,"size":371872714,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:653c685a3f01fa2b417f5cc318b32a45f89119f5&amp;dn=Thurston+Moore+-+The+Best+Day+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1413984097,"description":"\n  Thurston Moore - The Best Day (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Alternative, Indie, Experimental\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Speak to the Wild\n  02 Forevermore \n  03 Tape \n  04 The Best Day\n  05 Detonation \n  06 Vocabularies \n  07 Grace Lake \n  08 Germs Burn \n\n  Though his discography is littered with dozens of explorations in noise, improv side projects, and collaborations with other fringe-dwelling artists, Sonic Youth main man Thurston Moore's most visible solo offerings are spare and often with years between them. The moody guitar rock daydream of 1995's Psychic Hearts didn't see a proper follow-up until 2007's Trees Outside the Academy. The Beck-produced 2011 effort Demolished Thoughts was decidedly more subdued, offering up whisper-thin acoustic folk and a more toned-down take on the type of instrumental experimentation Moore began crafting with Sonic Youth back in the early '80s. The Best Day stands as the next major chapter in Moore's body of song-friendly solo work and returns to his signature songwriting style and meditative, sprawling guitar rock deconstruction. The album begins with bell-like guitar harmonics on &quot;Speak to the Wild,&quot; but immediately launches into a lurching, creepy rhythm and building tension, recalling some of the more eerie moments of the Sonic Youth catalog circa Dirty or Murray Street. \n\n  The lengthy, clattering &quot;Forevermore&quot; immediately follows the eight-plus-minute opening track, stretching The Best Day's first third over just two songs and setting up a rolling, mysterious backdrop of repetitive, lingering guitar wails for Moore's distant poetic lyrical wordplay. Sonic Youth drummer Steve Shelley plays on most of the record, adding a relentlessly simple but unignorable propulsive element to the tunes. There are dips into spellbinding acoustics on tunes like &quot;Vocabularies&quot; and &quot;Tape,&quot; as well as driving punk on the sneery &quot;Detonation.&quot; The Best Day comes nearly 20 years after Moore's official solo debut, Psychic Hearts, but the minimal, pushy rhythm and guitar interplay of &quot;Germs Burn&quot; and noisy clouds of feedback that break down &quot;Grace Lake&quot; could have fit nicely on that album. That's not to say he's simply been retreading ideas since the mid-'90s. The swaggering blues wobble of the title track and witchy acoustics that pop up throughout the album are all relatively new territory, but when Moore hits his stride with strange, dreamlike fits of guitar chaos, unconventional changes, and unflinching rhythms, all the elements of his very singular style come into full focus. While the newer additions to Thurston's muse are all well and good, The Best Day is most exciting when he returns to his most familiar trademarks, again investigating a sound that has spawned generations of imitators but still sounds like no one else","torrent":{"xt":"urn:btih:653c685a3f01fa2b417f5cc318b32a45f89119f5","amp;dn":"Thurston+Moore+-+The+Best+Day+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"653c685a3f01fa2b417f5cc318b32a45f89119f5","infoHashBuffer":{"type":"Buffer","data":[101,60,104,90,63,1,250,43,65,127,92,195,24,179,42,69,248,145,25,245]},"announce":[],"urlList":[]}}