{"title":"Intergraph COADE CADWorx 2010","uid":7116044,"size":341620677,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:66835d5a441ed291caed01ebed8aff0866d8b61e&amp;dn=Intergraph+COADE+CADWorx+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"inakidb","files":2,"time":1332221069,"description":"The Most Complete and Easiest to Use Plant Design Suite\nIntergraph CADWorx Plant Design Suite is an integrated, complete software series for plant design that provides intelligent drawing/database connectivity, advanced levels of automation and easy-to-use drafting tools. The comprehensive series of design tools includes structural steel, equipment, process and instrument diagrams and design review plus automatic isometrics and bills of material.\n\nCADWorx is quick and easy to set up and use, so you can start designing right away. The bi-directional links between CADWorx and analysis programs for pipes and vessels allow designers and engineers to easily share information while keeping the drawings, models and related information always in synch as changes are made. And, the fast processing and highly refined user-interface features in CADWorx allow multiple users to work efficiently together on even the largest models.\n\nSince its introduction, CADWorx has revolutionized the plant design industry with its ease of use, flexibility, interconnectivity and scalability.\n","torrent":{"xt":"urn:btih:66835d5a441ed291caed01ebed8aff0866d8b61e","amp;dn":"Intergraph+COADE+CADWorx+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66835d5a441ed291caed01ebed8aff0866d8b61e","infoHashBuffer":{"type":"Buffer","data":[102,131,93,90,68,30,210,145,202,237,1,235,237,138,255,8,102,216,182,30]},"announce":[],"urlList":[]}}