{"title":"The Making of Kind of Blue - Miles Davis and his Masterpiece (Ar","uid":10611749,"size":43435081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66a2efbd262548595be65cb8e1610a28fded5ea3&amp;dn=The+Making+of+Kind+of+Blue+-+Miles+Davis+and+his+Masterpiece+%28Ar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"STBGD","files":-1,"time":1406047283,"description":"Pdf / English / 2000 / 256 pages / 41 MB\n\nFrom the moment it was recorded, more than forty years ago, Miles Davis's Kind of Blue was hailed as a jazz classic. To this day, it remains the bestselling jazz album of all time, embraced by fans of all music genres. The album represented a true watershed moment in jazz history, and helped to usher in the first great jazz revolution since bebop.\n\nThe Making of Kind of Blue is an exhaustively researched examination of how this masterpiece was born. Recorded with pianist Bill Evans; tenor saxophonist John Coltrane; composer/theorist George Russell; and Miles himself, the album represented a fortuitous conflation of some of the real giants of the jazz world, at a time when they were at the top of their musical game. The end result was a recording that would forever change the face of American music\n.\nThrough extensive interview and access to rare recordings, Eric Nisenson pieced together the whole story of this miraculous session, laying bare the genius of Miles Davis, other musicians, and the heart of jazz itself.","torrent":{"xt":"urn:btih:66a2efbd262548595be65cb8e1610a28fded5ea3","amp;dn":"The+Making+of+Kind+of+Blue+-+Miles+Davis+and+his+Masterpiece+%28Ar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66a2efbd262548595be65cb8e1610a28fded5ea3","infoHashBuffer":{"type":"Buffer","data":[102,162,239,189,38,37,72,89,91,230,92,184,225,97,10,40,253,237,94,163]},"announce":[],"urlList":[]}}