{"title":"Gold Rush:Alaska Season 3(HD) NO Specials","uid":9384032,"size":9137760780,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6783c9132ce11d03a475787380075bb89d6fcf86&amp;dn=Gold+Rush%3AAlaska+Season+3%28HD%29+NO+Specials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"rukin2","files":-1,"time":1387770709,"description":" Gold Rush S03E01-Million Dollar Season\nThis season someone hits the mother lode. Todd doubles down with two claims, twice the crew and twice the gear. Dakota Fred's glory hole is thought to contain millions in gold. Parker hires a new crew and sets his sights on new land.\nAired October 26th, 2012\n\nGold Rush S03E02-The Wrong Claim\nDave faces disaster when his new claim cannot be mined; Todd is thousands of dollars in the hole; the Dakota boys face the threat of floods; Parker needs new ground.\nAired November 2nd, 2012\n\nGold Rush S03E03-Secret Weapons\nTodd does a deal on a new claim to get Dave's crew back in action. The Dakota boys hire new miners and one is quickly terminated. Todd junks his old wash plant, and replaces it with the new Super-Trommel.\nAired November 9th, 2012\n\nGold Rush S03E04-Battle of the Bridge\nTodd's chief investor arrives unannounced and threatens to pull the plug after he finds the mine at a standstill. Team Turin is plagued by melted permafrost and a broken dozer. Parker and the Dakota boys go to war over a bridge.\nAired November 16th, 2012\n\nGold Rush S03E05-The ultimatum\nTodd's investor demands to see 100 ounces of gold in the next three weeks. Parker's crew goes into meltdown when he forces them to replace a bridge and Fred attempts to make a precision part for his vital excavator.\nAired November 23rd, 2012\n\nGold Rush S03E06-Game Changer\nTodd finally takes delivery of the Turbo Trommel. Dave's mine could close if they can't improve on their disastrous first clean up. The Dakota boys are forced to run second hand dirt and Parker sets a new goal.\nAired November 30th, 2012\n\nGold Rush S03E07-Road to Gold\nTodd and his crew finally get to test the new Turbo Trommel. Dave pushes his crew to double their last clean out. The Dakota Boys receive a visit from the inspector and Parker brings in dynamite to blast a boulder.\nAired December 7th, 2012\n\nGold Rush S03E08-Up Smith Creek\nTodd Hoffman faces closure if he fails to get 100 ounces of gold for his investor. The Dakota Boys believe they've finally found the elusive Glory Hole. Parker Schnabel uncovers the two-year mystery of Smith Creek.\nAired December 14th, 2012\n\nGold Rush S03E09-Leprechaun Gold\nParker finds out about the fate of his grandpa. Todd has to rebuild his turbo trammel, Indian River faces a shutdown and the Dakota boys investigate whether the Glory Hole is truly an ancient waterfall.\nAired January 4th\n\nGold Rush S03E10-Dozer Wars\nTodd and Dave go to war over the dozer they both need to keep mining and Todd banks on finding virgin ground beneath a pile of dredge tailings. Parker faces a crew rebellion and Dakota Fred attacks the Glory Hole with his secret weapon- the bedrock shark\nAired January 11th, 2013\n\nGold Rush S03E11-Pink Slip\nTodd calls it quits on his turbo trammel and shuts down his Quartz Creek operation. Dave's race to open a new cut leaves his dozer hanging over a cliff. Parker finally hits bedrock at Emerson Trench.\nAired January 18th, 2013\n\nGold Rush S03E12-The Merger\nTodd forces his crew and Dave's crew to merge into one team. The Dakota Boys use their new equipment to get back down to the bottom of the Glory Hole. Parker risks his life to get pay dirt from an abandoned mine site.\nAired January 25th, 2013\n\nGold Rush S03E13-The NightShift\nTodd pushes Big Red to near breaking point on his best ground yet. Fred and Dustin battle to save an excavator as water floods the glory hole and Parker faces his worst nightmare as the dangerous mine road claims its first victim.\nAired Febuary 1st, 2013\n\nGold Rush S03E14-Bedrock Blowout\nTodd pushes Big Red to near breaking point on his best ground yet. Fred and Dustin battle to save an excavator as water floods the glory hole and Parker faces his worst nightmare as the dangerous mine road claims its first victim.\nAired Febuary 8th, 2013\n\nGold Rush S03E15-Redemption Road\nOut of Indian River paydirt, Todd comes up with a risky plan to hit his 1,000 ounce goal. A bad fall puts Fred out the game, leaving Dustin to dig the glory hole. Parker worries his season is over but his grandpa is convinced he's near the motherlode.\nAired Febuary 15th, 2013\n\nGold Rush S03E16-The Motherlode\nWinter strikes and the miners wage the final battle for the mother lode. The Hoffmans pull out a secret weapon to thaw frozen gold-rich paydirt. Dustin plunges into the freezing waters of the Glory Hole and Parker mines the last ground at Big Nugget.\nAired Febuary 23rd, 2013\nSource\n\nI hope you enjoy my torrent! :) Enjoy!\nSeed!\nShare!\nLeave a comment :)\n\n\nNOTE: There Are NO SPECIAL EPISODES IN THIS TORRENT! Just regular Episodes! Sorry :/ ","torrent":{"xt":"urn:btih:6783c9132ce11d03a475787380075bb89d6fcf86","amp;dn":"Gold+Rush%3AAlaska+Season+3%28HD%29+NO+Specials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6783c9132ce11d03a475787380075bb89d6fcf86","infoHashBuffer":{"type":"Buffer","data":[103,131,201,19,44,225,29,3,164,117,120,115,128,7,91,184,157,111,207,134]},"announce":[],"urlList":[]}}