{"title":"Clips4Sale - Leilani Lei, Fifi Foxx (Mommy s Family Threesome)","uid":15823731,"size":533548642,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:67c77afd7d52856acbea81540eb95d7ed8b11baf&amp;dn=Clips4Sale+-+Leilani+Lei%2C+Fifi+Foxx+%28Mommy+s+Family+Threesome%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"SudoSu","files":1,"time":1473807091,"description":"http://youpornbook.com\r\n\r\n――――――――――――――――\r\n Screen source:\r\n―――――――――――――――― \nhttp://imgreborn.com/?v=852501 \nhttp://imgreborn.com/?v=910206\r\n\r\nEver since Mom and Dad's divorce, Mom has been lying around, depressed and unmotivated. The cable's been shut off, and now someone's knocking on the front door. My brother and I yelled for Mom to get it, hoping she would get out of bed, but she didn't move. My brother knocked on her bedroom door, and asked her to unlock it, but she didn't answer. She's really in a slump.\r\n\r\nThis had been going on for months, so we needed to do something. I wasn't sure what would cheer her up, but I knew that she needed a distraction from Dad. The divorce really had been hard on her emotionally. We decided it would be a good idea to keep her company. I asked her to unlock the door, and my brother and I walked in.\r\n\r\nMom was lying in bed, apathetic and alone. I felt bad that she was so depressed, and wrapped my arms around her tiny waist. I told her to get up, but I heard the usual, &quot;...but I don't wanna.&quot; Ugh. I had to get her out of this mindset. I don't know why, but I just...kissed her. I hadn't really planned on doing something that crazy. I think it took my brother a minute to really process what I had done. He was blown away, and I knew he was turned on.\r\n\r\nI encouraged my brother to touch Mommy, and while he kissed her, I pulled down her panties. I spread her soft thighs, and Aiden and I shared her small tits. Our tongues swirled around her cute nipples, and she moaned happily. She loved it. Mommy needed us, and I wanted her to forget all about Daddy.\r\n\r\nI think maybe I was a bad influence to my brother. I saw his throbbing cock, and suggested he put it into her mouth. As he did, I spread her tight pussy lips with my tongue. &quot;Does Mommy taste good?&quot; my brother looked down at me. I smiled as my tongue rubbed against her clit. Aiden was so turned on, especially with Mom sucking his cock. I had no idea she could be so dirty.\r\n\r\nI wanted to see Aiden fuck Mom. I made her lie down on me, and smiled as Aiden put his cock inside of her. I just wanted Mommy to feel good. She deserved it. She moaned loudly, and I kissed her softly. Mommy started to get really dirty, and soon I was sitting on her face as Aiden fucked her.\r\n\r\nBut my brother wanted both of us. He put me on my hands and knees, and then fucked me, switching between me and Mom. He felt so good, and his cock was soaked with all of Mom's juices. He went back and forth with us, and then put Mom on her back, and fucked her until he came all over her stomach. I've never seen Mom so happy.\r\n\r\nMore exclusive porn at:  https://thepiratebay.org/user/SudoSu/","torrent":{"xt":"urn:btih:67c77afd7d52856acbea81540eb95d7ed8b11baf","amp;dn":"Clips4Sale+-+Leilani+Lei%2C+Fifi+Foxx+%28Mommy+s+Family+Threesome%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67c77afd7d52856acbea81540eb95d7ed8b11baf","infoHashBuffer":{"type":"Buffer","data":[103,199,122,253,125,82,133,106,203,234,129,84,14,185,93,126,216,177,27,175]},"announce":[],"urlList":[]}}