{"title":"[V. Ganapathy]Steam Generators and Waste Heat Boilers For Proces","uid":11355194,"size":15062293,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67d0474c40146fcece82cc1635a0634cfa7a34d2&amp;dn=%5BV.+Ganapathy%5DSteam+Generators+and+Waste+Heat+Boilers+For+Proces&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"zombie_rox","files":1,"time":1414934466,"description":"Incorporates Worked-Out Real-World Problems\n\nSteam Generators and Waste Heat Boilers: For Process and Plant Engineers focuses on the thermal design and performance aspects of steam generators, HRSGs and fire tube, water tube waste heat boilers including air heaters, and condensing economizers. Over 120 real-life problems are fully worked out which will help plant engineers in evaluating new boilers or making modifications to existing boiler components without assistance from boiler suppliers. The book examines recent trends and developments in boiler design and technology and presents novel ideas for improving boiler efficiency and lowering gas pressure drop. It helps plant engineers understand and evaluate the performance of steam generators and waste heat boilers at any load.\n\nLearn How to Independently Evaluate the Thermal Performance of Boilers and Their Components\n\nThis book begins with basic combustion and boiler efficiency calculations. It then moves on to estimation of furnace exit gas temperature (FEGT), furnace duty, view factors, heat flux, and boiler circulation calculations. It also describes trends in large steam generator designs such as multiple-module; elevated drum design types of boilers such as D, O, and A; and forced circulation steam generators. It illustrates various options to improve boiler efficiency and lower operating costs. The author addresses the importance of flue gas analysis, fire tube versus water tube boilers used in chemical plants, and refineries. In addition, he describes cogeneration systems; heat recovery in sulfur plants, hydrogen plants, and cement plants; and the effect of fouling factor on performance. The book also explains HRSG simulation process and illustrates calculations for complete performance evaluation of boilers and their components.\n\n    Helps plant engineers make independent evaluations of thermal performance of boilers before purchasing them\n    Provides numerous examples on boiler thermal performance calculations that help plant engineers develop programming codes with ease\n    Follows the metric and SI system, and British units are shown in parentheses wherever possible\n    Includes calculation procedures for the basic sizing and performance evaluation of a complete steam generator or waste heat boiler system and their components with appendices outlining simplified procedures for estimation of heat transfer coefficients\n\nSteam Generators and Waste Heat Boilers: For Process and Plant Engineers serves as a source book for plant engineers, consultants, and boiler designers.\n\nPublisher: CRC Press (16 October 2014)\nLanguage: English\nISBN-10: 1482247127\nISBN-13: 978-1482247121","torrent":{"xt":"urn:btih:67d0474c40146fcece82cc1635a0634cfa7a34d2","amp;dn":"%5BV.+Ganapathy%5DSteam+Generators+and+Waste+Heat+Boilers+For+Proces","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67d0474c40146fcece82cc1635a0634cfa7a34d2","infoHashBuffer":{"type":"Buffer","data":[103,208,71,76,64,20,111,206,206,130,204,22,53,160,99,76,250,122,52,210]},"announce":[],"urlList":[]}}