{"title":"Bruce Lee Filmography Soundtrack Discography","uid":5259675,"size":400413123,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:684dd2c232073e031c52849ec147eba11c73b47e&amp;dn=Bruce+Lee+Filmography+Soundtrack+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"satan165","files":96,"time":1262652566,"description":"1. The Big Boss (aka Fists of Fury)\nBruce Lee's first film was scored by German composed Peter Thomas.  The only commercial soundtrack available was on vinyl only and not distributed in the US.  Unfortunately the great body of music is wasted as the 'producers' (read: bootleggers) apparently just took snippets from a print of the film and called it a soundtrack; the movie's dialogue is still embedded on top of the musical selections.  I added this version anyways for archival purposes.\n\nHowever, just a few years ago the soundtrack was re-released exclusively on iTunes in its correct form.  However - it was not made available in the USA iTunes store.  This forced me into a quest that had my scavenge through 100s of torrents and hours in p2p services looking for this album.  Eventually I gave up...and purchased a 3000 Yen Japanese iTunes gift card (for $42) and bought it legitimately.  That done, I am now sharing the (mp3 converted) album quite illegitimately.  Also included are three songs that appear in the film but are not on this iTunes exclusive album.  These songs are however available on other Peter Thomas releases.\n\n2. Fist of Fury (aka The Chinese Connection)\nThis score was done by Joseph Koo.  The only existing 'soundtrack' is a Chinese vinyl that is basically a bootleg thrown together from a dubbed print of the film.  However the title track with vocals has some truly inspirational yet outlandish lyrics and makes the whole thing worthwhile as it is included in its entirety and without character dialogue.\n\n3. Way of the Dragon (aka Return of the Dragon)\nAgain by Joseph Koo, this has befallen the same fate as the previous film.  However, like those it is included for archival purposes.  Some is intact however sans dialogue, like the supremely funky instrumental theme.\n\n4. Enter the Dragon\nThis masterpiece score is still available and in print on compact disc.  Put together by the great Lalo Schifrin, it will truly draw you into the film's scenes as you enjoy it on headphones, or blasting out of speakers.\n\n5. Game of Death\nI found two separate soundtracks for this film.  I began to sort through them and soon gave up, have at it yourself.  There is some overlap no doubt, but I'm not sure how much.  Both are done by the great John Barry and the score is excellent.","torrent":{"xt":"urn:btih:684dd2c232073e031c52849ec147eba11c73b47e","amp;dn":"Bruce+Lee+Filmography+Soundtrack+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"684dd2c232073e031c52849ec147eba11c73b47e","infoHashBuffer":{"type":"Buffer","data":[104,77,210,194,50,7,62,3,28,82,132,158,193,71,235,161,28,115,180,126]},"announce":[],"urlList":[]}}