{"title":"Nutrition and Physical Degeneration by Weston A. Price (Expanded","uid":10465923,"size":146680706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68cc204f34d3b1df61772ee6518b7c758e8de38a&amp;dn=Nutrition+and+Physical+Degeneration+by+Weston+A.+Price+%28Expanded&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":1,"time":1404193036,"description":"New Expanded 8th edition with new photos and text.\n\nAn epic study demonstrating the importance of whole food nutrition, and the degeneration and destruction that comes from a diet of processed foods.\n\n\nFor nearly 10 years, Weston Price and his wife traveled around the world in search of the secret to health. Instead of looking at people afflicted with disease symptoms, this highly-respected dentist and dental researcher chose to focus on healthy individuals, and challenged himself to understand how they achieved such amazing health. Dr. Price traveled to hundreds of cities in a total of 14 different countries in his search to find healthy people. He investigated some of the most remote areas in the world. He observed perfect dental arches, minimal tooth decay, high immunity to tuberculosis and overall excellent health in those groups of people who ate their indigenous foods. He found when these people were introduced to modernized foods, such as white flour, white sugar, refined vegetable oils and canned goods, signs of degeneration quickly became quite evident. Dental caries, deformed jaw structures, crooked teeth, arthritis and a low immunity to tuberculosis became rampant amongst them. Dr. Price documented this ancestral wisdom including hundreds of photos in his book, Nutrition and Physical Degeneration.","torrent":{"xt":"urn:btih:68cc204f34d3b1df61772ee6518b7c758e8de38a","amp;dn":"Nutrition+and+Physical+Degeneration+by+Weston+A.+Price+%28Expanded","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68cc204f34d3b1df61772ee6518b7c758e8de38a","infoHashBuffer":{"type":"Buffer","data":[104,204,32,79,52,211,177,223,97,119,46,230,81,139,124,117,142,141,227,138]},"announce":[],"urlList":[]}}