{"title":"ALIAS complete SEASON 1 Xvid.avi [metalpunk69]","uid":5061046,"size":2681023758,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6905df162f4633bebe289af14392354ab155e4a2&amp;dn=ALIAS+complete+SEASON+1+Xvid.avi+%5Bmetalpunk69%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":6,"uploader":"metalpunk69","files":46,"time":1250707525,"description":"ALIAS COMPLETE SEASON 1 \n\nNO. OF EPISODES - 22 \n\nVIDEO FORMAT - .avi    \n\n\nSEASON 1 SUMMARY :-\n\nSeven years before season 1, Sydney Bristow was an undergraduate student of English literature when she was approached with a job offer by someone claiming to work for SD-6, which was supposedly part of the Central Intelligence Agency. She accepted the offer, and quickly became a field agent. In the pilot, she tells her fiancÃƒÂ© Danny that she is a spy. As a result of revealing SD-6's existence to an outsider, her fiancÃƒÂ© is murdered by SD-6.\n\nIt is then that Sydney is told by her father Jack Bristow (another SD-6 agent) that SD-6 is not part of the CIA; instead, it is part of the Alliance of Twelve, an organization that is an enemy to the United States. Sydney decides to offer her services to the real CIA as a double agent. Her offer is soon accepted, and she begins the long and arduous task of destroying SD-6 from the inside. She quickly learns that her father is also a double agent for the CIA.\n\nMajor plotlines from season 1 include Sydney hiding her triple-identity from her friends, both in her personal life and in her SD-6 job, Will Tippin's investigation into Danny's death, and the past antics of Sydney's mother. Sub-plots included Sydney's friendship with Francie, Francie's romantic relationship with Charlie, and Sydney's developing relationship with her CIA handler Michael Vaughn, of whom she is skeptical at first but grows to trust as her life becomes increasingly stressful. Season One focuses on the development of Sydney's character, and allows the audience to become familiar with her. The other seasons share the same theme of a guest star appearing throughout the entire season.\n\n","torrent":{"xt":"urn:btih:6905df162f4633bebe289af14392354ab155e4a2","amp;dn":"ALIAS+complete+SEASON+1+Xvid.avi+%5Bmetalpunk69%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6905df162f4633bebe289af14392354ab155e4a2","infoHashBuffer":{"type":"Buffer","data":[105,5,223,22,47,70,51,190,190,40,154,241,67,146,53,74,177,85,228,162]},"announce":[],"urlList":[]}}