{"title":"R-Drive Image Technician 6.0 Build 6011 (x32/x64) (Portable)","uid":12752442,"size":82825084,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:694e420fafb7561b7ea26269a46a4989b35343b3&amp;dn=R-Drive+Image+Technician+6.0+Build+6011+%28x32%2Fx64%29+%28Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"jovo_bih","files":1,"time":1447398463,"description":"************************************************************\r\nR-Drive Image Technician 6.0 Build 6011 (x32/x64) (Portable)\r\n************************************************************\r\n\r\nR-Drive Image is one of the best backup and disaster recovery solutions to prevent losing your data after a fatal system failure.\r\n\r\nR-Drive Image is a potent utility providing disk image files creation for backup or duplication purposes.\r\nA disk image file contains the exact, byte-by-byte copy of a hard drive, partition or logical disk and can be created with various compression levels on the fly without stopping Windows OS and therefore without interrupting your business.\r\nThese drive image files can then be stored in a variety of places, including various removable media such as CD-R(W)/DVD, Iomega Zip or Jazz disks, etc. \r\n\r\nR-Drive Image restores the images on the original disks, on any other partitions or even on a hard drive's free space on the fly. To restore system and other locked partitions R-Drive Image is switched to the pseudo-graphic mode directly from Windows or bootable version created by the utility is launched from CD disc or diskettes.\r\n\r\nUsing R-Drive Image, you can completely and rapidly restore your system after heavy data loss caused by an operating system crash, virus attack or hardware failure. You can also use R-Drive Image for mass system deployment when you need to setup many identical computers. In other words, you can manually setup one system only, create an image of the system, and then deploy it on all other computers, saving your time and costs. If you need to restore only certain files from a disk image, you can connect that image as a virtual disk and copy those files directly from the disk image using Windows Explorer or any other file utility.\r\n\r\nOS: Windows (x86/x64)\r\n\r\nChanges in R-Drive Image 6.0.6011 Tue Nov 10, 2015\r\n\r\nBugfixes:\r\n\r\n- Startup version: the program might crash when restoring a large number of files.\r\n- Program's GUI might work slowly when a large number of existing files were to be skipped during restoring. Fixed.\r\n- Symlinks might be incorrectly restored. Fixed.\r\n- When an OEM system media master image was larger than 2.3GB, yet fitted to a single DVD, R-Drive Image split the image into two files on one iso image. Fixed.\r\n\r\nHomepage http://www.drive-image.com/","torrent":{"xt":"urn:btih:694e420fafb7561b7ea26269a46a4989b35343b3","amp;dn":"R-Drive+Image+Technician+6.0+Build+6011+%28x32%2Fx64%29+%28Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"694e420fafb7561b7ea26269a46a4989b35343b3","infoHashBuffer":{"type":"Buffer","data":[105,78,66,15,175,183,86,27,126,162,98,105,164,106,73,137,179,83,67,179]},"announce":[],"urlList":[]}}