{"title":"Art Of Noise - The Best of the Art of Noise TQMP","uid":4769380,"size":401099755,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:699b57ed70706d787b4cd366071ba142edb4b3a5&amp;dn=Art+Of+Noise+-+The+Best+of+the+Art+of+Noise+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"zootallure","files":22,"time":1236986601,"description":"Art of Noise (also The Art of Noise) was an avant-garde synthpop group formed in 1983 by producer Trevor Horn, music journalist Paul Morley, and session musicians/studio hands Anne Dudley, J.J. Jeczalik, and Gary Langan. The group's mostly instrumental compositions were novel melodic sound collages based on digital sampler technology, which was new at the time. Inspired by turn-of-the-century revolutions in music, the Art of Noise were initially packaged as a faceless anti- or non-group, blurring the distinction between the art and its creators. The band is noted for innovative use of electronics and computers in pop music and particularly for innovative use of sampling.\n\nThe name of the group alludes to the essay The Art of Noises by noted futurist Luigi Russolo. From the earliest releases on ZTT, the band referred to themselves as both Art of Noise and The Art of Noise. Official and unofficial releases and press material use both versions.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health","torrent":{"xt":"urn:btih:699b57ed70706d787b4cd366071ba142edb4b3a5","amp;dn":"Art+Of+Noise+-+The+Best+of+the+Art+of+Noise+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"699b57ed70706d787b4cd366071ba142edb4b3a5","infoHashBuffer":{"type":"Buffer","data":[105,155,87,237,112,112,109,120,123,76,211,102,7,27,161,66,237,180,179,165]},"announce":[],"urlList":[]}}