{"title":"The Religion Virus - Why We Believe in God (Epub) Gooner","uid":11715472,"size":312361,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69d855014de312f0c8c0a6d068e9aacbd1392b01&amp;dn=The+Religion+Virus+-+Why+We+Believe+in+God+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1424552509,"description":"Publisher: CreateSpace Independent Publishing Platform; 2 edition (19 April 2013)\nLanguage: English\nISBN-10: 1482371006\nISBN-13: 978-1482371000\n\nReligions evolve, not metaphorically, but in a very real way. By applying survival-of-the-fittest principles to religion, we can finally understand how religion became incredibly infectious to the average human. Religion is perfectly adapted to its environment: your brain. In The Religion Virus, you will learn how infectious ideas like the loving father-figure God, the promise that death is not the end, the attraction of heaven, the threat of hell, and many others evolved from prehistoric to modern times. You will finally understand why today's religions survived while thousands of other religions and sects died out. The world's religions have amazing parallels to biological life: they reproduce, mutate, and compete with each other in an ongoing battle for survival of the fittest. Like biological life, over ninety-nine percent of the world's religions are extinct, but the ones that remain are quite remarkable. They are the strongest and best. More importantly, survival of the fittest does not necessarily mean survival of the truth, but rather the survival of the things people want to believe, whether true or not","torrent":{"xt":"urn:btih:69d855014de312f0c8c0a6d068e9aacbd1392b01","amp;dn":"The+Religion+Virus+-+Why+We+Believe+in+God+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69d855014de312f0c8c0a6d068e9aacbd1392b01","infoHashBuffer":{"type":"Buffer","data":[105,216,85,1,77,227,18,240,200,192,166,208,104,233,170,203,209,57,43,1]},"announce":[],"urlList":[]}}