{"title":"Carbon Copy Cloner - 3.5.4 [Intel/K]","uid":10346306,"size":12273195,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:69dac577a321f96a4d5894438a0e931460f80523&amp;dn=Carbon+Copy+Cloner+-+3.5.4+%5BIntel%2FK%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Xgollom","files":-1,"time":1402611786,"description":"Name: Carbon Copy Cloner\nVersion:  - 3.5.4\n\nMac Platform: Intel\nIncludes: K\n\nOS version: 10.6 or higher\n\nLink for more information: http://www.bombich.com/index.html\n\n\n\nCarbon Copy Cloner backups are better than ordinary backups. Suppose the unthinkable happens while you're under deadline to finish a project: your Mac is unresponsive and all you hear is an ominous, repetitive clicking noise coming from its hard drive. With ordinary backups, you'd spend your day rushing out to a store to buy a new hard drive and then sit in front of your computer reinstalling the operating system and restoring data. \n\nWith Carbon Copy Cloner, your data and the operating system's data are all preserved on a bootable volume, ready for production at a moment's notice. When disaster strikes, simply boot from your backup and get back to using your Mac. At your convenience, replace the failed hard drive and then let CCC restore the OS, your data and your settings directly from the backup in one easy step. \n\nAny backup application can save your stuff. A CCC bootable backup will save your productivity too!\n\nWhats new:\n\nAddressed an issue in which CCC would occasionally report errors such as &quot;Could not find xattr #1&quot; or &quot;Missing abbreviated xattr&quot;, most commonly when archiving items in the Google Chrome application support directory.\n\nCCC now removes its temporary private mountpoint folders used to mount and inspect Recovery HD volumes. Leaving these &quot;stale&quot; mountpoints in place was occasionally exposing a bug in the Finder in which it would report an error -43, &quot;Some items could not be found&quot; when trying to move items to the Trash. Relaunching Finder works around the bug, but cleaning up the stale mountpoints will avoid it.\n\nFixed an issue in which a scheduled task configured to run weekly, on &quot;no days of the week&quot; could be re-enabled without specifying a day to run the task.\n\nThe &quot;Backup everything&quot; filter was showing up twice for non-English localisations.\n\nDisabling &quot;Documents and Data&quot; syncing in the iCloud Preference Pane causes your ~/Library/Mobile Documents folder to be renamed to Mobile Documents.12345678 (the number varies). The iCloud Preference Pane reports that the items in this folder will be deleted. In fact, the items are not deleted, though they are rendered unreadable as long as the &quot;Documents and Data&quot; setting remains disabled. The unreadable documents in this folder generate unnecessary errors in CCC backup tasks, so the contents of this folder will now be excluded by default. This exclusion only applies when the &quot;Documents and Data&quot; syncing is disabled.\n\nCCC handles memory more efficiently now when numerous errors are encountered.\n\nAdded special handling for the &quot;SANDS&quot; filesystem from Tiger Engineering.\n\nIn some situations, the OS was sleeping before CCC finished sending an email notification. When this occurred, CCC was occasionally unable to complete sending the email when the system awoke (e.g. because the network wasn't yet available). CCC will now retain its idle sleep assertion long enough to complete sending the email notification.\n\nCCC is now more conservative about starting a scheduled task if the system might be entering a sleep state. If the lid of your laptop is closed, for example, and your scheduled task is configured to wake the system to run the task, the system may forcibly go back to sleep between 10-30 seconds after waking. Previously, CCC might have been able to start a task in that window of time. This version avoids starting a task in those situations to avoid Dark Wake cycles (periods of sleep and wake in which network and disk connectivity are constantly in flux).\n\nNFS volumes in which the root user is mapped to the root user (vs. root mapped to nobody) are no longer unmounted at the end of a scheduled task involving the NFS volume.\n\nInstall:\n\n1. Extract app and patcher\n2. Copy app to Applications folder\n3. Launch App and close\n4. Launch patcher\n5. Drag app from Applications folder into patcher\n6. Enjoy","torrent":{"xt":"urn:btih:69dac577a321f96a4d5894438a0e931460f80523","amp;dn":"Carbon+Copy+Cloner+-+3.5.4+%5BIntel%2FK%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69dac577a321f96a4d5894438a0e931460f80523","infoHashBuffer":{"type":"Buffer","data":[105,218,197,119,163,33,249,106,77,88,148,67,138,14,147,20,96,248,5,35]},"announce":[],"urlList":[]}}