{"title":"Blues Pills - Live At Rockpalast (EP)  VBR Extreme  ak6103","uid":10766763,"size":28842010,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69f9b3b425a20aa2cf7f6079778d8ead424eedda&amp;dn=Blues+Pills+-+Live+At+Rockpalast+%28EP%29++VBR+Extreme++ak6103&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"analogkid6103","files":5,"time":1408038767,"description":"Blues Pills - Live At Rockpalast (EP)  VBR Extreme  ak6103 What we got...Blues Pills is a Swedish blues rock - band from Ã–rebro . The band is at Nuclear Blast contract and has been a studio album released.Founding and first releases (2011-2012)\nElin Larsson (2014)\n\nIn the year 2011, played from Iowa coming half-brothers Zack Anderson ( bass ) and Cory Berry ( drums ) in the band Radio Moscow and learned in California , the Swedish singer Elin Larsson know. In the garage of Anderson's father, the three musicians recorded two songs as a demo , and published them on the Internet platform YouTube . The musicians received subsequently from the record label Crusher Records an offer, an EP record. They were also a tour in Spain offered. \n\nAt a concert tour in France Anderson and Berry got the only 16-year-old guitarist Dorian Sorriaux know. Sorriaux was invited by the other musicians to Ã–rebro and finally completed the band. The band's name comes from the same music blog , which deals with underground music employs the 1960s and 1970s.  About the record label Crusher Records the debut EP Bliss and have been a year later 7 &quot;single Black Smoke published.\nDevil Man and Live at Rockpalast (2013-2014)\nDorian Sorriaux (2014)\n\nBlues Pills played numerous concerts in 2013 and went on, inter alia, on the Desert Festival and the Roadburn Festival. End of July 2013 were Blues Pills by German record label Nuclear Blast contracted. The musicians had no great expectations with a simple e-mail advertised by the label and eventually received a contract.  In October of the same year with Devil Man released the second EP. The EP was produced by Don Alsterberg and met with a positive response from the press. The German magazine Rock Hard and Metal Hammer voted the EP for each demo of the month.\n\nOn October 18, 2013 Blues Pills played as part of the Crossroads Festival in Bonn . The presentation has been prepared by WDR for the program Rockpalast recorded.  It was followed by a European tour supporting Orchid and Scorpion Child , as well as a tour of Australia with the German band Kadavar .  On 28 March 2014 the band released the live EP Live at Rockpalast with four titles of the Bonn concert of October-2013.Title List\n\n    In the Beginning - 2:10\n    Black Smoke - 4:52\n    Little Sun - 4:18\n    Exit Mind - 3:54  Seed if you like it  ","torrent":{"xt":"urn:btih:69f9b3b425a20aa2cf7f6079778d8ead424eedda","amp;dn":"Blues+Pills+-+Live+At+Rockpalast+%28EP%29++VBR+Extreme++ak6103","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69f9b3b425a20aa2cf7f6079778d8ead424eedda","infoHashBuffer":{"type":"Buffer","data":[105,249,179,180,37,162,10,162,207,127,96,121,119,141,142,173,66,78,237,218]},"announce":[],"urlList":[]}}