{"title":"Switch On Your Brain by Dr. Caroline Leaf (420weedman)","uid":9274378,"size":5233899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a06ddc62b8718ed3149c3f739b0ef54a28079aa&amp;dn=Switch+On+Your+Brain+by+Dr.+Caroline+Leaf+%28420weedman%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"420weedman","files":4,"time":1385831928,"description":" According to researchers, the vast majority--a whopping 75-98 percent--of the illnesses that plague us today are a direct result of our thought life. What we think about truly affects us both physically and emotionally. In fact, fear alone triggers more than 1,400 known physical and chemical responses in our bodies, activating more than thirty different hormones! Today our culture is undergoing an epidemic of toxic thoughts that, left unchecked, create ideal conditions for illnesses.\nSupported by current scientific and medical research, Dr. Caroline Leaf gives readers a prescription for better health and wholeness through correct thinking patterns, declaring that we are not victims of our biology. She shares with readers the &quot;switch&quot; in our brains that enables us to live happier, healthier, more enjoyable lives where we achieve our goals, maintain our weight, and even become more intelligent. She shows us how to choose life, get our minds under control, and reap the benefits of a detoxed thought life","torrent":{"xt":"urn:btih:6a06ddc62b8718ed3149c3f739b0ef54a28079aa","amp;dn":"Switch+On+Your+Brain+by+Dr.+Caroline+Leaf+%28420weedman%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a06ddc62b8718ed3149c3f739b0ef54a28079aa","infoHashBuffer":{"type":"Buffer","data":[106,6,221,198,43,135,24,237,49,73,195,247,57,176,239,84,162,128,121,170]},"announce":[],"urlList":[]}}