{"title":"The Rough Guide to the Universe, Second edition - John Scalzi","uid":12682689,"size":27492815,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a4c9a747e87a9dae87f1080dd94bdae457a6127&amp;dn=The+Rough+Guide+to+the+Universe%2C+Second+edition+-+John+Scalzi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"MANTESH","files":1,"time":1446571939,"description":"\n\r\n\r\nThe Rough Guide to the Universe, Second edition (Rough Guide Reference)\r\nLanguage: English\r\nISBN-10: 1843538008\r\nISBN-13: 978-1843538004\r\n2008\r\nby John Scalzi (Author), Rough Guides (Author)\r\n\r\nWhether you’re a novice or a more experienced astronomer, The Rough Guide to The Universe is indispensable. The truth may or may not be out there, but space is the place to look, and the Rough Guide to the Universe takes it all in, from our own moon to the furthest frontiers of the known universe - and then speculates about what lies beyond. This fascinating guide is not meant to delve too deeply; instead it gives the reader the grounding needed to appreciate the night sky. Clue- up on the basics with concise information on every planet in the solar system, and practical advice on observing the planets and stars with binoculars, telescopes and the naked eye. You’ll find the latest theories about how the universe came to exist, incisive explanations of the formation of galaxies and weird concepts such a dark matter, wormholes and superstrings. The guide also provides travel-based information on planetariums, observatories and ''deep sky'' sites as well as listings of star clubs, space news sources and other Internet resources. With dozens of photographs and star charts of ev","torrent":{"xt":"urn:btih:6a4c9a747e87a9dae87f1080dd94bdae457a6127","amp;dn":"The+Rough+Guide+to+the+Universe%2C+Second+edition+-+John+Scalzi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4c9a747e87a9dae87f1080dd94bdae457a6127","infoHashBuffer":{"type":"Buffer","data":[106,76,154,116,126,135,169,218,232,127,16,128,221,148,189,174,69,122,97,39]},"announce":[],"urlList":[]}}