{"title":"The Introvert Advantage: How to Thrive in an Extrovert World","uid":9672261,"size":1452523,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6b32fe15a139263557d45848549c77a0accb5794&amp;dn=The+Introvert+Advantage%3A+How+to+Thrive+in+an+Extrovert+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Jenson100","files":-1,"time":1393487547,"description":"At least one out of four people prefers to avoid the limelight, tends to listen more than they speak, feels alone in large groups, and requires lots of private time to restore their energy. They're introverts, and here is the book to help them boost their confidence while learning strategies for successfully living in an extrovert world.\n\nAfter dispelling common myths about introverts-they're not necessarily shy, aloof, or antisocial--The Introvert Advantage explains the real issues. Introverts are hardwired from birth to focus inward, so outside stimulation-chitchat, phone calls, parties, office meetings-can easily become &quot;too much.&quot;\n\nThe Introvert Advantage dispels introverts' belief that something is wrong with them and instead helps them recognize their inner strengths-their analytical skills, ability to think outside the box, and strong powers of concentration. It helps readers understand introversion and shows them how to determine where they fall on the introvert/extrovert continuum. It provides tools to improve relationships with partners, kids, colleagues, and friends, offering dozens of tips, including 10 ways to talk less and communicate more, 8 ways to showcase your abilities at work, how to take a child's temperament temperature, and strategies for socializing. Finally, it shows how to not just survive, but thrive-how to take advantage of the introvert's special qualities to create a life that's just right for the introvert temperament, to discover new ways to expand their energy reserves, and even how, when necessary, to confidently become a temporary extrovert.","torrent":{"xt":"urn:btih:6b32fe15a139263557d45848549c77a0accb5794","amp;dn":"The+Introvert+Advantage%3A+How+to+Thrive+in+an+Extrovert+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b32fe15a139263557d45848549c77a0accb5794","infoHashBuffer":{"type":"Buffer","data":[107,50,254,21,161,57,38,53,87,212,88,72,84,156,119,160,172,203,87,148]},"announce":[],"urlList":[]}}