{"title":"Mobile Fighter G Gundam ep1-49 (Complete)","uid":3439985,"size":12384613669,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6b68b4f5405ef241344e80d4b20ee4af8c1e6508&amp;dn=Mobile+Fighter+G+Gundam+ep1-49+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":9,"uploader":"alexytc","files":49,"time":1139040668,"description":"The 13th Gundam Fight\nAt the dawn of the Future Century, Earth&amp;#039;s ruling class fled the polluted, overcrowded planet to live a life of luxury in the space colonies. These space nations soon found themselves struggling for supremacy and, in order to avert a devastating war, they agreed to settle the leadership question through the relatively peaceful means of the Gundam Fight. Now it&amp;#039;s the year F.C.60, and the 13th Gundam Fight is about to begin.\n\nThe Survival Eleven\nOnce the Gundam Fight is officially launched, the first phase of the tournament begins. This is the Survival Eleven, an 11-month period during which the Gundam Fighters who represent each colony nation wander around Earth, seeking out rival warriors and waging impromptu duels. Neo Japan&amp;#039;s Domon Kasshu follows his own special route, making his way through Rome, New York City, southern China, Paris, and the Siberian plateau in search of the mysterious man pictured in a torn fragment of a photograph.\n\nAs he roams the planet, Domon crosses paths with several other Gundam Fighters, knocking some out of the tournament and befriending a handful of others who earn his grudging respect. Meanwhile, he draws ever closer to his quarry, the malevolent Dark Gundam. After fruitless journeys through Neo Mexico, the Rocky Mountains, and London, Domon at last runs across evidence of the Dark Gundam&amp;#039;s evil influence. In Istanbul and in the deserts of Neo Egypt, he encounters fellow Gundam Fighters contaminated by biomechanical DG Cells, which gradually transforms its victims into the Dark Gundam&amp;#039;s slaves.\n\nShinjuku: The Dark Army\nAt last, the Dark Gundam is located. Domon and his loyal partner, Rain Mikamura, are summoned to their home territory of Neo Japan. In the ruins of Tokyo&amp;#039;s besieged Shinjuku district, they join a handful of defenders to battle the legions of the unstoppable Dark Army. Just as the situation seems hopeless, an unexpected ally appears?the legendary martial artist Master Asia, Domon&amp;#039;s former teacher and the Gundam Fight&amp;#039;s reigning champion.\n\nDespite Master Asia&amp;#039;s help, the situation continues to worsen. Domon&amp;#039;s fellow Gundam Fighters arrive in Shinjuku, now contaminated by DG Cells and completely under the thrall of the Dark Gundam. The Dark Army&amp;#039;s mysterious commander, the mighty Master Gundam, makes its appearance, and a shocking betrayal leaves Domon stunned and demoralized. But then...","torrent":{"xt":"urn:btih:6b68b4f5405ef241344e80d4b20ee4af8c1e6508","amp;dn":"Mobile+Fighter+G+Gundam+ep1-49+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b68b4f5405ef241344e80d4b20ee4af8c1e6508","infoHashBuffer":{"type":"Buffer","data":[107,104,180,245,64,94,242,65,52,78,128,212,178,14,228,175,140,30,101,8]},"announce":[],"urlList":[]}}