{"title":"The_Temple_Of_Elemental_Evil-FLT","uid":8042655,"size":1526181829,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6bfbf84ba440999e419e73cc6cfef3f52e54ab7b&amp;dn=The_Temple_Of_Elemental_Evil-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1358675463,"description":"The Temple of Elemental Evil (c) Infogrames\n\nSupplied by: FAiRLiGHT\nRelease Date: 09/17/03\nCracked by:  FAiRLiGHT\nGame Type:    RPG\nPackaged by: FAiRLiGHT\nImage Format: BIN/CUE\n\nCDS: 2\nProtection: SecuRom\nCD1 archives: 52 x 15 MB\nCD1: flt-tee1.001 --&gt; flt-toe1.052\nCD2 archives: 47 x 15 MB\nCD2: flt-tee2.001 --&gt; flt-toe2.050\n\nSystem Requirements: Good cpu, 32 meg gf2+ card and DX9 and lots of space!\n\nGame information:\n=================\n\nMany years ago in the land of Flanaess, an evil demoness founded a cult \ndedicated to elemental evil, the four elements as symbols of true evil, \nand based it in a temple outside the village of Nulb. Eventually, after \nyears of tyranny and chaos, the good armies of the nearby lands, headed by \nthe infamous Circle of Eight descended into the temple and razed it, \nimprisoning the villains inside. For years thereafter relative peace \nensued, as daring adventurers slew the remaining monsters that ravaged the \nland above and the temple itself faded into but a distant memory...until \nnow\n\nBandits have begun to patrol the roads outside Hommlet and Nulb again. \nWicked forces are rumored to be afoot, converging on the ruined temple for \nmalevolent purposes. Who and what these men are, no one can be sure. All \nclaim to be bent on slaying monsters and bringing peace and security to \nHommlet; but deeds speak more loudly than words, and lies cloak the true \npurposes of the malevolent. \n\nSo begins the classic Gygax D&amp;D module, The Temple of Elemental Evilãƒ» \nbrought to the PC for the first time with 3.5 Edition rules by Troika \nGames. A game like no other; where players will assemble a party of \nadventurers to uncover the source of this sinister and ominous activity, \nrallying to the very heart of evil within the Temple itself. \n\n-Literal computer translation of one of the world's most beloved Dungeons \n &amp; Dragons campaign settings, the Realm of Greyhawk. The first and only PC \n game to utilize the newly released D&amp;D 3.5 Edition Rules. \n\n-Options for creating up to five characters per party, in a reactive world \n filled with nonplayable characters (NPCs) that react differently to the  \n unique attributes of the adventuring party \n\n\n-Improved, easy-to-use turn-based combat system quickens gameplay and  \n allows players to better manage battles and spell casting \n\n-Dozens of skills and class abilities, over 50 feats and hundreds of   \n spells from which to chose, including cleric domain spells \n\n-Multiple quest solutions lead to different paths for different parties \n\n\n-Over 50 side quests allow players to explore beyond the main storyline \n\n-Multiple starting points depending on the party's alignment, and multiple \n end games depending on how the game is played \n\n-More than a 100 different monsters, from goblins and hill giants to   \n elementals and demons \n\n\nInstallation Information:\n=========================\n\nJust extract the archives and burn the .cue file with your favorite \nCD-Recording software. Then copy the crack from CD to the installation \ndirectory and enjoy!","torrent":{"xt":"urn:btih:6bfbf84ba440999e419e73cc6cfef3f52e54ab7b","amp;dn":"The_Temple_Of_Elemental_Evil-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bfbf84ba440999e419e73cc6cfef3f52e54ab7b","infoHashBuffer":{"type":"Buffer","data":[107,251,248,75,164,64,153,158,65,158,115,204,108,254,243,245,46,84,171,123]},"announce":[],"urlList":[]}}