{"title":"Essentialism; The Disciplined Pursuit of Less","uid":11719337,"size":518863115,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6c58ac7a1d046331323789cddad9d5e5124c3492&amp;dn=Essentialism%3B+The+Disciplined+Pursuit+of+Less&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Big-Papi","files":58,"time":1424748602,"description":"\n\nBy L. M. Keefer TOP 50 REVIEWERVINE VOICE on March 2, 2014\nFormat: Hardcover Vine Customer Review of Free Product ( What's this? )\nDoing more by doing less is a seductive concept. But is it possible? Yes, says this how-to manual on essentialism. The formula for doing more by doing less is to discern what is absolutely essential, eliminate the rest, and get those things done with as little effort as possible writes author Greg McKeown. McKeown is CEO of a strategy company in Silicon Valley, co-created a course at Stanford titled &quot;Designing Life, Essentially&quot; and speaks at companies including Apple, Google, Twitter, Facebook, Salesforce, and LinkedIn.\n\nThis book may not be for everybody. If your life is manageable, filled with satisfying activities, and you're progressing at the pace you want, you may not need this book. But for those who feel overloaded, distracted, stuck in the mire of doing a lot but not progressing on what matters to you, you might find it of interest. Although there are time and life management books by Stephen Covey, Brian Tracey, Julia Morgenstern, David Allen etc., this book approaches life management from a fresh angle: essentialism. It is filled with contemporary examples which are relevant in 2014.\n\nFour E's constitute the process of essentialism says McKeown: Essence, Explore, Eliminate and Execute. The goal is to do less, but better writes McKeown. It's a disciplined pursuit of less he writes. &quot;If you don't prioritize your life, someone else will,&quot; McKeown says. He recommends asking yourself continually: &quot;Is this the very most important thing I should be doing with my time and resources right now?&quot; Or, to discern what is essential to you, how about this question: &quot;If you could do one thing with your life right now, what would it be?&quot; The aim is to live by design, not default. You practice distinguishing between the trivial many and the vital few.\n\nUnder the umbrella of each of the four E's of essence, explore, eliminate and execute, McKeown lists mindsets and actions to live more essentially. Take execute, one of my favorite sections, McKeown outlines: buffering - prepare contingencies and expect the unexpected, subtracting - bring forth more by removing obstacles, progress - the power of small wins which harnesses the power of steadiness and repetition, flow - capture the genius of the best routines, focus - figure out what's important now and be - the essentialist life of more clarity, more control, and more joy in the journey.\n\nThreaded throughout are abundant examples of individuals who live by the principles and actions described in this book. Warren Buffet seems to practice essentialism in his approach to investing about which Buffet says humorously: &quot;Our investment philosophy borders on lethargy.&quot; Doing more by doing less. There's the example of business prophet Peter Drucker who is quoted forecasting: &quot;In a few hundred years, when the history of our time will be written from a long-term perspective, it is likely that the most important event historians will see is not technology, not the Internet, not e-commerce. It is an unprecedented change in the human condition. For the first time - literally - substantial and rapidly growing numbers of people have choices. For the first time they will have to manage themselves. And society is totally unprepared for it.&quot; This book offers ideas on how to manage yourself and what is essential to you.\n\nClarity = success promises this book. It makes sense that if you practice essentialist principles, it will revolutionize your life. You will create more of what you want, and eliminate more of what you don't want, enabling you to do more by doing less. This is life transforming, and one of the best books I have read recently in which the message is potentially life-changing. Like the book's design, too, with the jazzy black and white graphics","torrent":{"xt":"urn:btih:6c58ac7a1d046331323789cddad9d5e5124c3492","amp;dn":"Essentialism%3B+The+Disciplined+Pursuit+of+Less","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c58ac7a1d046331323789cddad9d5e5124c3492","infoHashBuffer":{"type":"Buffer","data":[108,88,172,122,29,4,99,49,50,55,137,205,218,217,213,229,18,76,52,146]},"announce":[],"urlList":[]}}