{"title":"Art in the Age of Technoscience - Genetic Engineering, Robotics,","uid":11571723,"size":23358806,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c70f0e662d9ab8832f66cd13bb9448d2186dd0b&amp;dn=Art+in+the+Age+of+Technoscience+-+Genetic+Engineering%2C+Robotics%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"STBGD","files":-1,"time":1417037086,"description":"Art in the Age of Technoscience: Genetic Engineering, Robotics, and Artificial Life in Contemporary Art By Ingeborg Reichle, Gloria Custance, Robert Zwijnenberg\n2009 | 422 Pages | ISBN: 3211781609 | PDF | 22 MB\n\nIs science the new art? Starting from this provocative question, art historian Ingeborg Reichle examines in her book fascinating responses of contemporary artists when faced with recent scientific and technological advances. In the last two decades a growing number of artists has left the traditional artistic playground to work instead in scientific contexts such as the laboratories of molecular biology, robotics, and artificial life. New art forms like Transgenic Art&quot; and &quot;Bio-Art have emerged from the laboratory. These art forms differ dramatically from traditional artistic approaches that explore the natural: they have crossed the boundaries between the artificial and the natural, and thus provoke passionate debates about the growing influence of science and technology. This first comprehensive survey presents a well-selected number of significant artworks and with over 280 colour illustrations provides a broad overview of this new and relevant development in art","torrent":{"xt":"urn:btih:6c70f0e662d9ab8832f66cd13bb9448d2186dd0b","amp;dn":"Art+in+the+Age+of+Technoscience+-+Genetic+Engineering%2C+Robotics%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c70f0e662d9ab8832f66cd13bb9448d2186dd0b","infoHashBuffer":{"type":"Buffer","data":[108,112,240,230,98,217,171,136,50,246,108,209,59,185,68,141,33,134,221,11]},"announce":[],"urlList":[]}}