{"title":"Fosters Home For Imaginary Friends (Seasons 1-5)","uid":4544157,"size":13280331706,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6d6a0a5176c6831c628042dcd5ed636317c58d3c&amp;dn=Fosters+Home+For+Imaginary+Friends+%28Seasons+1-5%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"tzanev","files":222,"time":1228063051,"description":"At the time of posting this torrent, these were the available episodes. Of course now all the episodes there will ever be have been broadcast. I have been searching high and low for the rest of season 6 (which is pretty damn good) and &quot;Let your hair down&quot; from season 5 but to no avail. Regardless this seems to be the only legitimate torrent out there with most of Fosters so you can complain all you like but this is as good as it gets.\n\nFoster's Home for Imaginary Friends is an Emmy Award winning American animated television series created and produced at Cartoon Network Studios by animator Craig McCracken, creator of The Powerpuff Girls. It first premiered on Cartoon Network on August 13, 2004, as a 90-minute television movie, which led to a series of half-hour episodes. The series currently airs on Cartoon Network and its affiliates worldwide, except in Canada where it has aired on English and Francophone Teletoon networks due to Canadian television ownership regulations. The show will finish its run in 2009 after 76 episodes.\n\nIn the Foster's Home For Imaginary Friends universe, imaginary friends become physical beings the instant a child imagines them; unlike how the concept often works on other shows, an Imaginary Friend is totally real, and can be seen, heard and felt by all under most circumstances. Unfortunately for them, the children outgrow them. When this happens, the friends are left to fend for themselves. Foster's Home for Imaginary Friends was founded by the elderly Madame Foster to provide a foster home for abandoned imaginary friends.\nThere are (according to &quot;Setting A President&quot;) 1,340 imaginary friends at Foster's Home; however at the end of &quot;Emancipation Complication&quot; Madame Foster states that there are 2,038 imaginary friends currently residing in the house plus Bloo and Mr. Herriman.[1] The house motto is &quot;Where good ideas are not forgotten&quot;.\nThe inspiration came when McCracken and his wife, Lauren Faust, adopted a pair of dogs from an adoption shelter. McCracken wondered how things would be if there was a similar place for childhood imaginary friends.\n","torrent":{"xt":"urn:btih:6d6a0a5176c6831c628042dcd5ed636317c58d3c","amp;dn":"Fosters+Home+For+Imaginary+Friends+%28Seasons+1-5%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d6a0a5176c6831c628042dcd5ed636317c58d3c","infoHashBuffer":{"type":"Buffer","data":[109,106,10,81,118,198,131,28,98,128,66,220,213,237,99,99,23,197,141,60]},"announce":[],"urlList":[]}}