{"title":"The Romanovs: 1613-1918 [Audiobook] by Simon Sebag Montefiore","uid":14469429,"size":429379016,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6dbd56a33de67c46dd810ba3c26f4128af7b8055&amp;dn=The+Romanovs%3A+1613-1918+%5BAudiobook%5D+by+Simon+Sebag+Montefiore&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Dr.Soc","files":4,"time":1461888952,"description":"The Romanovs: 1613-1918 [Audiobook] by Simon Sebag Montefiore, Read by Simon Russell Beale \r\nUnabridged | Format: M4B | ~ 30 hours | Bitrate: Variable | English | ASIN: B01D21QIIQ\r\n\r\n\r\nThe Romanovs were the most successful dynasty of modern times, ruling a sixth of the world's surface. How did one family turn a war-ruined principality into the world's greatest empire? And how did they lose it all?\r\n\r\nThis is the intimate story of twenty tsars and tsarinas, some touched by genius, some by madness, but all inspired by holy autocracy and imperial ambition. Montefiore's gripping chronicle reveals their secret world of unlimited power and ruthless empire-building, overshadowed by palace conspiracy, family rivalries, sexual decadence and wild extravagance, and peopled by a cast of adventurers, courtesans, revolutionaries and poets, from Ivan the Terrible to Tolstoy, from Queen Victoria to Lenin.\r\n\r\nTo rule Russia was both imperial-sacred mission and poisoned chalice: six tsars were murdered and all the Romanovs lived under constant threat to their lives. Peter the Great tortured his own son to death while making Russia an empire, and dominated his court with a dining club notable for compulsory drunkenness, naked dwarfs and fancy dress. Catherine the Great overthrew her own husband - who was murdered soon afterwards - loved her young male favourites, conquered Ukraine and fascinated Europe. Paul was strangled by courtiers backed by his own son, Alexander I, who faced Napoleon's invasion and the burning of Moscow, then went on to take Paris. Alexander II liberated the serfs, survived five assassination attempts, and wrote perhaps the most explicit love letters ever written by a ruler. THE ROMANOVS climaxes with a fresh, unforgettable portrayal of Nicholas and Alexandra, the rise and murder of Rasputin, war and revolution - and the harrowing massacre of the entire family.\r\n\r\nWritten with dazzling literary flair, drawing on new archival research, THE ROMANOVS is at once an enthralling story of triumph and tragedy, love and death, a universal study of power, and an essential portrait of the empire that still defines Russia today","torrent":{"xt":"urn:btih:6dbd56a33de67c46dd810ba3c26f4128af7b8055","amp;dn":"The+Romanovs%3A+1613-1918+%5BAudiobook%5D+by+Simon+Sebag+Montefiore","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dbd56a33de67c46dd810ba3c26f4128af7b8055","infoHashBuffer":{"type":"Buffer","data":[109,189,86,163,61,230,124,70,221,129,11,163,194,111,65,40,175,123,128,85]},"announce":[],"urlList":[]}}