{"title":"A Letter to a Hindu By Leo Tolstoy (Intoduction By Mahatma Gandh","uid":8835187,"size":28555829,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6e7063dbb16e57cebd0bd72b1f62411704c2dbf0&amp;dn=A+Letter+to+a+Hindu+By+Leo+Tolstoy+%28Intoduction+By+Mahatma+Gandh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"The_Abee","files":5,"time":1377095696,"description":"A Letter to a Hindu By Leo Tolstoy (Intoduction By Mahatma Gandhi) Abee\n_____\n &lt;a href=&quot;\nhttp://cdn.piczend.com/images/LbL5mA9S/1376919508_capture.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://cdn.piczend.com/images/LbL5mA9S/1376919508_capture.jpg&lt;/a&gt;\n\n\nAbout:\n___\n\nA Letter to a Hindu (also known as A Letter to a Hindoo) was a letter written by Leo Tolstoy to Tarak Nath Das in 1908.[1] The letter was written in response to two letters sent by Das, seeking support from the famous Russian author and thinker, for India's independence from British colonial rule. The letter was published in the Indian newspaper Free Hindustan. The letter caused the young Mohandas Gandhi to write to the world-famous Tolstoy to ask for advice and for permission to reprint the Letter in Gandhi's own South African newspaper, Indian Opinion, in 1909. Mohandas Gandhi was stationed in South Africa at the time and just beginning his lifelong activist career. He then translated the letter himself, from the original English copy sent to India, into his native Gujarati.[1]\n\nIn A Letter to a Hindu, Tolstoy argued that only through the principle of love could the Indian people free themselves from colonial British rule. Tolstoy saw the law of love espoused in all the world's religions, and he argued that the individual, non-violent application of the law of love in the form of protests, strikes, and other forms of peaceful resistance were the only alternative to violent revolution. These ideas ultimately proved to be successful in 1947 in the culmination of the Indian Independence Movement.\n\nThis letter, along with Tolstoy's views and preaching, helped to form Mohandas Gandhi's views about non-violent resistance.[1] Gandhi's familiarity with Tolstoy began with his reading of The Kingdom of God is Within You, which argues for a literal interpretation of Christian principles. Non-violent resistance was a major part of Tolstoy's own view of Christianity.\n\n\nWRITTEN BY: Leo Tolstoy\n\nINTRODUCTION BY: M.K. Gandhi\n\nNARRATED BY: Michael Scott\n\nBitrate : 96kbps\n\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_______________________________\n                            &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_______________________________\t\t\n\t\t\n\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t\t\n","torrent":{"xt":"urn:btih:6e7063dbb16e57cebd0bd72b1f62411704c2dbf0","amp;dn":"A+Letter+to+a+Hindu+By+Leo+Tolstoy+%28Intoduction+By+Mahatma+Gandh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e7063dbb16e57cebd0bd72b1f62411704c2dbf0","infoHashBuffer":{"type":"Buffer","data":[110,112,99,219,177,110,87,206,189,11,215,43,31,98,65,23,4,194,219,240]},"announce":[],"urlList":[]}}