{"title":"The Brothers Four album","uid":5367699,"size":558304251,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e9a001a32bfda02693c105e8102f6f86f299fba&amp;dn=The+Brothers+Four+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"flitigalisa","files":200,"time":1266279346,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nThe Brothers Four are an American folk group founded in 1957 in Seattle, Washington. Bob Flick, John Paine, Mike Kirkland, and Dick Foley met at the University of Washington, where they were members of the Phi Gamma Delta fraternity in 1956 (hence the &quot;Brothers&quot; appellation). Their first professional performances were the result of a prank played on them in 1958 by a rival fraternity, who had arranged for someone to call them, pretend to be from Seattle's Colony Club, and invite them to come down to audition for a gig. Even though they were not expected at the club, they were allowed to sing a few songs anyway, and were subsequently hired. Flick recalls them being paid &quot;mostly in beer.&quot;\nThey left for San Francisco in 1959, where they met Mort Lewis, Dave Brubeck's manager. Lewis became their manager and later that year secured them a contract with Columbia Records. Their second single, &quot;Greenfields,&quot; released in January 1960, hit #2 on the pop charts, and their first album, Brothers Four, released toward the end of the year, made the top 20. Other highlights of their early career included singing their fourth single, &quot;The Green Leaves of Summer,&quot; from the John Wayne movie The Alamo, at the 1961 Academy Awards, and having their second album, BMOC/Best Music On/Off Campus, go top 10. They also recorded the theme song for the ABC television series Hootenanny, &quot;Hootenanny Saturday Night,&quot; in 1963.\nThe British Invasion and the ascendance of edgier folk rock musicians such as Bob Dylan put an end to the Brothers Four's early period of success, but they kept performing and making records, doing particularly well in Japan and on the American hotel circuit.\nThe group co-built with Jerry Dennon a radio station in Seaside, Oregon (KSWB) in 1968. The station was subsequently sold in 1972 to a group from Montana, and later to a self-proclaimed minister, and finally merged into a larger conglomerate of radio stations.\nThe group attempted a comeback by recording a highly commercial version of Dylan's &quot;Mr. Tambourine Man&quot; but were unable to release it due to licensing issues, and The Byrds eventually stole their thunder by releasing their heralded version.  \nMike Kirkland left the group in 1969, and was replaced by Mark Pearson, another University of Washington alumnus. In 1971, Pearson left and was replaced by Bob Haworth, who stayed until 1989 and was replaced by a returning Pearson. Dick Foley left the group in 1990 and was replaced by Terry Lauber. Despite all the changes and having spent 47 years in the business, the group is still active.\n","torrent":{"xt":"urn:btih:6e9a001a32bfda02693c105e8102f6f86f299fba","amp;dn":"The+Brothers+Four+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e9a001a32bfda02693c105e8102f6f86f299fba","infoHashBuffer":{"type":"Buffer","data":[110,154,0,26,50,191,218,2,105,60,16,94,129,2,246,248,111,41,159,186]},"announce":[],"urlList":[]}}