{"title":"Udemy - The Complete Web Developer","uid":11485696,"size":2074625704,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6fc582cb7121d4f4e8131b0a421cd32c7182745d&amp;dn=Udemy+-+The+Complete+Web+Developer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"yousef86","files":-1,"time":1416220991,"description":"Udemy - The Complete Web Developer (2013)\n=========================================\nMP4 | AVC 190kbps | English | 1280x720 | 15fps | 18 hours | AAC stereo 54kbps | 1.93 GB\nGenre: Video Training |  Category: Development / Web Development\n\n\nThis is The Complete Web Developer: The Everything You Need To Know web development course about making websites.TCWD (The Complete Web Developer) will take you through over 18 hours of video content while being able to follow along with what I'm saying in each video. Each class has examples we go through, and explanations of how everything works. Perhaps you want to start your own online business, get an increase in salary or you have an idea that could change the world. Whatever your reason is, it's never a bad time to learn web development.\n\nHere are the topics we will learn in this web development course:\n1 HTML: This is the skeletal structure of your website.\n2 CSS: CSS is how we make our websites nice to look at.\n3 JavaScript: Often abbreviated as JS, this is how we give the site some basic functionality.\n4 jQuery: The hulk version of JavaScript. It's super powerful and very easy to use.\n5 Ajax: When a website loads dynamic information without reloading the page.. that very nice feature is called Ajax, and is used in almost every great website now.\n6 PHP: The brains of your website. You can tell your website how to think, and what action to take after a decision is made.\n7 SQL: This would be the memory of your website. Databases sound difficult, but they really aren't. It's simply a matter of understanding how your websites memory works.\n\nThis course is designed for everybody. Everything is explained in depth for the new web developer trying to learn web development. And for intermediate web dev's, this will expand your skills and provide you with even more web development knowledge","torrent":{"xt":"urn:btih:6fc582cb7121d4f4e8131b0a421cd32c7182745d","amp;dn":"Udemy+-+The+Complete+Web+Developer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fc582cb7121d4f4e8131b0a421cd32c7182745d","infoHashBuffer":{"type":"Buffer","data":[111,197,130,203,113,33,212,244,232,19,27,10,66,28,211,44,113,130,116,93]},"announce":[],"urlList":[]}}