{"title":"The Beatles - The U.S. Albums [Box] (2014) [FLAC]","uid":9529648,"size":4027714970,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6fc6b06ffa144c4e0814507821bd25fc79cec1a8&amp;dn=The+Beatles+-+The+U.S.+Albums+%5BBox%5D+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"rudown78","files":335,"time":1390819597,"description":"The Beatles - The U.S. Albums [Box] (2014) [FLAC]\n\nThe U.S. Albums is a box set compilation comprising the remastered American albums released by The Beatles between 1964 and 1970. The box set was released on 21 January 2014 in the United States, marking the fiftieth anniversary of the Beatles' first trip to the U.S. and first official American album Meet the Beatles!\n\nAll thirteen unique albums released by Capitol Records are included in the box set, eight of which previously released in The Capitol Albums, Volume 1 and Volume 2. The set contains the remastered mono and stereo versions of all albums, except The Beatles' Story and Hey Jude, presented only in stereo. Additionally, those two albums, Yesterday and Today, and the U.S. versions of A Hard Day's Night and Revolver, are released for the first time on CD in this box set.\n\n1. Meet the Beatles! (1964)\n2. The Beatles' Second Album (1964)\n3. A Hard Day's Night (1964)\n4. Something New (1964)\n5. The Beatles' Story (1964)\n6. Beatles '65 (1964)\n7. The Early Beatles (1965)\n8. Beatles VI (1965)\n9. Help! (1965)\n10. Rubber Soul (1965)\n11. Yesterday and Today (1966)\n12. Revolver (1966)\n13. Hey Jude (1970)\n\nShortly after the initial announcement, Capitol Records revealed that the new remasters for the U.S. versions of the albums are partially based on the original 1960s masters and the 2009 remasters, released in The Beatles Stereo Box Set and The Beatles in Mono. Unique stereo and mono mixes prepared in the U.K. for U.S. release are sourced from the original tapes. Any unique versions prepared for U.S. release will be recreated for this set. The tapes used for the 2004 and 2006 Capitol boxed sets drawn from the Capitol tapes are not used in this set with the exception of The Beatles' Story (which will be drawn from Capitol's tapes of the album).\n\nThe albums Sgt. Pepper's Lonely Hearts Club Band, Magical Mystery Tour, The Beatles (the &quot;White Album&quot;), Yellow Submarine, Abbey Road and Let It Be are not included in this set, as all post-1966 albums were released as intended by the Beatles. Originally, the American version of Magical Mystery Tour was also unique, as Capitol Records compiled the band's British EP and 1967 singles, but was released in the UK in the 1970s, and then formally adopted as part of the core catalog in 1987 for the band's CD releases.\n\n\nEach album has rip logs and cover art. Enjoy!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:6fc6b06ffa144c4e0814507821bd25fc79cec1a8","amp;dn":"The+Beatles+-+The+U.S.+Albums+%5BBox%5D+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fc6b06ffa144c4e0814507821bd25fc79cec1a8","infoHashBuffer":{"type":"Buffer","data":[111,198,176,111,250,20,76,78,8,20,80,120,33,189,37,252,121,206,193,168]},"announce":[],"urlList":[]}}