{"title":"CreativeLIVE - Wedding Cinematography Crash Course with Ray Roma","uid":9273038,"size":7940824821,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:71882c3eb812486014fb8e39ebaa1844873b8f5f&amp;dn=CreativeLIVE+-+Wedding+Cinematography+Crash+Course+with+Ray+Roma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"kr33","files":3,"time":1385771312,"description":"Wedding Cinematography Crash Course with Ray Roman\n\nReady to find out what separates wedding videographers from sought-after wedding cinematographers? Join acclaimed event cinematographer Ray Roman for a crash course in wedding cinematography.\n\nAs he shares what he's learned about filmmaking working with NBA All-Stars, high powered CEOs, and everyone in between, Ray will guide you through every stage of filming a wedding, from first looks to post-production. You'll learn about the key gear needed for documenting weddings. Ray will cover basic film structure and time-shifting methods. You'll also explore both basic and advanced composition techniques that you can easily integrate into your workflow. Ray will also share his proven sales and marketing techniques for connecting with clients and turning consultations into sales.\n\nBy the end of this course, you'll have the skills you need to market your services, capture weddings on film, and give your clients a jaw-dropping record of their once-in-a-lifetime event. \n","torrent":{"xt":"urn:btih:71882c3eb812486014fb8e39ebaa1844873b8f5f","amp;dn":"CreativeLIVE+-+Wedding+Cinematography+Crash+Course+with+Ray+Roma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71882c3eb812486014fb8e39ebaa1844873b8f5f","infoHashBuffer":{"type":"Buffer","data":[113,136,44,62,184,18,72,96,20,251,142,57,235,170,24,68,135,59,143,95]},"announce":[],"urlList":[]}}