{"title":"A User's Guide To The Universe - Dave Goldberg &amp; Jeff Blomqu","uid":10736673,"size":3139214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7211d356b42d982b1c31b99a9661c236485b2d40&amp;dn=A+User%27s+Guide+To+The+Universe+-+Dave+Goldberg+%26amp%3B+Jeff+Blomqu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1407699987,"description":"Answers to science's most enduring questions from &quot;&quot;Can I break the light-speed barrier like on Star Trek?&quot;&quot; and &quot;&quot;Is there life on other planets?&quot;&quot; to &quot;&quot;What is empty space made of?&quot;&quot;\n\nThis is an indispensable guide to physics that offers readers an overview of the most popular physics topics written in an accessible, irreverent, and engaging manner while still maintaining a tone of wry skepticism. Even the novice will be able to follow along, as the topics are addressed using plain English and (almost) no equations. Veterans of popular physics will also find their nagging questions addressed, like whether the universe can expand faster than light, and for that matter, what the universe is expanding into anyway.\n\nGives a one-stop tour of all the big questions that capture the public imagination including string theory, quantum mechanics, parallel universes, and the beginning of time\nExplains serious science in an entertaining, conversational, and easy-to-understand way\nIncludes dozens of delightfully groan-worthy cartoons that explain everything from special relativity to Dark Matter\nFilled with fascinating information and insights, this book will both deepen and transform your understanding of the universe.","torrent":{"xt":"urn:btih:7211d356b42d982b1c31b99a9661c236485b2d40","amp;dn":"A+User%27s+Guide+To+The+Universe+-+Dave+Goldberg+%26amp%3B+Jeff+Blomqu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7211d356b42d982b1c31b99a9661c236485b2d40","infoHashBuffer":{"type":"Buffer","data":[114,17,211,86,180,45,152,43,28,49,185,154,150,97,194,54,72,91,45,64]},"announce":[],"urlList":[]}}