{"title":"Armed - The Essential Guide to Concealed Carry (2012) Gooner","uid":13269814,"size":14508823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:729c015d67b2cd15818ffefb8f5a61d4370c9cf3&amp;dn=Armed+-+The+Essential+Guide+to+Concealed+Carry+%282012%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1453386255,"description":"Armed - The Essential Guide to Concealed Carry - 1st Edition (2012).epub Gooner\r\n\r\nPublisher: Krause Publ; 1st edition (June 30, 2012)\r\nLanguage: English\r\nISBN-10: 1440230005\r\nISBN-13: 978-1440230004\r\n\r\nThe Book Every Responsible Gun Owner MUST Read It seems everywhere you turn these days someone is offering advice on carrying a handgun for self-defense. But Armed-The Essential Guide to Concealed Carry is like nothing you've read before. Authored by Bruce N. Eimer, Ph.D. a noted psychologist with a dedication to teaching skills for staying armed and alive, Armed is the thinking gun owner's bible. This comprehensive volume breaks down not just the tools and tactics, but the mindset and choices a law-abiding citizen must have and make to become self-reliant, alert and legally armed. Inside you'll find: Why going armed is about owning your safety, not just a handgun The true mindset that drives anti-gunners How to avoid the &quot;Hero Syndrome&quot; What rules of engagement lead to justifiable use of force How to deal with the trauma after a shooting incident Practical dry-fire and live-fire drills Weapon retention-keeping a gun grab from happening to you The Force Continuum-how it works and the actions you'll take along its course to survive an attack And much, much more With comprehensive overviews on the gear that works and when it works, less-than-lethal rescue options, and common-sense solutions to everyday personal security problems, Armed-The Essential Guide to Concealed Carry is the one reference book that every truly responsible gun owner must read from cover to cover","torrent":{"xt":"urn:btih:729c015d67b2cd15818ffefb8f5a61d4370c9cf3","amp;dn":"Armed+-+The+Essential+Guide+to+Concealed+Carry+%282012%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"729c015d67b2cd15818ffefb8f5a61d4370c9cf3","infoHashBuffer":{"type":"Buffer","data":[114,156,1,93,103,178,205,21,129,143,254,251,143,90,97,212,55,12,156,243]},"announce":[],"urlList":[]}}