{"title":"Charles Darwin - On the Origin of Species  (Richard Dawkins)","uid":4720147,"size":717890244,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:732a2cd6a83faf200bb5bb1864303fa123b5ad51&amp;dn=Charles+Darwin+-+On+the+Origin+of+Species++%28Richard+Dawkins%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"sheila6","files":89,"time":1234475873,"description":"Audio Books : Misc. Educational : MP3/Variable : English\n\n\nThis torrent contains readings of two books on evolutionary biology.\n\nWhat is different about this collection is that I have reencoded the files so that the whole collection just fits onto one 700MB CDR so, for example, if your car stereo plays MP3s you can keep the disc in there with both books on it.\n\nThe files have been encoded with LAME as variable rate MP3 files. The average bitrate for the collection is 108kbps.\n\n\n\n--------------------------------------------------------------------------------\n\n\nOn the Origin of Species\nby Charles Darwin\nread by Richard Dawkins\n \n\n&quot;On The Origin of Species must be high on any serious list of the most important and influential books ever written. On its first publication, in 1859, Thomas Henry Huxley exclaimed &quot;How extremely stupid of me not to have thought of that.&quot; Charles Darwin's revolutionary idea is, indeed, an astoundingly simple one, especially when you measure it against the magnitude of what it explains -- every fact that we know about life on earth.\n\n&quot;Listen to Origin of Species, and you immediately find yourself ushered into the presence of one of the finest minds ever to grace this planet. In this recording, which was a true labour of love, I made no attempt to act the part of Darwin, but instead worked hard, as a modern follower of Darwin, to convey the true meaning of every sentence. I even surprised myself: the exercise of reading Darwin's words aloud and identifying in every phrase the syllable that needed to be stressed, revealed to me the subtleties and depths of meaning that I had missed when reading quietly to myself. I hope listeners will be enlightened in the same way.\n\n&quot;Of Darwin's six editions I chose to abridge from the first. Surprisingly, and in many ways, it is the most modern. Moreover, it is of greatest historical interest, as being the one that actually hit the Victorian solar plexus and drove out the wind of centuries. In abridging the book, my priority was to cut those passages that are now known to be wrong, notably those concerned with genetics. I believe it is what Darwin himself would have wished. What takes my breath away as a modern biologist is how much Darwin got right. It has been well said that he worked a century and more ahead of his time. The year 2009 is both the bi-centenary of Darwin's birth and the 150th anniversary of On the Origin of Species and that statement is becoming harder and harder to deny.&quot;\n\nAbout the author:\nCharles Robert Darwin (12 February 1809 - 19 April 1882) was an English naturalist, eminent as a collector and geologist, who proposed and provided scientific evidence that all species of life have evolved over time from common ancestors through the process he called natural selection. The fact that evolution occurs became accepted by the scientific community and the general public in his lifetime, while his theory of natural selection came to be widely seen as the primary explanation of the process of evolution in the 1930s, and now forms the basis of modern evolutionary theory. In modified form, Darwin's scientific discovery remains the foundation of biology, as it provides a unifying logical explanation for the diversity of life.\n\n\n--------------------------------------------------------------------------------\n\n\nThe Ancestor's Tale\nby Richard Dawkins\nread by Richard Dawkins and Lalla Ward\n \n\nThe Ancestor's Tale is a pilgrimage back through time; a journey on which we meet up with fellow pilgrims as we and they converge on our common ancestors. Chimpanzees join us at about 6 million years in the past, orang utans at 14 million years, as we stride on together, a growing band. The journey provides the setting for a collection of some 40 tales. Each explores an aspect of evolutionary biology through the stories of characters met along the way. The tales are interspersed with prologues detailing the journey, route maps showing joining lineages, and life-like reconstructions of our common ancestors. The Ancestor's Tale represents a pilgrimage on an unimaginable scale: our goal is four billion years away, and the number of pilgrims joining us grows vast - ultimately encompassing all living creatures. At the end of the journey lies something remarkable in its simplicity and transformative power: the first, humble, replicating molecules.\n\nJust as we trace our personal family trees from parents to grandparents and so on back in time, so in The Ancestor's Tale Richard Dawkins traces the ancestry of life. As he is at pains to point out, this is very much our human tale, our ancestry. Surprisingly, it is one that many otherwise literate people are largely unaware of. Hopefully Dawkins's name and well deserved reputation as a best selling writer will introduce them to this wonderful saga.\n\nThe Ancestor's Tale takes us from our immediate human ancestors back through what he calls 'concestors', those shared with the apes, monkeys and other mammals and other vertebrates and beyond to the dim and distant microbial beginnings of life some 4 billion years ago. It is a remarkable story which is still very much in the process of being uncovered. And, of course from a scientist of Dawkins stature and reputation we get an insider's knowledge of the most up-to-date science and many of those involved in the research. And, as we have come to expect of Dawkins, it is told with a passionate commitment to scientific veracity and a nose for a good story. Dawkins's knowledge of the vast and wonderful sweep of life's diversity is admirable. Not only does it encompass the most interesting living representatives of so many groups of organisms but also the important and informative fossil ones, many of which have only been found in recent years.\n\nAbout the author:\nRichard Dawkins is the Charles Simonyi Professor for the Public Understanding of Science at Oxford University and a fellow of New College. The Selfish Gene catapulted Richard Dawkins to fame, and remains his most famous and widely read work. It was followed by a string of bestselling books: The Extended Phenotype, The Blind Watchmaker, River Out of Eden, Climbing Mount Improbable, Unweaving the Rainbow, The Ancestor's Tale and a collection of his shorter writings A Devil's Chaplain. Dawkins is a Fellow of both the Royal Society and the Royal Society of Literature. He is the recipient of numerous honours and awards, including the 1987 Royal Society of Literature Award, the 1990 Michael Faraday Award of the Royal Society, the 1997 International Cosmos Prize for Achievement in Human Science, the Kistler Prize in 2001, and the Shakespeare Prize in 2005.\n\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:732a2cd6a83faf200bb5bb1864303fa123b5ad51","amp;dn":"Charles+Darwin+-+On+the+Origin+of+Species++%28Richard+Dawkins%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"732a2cd6a83faf200bb5bb1864303fa123b5ad51","infoHashBuffer":{"type":"Buffer","data":[115,42,44,214,168,63,175,32,11,181,187,24,100,48,63,161,35,181,173,81]},"announce":[],"urlList":[]}}