{"title":"The Jeffersons Season 2","uid":4324273,"size":5571943296,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:733311c250c3ef68231eb2e37e80dac835e29445&amp;dn=The+Jeffersons+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"hb1234","files":28,"time":1217666301,"description":"Season 2 \n\nThe Jeffersons is an American sitcom that was broadcast on CBS from January 18, 1975, through June 25, 1985, lasting 11 seasons, and a total of 253 episodes produced by T.AT. Communications Company from 1975-1982 and Embassy Television from 1982-1985. It is the longest running comedy (or series of any genre) with a predominantly African-American cast in the history of American television.\n\nThe show focused on an upper middle-class, African American couple, George and Louise Jefferson. The show was launched as the second spin-off of All in the Family, on which the Jeffersons had been the neighbors of Archie and Edith Bunker.\n\nThe show was the brainchild of prolific television producer Norman Lear. However, unlike some of his other shows, it was less sharply political in tone and The Jeffersons evolved into more of a traditional sitcom, relying more on the characters&amp;#039; interactions with one another rather than explicitly political dialog or story-lines. It was the first series to prominently feature an interracial couple: Tom and Helen Willis.\n\nThe show had one spin-off, titled Checking In. The short lived series was centered around the character, Florence. Checking In only lasted four episodes, after which Florence returned to The Jeffersons.\n\nThe show ended in controversy after CBS abruptly canceled the series without allowing for a proper series finale. The cast were not informed until after the June 25, 1985, episode &quot;Red Robins,&quot; and actor Sherman Hemsley said he found out that the show was canceled by reading it in the newspaper.[citation needed] The cast later reunited in a stage-play based on the sitcom.","torrent":{"xt":"urn:btih:733311c250c3ef68231eb2e37e80dac835e29445","amp;dn":"The+Jeffersons+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733311c250c3ef68231eb2e37e80dac835e29445","infoHashBuffer":{"type":"Buffer","data":[115,51,17,194,80,195,239,104,35,30,178,227,126,128,218,200,53,226,148,69]},"announce":[],"urlList":[]}}