{"title":"Ride - Nowhere (Remastered 2001) w/ Today Forever EP  (FLAC)","uid":4728202,"size":566665409,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:733b34cdd9ee62891f85cb31319e4ee888e68395&amp;dn=Ride+-+Nowhere+%28Remastered+2001%29+w%2F+Today+Forever+EP++%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Bootycall88","files":16,"time":1234863307,"description":"Review From AMG:\n\n\nNowhere seems to hold consensus as the second-best record of the shoegaze era, and with very good reason. All of the common words, phrases, and adjectives commonly used with the short-lived subgenre fit properly here, and they're all positive, every one of them. Whir, whoosh, haze, swirl, ad nauseum -- this record holds all of these elements at their most exciting and mastered. But in the end, great pop records necessitate quality songs, which Nowhere delivers throughout. Undeniably, it's Ride's zenith -- dense, tight, and hypnotic. &quot;Seagull&quot; serves as a dynamic opener; after a couple seconds of light feedback, bassist Steve Queralt kicks in with a rubbery, elliptical line (reminiscent of a certain Beatles song), which is soon followed by Andy Bell and Mark Gardener's guitar twists and Loz Colbert's alternately gentle and punishing drumming. After the upbeat &quot;Kaleidoscope,&quot; the record falls into a tempo lull that initially seems impenetrable and meandering. However, patience reveals a five-song suite of sorts, full of lovely instrumental passages that are punctuated with violent jabs of manic guitars. The endlessly escalating &quot;Polar Bear&quot; is a high point, featuring expertly placed tom rolls from Colbert. The tempo picks up for the closing &quot;Vapour Trail,&quot; a wistful pop song with chiming background guitars galore and mournful strings to close it out. The U.S. version was bolstered significantly with the remainder of the Fall EP (&quot;Dreams Burn Down&quot; having reappeared earlier in the record). &quot;Taste&quot; is one of their finest pure pop numbers; the moody/driving &quot;Here and Now&quot; rates well, and the five-minute &quot;Nowhere&quot; is a nasty distorto-freakout. [Nowhere was remastered and reissued by Ignition U.K. in 2001. Added to the 11 tracks featured on Sire's U.S. edition are the four selections from the equally wondrous Today Forever.]\n\nLove to hear your comments. Enjoy!","torrent":{"xt":"urn:btih:733b34cdd9ee62891f85cb31319e4ee888e68395","amp;dn":"Ride+-+Nowhere+%28Remastered+2001%29+w%2F+Today+Forever+EP++%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733b34cdd9ee62891f85cb31319e4ee888e68395","infoHashBuffer":{"type":"Buffer","data":[115,59,52,205,217,238,98,137,31,133,203,49,49,158,78,232,136,230,131,149]},"announce":[],"urlList":[]}}