{"title":"Foxit PhantomPDF Business v8.0.0.624","uid":15104143,"size":349429615,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:73d85c454b849574a7ddad7f769dbfd8c5bf7281&amp;dn=Foxit+PhantomPDF+Business+v8.0.0.624&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZarkBit","files":1,"time":1466972499,"description":"Foxit PhantomPDF Business v8.0.0.624\r\n\r\nPDF Editor – Modify text, objects, format, and layout\r\n..Edit Text\r\n....Edit text in a paragraph without worrying about layout - text will automatically reflow as you edit. After editing, spell check the document.\r\n..Advanced Text Editing \r\n....Advanced editing capabilities for PDF documents with more complex layout. Link, join, or split text blocks to connect text for more powerful editing. Move and resize text blocks to change to a more compelling layout.\r\n..Advanced Object Editing \r\n....Edit images, objects, and object shading. Change text to shape. Change page layout properties, add shading to objects, convert text to path, merge/split text and edit .ai files. \r\n\r\n..Modify And Format Text \r\n....Edit the font of PDF text by changing type, style, size, color, and effect. Align text left, center, or right, while choosing from multiple line spacing options. \r\n\r\n..Professionalize Documents \r\n....Customize the way your PDF looks by adding or modifying stamps, watermarks, headers, footers, and backgrounds to generate professional looking PDFS. \r\n\r\n..Insert Objects, Images, &amp; Videos \r\n....Embed images and videos in your PDF and make it more interactive. Align objects on the left middle, or center. Distribute objects horizontally or vertically. Rotate, flip, or shear objects. \r\n\r\nPDF Creator – Create PDF docs, forms, portfolios, and convert PDF to Office\r\n..Create Industry-Standard PDF \r\n....Create PDF's from hundreds of the most common file types that are 100% compatible with other PDF products. Reduce file size before you distribute or archive to save transfer time and disk space. \r\n\r\n..Export PDF To Word &amp; Other Formats \r\n....Easily share PDF content by exporting to MS Word, PowerPoint and Excel, RTF, HTML, text and image formats. \r\n\r\n..Create PDF from Microsoft Office, Outlook, and Visio \r\n....Create PDF with integrated, fully functional Word, PowerPoint Excel, Outlook and Visio add-ins. \r\n\r\n..PDF Form Generation \r\n....Develop PDF forms quickly and easily with automated form field recognition and designer assistant. Create professional looking forms with push and radio buttons; check, combo, and list boxes; and text and signature fields. \r\n\r\n..PDF Portfolios \r\n....View, print create, edit and search for text in PDF portfolios. \r\n\r\n..PDF/A, E, X compliance \r\n....Create and validate industry compliant PDF files for archiving engineering and print production. \r\n\r\nCollaborate and Share - Annotate, share, and collaborate PDFs\r\n..Shared Review \r\n....Initiate a Shared Review to include PhantomPDF, Foxit Reader, and MobilePDF users through a public cloud (Foxit Cloud), network folder, a SharePoint workspace, or email. \r\n\r\n..Commenting Tools \r\n....Provide feedback to documents through annotation and text markup tools. \r\n\r\n..Comments Management \r\n....Quickly view all the comments in a document in an easy to understand summary. Import, export and send comments as a FDF file via email. \r\n\r\n..Sharepoint Integration \r\n....Seamlessly check in and check out PDF files on SharePoint servers. \r\n\r\n..DocuSign Integration \r\n....Send, sign and save PDF documents using the industry's most widely used eSignature solution. \r\n\r\n..Evernote Integration \r\n....Create and send a PDF as an attachment to an Evernote note","torrent":{"xt":"urn:btih:73d85c454b849574a7ddad7f769dbfd8c5bf7281","amp;dn":"Foxit+PhantomPDF+Business+v8.0.0.624","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73d85c454b849574a7ddad7f769dbfd8c5bf7281","infoHashBuffer":{"type":"Buffer","data":[115,216,92,69,75,132,149,116,167,221,173,127,118,157,191,216,197,191,114,129]},"announce":[],"urlList":[]}}