{"title":"Destiny of Souls - by Michael Newton - Yasser","uid":8141393,"size":6300520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73e46000563c3448dea1d8f6bff9d6586985fadc&amp;dn=Destiny+of+Souls+-+by+Michael+Newton+-+Yasser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"yaser_adnan","files":5,"time":1360820162,"description":"Destiny of Souls: New Case Studies of Life Between Lives\nMichael Newton Ph.D (Author) \n\nMobi , Epub , Pdf\n\n-----------------\n\nBook Description :\n\nDestiny of Souls by Michael Newton, Ph.D., contains interviews given by sixty-seven people under hypnosis discussing their experiences between lives on earth. The result is a book which proves, beyond any doubt, that who and what you are continues, grows, and evolves into something wonderful even after you pass on into the next world. Death, that amazing transition, will no longer be seen as an ending or something fearful. Rather, you will understand that it is merely a change, a beginning, a way-station for rest and recuperation before rebirth.\n\nDr. Newton holds a doctorate in counseling and is a master hypnotherapist. This book is based on his groundbreaking research into the afterlife. It will thrill and astonish you, and is ideal introductory reading for this subject, or if you have already read his best-selling first volume, Journey of Souls.\n\nIn Destiny of Souls, you will explore the meaning of existence and what life is like between lives. You will discover:\n\n- Your purpose on Earth\n- The truth about soulmates\n- How spirits connect with and comfort the living\n- Spirit guides\n- The Council of Elders that interviews us between lives\n- Why you choose a certain body to incarnate into\n- What souls do between lives\n\nDestiny of Souls will show you more of the hidden aspects of what happens after death and help you understand the incredible order and peace that exists within the afterlife. If you have ever wondered what happens after death, if you want more peace of mind and happiness in your life today, read Destiny of Souls.\n\n-----------------\n\ncreated by Yasser Adnan","torrent":{"xt":"urn:btih:73e46000563c3448dea1d8f6bff9d6586985fadc","amp;dn":"Destiny+of+Souls+-+by+Michael+Newton+-+Yasser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73e46000563c3448dea1d8f6bff9d6586985fadc","infoHashBuffer":{"type":"Buffer","data":[115,228,96,0,86,60,52,72,222,161,216,246,191,249,214,88,105,133,250,220]},"announce":[],"urlList":[]}}