{"title":"ES File Explorer Pro v1.0.5 Mod+ APK [SadeemPC].zip","uid":14367402,"size":5199949,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:7409117cfd2fa22fd1e015f361bf657e7dfde628&amp;dn=ES+File+Explorer+Pro+v1.0.5+Mod%2B+APK+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"SadeemPC","files":1,"time":1461127510,"description":"ES File Explorer Pro v1.0.5 Mod+\r\nRequirements: Android 2.2+\r\n\r\nThis is the Pro version of ES File Explorer (File Manager) - the must-have app for every Android user. You can enjoy all the benefits below once you own ES File Explorer Pro!\t\r\n\r\nFeatures:\r\n- Remove Ads - Clean up all Ads in the App\r\n- More to customize - Set start pages &amp; ALL default windows\r\n- More to see - New Theme and color panel\r\n- More to expect - Dozens of new features( totally free) will come soon\r\n\r\nHighlights of ES File Explorer (File Manager):\r\n- File Manager: Click to install applications, and check zipped files\r\n- Multimedia Explorer: Click to play music/videos, check image(s) and document(s)\r\n- Cloud Storage: Supports Dropbox, Box.net, Sugarsync, Google Drive, OneDrive(SkyDrive), Amazon S3, Yandex and more clouds platforms.\r\n\r\nFeatures and Benefits of ES File Explorer (File Manager):\r\n- File Manager: Manage your files just like you do on your desktop or laptop using Multiple Select, Cut/Copy/Paste, Move, Create, Delete, Rename, Search, Share, Send, Hide, Create Shortcut, and Bookmark. All operations can be performed on local files (on your Android device) or even remotely (from your computer over a network)\r\n- Application Manager: Categorize, uninstall, back up, and create shortcuts to your apps\r\n- Remote File Manager: When this feature is enabled, you can manage files on your phone from your computer\r\n- Built-in ZIP and RAR support: Allows you to compress and decompress ZIP files, unpack RAR files, and create encrypted (AES 256 bit) ZIP files\r\n- Built-in viewers and players for various file types: Including photos, music, and videos; supports third-party applications such as Quick Office for better productivity\r\n- Shows thumbnails: For APKs and images\r\n- Text viewers and editors\r\n- Access your home PC: Through your smartphone via WiFi with SMB\r\n- Functions as an FTP and WebDAV client: Manage files on FTP, FTPS, SFTP, and WebDAV servers just like you manage files on your SD card\r\n- Bluetooth file browser: You can copy and paste files between Bluetooth-ready devices. ES File Explorer (File Manager) supports OBEX FTP for browsing devices and transferring files between Bluetooth devices\r\n- Kill tasks with a single click, increase memory and speed up your device: Includes a simple widget that stays on your home screen to let you know your current RAM situation and automatically kill tasks, with an ignore list to ignore the applications you want to keep running. The Task Manager module is required for this feature.\r\n- Cache Cleaner and Auto-start Manager: Delete junk files that take up valuable storage space. The Task Manager module is required for this feature.\r\n- Root Explorer: The ultimate set of file management tools for root users. Provides access to the entire file system and all data directories, and allows the user to change permissions.\r\n- Supports Multiple Languages: English, Russian, Japanese, Korean, French, Spanish, German, Italian, Czech, Hungarian, Ukrainian, Tamil, Catalan, Turkish, Lithuanian, Portuguese and more...\r\n\r\nWHAT'S NEW:\r\n- FTP can't change root directory bug fixed\r\n\r\nMOD No Ads:\r\n1. Remove Programs application homepage toolbox option.\r\n2. Removing favorites list associated with Baidu advertising practices.\r\n3. Removing the task manager and application download pop the lock.\r\n4. Adjusting the root directory of fragmented files to the same data folder.\r\n5. Disabled by default to automatically detect application upgrade can be updated manually.\r\n6. Streamlined a lot of extra language files retain only Simplified and Traditional British.\r\n7. Optimized content and other details of the interface options menu","torrent":{"xt":"urn:btih:7409117cfd2fa22fd1e015f361bf657e7dfde628","amp;dn":"ES+File+Explorer+Pro+v1.0.5+Mod%2B+APK+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7409117cfd2fa22fd1e015f361bf657e7dfde628","infoHashBuffer":{"type":"Buffer","data":[116,9,17,124,253,47,162,47,209,224,21,243,97,191,101,126,125,253,230,40]},"announce":[],"urlList":[]}}