{"title":"Salvatore Quasimodo - Nobel Prize in Literature, 1959 (2 books)","uid":14011510,"size":3092990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:740f81eaa9b699630b5776aae74001c68256de56&amp;dn=Salvatore+Quasimodo+-+Nobel+Prize+in+Literature%2C+1959+%282+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"workerbee","files":4,"time":1458831405,"description":"\nSALVATORE QUASIMODO (1901-1968) was an Italian poet, critic, and translator.  In 1959 he won the Nobel Prize in Literature &quot;for his lyrical poetry, which with classical fire expresses the tragic experience of life in our own times.&quot;  Along with Giuseppe Ungaretti and Eugenio Montale, he is one of the foremost Italian poets of the 20th century.\r\n\r\nQuasimodo's work is traditionally divided into two major periods: the &quot;hermetic&quot; period until World War II and the post-hermetic era until his death.  The first hermetic period, which was the dominant poetic force in Italy in the first half of the century, is characterized by metaphysical content and a recondite style, adopting occult symbolism and a vocabulary that is extremely personal and idiosyncratic.  During World War II, Quasimodo was involved in an anti-Fascist movement and was briefly imprisoned.  In the &quot;engagé&quot; period following the war, his poems are concerned with the interpretation of contemporary history, social conditions, and the frustrations and aspirations of the common man.  Although both periods are distinct, they should be seen as a single poetical quest for a unique language and mode of expression.\r\n\r\nSee especially his SELECTED WRITINGS, which contains selections made by the poet himself working closely with the translator, and presents a major portion of his poetry and two important prose essays.\r\n\r\n\r\nThe following books are in PDF format:\r\n\r\n* The Poet and the Politician: The Nobel Lecture (Nobel Foundation, 1959).\r\n\r\n* Selected Poems (Kline, 2012).  Translated by A. S. Kline.\r\n\r\n* Selected Writings of Salvatore Quasimodo (Farrar, Straus &amp; Cudahy, 1960).  Bilingual Italian-English edition.  Edited and translated by Allen Mandelbaum.\r\n\r\n_____________________________________________________________________________\r\n\r\n\r\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\r\n                        \nhttps://pirates-forum.org/User-workerbee  \r\n\r\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:740f81eaa9b699630b5776aae74001c68256de56","amp;dn":"Salvatore+Quasimodo+-+Nobel+Prize+in+Literature%2C+1959+%282+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"740f81eaa9b699630b5776aae74001c68256de56","infoHashBuffer":{"type":"Buffer","data":[116,15,129,234,169,182,153,99,11,87,118,170,231,64,1,198,130,86,222,86]},"announce":[],"urlList":[]}}