{"title":"Hermann Broch - The Death of Virgil &amp; The Sleepwalkers","uid":8575636,"size":3038227,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:747dba8fe0988f43912498a1521998ae915f5ecb&amp;dn=Hermann+Broch+-+The+Death+of+Virgil+%26amp%3B+The+Sleepwalkers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1371264768,"description":"Two novels by Austrian author Hermann Broch (1886-1951):\n\nHermann Broch - The Death of Virgil, translated from the German by Jean Starr Untermeyer (Vintage, 1995) [reissue].\n\nISBN: 9780679755487 | 496 pages | EPUB\n\nThe Death of Virgil [Der Tod des Vergil] was originally published in 1945. Begun while the author was imprisoned in a German concentration camp, this extraordinary and profound novel is widely regarded as one of the great works of 20th-century modernism; its stream of consciousness and complex literary allusions were influenced by the style of James Joyce.\n\nThe narrative depicts the last hours of life of the Roman poet Virgil, author of the Aeneid, in the port of Brundisium, where he accompanies the Roman emperor Augustus; his decision -- frustrated by Augustus -- to burn his Aeneid; and his final reconciliation with his destiny. Virgil's heightened perceptions as he dies recall his life and the age in which he lives, and the squalor and splendor of imperial Rome. The poet is in the interval between life and death, just as his culture hangs between the pagan and Christian eras.\n\nPart historical novel and part prose poem, The Death of Virgil is an intensely musical and immensely evocative meditation on the relation between life and death, the ancient and the modern.\n\n\nReviews\n\n&quot;Broch is the greatest novelist European literature has produced since Joyce, and ... The Death of Virgil represents the only genuine technical advance that fiction has made since Ulysses.&quot; -- George Steiner\n\n&quot;Hermann Broch belongs in that tradition of great twentieth-century novelists who have transformed, almost beyond recognition, one of the classic art forms of the nineteenth century.&quot; -- Hannah Arendt\n\n&quot;Broch's novel creates out of a dying poet's a rich, profound vision both of civilisation and of primal concerns of all mankind.&quot; -- Harry Levin\n\n&quot;One of the most extraordinary and profound experiments ever to have been undertaken with the flexible medium of the novel.&quot; -- Thomas Mann\n\n_________________________________________________\n\n\nHermann Broch - The Sleepwalkers: A Trilogy, translated from the German by Willa and Edwin Muir (Vintage, 1996) [reissue].\n\nISBN: 9780679764069 | 656 pages | EPUB\n\nThe Sleepwalkers [Die Schlafwandler, 1932] is a novel trilogy originally published in 1932. It is considered, alongside Robert Musil's Man Without Qualities and Thomas Mann's Magic Mountain, to be one of the masterpieces of modern German prose of the first half of the 20th century.\n\n\nReview\n\n&quot;One of the greatest European novels.&quot; -- Milan Kundera\n","torrent":{"xt":"urn:btih:747dba8fe0988f43912498a1521998ae915f5ecb","amp;dn":"Hermann+Broch+-+The+Death+of+Virgil+%26amp%3B+The+Sleepwalkers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"747dba8fe0988f43912498a1521998ae915f5ecb","infoHashBuffer":{"type":"Buffer","data":[116,125,186,143,224,152,143,67,145,36,152,161,82,25,152,174,145,95,94,203]},"announce":[],"urlList":[]}}