{"title":"Amy Winehouse - Back To Black (UK) (PBTHAL) [Vinyl]","uid":6561036,"size":224656373,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:748d42487dc52a3e35fb2da9a60278bc3729025b&amp;dn=Amy+Winehouse+-+Back+To+Black+%28UK%29+%28PBTHAL%29+%5BVinyl%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"insinuendo","files":17,"time":1311470485,"description":"Amy Winehouse - Back To Black (2007)\nVinyl rip in 24-bit/192 kHz - 16-bit/44 kHz | FLAC (Tracks) , artworks | Stereo | 244 Mb | 5% RAR Recovery\nStyles: Soul, R&amp;B | \nIsland/Universal Records\n\nThe story of Back to Black is one in which celebrity and the potential of commercial success threaten to ruin Amy Winehouse, since the same insouciance and playfulness that made her sound so special when she debuted could easily have been whitewashed right out of existence for this breakout record. (That fact may help to explain why fans were so scared by press allegations that Winehouse had deliberately lost weight in order to present a slimmer appearance.) Although Back to Black does see her deserting jazz and wholly embracing contemporary R&amp;B, all the best parts of her musical character emerge intact, and actually, are all the better for the transformation from jazz vocalist to soul siren. With producer Salaam Remi returning from Frank, plus the welcome addition of Mark Ronson (fresh off successes producing for Christina Aguilera and Robbie Williams), Back to Black has a similar sound to Frank but much more flair and spark to it. Winehouse was inspired by girl group soul of the '60s, and fortunately Ronson and Remi are two of the most facile and organic R&amp;B producers active. (They certainly know how to evoke the era too; Remi's &quot;Tears Dry on Their Own&quot; is a sparkling homage to the Motown chestnut &quot;Ain't No Mountain High Enough,&quot; and Ronson summons a host of Brill Building touchstones on his tracks.) As before, Winehouse writes all of the songs from her experiences, most of which involve the occasionally riotous and often bittersweet vagaries of love. Also in similar fashion to Frank, her eye for details and her way of relating them are delightful. She states her case against &quot;Rehab&quot; on the knockout first single with some great lines: &quot;They tried to make me go to rehab I won't go go go, I'd rather be at home with Ray&quot; (Charles, that is). As often as not, though, the songs on Back to Black are universal, songs that anyone, even Joss Stone, could take to the top of the charts, such as &quot;Love Is a Losing Game&quot; or the title song (&quot;We only said good bye with words, I died a hundred times/You go back to her, and I go back to black&quot;). --Allmusic\n\nTracklist:\n\n1. Rehab\n2. You Know I'm No Good\n3. Me &amp; Mr Jones\n4. Just Friends\n5. Back To Black\n6. Love Is A Losing Game\n7. Tears Dry On Their Own\n8. Wake Up Alone\n9. Some Unholy War\n10. He Can Only Hold Her\n11. You Know I'm No Good\n\nThis is an original rip produced by PBTHAL\n\nRipping Equipment:\nPbthal ripping specs:\nVPI Scoutmaster turntable with Trans-Fi Terminator Air Bearing Linear Tracing Tonearm\nAudio-Technica AT33PTG Moving Coil Cartridge\nPro-Ject TubeBox phono preamp\nE-MU 1212 soundcard\n","torrent":{"xt":"urn:btih:748d42487dc52a3e35fb2da9a60278bc3729025b","amp;dn":"Amy+Winehouse+-+Back+To+Black+%28UK%29+%28PBTHAL%29+%5BVinyl%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"748d42487dc52a3e35fb2da9a60278bc3729025b","infoHashBuffer":{"type":"Buffer","data":[116,141,66,72,125,197,42,62,53,251,45,169,166,2,120,188,55,41,2,91]},"announce":[],"urlList":[]}}