{"title":"Nuclear Engineering Handbook - Kenneth D. Kok","uid":15648422,"size":29262404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7591b20338f4006c3790213add810f8524c4180a&amp;dn=Nuclear+Engineering+Handbook+-+Kenneth+D.+Kok&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1472071085,"description":"Nuclear Engineering Handbook - Kenneth D. Kok (CRC, 2009).pdf\r\n\r\nNuclear power has, in recent years, undergone a major transformation, resulting in major technical developments and a new generation of nuclear scientists and engineers. A comprehensive book that reflects the latest nuclear technologies has been lacking—until now.\r\n\r\nThe Nuclear Engineering Handbook is a response to this global resurgence of interest in commercial nuclear power. A broad overview of nuclear power and engineering and their limitless potential, this basic introduction to the field provides an in-depth discussion of power plants and extensive coverage of the nuclear fuel cycle, waste disposal, and related engineering technologies.\r\n\r\nOrganized into three sections—Nuclear Power Reactors, Nuclear Fuel Cycle Processes and Facilities, and Engineering and Analytical Applications—this book addresses the entire nuclear fuel cycle and process. Topics include everything from the mining, milling, and enrichment of uranium and thorium fuel resources, to fuel fabrication, nuclear materials transportation, fuel reprocessing, and safe waste disposal. This all-encompassing volume discusses current analytical techniques related to nuclear engineering, addressing safety, heat transfer, shielding, thermo-hydraulics, and heat physics. Covering reactor operation and radiation protection, it also outlines the economic considerations involved in building new nuclear power stations instead of large fossil-fueled plants, and elaborates on concerns regarding the control of emissions from the latter.\r\n\r\nA review of past and current nuclear engineering capabilities, this valuable resource covers the gamut of crucial topics, including historical perspectives, a detailed technological review, and an assessment of the field’s future direction. It is an exceptional tool that will help readers to foster optimal understanding and use of nuclear power for electricity generation now and in the future","torrent":{"xt":"urn:btih:7591b20338f4006c3790213add810f8524c4180a","amp;dn":"Nuclear+Engineering+Handbook+-+Kenneth+D.+Kok","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7591b20338f4006c3790213add810f8524c4180a","infoHashBuffer":{"type":"Buffer","data":[117,145,178,3,56,244,0,108,55,144,33,58,221,129,15,133,36,196,24,10]},"announce":[],"urlList":[]}}