{"title":"Fucked Up - Glass Boys (2014) [FLAC]","uid":10316058,"size":318597368,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:76617aa774902ed446220cdb094d87ece8a2d7fd&amp;dn=Fucked+Up+-+Glass+Boys+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1402242414,"description":"\n  Fucked Up - Glass Boys (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Hardcore, Punk\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Echo Boomer\n  02 Touch Stone\n  03 Sun Glass\n  04 The Art of Patrons\n  05 Warm Change\n  06 Paper the House\n  07 DET\n  08 Led by Hand\n  09 The Great Divide\n  10 Glass Boys\n\n  Although Fucked Up's fourth album, Glass Boys, may not be as high-concept as 2011's sprawling David Comes to Life, the Canadian hardcore outfit delivers an album every bit as epic with Glass Boys. Rather than looking outward to tell a story, the album finds Fucked Up turning the narrative lens on themselves with a collection about the perils of getting older and burdens of unexpected recognition. On the poignant &quot;Touch Stone,&quot; singer Damian Abraham spins a tale about the moment you recognize yourself in the faces of the kids in the crowd and realize it's your duty to inspire the next generation to take the torch and run with it. Finishing off the album, the titular &quot;Glass Boys&quot; finds Abraham getting self-reflective as he ruminates on what will happen to him when he leaves Neverland and returns to the real world where time cruelly marches on. As on their last album, Fucked Up feel as though they're pushing punk rock into completely undiscovered territory as they completely eschew the short and sweet method of classic punk for something longer and more revelatory. Although Abraham's hoarse growls are classic hardcore, musically and lyrically Fucked Up are on a whole other plane. The band beautifully marries its dense and intricate compositions with Abraham's sledgehammer vocals to create something that feels like the next evolution of the genre. As a band whose music seems to focus so much on change and personal journeys, it only makes sense that Fucked Up would fundamentally alter the medium they were working in, allowing it to transform and become fully realized right along with them. While the band's previous effort (and its supporting material) may have been an exercise in unbridled creativity, by anchoring Glass Boys to the real world Fucked Up have made an album that reveals things not only about themselves, but about punk rock as a whole, and in the process have made a record that may very well be their masterwork.\n","torrent":{"xt":"urn:btih:76617aa774902ed446220cdb094d87ece8a2d7fd","amp;dn":"Fucked+Up+-+Glass+Boys+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76617aa774902ed446220cdb094d87ece8a2d7fd","infoHashBuffer":{"type":"Buffer","data":[118,97,122,167,116,144,46,212,70,34,12,219,9,77,135,236,232,162,215,253]},"announce":[],"urlList":[]}}