{"title":"Prison Architect - Alpha 23d - PC","uid":10675307,"size":121559642,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76bf5a8df796d9f2c4735603f4ec698d6835007e&amp;dn=Prison+Architect+-+Alpha+23d+-+PC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"sharpshot94549","files":-1,"time":1406939335,"description":"Prison Architect Alpha 23d\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\nI don't Know what was different with my 22 version, it came from the same Introversion website as the others, but this one should be good.\n\nAlpha 23d Change-Log\n\nWhen the cravings get too bad, just take a stroll to the outer wall... ...and whistle. Contraband now gets thrown over walls and smuggled in the Chef's ingredients. You're gonna need some more dogs!\n\nWe've also massively beefed up the automation - remote controls, time locks and daisy chaining of door servos will free up your time (and your guards) for more pressing matters. Also, Chris went mad and implemented a load of logic gates - WTF!\n\nCHANGES\n\n= Remote Access systems\nYou can now build a number of interconnected systems and servos in your prison, to automate access through locked doors. These new objects are unlocked via 'Remote Access' in the beauracracy screen, and available in the Utilities menu. All of these systems can be connected together using the 'Connect' tool in the Utilities menu.\nDoor Servo\nAttaches to an existing door. Can be triggered electrically to open the door.\nDoor Control System\nOperated by a guard in a security room. Allows guards to open doors remotely. The system is connected to servos via the new 'Connect' tool in the utilities menu.\nNote: The operator can open a maximum of two doors per second, so don't overload a single system with too many servos.\nNote: If a Door Control System becomes broken, ALL connected doors will spring open.\nDoor Timer\nAnother way to control doors automatically, based on time of day. Click on the door timer to access its schedule. All connected doors will be opened when the schedule says they should be.\nRemote Door\nA strong metal door that cannot be opened with Jail Keys. You must connect this door up with a Door Servo and control it remotely somehow.\n= Cctv overhall\nThe old cctv system has been replaced, using the new Connection mechanics developed for Remote Access Systems.\nCctv Monitors must now be connected to cameras using the 'Connect' tool.\nA single Cctv Monitor must now be operated by one Guard, and a Guard can only operate one monitor at a time.\nA Monitor can be connected to as many cameras as you wish, but has only eight screens.\nIf you connect it to more than eight cameras, the monitor will cycle through them, giving only partial coverage.\n= [ADVANCED FEATURE] Logic Circuits\nTwo new objects have been added purely as an experiment, and are not required for any normal prison. These objects can be used to build advanced electrical circuits.\nLogic Circuit\nA boolean logic gate with X inputs and 1 output.\nAvailable operations : And / Or / Not / Nand / Nor / Xor\nRight click on the circuit to cycle the operation.\nLogic Bridge\nCan be used to send a signal via Electrical Cable (normally used to power your prison)\nPlace the Logic Bridge over a cell containing Electrical cable, and that entire cable will have the same signal value.\nAny Logic Circuit sitting on the same Electrical Cable will receive the signal as one of its inputs.\nThis is specifically useful for transmitting a common signal around your circuit - eg a Clock signal, without requiring thousands of seperate wires.\n= Contraband Smuggling continued\nContraband can now be smuggled in via materials in a Delivery Truck. Anything brought in via Delivery Trucks can be used. E.g. Food ingredients, metal sheets for the workshop, prisoner uniforms, construction materials etc.\nDogs will detect narcotics in these items, and metal detectors will spot metal items.\nGuards can now search these items on request.\nOnce brought into the prison, the contraband will remain in its material until a nearby prisoner picks it up.\nNote: The types of contraband smuggled in this way will be determined by the Supply and Demand within the prison.\nContraband can now be thrown in over the external walls.\nPrisoners 'arrange' this when phoning home, or when talking to their visitors in Visitation.\nThey will arrange to go to a pre-determined place at a certain time, and collect a specific item.\nThe item chosen will be based on the needs of that prisoner.\nIf there are guards near the collection point, the contraband will not be thrown in.\nThe maximum throw range is 10 squares, and cannot happen in sectors marked as 'Staff Only' as prisoners cannot get there.\n= Other changes\nIntoxication is now a type of Misconduct, and is 'detected' when a Guard searches a prisoner. He will notice they are high/drunk.\nYou can now set the punishment for Intoxication in the Policy table.\nBeing caught Intoxicated automatically refers the prisoner to the relevent 'Rehab' program, if it exists.\nUtilities mode now filters the display based on what you are building, to give a clearer view.\nOnly relevent objects and connections will be shown depending on the mode - Electrical, Pipes, Circuit wiring.\nFences are no longer free (YOU try getting hundreds of metres of fences for free)\nYou can now expand and contract the Todo list to free up screen space\nMore info has been added to the tooltips in the Build Toolbar\nKitchen Sinks now require a water pipe connection\nThe 'Day X' timer in the top toolbar now shows the total 'Real Time' played on this prison\nFixed a subtle bug in the audio system that caused audio corruption sometimes - buzzing, popping, clicking\n\nUpdates\n\nAlpha 23d\nA hot-fix meant to correct some critical issues that Alpha 23 introduced to the game:\nFixed: New inmates will now use the needs system correctly.","torrent":{"xt":"urn:btih:76bf5a8df796d9f2c4735603f4ec698d6835007e","amp;dn":"Prison+Architect+-+Alpha+23d+-+PC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76bf5a8df796d9f2c4735603f4ec698d6835007e","infoHashBuffer":{"type":"Buffer","data":[118,191,90,141,247,150,217,242,196,115,86,3,244,236,105,141,104,53,0,126]},"announce":[],"urlList":[]}}