{"title":"The Elder Scrolls V - Skywind [Beta]","uid":9534227,"size":3705958238,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:76eabf8ef449cbcfa6352c2bd99001a7f8529c0b&amp;dn=The+Elder+Scrolls+V+-+Skywind+%5BBeta%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"jc2k301","files":-1,"time":1390897420,"description":"1. Q: What IS Skywind exactly?\n\nA: It is a non-commercial, fan made modification for The Elder Scrolls V: Skyrim that seeks to merge the amazing world of The Elder Scrolls III: Morrowind with the enhanced graphics and capabilities of Skyrim's engine.\n\nWhile ownership of both games is required to play, the player only actually plays Skywind using the Skyrim game, and not the older Morrowind game. This means that the user interface, combat, graphics, and system requirements for the Skywind mod are all those of Skyrim, and NOT Morrowind.\n\n2. Q: What do I need to run Skywind?\n\nA: You will need a copy of TES III: Morrowind, including the Bloodmoon and Tribunal expansions installed correctly on your system. Plus TES V: Skyrim of course. The exact files that you will need to run, as well as the instructions you should follow to install can be located on The Official Installation Instruction Thread. \n\n \n\nYOU NEED LEGITIMATE COPIES OF BOTH GAMES - even if you defeat the copy protection somehow, pirated copies of the games DO NOT WORK RIGHT with Skywind and you WILL have problems.  Also, please do not post &quot;help me&quot; threads about pirated games; you will be banned from the site.\n\n3. Q: Will Skywind be complete with quests, or will it only feature the Morrowind landscape?\n\nA: As of now, Skywind mostly just consists of landscape and static meshes, but we are currently working on getting all of the quests, npcs, weapons, creatures, etc. working correctly, and they should all be available by the final release. Remember though that we have a limited team, and if you want to see a particular feature faster then join and help work on it.\n\n4. Q: But Morrowind had very outdated graphics, especially in the mesh and texture areas!\n\nA: Take a look at some of the pictures located throughout the Skywind Screenshot thread. Eloth is nearing the completion of a fantastic visual overhaul which will replace every original Morrowind texture with remakes of much higher visual quality. Besides this, many other objects will have new custom meshes that will be of greater quality than the originals, while keeping to the Morrowind feel. Note: Most of the screeenshots are taken with ENB enabled, so they may be brighter and have more bloom than you would expect with default Skyrim shaders.\n\n5. Q: Will there be an Oblivion conversion, and if so, should I wait for it before trying Skywind?\n\nA: Yes, there will be an Oblivion conversion. However, work probably won't start on it until after the final release of Skywind. The two will be able to run separately, so there will be no reason to postpone playing Skywind just to wait for it. Though if you are really adventurous, there is currently a raw converted Masterfile for the Oblivion conversion, but it is far from playable. Everything you would need to know about that is located on the official Skyblivion Installation Instructions thread.\n\n6. Q: Will I be able to take advantage of the new Skyrim systems while in Morrowind? Things such as smithing and crafting.\n\nA: Yes you will! This is not yet implimented, but in the future you will be able to craft many of the objects from Morrowind using local materials. That means real mining and Morrowind style crafting stations too. These recipes will be balanced so as not to interfere with normal Morrowind gameplay though.\n\n7. Q: But what about fast-travel and quest markers? They could ruin a true Morrowind experience.\n\nA: You will be able to use fast-travel and quest markers because they come with the Skyrim engine. However it will still be quite possible to play through the entire game without them. There are several .ini tweaks that are especially helpful for this, and they only take a few minutes to look up and add to your .ini files. Note: Always make a backup copy of your .ini files before attempting to tweak them so you can revert back if something goes wrong.\n\n8. Q: I have heard that the armor system will be similar to the one in Morrowind, is this true?\n\nA: Yes indeed. You will be able to place 2 pauldrons, 2 gauntlets, greaves, boots, cuirass, and a helmet on your character all at the same time! There will probably still be some limitations that didn't exist in Morrowind, such as the ability to wear clothing, armor, and robes all in layers, but most of the functionality that you may remember from Morrowind will be making a glorious return.\n\n9. Q: Is there any estimate for a release date?\n\nA: Well, the masterfile is actually available right now! It can be installed by following the instructions from the link posted in question 2, however this version doesn't have that many features available at the moment. Otherwise, the answer is &quot;when it's finished.&quot;  The more people that help out, the faster it gets done!\n\n \n\n10. Q: In Skyrim, there is a really nice perk system with 18 separate skills.  In Morrowind there are 27 different skills, with a class and attribute system.  How do you plan on reconciling these differences?\n\n \n\nA:  We will use the Skyrim system as it is found in a vanilla copy of the game.  To accomplish this we will simply merge those lost skills with the most applicable Skyrim ones.  So items using short blade, long blade, blunt, axe, and spear will all be placed in the one handed and two handed Skyrim weapon categories, medium armors will be placed in the light and heavy armor categories, etc.  If you really don't like the Skyrim system, then there are already mods restoring Morrowind attributes available on sites such as the Nexus that could be used in conjunction with Skywind.\n\nInstaller For Skywind Beta, please backup original folder as this total conversion is still in development.","torrent":{"xt":"urn:btih:76eabf8ef449cbcfa6352c2bd99001a7f8529c0b","amp;dn":"The+Elder+Scrolls+V+-+Skywind+%5BBeta%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76eabf8ef449cbcfa6352c2bd99001a7f8529c0b","infoHashBuffer":{"type":"Buffer","data":[118,234,191,142,244,73,203,207,166,53,44,43,217,144,1,167,248,82,156,11]},"announce":[],"urlList":[]}}