{"title":"ConceptDraw.Office.Pro.v8.0.3.Incl.Keymaker","uid":4650098,"size":178714529,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7762382cbed11f491ef4610978a772775b58d282&amp;dn=ConceptDraw.Office.Pro.v8.0.3.Incl.Keymaker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"karniga","files":1,"time":1232019764,"description":"Capture and present your ideas as mind maps, concise radiant diagrams. Mind maps speed up understanding, decision making and learning up to 90%. Also, use MINDMAP to illustrate your MS PowerPoint presentations, generate project plans, draw pro-quality flowcharts and more.\n\n- The Mind Map View is synchronized with Outline allowing to switch between graphic and text views and work with the map and outline simultaneously. \n\n- Add new topics with just a double click over the place where you would like it to apear. \n\n- Add topics in free hand mode by dragging them out of the selected topic. \n\n- Choose between using MINDMAP or MindManager symbol sets, in particular, when working with maps created in MindManager. On the whole, the MINMDMAP set of symbols exceeds 3000 icons. \n\n- Use text notes to supply additional information where necessary. You can edit them in the floating window. When exported to HTML, notes come up as hints in the browser. \n\n- With the single click on Arrange or Sort tools you can rearrange topics, lay out them in different directions, sort by priorities or alphabetically. \n\n- Select among multiple pre-set map styles. Change the style of the entire map with just two clicks. \n\n- Multi-page Documents let create highly detailed, multi-level maps. You can produce a complete multi-page website by exporting such a map to HTML and easily navigate through its pages in the browser. \n\n- You can add your comments to the topics using Callouts. The Floating topics allow placing random ideas that do not concern the map subject matter outside your map and then go back to these ideas later. \n\nBenefits \n\n- Saves 90% of your mental energy \n\n- Increases daily productivity; \n\n- Fosters creative approach; \n\n- Strengthens team spirit \n\nAdvantages\n\n- Synchronized MindMap/Outline views\n\n- Advanced business flowcharting tools\n\n- Compatibility with ConceptDraw tools\n\n- Works on Windows and Mac OS X\n\nWindows XP/Vista","torrent":{"xt":"urn:btih:7762382cbed11f491ef4610978a772775b58d282","amp;dn":"ConceptDraw.Office.Pro.v8.0.3.Incl.Keymaker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7762382cbed11f491ef4610978a772775b58d282","infoHashBuffer":{"type":"Buffer","data":[119,98,56,44,190,209,31,73,30,244,97,9,120,167,114,119,91,88,210,130]},"announce":[],"urlList":[]}}