{"title":"EXPLOITED COLLEGE GIRLS - Sunny - Huge Curvy Boobs **NEW**","uid":10488278,"size":745414251,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:77b8c9a4333c3816c3a7a9a2e716fb8f3f9c1409&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Sunny+-+Huge+Curvy+Boobs+%2A%2ANEW%2A%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"beta2008x","files":1,"time":1404512411,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=5qjxe_sny.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=5qjxe_sny.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=zu7ot_sunny_sd_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=zu7ot_sunny_sd_s.jpg&lt;/a&gt;\n\n\n If you are a connoisseur of big, huge, epic tits on curvy blondes we've got 53 minutes of pure heaven for you this week. Her porn name is Sunny and monster mams aside, she is a charmer. She's got a sexual appetite as big as her rack and isn't at all shy about her colorful sexual history. During the intro interview, she shares a few strange but true stories, so don't immediately leap for the fast forward button.\nAfter listening to Sunny's amusing sexual history, Jay cuts to the chase and has her pull her dress off to reveal her amazing set of big naturals. They are absolutely impressive and our man can hardly keep his hands off them. Once Sunny gets settled in a cute black top things really take off, she admits she's already turned on and excited to start. We start off with some great close ups as Sunny's pussy gets fingered and then teased with a vibrator. She really gets into it, you can hear her panting and moaning on as she writhes on the bed.\nWhen Jay gets her on her knees for the blowjob portion of today's program, things really heat up. This turns out to be more than a blowjob, it's pure cock worship. Sunny performs some of the most enthusiastic, erotic oral we've ever shown at ECG. It's amazing. After the excellent beej, our resident cocksman does his best to pay her back and manages to give her a huge DP orgasm.\nAfter some really sensual fucking in sideshow and then a quick, hard pounding with Sunny's face down on the bed, Jay can't hold off anymore and unleashes a huge load that coats her lips, her chin and her amazing tits. As much as you could fall in love with Sunny's jugs, her cute face and her big, bouncy booty you'll equally fall for her personality. Just look at that enthusiasm as she rubs her jizzy reward into her tits and cheeks, it's adorable.","torrent":{"xt":"urn:btih:77b8c9a4333c3816c3a7a9a2e716fb8f3f9c1409","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Sunny+-+Huge+Curvy+Boobs+%2A%2ANEW%2A%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77b8c9a4333c3816c3a7a9a2e716fb8f3f9c1409","infoHashBuffer":{"type":"Buffer","data":[119,184,201,164,51,60,56,22,195,167,169,162,231,22,251,143,63,156,20,9]},"announce":[],"urlList":[]}}