{"title":"Thick As A Brick - Tull","uid":7902222,"size":267437992,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77d5f9adf45d8ea544d9633c701e10f83a17e9bf&amp;dn=Thick+As+A+Brick+-+Tull&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"PiratePrincess","files":8,"time":1354989783,"description":"Album information\n\nThe epic is notable for numerous time signature and tempo changes (which is not uncommon in the then-emerging progressive rock subgenre of rock), as well as a large number of themes throughout the piece, resembling a typical classical symphony in this regard, rather than a typical rock song. Released in 1972, Thick as a Brick was Jethro Tull's first deep progressive rock offering, four years after the release of their first album. Not only was the musical structure complex, but many instruments uncommon in rock music were added. Whereas in prior numbers the band were content with guitars, drums, piano, Hammond organ, and Ian Anderson's signature flute, Thick as a Brick included harpsichord, xylophone, timpani, violin, lute, trumpet, saxophone, and a string section.\nBand leader Ian Anderson was surprised by the critical reaction to the previous album, Aqualung, as a &quot;concept album&quot;, a label he has firmly rejected to this day. In an interview on In the Studio with Redbeard (which spotlighted Thick as a Brick), Anderson's response to the critics was: &quot;If the critics want a concept album we'll give the mother of all concept albums and we'll make it so bombastic and so over the top.&quot;[5] Ian Anderson has been quoted as stating that Thick as a Brick was written &quot;because everyone was saying we were a progressive rock band, so we decided to live up to the reputation and write a progressive album, but done as a parody of the genre.&quot; With Thick as a Brick, the band created an album deliberately integrated around one concept: a poem by an intelligent English boy (named Gerald) about the trials of growing up. Beyond this, the album was a send-up of all pretentious &quot;concept albums&quot;. (The simile &quot;Thick as a brick&quot;, in English, is an expression signifying someone who is &quot;stupid; slow to learn or understand&quot;.[6])\nAnderson also stated in that interview that &quot;the album was a spoof to the albums of Yes and Emerson, Lake &amp; Palmer much like what the movie Airplane! had been to Airport&quot;. The formula was successful, and the album reached number one on the charts in the United States. ","torrent":{"xt":"urn:btih:77d5f9adf45d8ea544d9633c701e10f83a17e9bf","amp;dn":"Thick+As+A+Brick+-+Tull","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77d5f9adf45d8ea544d9633c701e10f83a17e9bf","infoHashBuffer":{"type":"Buffer","data":[119,213,249,173,244,93,142,165,68,217,99,60,112,30,16,248,58,23,233,191]},"announce":[],"urlList":[]}}