{"title":"STREET FIGHTER II comics (1993-2010) (Malibu, DC, Image, Udon)","uid":8354712,"size":945576408,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:77ea3e17fb553206929cd4b490c35ce17913d958&amp;dn=STREET+FIGHTER+II+comics+%281993-2010%29+%28Malibu%2C+DC%2C+Image%2C+Udon%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"STFmaryville","files":-1,"time":1365456390,"description":"I believe there are 58 comics and 1 magazine in this torrent. I don't think I've ever read a Street Fighter II comic, although I did enjoy the games.\n\nActually I was browse the Comics category here on TPB, and I noticed that someone anonymous uploaded a torrent, &quot;The Complete Street Fighter Collection (Udon, 2003-2010)&quot; but never seeded it. However, a month later and there are still 90+ people trying to get it!\n\nSo, thanks to Joshua13's MTCDC project, here are those Udon comics, as well as 5 from Malibu, and the DC adaptation of the movie.\n\nEnjoy and please seed in order to share with our friends here on TPB!  --STFmaryville\n\n------\n\nFrom Wikipedia: (it's about the game, not the comics, but whatever...)\n\nStreet Fighter II is a competitive fighting game originally released for the arcades in 1991.\n\nThe success of Street Fighter II is credited for starting the fighting game boom during the 1990s which inspired other game developers to produce their own fighting game franchises, popularizing the genre. In 1993, sales of Street Fighter II exceeded $1.5 billion in gross revenues, and by 1994, the game had been played by at least 25 million Americans in homes and arcades. The video game console ports to the Super NES and Sega Genesis sold more than 14 million copies, and it remains Capcom's best-selling consumer game of all time as of March 31, 2012.","torrent":{"xt":"urn:btih:77ea3e17fb553206929cd4b490c35ce17913d958","amp;dn":"STREET+FIGHTER+II+comics+%281993-2010%29+%28Malibu%2C+DC%2C+Image%2C+Udon%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77ea3e17fb553206929cd4b490c35ce17913d958","infoHashBuffer":{"type":"Buffer","data":[119,234,62,23,251,85,50,6,146,156,212,180,144,195,92,225,121,19,217,88]},"announce":[],"urlList":[]}}