{"title":"Mulholland.Drive.2001.1080p.Criterion.BluRay.x264.DTS-SARTRE","uid":13501207,"size":7013857769,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:78d462e161a7f90744962e54254fc1bf6316bbed&amp;dn=Mulholland.Drive.2001.1080p.Criterion.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"sartre7","files":15,"time":1455198926,"description":"\n\r\n\r\nDavid Lynch wrote and directed this look at two women who find themselves walking a fine line between truth and deception in the beautiful but dangerous netherworld of Hollywood. A beautiful woman (Laura Elena Harring) riding in a limousine along Los Angeles' Mulholland Drive is targeted by a would-be shooter, but before he can pull the trigger, she is injured when her limo is hit by another car. The woman stumbles from the wreck with a head wound, and in time makes her way into an apartment with no idea of where or who she is. \r\n\r\nAs it turns out, the apartment is home to an elderly woman who is out of town, and is allowing her niece Betty (Naomi Watts) to stay there; Betty is a small-town girl from Canada who wants to be an actress, and her aunt was able to arrange an audition with a film director for her. Betty befriends the injured woman, who begins calling herself &quot;Rita&quot; after seeing a poster of Rita Hayworth. \r\n\r\nWhile Betty's audition impresses a casting agent, and she catches the eye of hotshot director Adam Kesher (Justin Theroux), Kesher's producers and moneymen insist with no small vehemence that he instead cast a woman named Camilla Rhodes. As Rita attempts to put the pieces of her life back together, she pulls the name Diane Selwyn from her memory; Rita thinks it could be her real name, but when she and Betty find a listing for Diane Selwyn and visit her apartment, they discover the latest victim of a mysterious killer who is eluding police detective Harry McKnight (Robert Forster). Rita's emotional identity soon takes a left turn, and it turns out that neither woman is quite who she once appeared to be. \r\n\r\nDavid Lynch originally conceived Mulholland Drive as the pilot film for a television series; after the ABC television network rejected the pilot and declined to air it, the French production film StudioCanal took over the project, and Lynch reshot and re-edited the material into a theatrical feature. The resulting version of Mulholland Drive premiered at the 2001 Cannes Film Festival, where David Lynch shared Best Director honors with Joel Coen.\r\n\r\n\r\n\r\nSTARS.........: Naomi Watts, Laura Harring, Justin Theroux\r\nDIRECTOR......: David Lynch\r\nWRITERS.......: David Lynch\r\nGENRE.........: Drama | Mystery | Thriller\r\nRATING........: 8.0/10  226,759 votes\r\nMETASCORE.....: 81/100\r\nIMDB LINK.....: http://www.imdb.com/title/tt0166924/\r\nRUNTIME.......: 2h 27mn\r\nSIZE..........: 5.41GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x1036\r\nBITRATE.......: 4500 Kbps (3-Pass)\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO.........: English DTS 5.1 768kbps\r\nSOURCE........: Criterion Blu Ray\r\nSUBTITLES.....: ENG\r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-02-10\r\n\r\n\r\n\r\n \nhttp://i.imgur.com/DBvzZnF.jpg \nhttp://i.imgur.com/YN4SUDj.jpg \nhttp://i.imgur.com/gnjo0aT.jpg","torrent":{"xt":"urn:btih:78d462e161a7f90744962e54254fc1bf6316bbed","amp;dn":"Mulholland.Drive.2001.1080p.Criterion.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78d462e161a7f90744962e54254fc1bf6316bbed","infoHashBuffer":{"type":"Buffer","data":[120,212,98,225,97,167,249,7,68,150,46,84,37,79,193,191,99,22,187,237]},"announce":[],"urlList":[]}}