{"title":"How to Write a Novel in 30 Days or Less - Nicholas Black.epub","uid":10883609,"size":514780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:78f7b90c6f246651dc7afc0e6bc062dcd3a5dda6&amp;dn=How+to+Write+a+Novel+in+30+Days+or+Less+-+Nicholas+Black.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1409060263,"description":"How to Write a Fiction Novel in 30 Days - ideas and techniques if you only have one hour or less each day to write your book. \nby Nicholas Black\n\nHave you thought about writing books? \nAre you writing a book now? \nDoes the idea of writing books seem seem interesting but you have no experience? \n\nThis will teach you how to write a book, quickly, and have you published in 30 days! \n\nThis is the number one book that will teach you an actual system to take the ideas out of your head and formulate them into your very own fiction novel. This is the same How-to system that Nicholas Black used to write his novels, after having no experience at all in writing or publishing. \n\n(BONUS) - Special new section on your Kindle Strategy to Launch your book! This is invaluable information, notes, web links, and a structured timeline for any author who is about to publish. \n\nSeveral of Mr. Black's books have been best sellers in many categories on Amazon, and this teaches you the basics of getting your novel written and published in the next month! \n\nWant to be the next Dean Koontz, Stephen King, or James Patterson? This how-to book will teach you how to create and maintain an effective outline, write a stunning Prologue, Epilogue, and all of the important chapters in between. You will learn how to understand the dramatic structure of a novel (both fiction and nonfiction), and all of the details in between. \n\nThis book will teach you, even if you've never written anything in your life, how to get those ideas out of your head, and onto the printed page - or on the lit screen of the Amazon Kindle and Kindle Fire (as well as the many other e-reading devices like: Sony, Barnes &amp; Noble's Nook, Apple's iPad, and more). Learn the basics that you will need for any of the e-publishing formats (.epub, .mobi, PRC, AZW, AZW1, TPZ, .TXT, PRS (Sony devices), EPUB, LRF, LRX, RTF, PDF, etc.). \n\nSo if you want to become a best selling author, but you never thought you had the time to write a book, then this is the How-to book for you. This book is easy to read, easy to understand, and easy to use! \n\nLearn how to write a book (your fiction novel) in the next 30 days! \n\nNicholas Black (author of over 15 novels in just the last two years; including, See Jack Die, the Purg Series, Walking Ghost, Soul's Harbor, and The Messenger) has created a system that is so simple to use, you can write your first novel in 30 days, while only having to dedicate one hour per day to your writing. \n\nNicholas pioneered this system, having zero experience in writing of any kind. He takes you from a complete novice, and teaches you every skill you will need to get your thoughts onto the screen, and out into the market. \n\nSo what are you waiting for? In 30 days you could be a published Novelist!","torrent":{"xt":"urn:btih:78f7b90c6f246651dc7afc0e6bc062dcd3a5dda6","amp;dn":"How+to+Write+a+Novel+in+30+Days+or+Less+-+Nicholas+Black.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78f7b90c6f246651dc7afc0e6bc062dcd3a5dda6","infoHashBuffer":{"type":"Buffer","data":[120,247,185,12,111,36,102,81,220,122,252,14,107,192,98,220,211,165,221,166]},"announce":[],"urlList":[]}}