{"title":"Star Wars Flight-Sim Gems(X-Wing,TIE-Fighter, XWA=","uid":3526002,"size":1700215401,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:79006cc926118521f56b3833cb6ab21dd09d58a4&amp;dn=Star+Wars+Flight-Sim+Gems%28X-Wing%2CTIE-Fighter%2C+XWA%3D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Threedots_dead","files":5,"time":1158600573,"description":"Evening everyone. This is my second release in the &quot;gems&quot;-series, and this time I decided to provide you with some Star Wars games. The so called &quot;X-Wing trilogy&quot; to be precise. The torrent has been posted  here before, but has since been removed, so I resubmited it.\n\nWhen they came out, all three of these games were considered the best of their genre, and both X-Wing and TIE-Fighter have had their graphics upgraded since then.\nI decided not to include X-Wing vs. TIE-Fighter because 1: I donÂ´t have it :), and 2: It was mostly a multiplayer-game. A smaller trial-version is included on the X-Wing-disc if youÂ´re interested.\n\nLetÂ´s go over to the games then!\n\n1. X-Wing. \n    Released by Lucasarts waaaaaaay back in 1993 on five diskettes, this was a revolutionary game that just about everyone played. You are a rebel pilot and have to fight the empire in a storyline centered around the first movie, with the final battle taking place over the death star at the battle of Yavin. On your way there you will play through lots and lots of campaigns and bonus-missions. \nThe  game engine was upgraded and voices and sound were added for the games release on CD-ROM a few  years later. For the 1998 &quot;X-wing collector series&quot; it was converted to work in windows and most of the interface between battles was redone. Despite the dated graphics, it is still a great game that captures the magic of Star Wars perfectly. If nothing else, you should play it just to experience the amazing Death star-battle.\n\n2. TIE-Fighter.\n    This was the highly anticipated sequel for X-wing, and by many considered one of the best games ever. Me included ;) This time itÂ´s up to you in your cool black outfit to blow the puny rebel-hippies to dust, using a wide range of Imperial equipment at your disposal. You fly everything from a simple TIE-fighter with only two laser cannons to the kickass TIE-defender outfitted with shields, tractor beam, quad lasers, heavy torpedoes and more. You can even choose your ship and customize  your equipment yourself after you gain some rank. At your side       you have wingmen that you can  assign orders to at any time, and your squad is supported by other TIE-fighters, bombers, assault gunboats and, of course, the mighty star-destroyers. There are lots of references to the movies and very cool  cutscenes, which all add to the great atmosphere. Just like X-wing, this games graphics were upgraded in 98, both in-game and when it comes to the interface. It even supports 3D-rendering (although I couldnÂ´t get it to work). If you like space-sims: play it. If you like Star Wars: quit your work and play it.\n\n3. X-Wing Alliance. \n    It doesnÂ´t have that much incommon with its two predecessors, but it is nevertheless a solid game. Some of the &quot;magic&quot; is gone because you donÂ´t start out as a member of any of the factions, but as the member of a family that trades in... something. That means you will spend the first third or so of the game flying ships and meeting enemies you have never heard of before. The game soon picks  up, however, and letÂ´s you fly all the familiar X,Y,A,B-wings and so on. The climactic ending is the wonderful and long (split up in several sub-missions) battle of Endor, with tons of fighters and capital ships flying around. And piloting the Millenium Falcon is of course a dream come true for all the fans.  New features include the ability to man turrets on bigger craft, look around the cockpit using the mouse and of course higher resolutions and full 3D-hardware support. There is currently a project to  upgrade all the models used in the          game, and the ones IÂ´ve seen looks absolutely stunning. Have a  look at http://www.xwaupgrade.com/ \n\n  \nInstructions on how to install are included with every game. All of them run in XP with no tweaking  needed, at least not for me. I should mention you will need a joystick to play them. I played the  DOS-version of TIE-fighter with my mouse, but that doesnÂ´t seem to work in the Windows-edition. Let me know if you find a way.\nFeel free to e-mail/MSN-me if you run into any problems: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;6c000d1b0933060908052c040318010d0500420f0301&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nHave Fun!","torrent":{"xt":"urn:btih:79006cc926118521f56b3833cb6ab21dd09d58a4","amp;dn":"Star+Wars+Flight-Sim+Gems%28X-Wing%2CTIE-Fighter%2C+XWA%3D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79006cc926118521f56b3833cb6ab21dd09d58a4","infoHashBuffer":{"type":"Buffer","data":[121,0,108,201,38,17,133,33,245,107,56,51,203,106,178,29,208,157,88,164]},"announce":[],"urlList":[]}}