{"title":"Christine Felstead - Yoga for Runners","uid":9372341,"size":6618558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7929a7d090391e7a8da6b8f44f162d09032262f7&amp;dn=Christine+Felstead+-+Yoga+for+Runners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"acer47x","files":-1,"time":1387554812,"description":"As a runner, you strike the ground 1,000 times per mile, with a force of two to three times your body weight. You can feel that impact in the muscles, ligaments, and bone structures throughout your body. Thankfully, &quot;Yoga for Runners&quot; addresses both the physical and mental demands of the sport. Whether you are new to yoga or have practiced for years, &quot;Yoga for Runners&quot; provides you with the most effective poses--88 poses in all. Each pose is described in detail to ensure correct execution, maximizing the physical benefit and decreasing the risk of injury.\n\nYou'll learn how simple yoga techniques can be incorporated into your existing running workouts and routines to eliminate chronic aches and pains. Discover how each pose can be sequenced to address a specific need, such as strengthen and lengthen the hamstrings, strengthen and increase mobility of the hip joint, eliminate lower-back and upper-body discomfort, speed the recovery process after a practice run or a race, maintain a strong core, or just restore and rejuvenate to prepare for an upcoming event. These sequences target all troublesome muscle regions. Anatomical illustrations and descriptions explain why these poses and sequences decrease your risk of acute or chronic injury as well as why they are beneficial to your training regimen.\n\nAfter just a few weeks of following &quot;Yoga for Runners,&quot; you will feel stronger, more balanced, more in tune with your breathing, and more aware of your posture and technique. Your entire running experience--endurance, strength, breathing, and mental sharpness--will be more productive, positive, and enjoyable.","torrent":{"xt":"urn:btih:7929a7d090391e7a8da6b8f44f162d09032262f7","amp;dn":"Christine+Felstead+-+Yoga+for+Runners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7929a7d090391e7a8da6b8f44f162d09032262f7","infoHashBuffer":{"type":"Buffer","data":[121,41,167,208,144,57,30,122,141,166,184,244,79,22,45,9,3,34,98,247]},"announce":[],"urlList":[]}}