{"title":"Collins COBUILD Advanced Dictionary 6th Edition","uid":9521154,"size":565699933,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:79b3ca42c15964cef6545ec7667ec637ad61454b&amp;dn=Collins+COBUILD+Advanced+Dictionary+6th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"AUDI-A4","files":48,"time":1390636847,"description":"Advanced Dictionary: (Collins Cobuild)\n\nThis is the 6th edition of the Collins Cobuild Advanced Learner's English Dictionary.\n\nThis new edition of the flagship Collins Cobuild dictionary for advanced learners of English, gives up-to-date coverage of today's English, and transforms the learner's dictionary from an occasional reference into the best possible learning resource.\n\nThis dictionary is ideal for upper intermediate and advanced learners of English. It covers all the words, phrases and idioms that students need to learn and master to be able to speak and write effective English, and gives extensive help with grammar, including grammar patterns for many of the examples, and including a grammar reference in the supplement. A wide range of vocabulary-building features, many of them with full-colour illustrations, help with learning new words.\n\nThe dictionary also includes an Activity Guide, which gives exercises in dictionary use; a Writer's Handbook, which gives guidance on spelling, punctuation, letter-writing and CVs; a Speaker's Handbook, which gives advice on the best set phrases to use in key situations; Text Messaging Abbreviations and Emoticons; Defining Vocabulary; Geographical Places and Nationalities; Academic Word List.\n\nThis edition comes with a pin code which gives access to myCobuild.com. This website includes the full text of the dictionary, plus over 2,000 additional entries grouped by topic so learners can customize the online dictionary to meet their own learning needs, and a wide range of additional activities and features.","torrent":{"xt":"urn:btih:79b3ca42c15964cef6545ec7667ec637ad61454b","amp;dn":"Collins+COBUILD+Advanced+Dictionary+6th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79b3ca42c15964cef6545ec7667ec637ad61454b","infoHashBuffer":{"type":"Buffer","data":[121,179,202,66,193,89,100,206,246,84,94,199,102,126,198,55,173,97,69,75]},"announce":[],"urlList":[]}}