{"title":"ESG - A South Bronx Story","uid":3938082,"size":73217625,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79f0971a5d74344d0b522743d1833dd1984eaa68&amp;dn=ESG+-+A+South+Bronx+Story&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"relssieg","files":17,"time":1197963866,"description":"The four Scroggins sisters (Renee, Deborah, Valerie, and Marie) and neighbor Tito Libran burst on to the music scene from left field in 1981 with the remarkable success of &quot;UFO&quot; and &quot;Moody&quot; off their debut 12-inch record. Thanks to the ascendance of hip-hop, the South Bronx was very much on the musical map at the time. But ESG&amp;#039;s minimalist funk, which featured live instruments, was closer in spirit to what was coming out of the U.K. at the time--PiL, Gang of Four, and the Factory label (which released ESG&amp;#039;s first three songs). Their approach also had kinship to New York bands Konk, Bush Tetras, and Liquid Liquid (the latter two would become their label-mates on the semi-legendary 99 Records). &quot;Moody&quot; entered permanent rotation at New York dance clubs such as the Paradise Garage, while &quot;UFO&quot; became a hip-hop building block, used as sample material for at least a dozen other records (and still counting). The appeal of the tracks lay in the taut interaction between Deborah and Valerie&amp;#039;s bass and drums, abetted by Marie and Tito&amp;#039;s congas as well as Renee&amp;#039;s sparse but precise guitar and unadorned vocal style. The stripped-down nature of the sound lent itself to hip-hop producers&amp;#039; layering on top of it and has helped the music successfully weather the intervening decades--there&amp;#039;s none of that &quot;What were they thinking with that synthesizer sound?&quot; problem that afflicts some early &amp;#039;80s music. The CD includes much of their 99 Records output and tracks from their self-titled 1991 release on the Pow Wow label. The 99 Records label itself went down in legal flames, and that Renee Scroggins&amp;#039; apparently owns the rights to the music is noteworthy in itself. But the historical significance and sheer listenability of the music make this a most welcome reissue. --Bob Bannister ","torrent":{"xt":"urn:btih:79f0971a5d74344d0b522743d1833dd1984eaa68","amp;dn":"ESG+-+A+South+Bronx+Story","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79f0971a5d74344d0b522743d1833dd1984eaa68","infoHashBuffer":{"type":"Buffer","data":[121,240,151,26,93,116,52,77,11,82,39,67,209,131,61,209,152,78,170,104]},"announce":[],"urlList":[]}}