{"title":"A Textbook of Graph Theory - R. Balakrishnan, K. Ranganathan","uid":11823902,"size":4177713,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a61664a7aff6005435e6bfade07fdc3465bada9&amp;dn=A+Textbook+of+Graph+Theory+-+R.+Balakrishnan%2C+K.+Ranganathan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1429397165,"description":"Graph theory experienced a tremendous growth in the 20th century. One of the main reasons for this phenomenon is the applicability of graph theory in other disciplines such as physics, chemistry, psychology, sociology, and theoretical computer science. This textbook provides a solid background in the basic topics of graph theory, and is intended for an advanced undergraduate or beginning graduate course in graph theory.\n\nThis second edition includes two new chapters: one on domination in graphs and the other on the spectral properties of graphs, the latter including a discussion on graph energy.  The chapter on graph colorings has been enlarged, covering additional topics such as homomorphisms and colorings and the uniqueness of the Mycielskian up to isomorphism.  This book also introduces several interesting topics such as Dirac's theorem on k-connected graphs, Harary-Nashwilliam's theorem on the hamiltonicity of line graphs, Toida-McKee's characterization of Eulerian graphs, the Tutte matrix of a graph, Fournier's proof of Kuratowski's theorem on planar graphs, the proof of the nonhamiltonicity of the Tutte graph on 46 vertices, and a concrete application of triangulated graphs","torrent":{"xt":"urn:btih:7a61664a7aff6005435e6bfade07fdc3465bada9","amp;dn":"A+Textbook+of+Graph+Theory+-+R.+Balakrishnan%2C+K.+Ranganathan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a61664a7aff6005435e6bfade07fdc3465bada9","infoHashBuffer":{"type":"Buffer","data":[122,97,102,74,122,255,96,5,67,94,107,250,222,7,253,195,70,91,173,169]},"announce":[],"urlList":[]}}