{"title":"Root Explorer v4.0.1 Proper Patched APK [SadeemPC].zip","uid":14367550,"size":2681369,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:7ab32bb58c7bab7fd5d5083729118aec26311c43&amp;dn=Root+Explorer+v4.0.1+Proper+Patched+APK+%5BSadeemPC%5D.zip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"SadeemPC","files":1,"time":1461128574,"description":"Root Explorer v4.0.1 Patched APK\r\n\r\nRoot Explorer is the ultimate file manager for root users. Access the whole of android's file system (including the elusive data folder!).\t\r\n\r\nFeatures include multiple tabs, Google Drive, Box, Dropbox and network (SMB) support, SQLite database viewer, Text Editor, create and extract zip or tar/gzip files, extract rar archives, multi-select, execute scripts, search, remount, permissions, bookmarks, send files (via email, bluetooth etc), image thumbnails, APK binary XML viewer, change file owner/group, create symbolic link, &quot;Open With&quot; facility, MD5, create shortcuts.\r\n\r\nWe will always try to help with any problem you may have with the app. If we can't help then you can have a refund, no questions asked. Although 22,000+ five star ratings will tell you that most people are very satisfied customers. Make sure you read as many comments as possible to get a good idea of what most people think of the app. We still respect the old 24 hour refund policy. So if you're not happy with the app just email us within 24 hours and you can have a refund. We'll need to know the order number, which you can find on the emails sent to you by Google when you downloaded.\r\n\r\nWhy compromise? Get the original and the best!\r\n\r\nNew permissions:\r\n- Full network access - Required for network and cloud access. No information is passed to us over the internet.\r\n- Add or remove accounts - Used by the Google Drive SDK to add a new account if desired. No changes are made to existing accounts and no details accessed apart from the account name.\r\n- Find accounts on the device - Used to list available accounts for logging into Google Drive.\r\n- Prevent from sleeping - Used to stop the device sleeping during long operations so they are not interrupted.\r\n\r\nWHAT'S NEW:\r\n- Material Design\r\n\r\nRequirements: Android 2.3+\r\n\r\nLicense Properly Patched | Drive work","torrent":{"xt":"urn:btih:7ab32bb58c7bab7fd5d5083729118aec26311c43","amp;dn":"Root+Explorer+v4.0.1+Proper+Patched+APK+%5BSadeemPC%5D.zip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ab32bb58c7bab7fd5d5083729118aec26311c43","infoHashBuffer":{"type":"Buffer","data":[122,179,43,181,140,123,171,127,213,213,8,55,41,17,138,236,38,49,28,67]},"announce":[],"urlList":[]}}