{"title":"Paolo Bacigalupi - The Water Knife","uid":12282685,"size":404215962,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7b0dc56fb07092c1e249c305ccc180a2fa4c4aaf&amp;dn=Paolo+Bacigalupi+-+The+Water+Knife&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Cybotage","files":58,"time":1440435943,"description":"In the American Southwest, Nevada, Arizona, and California skirmish for dwindling shares of the Colorado River. Into the fray steps Angel Velasquez, detective, leg breaker, assassin, and spy. A Las Vegas water knife, Angel &quot;cuts&quot; water for his boss, Catherine Case, ensuring that her lush, luxurious arcology developments can bloom in the desert, so the rich can stay wet while the poor get nothing but dust.\n\nWhen rumors of a game-changing water source surface in drought-ravaged Phoenix, Angel is sent to investigate. There he encounters Lucy Monroe, a hardened journalist with no love for Vegas and every reason to hate Angel, and Maria Villarosa, a young Texas refugee who survives by her wits and street smarts in a city that despises everything she represents.\n\nWith bodies piling up, bullets flying, and Phoenix teetering on collapse, it seems like California is making a power play to monopolize the life-giving flow of a river. For Angel, Lucy, and Maria, time is running out, and their only hope for survival rests in each other's hands. But when water is more valuable than gold, alliances shift like sand, and the only thing for certain is that someone will have to bleed if anyone hopes to drink.\n\n\nRead by Almarie Guerra\nFormat: MP3\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:7b0dc56fb07092c1e249c305ccc180a2fa4c4aaf","amp;dn":"Paolo+Bacigalupi+-+The+Water+Knife","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b0dc56fb07092c1e249c305ccc180a2fa4c4aaf","infoHashBuffer":{"type":"Buffer","data":[123,13,197,111,176,112,146,193,226,73,195,5,204,193,128,162,250,76,74,175]},"announce":[],"urlList":[]}}