{"title":"Pierre Bourdieu - Distinction (1984)","uid":8617151,"size":34637814,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b5f7199a2b7f648109edec99666a10b0ff85861&amp;dn=Pierre+Bourdieu+-+Distinction+%281984%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":-1,"time":1372281811,"description":"Pierre Bourdieu (trans. Richard Nice) - Distinction: A Social Critique of the Judgement of Taste (Harvard University Press, 1984).\n\nISBN: 9780674212770 | 640 pages | PDF\n\n\nNo judgement of taste is innocent. In a word, we are all snobs.\n\nPierre Bourdieu (1930-2002), the French sociologist, anthropologist and philosopher, brilliantly illuminates this situation of the middle class in the modern world. He focuses here on the French bourgeoisie, its tastes and preferences. Distinction is at once a vast ethnography of contemporary France and a dissection of the bourgeois mind.\n\nIn the course of everyday life people constantly choose between what they find aesthetically pleasing and what they consider tacky, merely trendy, or ugly. Bourdieu bases his study on surveys that took into account the multitude of social factors that play a part in a French person's choice of clothing, furniture, leisure activities, dinner menus for guests, and many other matters of taste. What emerges from his analysis is that social snobbery is everywhere in the bourgeois world. The different aesthetic choices people make are all distinctions -- that is, choices made in opposition to those made by other classes. Taste is not pure. Bourdieu finds a world of social meaning in the decision to order bouillabaisse, in our contemporary cult of thinness, in the &quot;California sports&quot; such as jogging and cross-country skiing. The social world, he argues, functions simultaneously as a system of power relations and as a symbolic system in which minute distinctions of taste become the basis for social judgement.\n\nThe topic of Bourdieu's book is a fascinating one: the strategies of social pretension are always curiously engaging. But the book is more than fascinating. It is a major contribution to current debates on the theory of culture and a challenge to the major theoretical schools in contemporary sociology.\n\n\nReviews\n\n&quot;A book of extraordinary intelligence.&quot; -- Irving Louis Horowitz, Commonweal\n\n&quot;One of the more distinguished contributions to social theory and research in recent years. . . There is in this book an account of culture, and a methodology of its study, rich in implication for a diversity of fields of social research. The work in some ways redefines the whole scope of cultural studies.&quot; -- Anthony Giddens, Partisan Review\n\n&quot;Bourdieu's analysis transcends the usual analysis of conspicuous consumption in two ways: by showing that specific judgments and chokes matter less than an esthetic outlook in general and by showing, moreover, that the acquisition of an esthetic outlook not only advertises upper-class prestige but helps to keep the lower orders in line. In other words, the esthetic world view serves as an instrument of domination. It serves the interests not merely of status but of power. It does this, according to Bourdieu, by emphasizing individuality, rivalry, and 'distinction' and by devaluing the well-being of society as a whole.&quot; -- Christopher Lasch, Vogue\n\n","torrent":{"xt":"urn:btih:7b5f7199a2b7f648109edec99666a10b0ff85861","amp;dn":"Pierre+Bourdieu+-+Distinction+%281984%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b5f7199a2b7f648109edec99666a10b0ff85861","infoHashBuffer":{"type":"Buffer","data":[123,95,113,153,162,183,246,72,16,158,222,201,150,102,161,11,15,248,88,97]},"announce":[],"urlList":[]}}