{"title":"Harvard Dictionary of Music","uid":5498537,"size":21361278,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ba6a392a67dba3b09e8e4c46050abc342452930&amp;dn=Harvard+Dictionary+of+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"artpepper","files":-1,"time":1271414507,"description":"Harvard Dictionary of Music: Second Edition, Revised and Enlarged\nWilli Apel\n\nBelknap Press of Harvard University Press | 1968 | ISBN: 0674375017 | 935 pages | Djvu | 16,4 MB\n\n(WinDjView, an Open Source .djvu viewer from sourceforge.net included in a .zip file)\n\n\n\n\n\n\n\nA classic and invaluable reference work for over thirty years. Soon after its initial publication, the Harvard Dictionary of Music by Willi Apel was firmly established as a standard and essential resource for everyone concerned with music. \n\n\nThe product of exceptional scholarship, it was praised as being comprehensive, concise, authoritative, scholarly, and enjoyable. Leopold Stokowski wrote, &quot;I so often consult your dictionary of music, and with such never failing enlightenment, that I must offer you my thanks for your unique book, so profound and so broad in scope ... The vast scholarship... is of immeasurable value to the whole world of music.&quot; \n\n\nThe Christian Science Monitor called it &quot;a highly satisfying book of musical knowledge, in which basic definitions are given with fine intellectual integrity, and musical facts are carefully separated from plausible deductions or theories.&quot;\n\nFor this second edition the dictionary has been thoroughly revised, updated, and substantially enlarged. Mr. Apel and eightyeight other eminent music scholars have contributed new articles and revised old ones completely. The already comprehensive list of accurate definitions has grown measurably and it now even includes nothus, pyiba, and meringue.\n\nIn the greatly expanded coverage of ethnomusicology, cumbia-an Afro-Panamanian dance form - and Vietnam are only two of the new entries. Additionally, all the general information about individual countries has been revised and the discussion of both theory and history has been amply increased. \n\n\nDevelopments of the last two decades are given special attention with particular emphasis on compositional techniques, including electronic music and serial music. Individual compositions, representative of every type from every era, are described.\n\nThe bibliography following each article, a unique feature of the first edition, has been updated and expanded. There are fifty percent more illustrations than in the first edition, including explicit drawings of instruments, clear music examples, diagrams, charts and a full-page outline of the history of music.\n\nAn extensive list of the most important music libraries and collections throughout the world with summaries of their significant musical holdings is a valuable part of the dictionary. The section on historical editions now lists fifty-three collections of music and briefly describes each volume within each collection.\n\nThe Harvard Dictionary of Music, Second Edition, Revised and Enlarged, is the result of imaginative, specialized, modern, and reliable music scholarship. Containing nearly 1000 pages of precise and accessible information on all musical subjects, it offers over fifty percent more material than the first edition. \n\n\nIt is essential not only to the scholar of music, the professional performer, and the practicing amateur, but to everyone who has ever anticipated the pleasure of a weekly musical broadcast, purchased a favorite recording, or truly enjoyed a concert.\n\n\n","torrent":{"xt":"urn:btih:7ba6a392a67dba3b09e8e4c46050abc342452930","amp;dn":"Harvard+Dictionary+of+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba6a392a67dba3b09e8e4c46050abc342452930","infoHashBuffer":{"type":"Buffer","data":[123,166,163,146,166,125,186,59,9,232,228,196,96,80,171,195,66,69,41,48]},"announce":[],"urlList":[]}}