{"title":"ALL THE PRETTY HORSES - Cormac McCarthy. Frank Muller {FerraBit}","uid":4742438,"size":334745056,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7bba6dbe0b5102edcc1136be64cf3a2bd7c2383c&amp;dn=ALL+THE+PRETTY+HORSES+-+Cormac+McCarthy.+Frank+Muller+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"FerraBit","files":-1,"time":1235631384,"description":"ALL THE PRETTY HORSES by Cormac McCarthy (1992)\n\nRead by . . : Frank Muller\nPublisher . : Recorded Books (1992) #C4162  \nISBN . . . .: ISBN-10: 0694523445 ISBN-13: 978-1428153127\nFormat . . .: MP3. 168 tracks, 315 MB\nBitrate . . : ~70 kbps (iTunes 8, VBR, mono, 32 kHz)\nSource . . .: 9 CDs (10 hours)\nGenre . . . : Fiction, Western\nUnabridged .: Unabridged\n\nFirst of the Border Trilogy:\n  Book 1: All the Pretty Horses\n  Book 2: The Crossing. &lt;a href=&quot; https://thepiratebay.se/torrent/5137070&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/5137070&lt;/a&gt; \n  Book 3: Cities of the Plain. &lt;a href=&quot; https://thepiratebay.se/torrent/5136089&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/5136089&lt;/a&gt; \n\n(This is the same recording pulished by HarperAudio in 2000)\nCover scan included.\n\nCheers, FerraBit\nFebruary 2009\n\nLinks:\nhttp://en.wikipedia.org/wiki/All_the_Pretty_Horses_(novel)\n_________________________________________\n\nFrom Wiki:\n  All the Pretty Horses is a novel by U.S. author Cormac McCarthy published in 1992. Its romanticism (in contrast to the bleakness of McCarthy's earlier work) brought the writer much public attention. The novel was a bestseller and won the U.S. National Book Award. It is also the first of McCarthy's &quot;Border Trilogy.&quot;\n\nAmazon Review\n  Part bildungsroman, part horse opera, part meditation on courage and loyalty, this beautifully crafted novel won the National Book Award in 1992. The plot is simple enough. John Grady Cole, a 16-year-old dispossessed Texan, crosses the Rio Grande into Mexico in 1949, accompanied by his pal Lacey Rawlins. The two precocious horsemen pick up a sidekick--a laughable but deadly marksman named Jimmy Blevins--encounter various adventures on their way south and finally arrive at a paradisiacal hacienda where Cole falls into an ill-fated romance. Readers familiar with McCarthy's Faulknerian prose will find the writing more restrained than in Suttree and Blood Meridian. Newcomers will be mesmerized by the tragic tale of John Grady Cole's coming of age. --This text refers to the Hardcover edition. \n\nFrom Publishers Weekly\n  This is a novel so exuberant in its prose, so offbeat in its setting and so mordant and profound in its deliberations that one searches in vain for comparisons in American literature. None of McCarthy's previous works, not even the award-winning The Orchard Keeper (1965) or the much-admired Blood Meridian (1985), quite prepares the reader for the singular achievement of this first installment in the projected Border Trilogy. John Grady Cole is a 16-year-old boy who leaves his Texas home when his grandfather dies. With his parents already split up and his mother working in theater out of town, there is no longer reason for him to stay. He and his friend Lacey Rawlins ride their horses south into Mexico; they are joined by another boy, the mysterious Jimmy Blevins, a 14-year-old sharpshooter. Although the year is 1948, the landscape--at some moments parched and unforgiving, at others verdant and gentled by rain--seems out of time, somewhere before history or after it. These likable boys affect the cowboy's taciturnity--they roll cigarettes and say what they mean--and yet amongst themselves are given to terse, comic exchanges about life and death. In McCarthy's unblinking imagination the boys suffer truly harrowing encounters with corrupt Mexican officials, enigmatic bandits and a desert weather that roils like an angry god. Though some readers may grow impatient with the wild prairie rhythms of McCarthy's language, others will find his voice completely transporting. In what is perhaps the book's most spectacular feat, horses and men are joined in a philosophical union made manifest in the muscular pulse of the prose and the brute dignity of the characters. &quot;What he loved in horses was what he loved in men, the blood and the heat of the blood that ran them,&quot; the narrator says of John Grady. As a bonus, Grady endures a tragic love affair with the daughter of a rich Spanish Hacendado , a romance, one hopes, to be resumed later in the trilogy.","torrent":{"xt":"urn:btih:7bba6dbe0b5102edcc1136be64cf3a2bd7c2383c","amp;dn":"ALL+THE+PRETTY+HORSES+-+Cormac+McCarthy.+Frank+Muller+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bba6dbe0b5102edcc1136be64cf3a2bd7c2383c","infoHashBuffer":{"type":"Buffer","data":[123,186,109,190,11,81,2,237,204,17,54,190,100,207,58,43,215,194,56,60]},"announce":[],"urlList":[]}}