{"title":"(For Kids) Mr. Tumble - Something Special (Pets)","uid":6302225,"size":1468530688,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7bd2bdcedd0e5b9d70f7ad6c9368de18380743ed&amp;dn=%28For+Kids%29+Mr.+Tumble+-+Something+Special+%28Pets%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"nightissuchproximity","files":1,"time":1302192119,"description":"Something Special is a programme on the cbeebies channel which is aimed at younger children. \n\nThe presenter of the programme Justin Fletcher, is a lively character who all the kids I know seem to love. He is bright, and bubbly, and bounces around whilst getting very excited and his excitement seems to rub off on them which I think is why the show works so well. \n\nJustin uses makaton sign language throughout the programme whilst teaching what a new thing is whether it be a shape, or colour, or everyday item, and encourages children to join in. Makaton is meant to be a helping hand for children who are in early stages of development, or with special needs to communicate. I can't say my daughter has ever really copied any of the signs but, think it would be useful for children who already use makaton. \n\nEach programme focuses on aspects of the children's world about them. Topics covered include pets, toys, weather, clothes, shops, food, all about me, where I live and colours. \n\nI often find myself singing songs from the show at work they are unbelievably catchy although this is a bit worrying and can be embarrassing who wants to hear a grown woman singing about how to make music or coming to her shop! \n\nMr Tumble (also played by Justin) is a character in the show who things never seem to go right for he is a clown I believe and acts silly and has a young girl speak as the grown up telling him where he is going wrong and what he should be doing. He is probably my daughter's favourite part of the show and she finds him hilarious and often shouts at the telly telling Mr Tumble not to be silly or tells me what he has just been doing in a &quot;guess what that silly man has done now&quot; sort of way. \n\nThe programme is a fun filled learning half and hour and we love it so much we bought one of the DVD's of the series this was quite expensive at Ã‚Â£18.99 but I think it is because its an educational DVD and my daughter loves it. \n\nSummary: Would recommend to anyone with young children\n\n","torrent":{"xt":"urn:btih:7bd2bdcedd0e5b9d70f7ad6c9368de18380743ed","amp;dn":"%28For+Kids%29+Mr.+Tumble+-+Something+Special+%28Pets%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bd2bdcedd0e5b9d70f7ad6c9368de18380743ed","infoHashBuffer":{"type":"Buffer","data":[123,210,189,206,221,14,91,157,112,247,173,108,147,104,222,24,56,7,67,237]},"announce":[],"urlList":[]}}