{"title":"Soubrettes Services: Claire et Cara A Votre Service / French Mai","uid":11794350,"size":2171756310,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7c24e9b526c5861457dec7578eb0e151e9184c3d&amp;dn=Soubrettes+Services%3A+Claire+et+Cara+A+Votre+Service+%2F+French+Mai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"H4ckuos","files":1,"time":1428072851,"description":"Soubrettes Services: Claire et Cara A Votre Service / French Maid Service: Claire and Cara At Your Service (Marc Dorcel) [DVD] -=NEW PRE-RELEASE 2015=-\n\nYear : 2015 \n\nCountry : France \n\nDirector : Herve Bodilis \n\nStudio : Marc Dorcel \n\nGenre : Feature, Anal, Oral, Big Boobs, Double Penetration, Threesome, Lesbian, Dildos Starring : Cara Saint-Germain, Chloe Lacourt, Claire Castel, Valentina Nappi , Yanick Shaft, Mike Angelo, James Brossman, Math \n\nDuration : 100 minutes \n\nDescription in French : Qu'il s'agisse du personnel masculin ou de ces trois sublimes soubrettes en uniforme, tout le monde a le devoir d'obeir aux moindres desirs de Madame et de son mari. Ici, c'est le service complet. Devotion, obeissance, perfectionnisme, mais aussi - et surtout - beaute, volupte, imagination, audace et perversion sans limite. Autant de criteres draconiens selon lesquels les employes sont choisis. D'ailleurs, l'assurance naturelle et l'appetit sexuel de la jeune Cara ont rapidement plu aux chatelains, ainsi qu'a Claire et Valentina, les deux autres soubrettes. Enfin, surtout a Claire ... Ce soir-la, Claire entraine Cara avec elle dans sa chambre. Elles sont suivies de pres par le majordome, mais il n'a pas le droit de participer. Il doit se contenter de regarder ces deux corps de deesses s'entrelacer, se caresser, se lecher et se donner mutuellement du plaisir a l'aide de volumineux sex toys. Excite et frustre a la fois, il a la bonne surprise de decouvrir le lendemain Cara en train de l'epier sous sa douche. La jeune soubrette se met a le sucer avec passion et gourmandise avant de s'offrir entierement a lui. Chaque recoin de la demeure recele son lot de frissons. Au garage, le vigoureux voiturier sodomise sauvagement sa patronne, et Claire jouira a plusieurs reprises au cours d'une spectaculaire et intense double penetration. Ici, les fantasmes ne connaissent aucune limite. \n\nEnglish Description : Everybody in this house, the male staff and these three gorgeous maids in uniform alike, has a duty to cater to Madame and her husband's every desire. Here a full service is offered! Devotion, obedience, perfectionism, but also - and above all - beauty, sensuality, imagination, boldness and limitless perversion. These are the many strict criteria by which employees are selected. The natural confidence and sexual appetite of young Cara immediately appealed to her wealthy employers in their stately home, as well as to Claire and Valentina, the two other maids. Well ... Especially Claire! Tonight, Claire invites Cara to her room. They are followed closely by the butler, but he is not allowed to join in. He can only watch the bodies of these two beauties intertwine, caress, lick and give each other pleasure with rather large sex toys. Horny and frustrated, the next day, the butler is happy to discover Cara spying on him in the shower. The young maid starts sucking his cock with passion and greed before offering herself entirely to him. Every corner of the house contains its share of excitement. In the garage, the virile valet brutally sodomizes Madame, and Claire comes several times during amazingly intense double penetration. Here, fantasies have no limits.\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551e8deaea2ed.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551e8deaea2ed.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.info/img-551e8de590699.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-551e8de590699.html&lt;/a&gt;","torrent":{"xt":"urn:btih:7c24e9b526c5861457dec7578eb0e151e9184c3d","amp;dn":"Soubrettes+Services%3A+Claire+et+Cara+A+Votre+Service+%2F+French+Mai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c24e9b526c5861457dec7578eb0e151e9184c3d","infoHashBuffer":{"type":"Buffer","data":[124,36,233,181,38,197,134,20,87,222,199,87,142,176,225,81,233,24,76,61]},"announce":[],"urlList":[]}}