{"title":"QuarkXPress v9.5.1","uid":8270517,"size":699050682,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c415aa720dbd487ed92b9a5dac1c3c02056bb14&amp;dn=QuarkXPress+v9.5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"NZupload","files":-1,"time":1363567813,"description":"Version: v9.5.1\nBit: 32bit\nLanguage: Multilingual (Russian present)\nMedicine: Disinfected\n\nSystem requirements:\nSoftware\n* Microsoft Windows XP (Service Pack 2 or 3), Windows Vista 1.0, or Windows 7/8 (32 and 64 Bit)\n* Microsoft. NET Framework 3.5 SP1\n* Tested on Citrix\nHardware\n* 2GB RAM (1GB minimum)\n* 1GB hard disk space\nOptional\n* An Internet connection for activation\n* DVD-ROM drive for installation from DVD (not required for installation from download)\n\nQuarkXPress - a powerful publishing system, with its intuitive interface and expanded set of tools for word processing, color management and graphic elements, and designing web-pages. QuarkXPress is widely used in books, newspaper and magazine publishing, advertising and marketing agencies, design firms and publishing houses.\nIn addition to tools for creating applications iPad-, QuarkXPress 9 offers export utility customers called ePub, which allows you to create a final product in the form of e-books. Among other things, the utility ePub support such popular platforms for distribution and viewing of electronic publications, as iBooks, Kindle and Nook. Additional support for e-books technology provides Reflow View, which controls the correct display layout on any device where you have to reformat the original layout. The package supports QuarkXPress 9 for the first time the utility Blio eReader eBook reader environments Windows, Android and iOS. Among the new features in general-purpose package QuarkXPress 9 worth noting, for example, the function of cloning items, new markers of normal and numbered lists, as well as &quot;conditional&quot; styles that automatically sverstyvayut page content against a set of defined rules. New leader now allow you to automatically move frames and groups of objects behind the text, and the function ImageGrid coder allows to quickly import or build a grid layout for graphics. A similar function for its intended purpose Linkster is designed to set or break ties for text frames and whole notes. Story Editor module allows you to handle the future in the full text of the material editor.\n\nFeatures:\nIntuitive interface\nBuilt-in Web and Flash authoring tools\nCreate amazing sformlennyh texts through its control over typography\nImport Adobe Illustrator files and support for Adobe Photoshop\nImproved tools for working with images, illustrations and text\nFully customizable control characters\nAdvanced baseline grids\nThe use of dictionaries and hyphenation\nSupport for over 30 languages\nAnd much more","torrent":{"xt":"urn:btih:7c415aa720dbd487ed92b9a5dac1c3c02056bb14","amp;dn":"QuarkXPress+v9.5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c415aa720dbd487ed92b9a5dac1c3c02056bb14","infoHashBuffer":{"type":"Buffer","data":[124,65,90,167,32,219,212,135,237,146,185,165,218,193,195,192,32,86,187,20]},"announce":[],"urlList":[]}}