{"title":"Soldaat Van Oranje 1977 (DVDR) [AVI]","uid":5527045,"size":1885905786,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7d1ab12d340e4fdc9c29a464a615b1c2b5312b75&amp;dn=Soldaat+Van+Oranje+1977+%28DVDR%29+%5BAVI%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pieterdb1","files":3,"time":1272808548,"description":"Regie: Paul Verhoeven \nCast: Rutger Hauer, Jeroen KrabbÃƒÂ©, Derek de Lint \nGenre: Nederlandstalig, Oorlog \nLengte: 167 minuten \n\n\nGrootse Nederlandse oorlogsfilm van Paul Verhoeven uit 1977 naar de biografie van verzetsheld Erik Hazelhoff Roelfzema, gespeeld door Rutger Hauer\n\nAls de Duitsers in 1940 Nederland binnenvallen, beseffen Erik Lanshof (Rutger Hauer) en Guus LeJeune (Jeroen KrabbÃƒÂ©) dat hun onbezorgde studententijd voorbij is en dat de oorlog nu ook hen aangaat. Al snel raken ze betrokken bij spionage- en verzetsactiviteiten tegen de Nazi's, terwijl hun omgeving steeds gevaarlijker wordt doordat niemand meer te vertrouwen is en zelfs vrienden en bekenden overlopen naar de vijand. Via een verzetsgroep die een geheime radioverbinding met Engeland onderhoudt, komt Erik uiteindelijk in Londen terecht, waar hij Koningin Wilhelmina ontmoet.\n\n'Soldaat van Oranje' van Paul Verhoeven was in 1977 de grootste en duurste Nederlandse speelfilm ooit en werd in binnen- en buitenland enthousiast ontvangen. De film is gebaseerd op het gelijknamige autobiografische boek van Erik Hazelhoff Roelfzema, die in de oorlog als echte Soldaat van Oranje inderdaad opklom van verzetsstrijder tot rechterhand van de Koningin. Rob Houwer tekende voor de productie en Verhoevens vaste scenarist Gerard Soeteman werkte mee aan het filmscript.\n\n","torrent":{"xt":"urn:btih:7d1ab12d340e4fdc9c29a464a615b1c2b5312b75","amp;dn":"Soldaat+Van+Oranje+1977+%28DVDR%29+%5BAVI%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d1ab12d340e4fdc9c29a464a615b1c2b5312b75","infoHashBuffer":{"type":"Buffer","data":[125,26,177,45,52,14,79,220,156,41,164,100,166,21,177,194,181,49,43,117]},"announce":[],"urlList":[]}}