{"title":"Boy And Bear - With Emperor Antarctica EP (2011)","uid":6308433,"size":38270253,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d6735a9bdd3b104168c797af7c39ab000738f6d&amp;dn=Boy+And+Bear+-+With+Emperor+Antarctica+EP+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"piratetorrent1989","files":-1,"time":1302441088,"description":"Boy &amp; Bear is a band from Sydney, Australia. The band describes its style as &quot;a combination of drivey indie folk and choral harmonies.&quot;\n\nFormed in 2009, Boy &amp; Bear was originally began as a solo project for Dave Hosking. Jake Tarasenko joined and then they expanded with Killian Gavin and Tim Hart, all members being singer / songwriters. All the members originally fronted their own groups, and became friends after sharing the stage on many occasions. They later expanded to a quintet with Jon Hart.\n\nThe band has received national airplay on NovaFM and Triple J and in October, 2009, the band was the 'feature artist' on radio Triple J's Unearthed program. The band signed with Universal and they have won Unearthed competition, giving them a spot at Homebake 2009, toured Australia with Angus and Julia Stone and Hungry Kids of Hungary. In 2010, they toured Britain with Laura Marling and Alessi's Ark, supported Mumford &amp; Sons in their Australian tour, and released their debut EP, With Emperor Antarctica. The EP peaked at #63 on the Australian ARIA Charts. In 2010 they were a part of a tribute album to Crowded House, where they recorded the song Fall At Your Feet. This later placed as number 5 in Triple J's Hottest 100 2010. Another one of their successful tracks Rabbit Song also placed as number 45 in this year's count.","torrent":{"xt":"urn:btih:7d6735a9bdd3b104168c797af7c39ab000738f6d","amp;dn":"Boy+And+Bear+-+With+Emperor+Antarctica+EP+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d6735a9bdd3b104168c797af7c39ab000738f6d","infoHashBuffer":{"type":"Buffer","data":[125,103,53,169,189,211,177,4,22,140,121,122,247,195,154,176,0,115,143,109]},"announce":[],"urlList":[]}}