{"title":"Excellence in Excel! Create a bookkeeping tools by doing","uid":11784263,"size":219437894,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d74ef281a9fe633b3b8fc24d2cc9b274c5182a9&amp;dn=Excellence+in+Excel%21+Create+a+bookkeeping+tools+by+doing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"mdusanjay","files":2,"time":1427691659,"description":"Excellence in Excel! Create a bookkeeping tools by doing\n\n1.5 hrs | English | .MP4 | yuv420p, 1280x720, 30.00 fps | aac, 44100 Hz, 2 ch | 209MB\nGenre: eLearning\n\nExcel can make your work more efficient. This Excel course shows you how to make practical use of the Excel formulas.\nExcel, create by Doing! Are you looking for a useful Excel course where you truly learn something practical and create a valuable tool? This course is for you!\nThis course will teach you how to use Excel functions and create a useful Bookkeeping tool. Many people learn Excel functions and all the possible options that you can do with Excel. The real thing is that you will probably not use 80% of the power of Excel.\nExcel is powerful but if you do not understand how to use it, your knowledge remains powerless. This course will show you how to use just a few functions and create in the meanwhile a very useful tool. This learning method is named CREATE BY DOING!\nIf you feel intimidated by Excel do not worry! The real issue is not Excel or You but by the method of learning it! Yes, the way you learn something can be successful or unsuccessful. This course uses the SPEED LEARNING methods of the learning cone. What is that? This is a method development make sure you truly remember 90% of everything you learn. How? Just by doing and following the exercises.\nThis course is active, and you have to do the exercises and follow along","torrent":{"xt":"urn:btih:7d74ef281a9fe633b3b8fc24d2cc9b274c5182a9","amp;dn":"Excellence+in+Excel%21+Create+a+bookkeeping+tools+by+doing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d74ef281a9fe633b3b8fc24d2cc9b274c5182a9","infoHashBuffer":{"type":"Buffer","data":[125,116,239,40,26,159,230,51,179,184,252,36,210,204,155,39,76,81,130,169]},"announce":[],"urlList":[]}}