{"title":"The History of Western Philosophy - Bertrand Russel [Qwerty80]","uid":7896290,"size":5192671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7d93b4f13115de5a5e5a88944529934deb013229&amp;dn=The+History+of+Western+Philosophy+-+Bertrand+Russel+%5BQwerty80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"KatQwerty","files":3,"time":1354849258,"description":"Since its first publication in 1945? Lord Russell's A History of Western Philosophy has been universally acclaimed as the outstanding one-volume work on the subject -- unparalleled in its comprehensiveness, its clarity, its erudition, its grace and wit. \n \nIn seventy-six chapters he traces philosophy from the rise of Greek civilization to the emergence of logical analysis in the twentieth century. Among the philosophers considered are: Pythagoras, Heraclitus, Parmenides, Empedocles, Anaxagoras, the Atomists, Protagoras, Socrates, Plato, Aristotle, the Cynics, the Sceptics, the Epicureans, the Stoics, Plotinus, Ambrose, Jerome, Augustine, Benedict, Gregory the Great, John the Scot, Aquinas, Duns Scotus, William of Occam, Machiavelli, Erasmus, More, Bacon, Hobbes, Descartes, Spinoza, Leibniz, Locke, Berkeley, Hume, Rousseau, Kant, Hegel, Schopenhauer, Nietzsche, the Utilitarians, Marx, Bergson, James, Dewey, and lastly the philosophers with whom Lord Russell himself is most closely associated -- Cantor, Frege, and Whitehead, co-author with Russell of the monumental Principia Mathematica.\n","torrent":{"xt":"urn:btih:7d93b4f13115de5a5e5a88944529934deb013229","amp;dn":"The+History+of+Western+Philosophy+-+Bertrand+Russel+%5BQwerty80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d93b4f13115de5a5e5a88944529934deb013229","infoHashBuffer":{"type":"Buffer","data":[125,147,180,241,49,21,222,90,94,90,136,148,69,41,147,77,235,1,50,41]},"announce":[],"urlList":[]}}