{"title":"Sims' Symptoms of the Mind, 5E Expert Consult [StormRG]","uid":11871965,"size":10898972,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e2f7cd00176fdf11514aa6d39efa7e5580c224a&amp;dn=Sims%27+Symptoms+of+the+Mind%2C+5E+Expert+Consult+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"0xmovva","files":2,"time":1430465590,"description":"TITLE/EDITION Sims' Symptoms in the Mind: Textbook of Descriptive Psychopathology 5e \nBy: Femi Oyebode\nPaperback: 400 pages\nPublisher: Saunders Ltd.; 5 edition (October 17, 2014)\nLanguage: English\nISBN-10: 0702055565\nISBN-13: 978-0702055560\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nSIMS' SYMPTOMS IN THE MIND has, since its first publication in 1988, become established as the leading introductory textbook on clinical psychopathology, defining, clarifying and describing the main symptoms and syndromes of mental illness seen in clinical practice. Now fully revised and updated, it offers essential reading for psychiatric trainees and an invaluable reference for psychiatrists of all grades. It has also come to be widely appreciated by clinical psychologists, allied mental health professionals and researchers in this field.\n\nComprehensive and accessible overview of clinical psychopathology not found anywhere else\nIllustrates key principles of psychopathology with examples drawn from a wide source, including fiction, autobiography and clinical textbooks\nFully updated throughout, taking account of advances in the understanding of cognitive neuroscience and neuropsychology, revised legislation, changing classificatory concepts and evolving cultural aspects of psychiatry\nImproved presentation, including new chapter and key point summaries, will help those searching for quick information without losing the rich writing style for which the book is so well known and appreciated\nNow comes with complementary access to the complete, downloadable eBook version, providing an enhanced learning experience and increased utility in practice. Additional, fully integrated electronic resources include:\nPatient interview scenarios exploring key themes (videos with transcripts)\nAuthor podcasts (audio) to expand and clarify core topics\nInteractive question and answer sections for each chapter, to test your understanding and aid revision of essential areas","torrent":{"xt":"urn:btih:7e2f7cd00176fdf11514aa6d39efa7e5580c224a","amp;dn":"Sims%27+Symptoms+of+the+Mind%2C+5E+Expert+Consult+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e2f7cd00176fdf11514aa6d39efa7e5580c224a","infoHashBuffer":{"type":"Buffer","data":[126,47,124,208,1,118,253,241,21,20,170,109,57,239,167,229,88,12,34,74]},"announce":[],"urlList":[]}}