{"title":"Lower Dens - Twin-Hand Movement (RE-SEED) @320","uid":5709432,"size":96583550,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7e837c8f321e3fdb8e3fad8f81f6a70bd6b6c431&amp;dn=Lower+Dens+-+Twin-Hand+Movement+%28RE-SEED%29+%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":11,"time":1279830925,"description":"Re-Seed\n\n&quot;Lower Dens is the new full-band project from Jana Hunter, who first emerged during the freak folk boom of the mid-aughts. Although Hunter released solo albums via Devendra Banhart's Gnomonsong label and toured with many of that scene's leading lights, her songs always seemed to inhabit a much darker world than many of her contemporaries, one rooted more in the spirit and tradition of southern blues than the Incredible String Band. Instead of being front and center, the &quot;freak&quot; was lurking somewhere below the surface -- a dark, unsettling presence, implied more in the lyrical narratives and blue-black, skeletal arrangements. Lower Dens moves forward with this conceit, taking that blueprint and adapting it for a more-or-less traditional &quot;rock&quot; band set-up. And while not much here would qualify as &quot;rock,&quot; there are some surprisingly spirited numbers folded into Hunter's traditionally mid-tempo brooders. &quot;Hospice Gates&quot; boasts a bpm and backbeat that the Ronettes would understand, and &quot;Holy Water&quot; sounds like it could have been peeled off some long-lost early-Clean demo, with its driving, sun-baked dreams of the pipeline. Some  might also sense a kinship with fellow Baltimore scene-vets, Beach House, what with the stately procession of some of the songs, not to mention the muttered, smoky incantations both women employ in their delivery could certainly justify such a comparison. More than anything though, this sounds like a sly reinvention/invigoration. The Beatles bought a sitar. Dylan painted his face. Mark Kozelek blew some comb-overs back by getting together a new band (Sun Kil Moon) and cranking out rock songs.&quot;\n\nBlue &amp; Silver \t\nTea Lights \t\nA Dog's Dick\t\nHoly Water \t\nI Get Nervous\t\nCompletely Golden\t\nPlastic &amp; Powder\t\nRosie\t\nTruss Me\t\nHospice Gates \t\nTwo Cocks","torrent":{"xt":"urn:btih:7e837c8f321e3fdb8e3fad8f81f6a70bd6b6c431","amp;dn":"Lower+Dens+-+Twin-Hand+Movement+%28RE-SEED%29+%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e837c8f321e3fdb8e3fad8f81f6a70bd6b6c431","infoHashBuffer":{"type":"Buffer","data":[126,131,124,143,50,30,63,219,142,63,173,143,129,246,167,11,214,182,196,49]},"announce":[],"urlList":[]}}