{"title":"John Sandford E-Book Collection","uid":8638315,"size":15221264,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ecf10b5e1aefc907583cfb25f2fbeab45eb5829&amp;dn=John+Sandford+E-Book+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":35,"time":1372812323,"description":"John Sandford is the pseudonym of John Roswell Camp, an American author and journalist. Camp won the Pulitzer Prize in journalism in 1986, and was one of four finalists for the prize in 1980. He also was the winner of the Distinguished Writing Award of the American Society of Newspaper Editors for 1985.\n\n From 1971 to 1978, Camp wrote for the Miami Herald. In 1978, he moved to Minneapolis and started writing for The Saint Paul Pioneer Press as a features reporter; in 1980, he became a daily columnist. In 1980, he was a finalist for a Pulitzer for a series of stories on Native American culture. In 1986, he won the Pulitzer for Non-Deadline Feature Writing for a series of stories collectively titled &quot;Life on the Land: An American Farm Family&quot;. The series, written during the Midwest farm crisis, followed a typical southwest Minnesota farm family through the course of a full year. In 1989, he stopped writing full-time for the Pioneer Press and stopped entirely the next year.\n\n In 1989, Camp wrote two novels that would each spawn a popular series. The Fool's Run (Kidd series) was published under his own name, but the publisher asked him to provide a pseudonym for Rules of Prey (Prey series) so it was published under the name &quot;John Sandford&quot;. After the Prey series proved to be more popular, with its charismatic protagonist Lucas Davenport, The Fool's Run and all of its subsequent sequels have been published under John Sandford.\n\n In 2007, Camp started a third series, featuring Virgil Flowers, who was a supporting character in some of the Prey novels, including Invisible Prey and Storm Prey.\n","torrent":{"xt":"urn:btih:7ecf10b5e1aefc907583cfb25f2fbeab45eb5829","amp;dn":"John+Sandford+E-Book+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ecf10b5e1aefc907583cfb25f2fbeab45eb5829","infoHashBuffer":{"type":"Buffer","data":[126,207,16,181,225,174,252,144,117,131,207,178,95,47,190,171,69,235,88,41]},"announce":[],"urlList":[]}}