{"title":"El Lobo DVDRip Spanish 2004","uid":5265572,"size":729880603,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7ed2c057933163910373c4e559e552c6fcfd4ea9&amp;dn=El+Lobo+DVDRip+Spanish+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Mois20","files":2,"time":1262875563,"description":"Historia de Mikel Lejarza, alias Lobo, el agente de los servicios secretos espaÃƒÂ±oles que consiguiÃƒÂ³ infiltrarse en ETA entre 1973 y 1975 y provocÃƒÂ³ la caÃƒÂ­da de una cuarta parte de la militancia etarra de la ÃƒÂ©poca, unos ciento cincuenta activistas y colaboradores, incluyendo a los miembros mÃƒÂ¡s destacados de sus comandos especiales y a la cÃƒÂºpula dirigente del momento. La infiltraciÃƒÂ³n de Lejarza, conocida como OperaciÃƒÂ³n Lobo, supuso un mazazo a la organizaciÃƒÂ³n en un momento en el que sus acciones se estaban convirtiendo en la excusa perfecta para que los sectores mÃƒÂ¡s involucionistas del rÃƒÂ©gimen de Franco se decidieran a tomar el poder y bloquear el futuro democrÃƒÂ¡tico que ansiaban los espaÃƒÂ±oles. La aventura del Lobo consiguiÃƒÂ³ frustrar el primer plan de fuga masiva de presos etarras de la cÃƒÂ¡rcel de Segovia y una sangrienta campaÃƒÂ±a de atentados indiscriminados, con los que ETA pretendÃƒÂ­a demostrar su fuerza en la agÃƒÂ³nica coyuntura del rÃƒÂ©gimen y provocar al EjÃƒÂ©rcito para asegurar su supervivencia a travÃƒÂ©s de su estrategia de AcciÃƒÂ³n-RepresiÃƒÂ³n-AcciÃƒÂ³n.\nLa operaciÃƒÂ³n constituyÃƒÂ³ el mayor ÃƒÂ©xito policial contra ETA hasta la fecha. Como consecuencia de su trabajo como infiltrado, la organizaciÃƒÂ³n condenÃƒÂ³ a muerte a Lejarza, empapelÃƒÂ³ el PaÃƒÂ­s Vasco de carteles con su fotografÃƒÂ­a bajo la leyenda &quot;Se busca&quot;, el Lobo se vio obligado a cambiar de identidad y de rostro, y a desaparecer sin dejar rastro. La historia del Lobo es la de un hombre utilizado y destrozado por los servicios secretos de la dictadura que intentaron eliminarle en mitad de la operaciÃƒÂ³n y que tuvo el coraje de salvarse por sus propios medios y continuar con su misiÃƒÂ³n. Su huella fue tan profunda que en la actualidad los comandos que parten hacia EspaÃƒÂ±a para realizar atentados aÃƒÂºn reciben una bala de reserva para matar al Lobo.  ","torrent":{"xt":"urn:btih:7ed2c057933163910373c4e559e552c6fcfd4ea9","amp;dn":"El+Lobo+DVDRip+Spanish+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ed2c057933163910373c4e559e552c6fcfd4ea9","infoHashBuffer":{"type":"Buffer","data":[126,210,192,87,147,49,99,145,3,115,196,229,89,229,82,198,252,253,78,169]},"announce":[],"urlList":[]}}