{"title":"Jodhaa-Akbar (2008) - BD.Rip - 1080p - HEVC - x265.DTSHD.DDR","uid":14860309,"size":10736108709,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7f459cfbc5ffabfe08290f9ae32ec4a749090b8d&amp;dn=Jodhaa-Akbar+%282008%29+-+BD.Rip+-+1080p+-+HEVC+-+x265.DTSHD.DDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":6,"uploader":"SaM","files":2,"time":1465510984,"description":"Presenting a DDR Anniversary Upload\r\n\r\n\r\nJodhaa - Akbar (2008)\r\n(A film by Ashutosh Gowariker)\r\n\r\nHindi - BD.Rip (BODEGA) - 1080p - 1920x816 (2.35:1)- 10.0 GB - x.265.DTSHD (7.1 Ch).Esubs - 3 Hrs:34 Min\r\n\r\nA HIGH EFFICIENCY VIDEO ENCODING (HEVC)RIP\r\n \nhttp://extraimago.com/image/aBLV \nhttp://extraimago.com/image/aBL6 \nhttp://extraimago.com/image/aBLx \nhttp://extraimago.com/image/aBLt \nhttp://extraimago.com/image/aBLo \nhttp://extraimago.com/image/aBLk \nhttp://extraimago.com/image/aBLH \nhttp://extraimago.com/image/aBLF \nhttp://extraimago.com/image/aBLD \nhttp://extraimago.com/image/aBL5 \nhttp://extraimago.com/image/aBLg \nhttp://extraimago.com/image/aBLX \nhttp://extraimago.com/image/aBLP \nhttp://extraimago.com/image/aBLG \nhttp://extraimago.com/image/aBLr \nhttp://extraimago.com/image/aBLp \nhttp://extraimago.com/image/aBLY\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/aBRz\r\n\r\nSynopsis:\r\nA historical drama about a Rajput princess forced to marry a Mughal prince so as bring about lasting peace. She is a spirited woman who resents being used as a pawn in the political game and he is a patient man, who wins her over slowly. There are misunderstandings of course, but ultimately love prevails. The story is also a passionate call for communal harmony.\r\n\r\n\r\nComments:\r\nIts difficult to vouch for the historical accuracy of this film. Certainly the stories have been dramatised for maximum impact and seem a little less than believable. But if you don't go by history, it is a film historical romance that you will love. The scale of this film is immense and ashutosh Gowariker can legitimitaely cliam to be the Cecil B De Mille of Indian cinema. In a way, it is a film worthy of emulation if only to bring India's past home to the world.\r\n\r\nThe sheer craftsmanship is outstanding. The expansive camera work, the use of colour as I have rarely seen in an Indian film, the grand and spectacular music - everything contributes to making this film a grand spectacle. If the characters are a bit stereotyped, it can perhaps be forgiven. Its a romance after all! The spectacle is aided by some very competent acting by Hritwik Roshan and a shade less by Aishwarya Rai Bachhan. Rahman's music has won universal praise and technically, this is one of the better films made in India.\r\n\r\nThen there is the passionate message of communal unity and harmony that permeates through the film without ever becoming in your face until the last.\r\n\r\nIf I must criticise, it will be on the length of the film. Three and a half hours is quite a strain, even for a film as well made as this.\r\n\r\nUploader's Notes:\r\n\r\nThis is a BD authored by BODEGA and it needed very gentle handling. The colours were near perfect and except for an imperceptible decrease in the overall yellow tint (and we have been faithful to the big screen picture), we have left the colours alone. There has been a careful enhancement of detail - never allowing excessive sharpening or distortion. The original DTS-HD sound with full 7.1 Channels has been preserved for your listening pleasure.\r\n\r\nPlease do check out the sample which is from the exact centre of the film. Also the thumbnails may take a second or two to download - so if you see a slightly blurred image, wait a few moments and the image will come to you in full glory.\r\n\r\nWe bring you this rip in celebration of the 8th anniversary of DDR bringing you the best of Indian Cinema.\r\n\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt0449994/","torrent":{"xt":"urn:btih:7f459cfbc5ffabfe08290f9ae32ec4a749090b8d","amp;dn":"Jodhaa-Akbar+%282008%29+-+BD.Rip+-+1080p+-+HEVC+-+x265.DTSHD.DDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f459cfbc5ffabfe08290f9ae32ec4a749090b8d","infoHashBuffer":{"type":"Buffer","data":[127,69,156,251,197,255,171,254,8,41,15,154,227,46,196,167,73,9,11,141]},"announce":[],"urlList":[]}}