{"title":"Do you speak American? - Three 1-Hour English Learning Episodes","uid":6285105,"size":1784446622,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:808f535f257950e00f5030a7bd1b8249cd3de7e8&amp;dn=Do+you+speak+American%3F+-+Three+1-Hour+English+Learning+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Kentux","files":12,"time":1301583158,"description":"Is American English in decline? Are regional dialects dying out? Is there a difference between men and women in how they adapt to linguistic variations?\nThese questions, and more, about our language catapulted Robert MacNeil and William Cran - the authors (with Robert McCrum) of the language classic \nThe Story of English - across the country in search of the answers. Do You Speak American? is the tale of their discoveries, which provocatively show \nhow the standard for American English - if a standard exists - is changing quickly and dramatically.\nOn a journey that takes them from the Northeast, through Appalachia and the Deep South, and west to California, the authors observe everyday \nverbal interactions and in a host of interviews with native speakers glean the linguistic quirks and traditions characteristic of each area. \nWhile examining the histories and controversies surrounding both written and spoken American English, they address anxieties and assumptions that, \nwhen explored, are highly emotional, such as the growing influence of Spanish as a threat to American English and the special treatment of African \nAmerican vernacular English. And, challenging the purists who think grammatical standards are in serious deterioration and that media saturation of our \nculture is homogenizing our speech, they surprise us with unpredictable responses.\n\nDo you speak American?\nEnglish | XviD 1132kbps | 720x408 29.97fps | MP3 128kbps | 1.66 GB\nGenre: Documentary / Learning","torrent":{"xt":"urn:btih:808f535f257950e00f5030a7bd1b8249cd3de7e8","amp;dn":"Do+you+speak+American%3F+-+Three+1-Hour+English+Learning+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"808f535f257950e00f5030a7bd1b8249cd3de7e8","infoHashBuffer":{"type":"Buffer","data":[128,143,83,95,37,121,80,224,15,80,48,167,189,27,130,73,205,61,231,232]},"announce":[],"urlList":[]}}