{"title":"The New Mammoth Book of Pulp Fiction","uid":10639858,"size":1560702,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:810c241c9ffec6ef82b8f2bfc15c135b786b7478&amp;dn=The+New+Mammoth+Book+of+Pulp+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1406437435,"description":"All the suspense, shocks, kicks, and titilation of yesterday's pulp magazines returns with a vengeance in these pages. Action-packed stories featuring hit men, underworld bosses, rogue cops, private dicks, and shady ladies are assembled here, written by such renegade authors as Raymond Chandler, Dashiell Hammett, Ed McBain, Jim Thompson, James Ellroy, Robert Bellum, and Ed Gorman.\n\nFiction has been looked down on as a guilty pleasure, but it offers the perfect form of entertainment: the very best storytelling filled with action, surprises, sound and fury. In short, all the exhiliration of a roller-coaster ride. \n\nThe 1920s in America saw the proliferation of hundreds of dubiously named but thrillingly entertaining pulp magazines in America - Black Mask, Amazing, Astounding, Spicy Stories, Ace-High, Detective Magazine, Dare-Devil Aces. It was in these luridly-coloured publications, printed on the cheapest pulp paper, that the first gems began to appear. \nThe one golden rule for writers of pulp fiction was to adhere to the art of storytelling. Each story had to have a beginning, an end, economically-etched characters, but plenty going on, both in terms of action and emotions. Pulp magazines were the TV of their day, plucking readers from drab lives and planting them firmly in thrilling make-believe, successors to the Victorian penny dreadfuls of writers such as Sir Arthur Conan Doyle and Charles Dickens. These stories exemplify the best of crime and mystery pulp fiction - its zest, speed, rhythm, verve and commitment to straightforward storytelling - spanning seven decades of popular writing.","torrent":{"xt":"urn:btih:810c241c9ffec6ef82b8f2bfc15c135b786b7478","amp;dn":"The+New+Mammoth+Book+of+Pulp+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"810c241c9ffec6ef82b8f2bfc15c135b786b7478","infoHashBuffer":{"type":"Buffer","data":[129,12,36,28,159,254,198,239,130,184,242,191,193,92,19,91,120,107,116,120]},"announce":[],"urlList":[]}}