{"title":"Tim Ferriss: How to feel like the Incredible Hulk","uid":4852375,"size":56456424,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:811ba9c217a6d1e13d69a25ae09f78eb1f3d1638&amp;dn=Tim+Ferriss%3A+How+to+feel+like+the+Incredible+Hulk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"the_Phyrexian","files":-1,"time":1239920925,"description":"Tim Ferriss How to feel like the Incredible Hulk\n\nFrom the EG conference: Productivity guru Tim Ferriss' fun, encouraging anecdotes show how one simple question -- &quot;What's the worst that could happen?&quot; -- is all you need to learn to do anything.\n\nTim Ferris brings an analytical, yet accessible, approach to the challenges of self-improvement and career advancement through what he calls &quot;lifestyle design.&quot; His 2007 book, The 4-Hour Workweek, and his lectures on productivity are stuffed with moving, encouraging anecdotes -- often from his own life -- that show how simple decisions, made despite fears or hesitation, can make for a drastically more meaningful day-to-day experience at work, or in life.\n\nWord-of-blog chatter in Silicon Valley may have propelled his book to bestselling success, but Ferriss himself takes a fervid stance against the distractions of technologies like email and PDAs, which promote unnecessary multitasking.\n\nFollowing the success of his book, Ferriss has become a full-time angel investor.\n\n    &quot;[Ferriss] has become a pet guru of Silicon Valley, precisely by preaching apostasy in the land of shiny gadgets: just pull the plug. Crawl out from beneath the reams of data. Stand firm against the torrent of information.&quot;\n\nThe New York Times","torrent":{"xt":"urn:btih:811ba9c217a6d1e13d69a25ae09f78eb1f3d1638","amp;dn":"Tim+Ferriss%3A+How+to+feel+like+the+Incredible+Hulk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"811ba9c217a6d1e13d69a25ae09f78eb1f3d1638","infoHashBuffer":{"type":"Buffer","data":[129,27,169,194,23,166,209,225,61,105,162,90,224,159,120,235,31,61,22,56]},"announce":[],"urlList":[]}}