{"title":"The Little Manual of Meditation (gnv64)","uid":6945696,"size":11015915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:818550067367edffbeb0075760800a85397c5d7b&amp;dn=The+Little+Manual+of+Meditation+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gnv65","files":-1,"time":1326218432,"description":"The Little Manual of Meditation: 15 Effective Ways to Discover Your Inner Self\nBy Vikas Malkani\nUnicorn Books | 2008 | ISBN: 978-81-7806-142-9 | PDF | 144 pages | 10.5 mb\nAmazon Link : http://www.amazon.com/Little-Manual-Meditation-Effective-Discover/dp/1846941644\nscanned to PDF by me\n\nWant to know about the benefits of meditation?\nThis little manual tells you about an ancient practice that has been used by people who seek a life of peace and purpose. It is special because the author, a best-selling writer of over 24 books, is an Internationally renowned master of meditation. This book empowers you to make positive and powerful changes in your life through meditation and shows you how to realise your highest potential. It is the greatest gift you can give to yourself.\n\nAbout the Author\nVikas Malkani is a metaphysical teacher who comes from a corporate business background. His forte is to make the ancient wisdom of the spiritual masters simple to understand and easy to apply in our daily lives. Vikas Malkani has been called many things over the years: Spiritual Guru, Zen Master; Motivator, Mystic, Rich Monk, Soul Coach and Reiki Master, to name a few. Born and brought up in a business family in India, he was the head of a large business enterprise when his life underwent an inner transformation at the age of 29.He is the founder of SoulCentre (in India and Singapore). He leads life-transforming workshops on spirituality, leadership, the creation of success and love and relationships that have touched the lives of thousands worldwide.He shares a message of manifesting holistic success; an abundance that is apparent by our external material wealth as well as our inner spiritual wisdom. He is the founder of the SoulKids program for confident and creative children, and is the author of &quot;The Yoga of Wealth&quot;, &quot;The Yoga of Love&quot;, &quot;The Little Treasure Books Collection on Life, Happiness, Success and Leadership&quot;, and &quot;Tantra Demystified&quot;. Vikas' forte is to make ancient wisdom simple to understand and easy to apply to create a life of health, harmony and abundance on all levels. A gifted orator, he is a keynote speaker at many international conferences and summits. He appears on primetime every night on a national spiritual TV channel in India and has been a guest on numerous TV and radio shows worldwide.\n\nCONTENTS\nAuthor's Note 14 \n1. Pay Attention 1 7\n2. Look Within 23\n3. Make an Investment 31\n4. Improve Your Health 41\n5. Correct Your Posture 51\n6. Breathe Right 61\n7. Focus Your Mind 71\n8. Discover Yourself 77\n9. See the Reality 85\n10. Stop Worrying 93\n11. Turn Stress to Strength 101\n12. Heal Yourself 111\n13. Enjoy Life 123\n14. Reach Out 129\n15. Expand Your Consciousness 135 \nEffective Ways to Discover Your Inner Self 142 \nAbout the Author 144\n","torrent":{"xt":"urn:btih:818550067367edffbeb0075760800a85397c5d7b","amp;dn":"The+Little+Manual+of+Meditation+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818550067367edffbeb0075760800a85397c5d7b","infoHashBuffer":{"type":"Buffer","data":[129,133,80,6,115,103,237,255,190,176,7,87,96,128,10,133,57,124,93,123]},"announce":[],"urlList":[]}}