{"title":"Niall Ferguson - The Ascent of Money [2008] Unab. 96 kbps","uid":11231242,"size":501284566,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:82e8d6d3340154b0402b0b8ad4da1949da6653f3&amp;dn=Niall+Ferguson+-+The+Ascent+of+Money+%5B2008%5D+Unab.+96+kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"rambam1776","files":-1,"time":1413537792,"description":"Niall Ferguson - The Ascent of Money: A Financial History of the World [Unabridged]\n\n96 kbps, Unabridged, Read by Simon Prebble\n &lt;a href=&quot;\nhttp://bayimg.com/HacDOaagb&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/HacDOaagb&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.barnesandnoble.com/w/ascent-of-money-niall-ferguson/1100832994?ean=9781594201929&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.barnesandnoble.com/w/ascent-of-money-niall-ferguson/1100832994?ean=9781594201929&lt;/a&gt;\n\nFull BBC documentary here -  &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/11231239/Niall_Ferguson_-_The_Ascent_of_Money_[6_part_BBC_full_version]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/11231239/Niall_Ferguson_-_The_Ascent_of_Money_[6_part_BBC_full_version]&lt;/a&gt;\n\nOverview\n&quot;Bread, cash, dosh, dough, loot, lucre, moolah, readies, the wherewithal: Call it what you like, it matters. To Christians, love of it is the root of all evil. To generals, it's the sinews of war. To revolutionaries, it's the chains of labor. But in The Ascent of Money, Niall Ferguson shows that finance is in fact the foundation of human progress. What's more, he reveals financial history as the essential backstory behind all history.&quot; &quot;Through Ferguson's expert lens familiar historical landmarks appear in a new and sharper financial focus. Suddenly, the civilization of the Renaissance looks very different: a boom in the market for art and architecture made possible when Italian bankers adopted Arabic mathematics. The rise of the Dutch republic is reinterpreted as the triumph of the world's first modern bond market over insolvent Habsburg absolutism. And the origins of the French Revolution are traced back to a stock market bubble caused by a convicted Scot murderer.&quot; With the clarity and verve for which he is known, Ferguson elucidates key financial institutions and concepts by showing where they came from. What is money? What do banks do? What's the difference between a stock and a bond? Why buy insurance or real estate? And what exactly does a hedge fund do?\n\nLibrary Journal\nWith global financial markets experiencing severe turbulence, Harvard historian Ferguson (The Pity of War) presents a timely history of money and finance from the advent of coins to J.P Morgan Chase's takeover of Bear Stearns earlier this year. He describes humanity's major financial innovations such as banks, bonds, joint stock companies, insurance, and property ownership as well as the pitfalls of inflation, recessions, and asset bubbles. Ferguson finishes by discussing the various iterations of globalization over the past 100 years and one of the newest and currently most notorious financial developments: hedge funds. He keeps his story interesting with humor and unexpected twists such as how a fund to provide for the widows of Scottish clergymen laid the foundations for modern insurance theory. Commenting on the safety normally ascribed to investing in property, he observes ironically that the only real security entailed is for lenders who in the event of loan defaults can seize properties. Though not comprehensive in scope, Ferguson's lighthearted but thoughtful stroll through financial history is a welcome and recommended addition for public libraries and undergraduate collections.\n\nNiall Ferguson is the Laurence A. Tisch Professor of History at Harvard University and the bestselling author of Paper and Iron and The House of Rothschild","torrent":{"xt":"urn:btih:82e8d6d3340154b0402b0b8ad4da1949da6653f3","amp;dn":"Niall+Ferguson+-+The+Ascent+of+Money+%5B2008%5D+Unab.+96+kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82e8d6d3340154b0402b0b8ad4da1949da6653f3","infoHashBuffer":{"type":"Buffer","data":[130,232,214,211,52,1,84,176,64,43,11,138,212,218,25,73,218,102,83,243]},"announce":[],"urlList":[]}}