{"title":"Rocksmith 2014 500+ Custom DLC for STEAM on PC only","uid":9413893,"size":3463226390,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8397f87a1b3974db7bd0b3fc4ed21aeeea333c0c&amp;dn=Rocksmith+2014+500%2B+Custom+DLC+for+STEAM+on+PC+only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"jd2k5","files":-1,"time":1388384248,"description":"As the title above states this is a collection of over 600 custom songs for Rocksmith 2014 Steam version. All the appID's have been changed to use cherub rock appID. \n\nYOU MUST HAVE PURCHASED THE CHERUB ROCK SONG TO USE THESE CUSTOMS\nI REPEAT YOU MUST HAVE PURCHASES CHERUB ROCK BY SMASHING PUMPKINS FOR THIS TO WORK.\n\nJust like my other upload this has the same songs as before with over 100 more customs added to it. I have also removed the mac versions of the songs to trim this down a bit size wise. So if your looking for a Mac version sorry but this isn't the place for you. \n\nPackage includes as follows\n\nALL OFFICIALLY RELEASED CONTENT FOR ROCKSMITH RELEASED BY UBISOFT HAVE HAD THEIR APPID'S CHANGED TO CHERUB ROCK APPID up to and including the muse pack and golden bomber pack that were released the week before christmas.\nAll Rocksmith 2012 on disc included songs\nAll Rocksmith 2012 DLC\n\nOver 500 Custom DLC from Smithyanvil forums downloaded and tested by myself and all have the cherub rock appid. \n\nIncluded artists are to many to name here individually but they include\n\nMetallica\nLinkin Park\nBon Jovi\nMuse\nIron Maiden\nAC/DC\nSystem of a Down\nQueen\nand many many many more....\n\nDLL file that lets the customs actually work is included as well which also comes from smithyanvil forums.\n\nInstall instructions\n\n1. Unrar file\n2. Copy contents of folder to your root Steam Rocksmith 2014 installation (normally C:Program Files (x86)SteamSteamAppscommonRocksmith2014) \n3. Play like normal\n\nNo cracks or other files should be needed. Make sure you are running steam as administrator as for some reason this would not work for me if steam was not running in admin mode. \n\n\nDISCLAIMER\nI DO NOT KNOW IF THIS WILL AFFECT HOW THE GAME PLAYS THROUGH UPLAY AND STEAM BUT IT SEEMS TO BE WORKING PERFECTLY FOR ME SO WE SHALL SEE. IF YOU ARE WORRIED ABOUT BEING BANNED THEN DO NOT DOWNLOAD THIS PACKAGE. \n","torrent":{"xt":"urn:btih:8397f87a1b3974db7bd0b3fc4ed21aeeea333c0c","amp;dn":"Rocksmith+2014+500%2B+Custom+DLC+for+STEAM+on+PC+only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8397f87a1b3974db7bd0b3fc4ed21aeeea333c0c","infoHashBuffer":{"type":"Buffer","data":[131,151,248,122,27,57,116,219,123,208,179,252,78,210,26,238,234,51,60,12]},"announce":[],"urlList":[]}}