{"title":"Bernard Jaffe - Crucibles. The Story of Chemistry from Ancient A","uid":10476035,"size":14176329,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8402f6faab60d5c6a1e076d4af31ef7667a6932c&amp;dn=Bernard+Jaffe+-+Crucibles.+The+Story+of+Chemistry+from+Ancient+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1404335365,"description":"Description\nProduct Details\nBook Title: Crucibles: The Story of Chemistry from Ancient Alchemy to Nuclear Fission\t\nBook Author: Bernard Jaffe (Author)\nPaperback: 384 pages\nPublisher: Dover Publications; 4th edition (June 1, 1976)\nLanguage: English\nISBN-10: 0486233421\nISBN-13: 978-0486233420\n\n===================================================================================\nBook Description\nRelease date: June 1, 1976 | ISBN-10: 0486233421 | ISBN-13: 978-0486233420 | Edition: 4th\nThis book is a classic in the field of popular science. Standard reading since the 1930s, it is one of the few histories of chemistry to concentrate on the lives of the great chemists. Through these dramatic and human stories, it gives an authoritative and entertaining account of the great discoveries and advances in this scientific field. After many printings in three previous editions, this book has been newly revised by the author for this fourth edition.\nBeginning with Trevisan and his lifelong search for the &quot;philosopher's stone,&quot; the author narrates the lives and discoveries of such towering figures as Paracelsus and his chemical treatment of disease; Priestley looking for phlogiston and finding oxygen and carbon dioxide, Lavoisier creating a new language of chemistry; Dalton and his Atomic Theory; Avogadro and the idea of molecules, Mendeleeff arranging the table of elements under his Periodic Law; the Curies isolating radium; Thomson discovering the electron; Moseley and his Law of Atomic Numbers; Lawrence and the construction of the cyclotron; and more. Probably the most dramatic chapter in the book, the account of the development of nuclear fission, ends the story of chemistry at its most monumental achievement. A final chapter discusses some of the consequences of nuclear fission, the discovery of nuclear fusion, and the recent work with subatomic particles.\n\n===================================================================================\nAbout the Author\nBernard Jaffe is the author of many other science books and several science textbooks. Upon the original publication of this book, Mr. Jaffe received the Francis Bacon Award for the Humanizing of Knowledge. The American Chemical Society's History of Chemistry Division honored him in 1973 with its Dexter Award for &quot;distinguished achievement in the history of chemistry.&quot;\n===================================================================================","torrent":{"xt":"urn:btih:8402f6faab60d5c6a1e076d4af31ef7667a6932c","amp;dn":"Bernard+Jaffe+-+Crucibles.+The+Story+of+Chemistry+from+Ancient+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8402f6faab60d5c6a1e076d4af31ef7667a6932c","infoHashBuffer":{"type":"Buffer","data":[132,2,246,250,171,96,213,198,161,224,118,212,175,49,239,118,103,166,147,44]},"announce":[],"urlList":[]}}