{"title":"Android App Development Fundamentals I and II LiveLessons","uid":9853736,"size":4988647997,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:844dd58f054068db7d3f3434c107d0b04afedc3d&amp;dn=Android+App+Development+Fundamentals+I+and+II+LiveLessons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"stalker277","files":-1,"time":1396191815,"description":"Android App Development Fundamentals I and II LiveLessons (Video Training)\n\n21+ Hours of Video Instruction Android App Development Fundamentals I and II LiveLessons video uses the same App-Driven Approach that Paul Deitel pioneered in his successful iPhone App Development LiveLesson video. Viewers learn Android programming technologies in the context of 16 complete working Android apps. Each lesson presents one app and is structured as follows: Deitel describes the app's behavior and the technologies and the architecture used to build it. Then Deitel does a detailed walkthrough of the code. As part of the walkthrough, Deitel discuss the programming concepts involved, and demonstrates the functionality of the appropriate Android API. By the end of the LiveLesson, viewers will gain hands-on experience with a wide spectrum of essential Android APIs. Viewers will also learn how to use Eclipse and Android Development Tools (ADT) for Eclipse to successfully create, debug, and deploy Android apps. Table of Contents: Introduction Lesson1: Setting Up Your Development Environment Lesson 2: Test-Driving an Android App in an AVD Lesson 3: Welcome App Lesson 4: Tip Calculator App Lesson 5: Favorite Twitter Searches App Lesson 6: Flag Quiz Game App Lesson 7: Cannon Game App Lesson 8: SpotOn Game App Lesson 9: Doodlz App Lesson 10: Address Book app Lesson 11: Route Tracker app Lesson 12: Slideshow App Lesson 13: Enhanced Slideshow App Lesson 14: WeatherViewer App Lesson 15: Pizza Ordering App Lesson 16: Voice Recorder App Lesson 17: Address Book app Lesson 18: HTML5 Favorite Twitter Searches App LiveLessons Video Training series publishes hundreds of hands-on, expert-led video tutorials covering a wide selection of technology topics designed to teach you the skills you need to succeed. This professional and personal technology video series features world-leading author instructors published by your trusted technology brands: Addison-Wesley, Cisco Press, IBM Press, Pearson IT Certification, Prentice Hall, Sams, and Que. Topics include: IT Certification, Programming, Web Development, Mobile Development, Home &amp; Office Technologies, Business &amp; Management, and more.","torrent":{"xt":"urn:btih:844dd58f054068db7d3f3434c107d0b04afedc3d","amp;dn":"Android+App+Development+Fundamentals+I+and+II+LiveLessons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"844dd58f054068db7d3f3434c107d0b04afedc3d","infoHashBuffer":{"type":"Buffer","data":[132,77,213,143,5,64,104,219,125,63,52,52,193,7,208,176,74,254,220,61]},"announce":[],"urlList":[]}}