{"title":"Jeffrey Archer - To Cut a Long Story Short (Big Papi)","uid":9747097,"size":378632206,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:844f993060d25d916667df4b221983185d218203&amp;dn=Jeffrey+Archer+-+To+Cut+a+Long+Story+Short+%28Big+Papi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1394599515,"description":"Jeffrey Archer - To Cut a Long Story Short (Big Papi) Audio Book Unabridged\n\nSource: CD + Fresh Cover Art Scan\n\n\n\nTracks marked with * are based on true incidents.\n\n\n\nPlease note that there are special settings on the MP3 files in this collection:\n\n\nSkip Shuffle - If you have this audio book on your music player and shuffle songs none of these audio book tracks will play.\n\nRemember Position - If you hit the stop button when the track is resumed it play where it left off. \n\nAlbum Display - When viewing this audio book in your music player you will see one album with cover art with multiple discs inside. The view from the factory is typically one album for each disc and that makes for sloppy.\n\n\n- Big Papi\n\n\n\nAuthors: Jeffrey Archer, Bill Wallace\n\nThe key to a great short story is to never give away the...In To Cut a Long Story Short, New York Times bestselling author Jeffrey Archer delivers an enthralling new collection of short stories. Listeners will have a difficult time sorting fact from fiction as each story comes complete with intriguing characters, ingenious plotting and Archer's trademark surprise endings. From the cleverest of confidence tricks, to the quirks of the legal profession, to the intrigues of love at first sight, Archer keeps listeners guessing at what is truly as it seems to be and what is a hoax, what is real and what is a red herring. His mastery of character and suspense is apparent, each word is necessary and each ending will shock and surprise.To Cut a Long Story Short is Archer at the top of his form. It is stylish, witty, constantly entertaining, and will captivate listeners who will race through each story to find out how it ends.\n\nISBN13: 9780754005605\nISBN10: 0754005607","torrent":{"xt":"urn:btih:844f993060d25d916667df4b221983185d218203","amp;dn":"Jeffrey+Archer+-+To+Cut+a+Long+Story+Short+%28Big+Papi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"844f993060d25d916667df4b221983185d218203","infoHashBuffer":{"type":"Buffer","data":[132,79,153,48,96,210,93,145,102,103,223,75,34,25,131,24,93,33,130,3]},"announce":[],"urlList":[]}}