{"title":"Psycroptic - Psycroptic 2015 ak","uid":11733123,"size":101146512,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8518a15b3800f8565912d4f154de7d13ef5d69a8&amp;dn=Psycroptic+-+Psycroptic+2015+ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"analogkid6103","files":10,"time":1425463343,"description":"Psycroptic are an Australian technical death metal band formed in Hobart in 1999. Mainstay members are Dave Haley on drums, his brother Joe Haley on guitar, and Cameron Grant on bass guitar. Their lead vocalist, Jason Peppiatt, joined in 2004. In 2008 they signed to Nuclear Blast. As of February 2012, the band have released five studio albums. They have undertaken Australian national tours supporting international acts, Incantation, Decapitated, Origin and Misery Index. Psycroptic have also toured Europe with Nile and with Deicide\nimage\nPsycroptic were formed in Hobart in early 1999 by brothers Dave (drums) and Joe (guitar) Haley both were members of Disseminate,[1] which had recorded a demo in 1998 before disbanding. The Haleys were joined by Cameron Grant on bass and (ex-Magoria) and Matthew Chalk on vocals (ex-Hemlock),[1] who soon after became a drummer with established local death metal act M.S.I. The band's name, Psycroptic, was randomly devised by Chalk's friend and has no particular meaning.[1] With assistance from the Tasmanian Council of the Arts, the band recorded The Isle of Disenchantment in October 2000, initially as a demo, but they issued it as a studio album.[2] Shortly after it was released in January 2001 the band was invited to play shows in Melbourne. In late 2001 they featured at the annual Metal for the Brain festival in Canberra for the first time, later appearing in 2003 and 2005.\n\nThe band recorded its second album The Scepter of the Ancients in 2003 for release through United States label Unique Leader. They played their first full Australian tour in support of American death metal band Incantation. The Haley brothers also joined Sydney-based industrial death metal band The Amenta during this period and recorded the album Ocassus with that group. Dave Haley also recorded an EP called Atom and Time with Ruins, a Hobart black metal band formed by Alex Pope in 2000. He has been a member of this band since; Joe Haley has been the touring guitarist for Ruins since they undertook a national tour with Satyricon in 2006.[3]\nimage\n2004 was a breakthrough year for the band as they played a second Australian tour, this time with Deeds of Flesh and then headed to Europe for a wide-ranging tour with Swedish bands Dismember and Anata. However, Chalk was reluctant to tour so his friend Jason Peppiatt (ex-Born Headless) was recruited to sing vocals. On returning to Australia, Psycroptic played two legs of the Metal for the Brain in Canberra and Brisbane, and a final show in their hometown of Hobart. Following this, disharmony within the band saw Chalk leave Psycroptic, and Peppiatt replace him permanently.[4] Since his departure from Psycroptic, Chalk has continued to play drums with M.S.I. as well as a doom band called Space Raven and act in the vocal role in a number of other groups that includes Mephistopheles, playing bass in Born Headless and several other projects including the brief vocal position with Swedish band Spawn of Possession in 2009.\nPsycroptic 2015\nimage\n1. Echoes to Come 05:37\n2. Ending 04:01\n3. A Soul Once Lost 03:45\n4. Cold 04:35\n5. Setting the Skies Ablaze 03:31\n6. Ideals That Won't Surrender 03:44\n7. Sentence of Immortality 04:26\n8. The World Discarded 03:22 Show lyrics\n9. Endless Wandering 04:44\n37:45","torrent":{"xt":"urn:btih:8518a15b3800f8565912d4f154de7d13ef5d69a8","amp;dn":"Psycroptic+-+Psycroptic+2015+ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8518a15b3800f8565912d4f154de7d13ef5d69a8","infoHashBuffer":{"type":"Buffer","data":[133,24,161,91,56,0,248,86,89,18,212,241,84,222,125,19,239,93,105,168]},"announce":[],"urlList":[]}}