{"title":"Boardwalk Empire Season 1 &amp; Extras HDTV (The Making Of etc.)","uid":6015387,"size":7520319764,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:853d6637cb8f0d5f3ebff523e9898323adc07ff5&amp;dn=Boardwalk+Empire+Season+1+%26+Extras+HDTV+%28The+Making+Of+etc.%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":5,"uploader":"TSV","files":-1,"time":1291621122,"description":"TSV Productions\n\nBoardwalk Empire Season 1 complete HDTV + Behind The Scenes, The Making Of etc etc. All are in HD and in English.\n\nPlease seed for as long as possible. If the torrent it slow, make sure you are uploading to at least 25 Kb/s as you get priority once you have uploaded the previous piece.\n\nThank you and enjoy. \n\n\n\nBoardwalk Empire is an American television series created by Terence Winter and based on the novel Boardwalk Empire: The Birth, High Times and Corruption of Atlantic City by Nelson Johnson. The series premiered on HBO on September 19, 2010.\n\nAs of December 5, 2010 (2010 -12-05), 12 original episodes of Boardwalk Empire have aired, concluding the first season.\n\nBoardwalk Empire is a period drama focusing on Enoch &quot;Nucky&quot; Thompson (based on the historical Enoch L. Johnson), a political figure who rose to prominence and controlled Atlantic City, New Jersey during the Prohibition period of the 1920s and 1930s. Nucky interacts with several historical figures in both his personal and political life, including mobsters, politicians, government agents, and the common folk who looked up to him. The federal government also takes an interest in the bootlegging and other illegal activities in the area, sending agents to investigate possible mob connections but also looking at Nucky's expensive and lavish lifestyle for a county political figure.\n\nLike the historical Enoch L. Johnson, the Nucky of the television series is the second of three crime bosses who head the Republican machine and use racketeering and power politics to control Atlantic City. However, Terence Winter has stated, &quot;[Nelson Johnson's] book was really just a jumping-off point.&quot;\n\n","torrent":{"xt":"urn:btih:853d6637cb8f0d5f3ebff523e9898323adc07ff5","amp;dn":"Boardwalk+Empire+Season+1+%26+Extras+HDTV+%28The+Making+Of+etc.%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"853d6637cb8f0d5f3ebff523e9898323adc07ff5","infoHashBuffer":{"type":"Buffer","data":[133,61,102,55,203,143,13,95,62,191,245,35,233,137,131,35,173,192,127,245]},"announce":[],"urlList":[]}}