{"title":"Veggie Tales - Cartoons for Kids","uid":9825478,"size":17634803217,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8597c4cd034d3b3e9f9098bd4587af21e576b56f&amp;dn=Veggie+Tales+-+Cartoons+for+Kids&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":12,"uploader":"POtHS11","files":-1,"time":1395768090,"description":"Neo is a 10 year boy that was born in Israel and now resides on The Island of Kauai in Hawaii.\nNeo will be a superstar some day. I entered Neo in Vubes music video contest. Neo can win a few\nbucks with some votes from you guys.\n\nVote for Little NEO here: &lt;a href=&quot; http://vube.com/contest?t=s&amp;floatee=JesiFwtoWk&amp;channel=Havaiia%20Family%20Band&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://vube.com/contest?t=s&amp;floatee=JesiFwtoWk&amp;channel=Havaiia%20Family%20Band&lt;/a&gt;\n\nHere is his Families page as they are a musical family with 7 children. They are a Fantastic 9 piece Band -- The Havaiia Family Band. &lt;a href=&quot;\nhttp://vube.com/Havaiia+Family+Band?t=s&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://vube.com/Havaiia+Family+Band?t=s&lt;/a&gt;\n\n\n\nVeggie Tales - Cartoons for Kids\n\n\nLet your kids watch these cartoons and turn off Their TV's\n\nVeggieTales is an American series of children's computer animated films featuring anthropomorphic vegetables in stories conveying moral themes based on Christianity. They frequently retell Biblical stories, sometimes anachronistically reframed, and include humorous references to pop culture. The series was developed by Big Idea Entertainment and is owned by DreamWorks through its subsidiary, Classic Media.[1]\n\nVeggieTales was created by Phil Vischer and Mike Nawrocki, who also provide many of the voices. Originally released in direct-to-video format, the series debuted on December 21, 1993. From September 9, 2006 to September 7, 2009, VeggieTales appeared on NBC as part of the qubo Saturday morning children's programming block. On November 3, 2012 the show began running on the Trinity Broadcasting Network (TBN)[2] as well as its children's network Smile of a Child,[3] where it currently continues to air (in a repackaged and edited format).\n\nIn 2009, Netflix made many VeggieTales videos (in their uncut, original formats) and feature films available via their video streaming service. On March 14, 2014, Netflix announced that production is starting on a new Dreamworks-licensed VeggieTales television show entitled VeggieTales In The House.[4] Big Idea has also published VeggieTales books and music CDs and branded items such as toys, clothing, and garden seeds for vegetables and flowers.\n\nVeggieTales was created by Phil Vischer and Mike Nawrocki through their company Big Idea Productions. Their aim was to produce children's videos which conveyed Christian moral themes and taught Biblical values and lessons. The animated feature involved stories told by a group of recurring vegetable characters who lived on a kitchen countertop. The program was offered in the direct-to-video market, with the first 30-minute program, Where's God When I'm S-Scared?, released in July 1993. In all, Big Idea has released 45 VeggieTales episodes including three Silly Song collections, 5 holiday specials, 4 LarryBoy episodes and a drawing tutorial. In addition to these episodes, there are 13 compilations that combine previously released material, and two feature length movies, Jonah: A VeggieTales Movie and The Pirates Who Don't Do Anything: A VeggieTales Movie. Beginning in 2006, the VeggieTales videos were adapted as a regular television program through the Qubo multi-platform network and NBC network. On September 30, 2008, Big Idea said that Mike Nawrocki would create an &quot;original new VeggieTales TV series,&quot; though no further news has been revealed.[5]\n\nThe idea for VeggieTales came in the early 90's when Phil Vischer was testing out animation software as a medium for children's videos.[6] Due to the limitations of the software available to him, he chose to avoid the technical production hurdle of creating characters with arms, legs, or hair. His first animation model on the software was an anthropomorphic candy bar, but after his wife suggested that parents might not want to show their children videos with a candy hero, he instead chose to use fruits and vegetables, their polar opposite.","torrent":{"xt":"urn:btih:8597c4cd034d3b3e9f9098bd4587af21e576b56f","amp;dn":"Veggie+Tales+-+Cartoons+for+Kids","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8597c4cd034d3b3e9f9098bd4587af21e576b56f","infoHashBuffer":{"type":"Buffer","data":[133,151,196,205,3,77,59,62,159,144,152,189,69,135,175,33,229,118,181,111]},"announce":[],"urlList":[]}}