{"title":"Diana Krall - 2004 - The Girl In The Other Room (24 88 SACD) FLA","uid":8632580,"size":1157552334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:85a673b6007345e0c241a3975ea48e6e5843db1d&amp;dn=Diana+Krall+-+2004+-+The+Girl+In+The+Other+Room+%2824+88+SACD%29+FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"eika256","files":-1,"time":1372669262,"description":"Diana Krall - 2004 - The Girl In The Other Room\n24 bit 88 KHz SACD rip\n\nWhile the jazz fascists (read: purists) may be screaming &quot;sellout&quot; because Diana Krall decided to record something other than standards this time out, the rest of us can enjoy the considerable fruit of her labors. The Girl in the Other Room is, without question, a jazz record in the same manner her other outings are. The fact that it isn't made up of musty and dusty &quot;classics&quot; may irk the narrow-minded and reactionary, but it doesn't change the fact that this bold recording is a jazz record made with care, creativity, and a wonderfully intimate aesthetic fueling its 12 songs. Produced by Tommy LiPuma and Krall, the non-original material ranges from the Mississippi-fueled jazzed-up blues of Mose Allison's &quot;Stop This World&quot; to contemporary songs that are reinvented in Krall's image by Tom Waits (&quot;Temptation&quot;), Joni Mitchell (&quot;Black Crow&quot;), Chris Smither (&quot;Love Me Like a Man&quot;), and her husband, Elvis Costello (&quot;Almost Blue&quot;). These covers are striking. Krall's read of Allison's tune rivals his and adds an entirely different shade of meaning, as does her swinging, jazzy, R&amp;B-infused take on Smither's sexy nugget via its first hitmaker, Bonnie Raitt. Her interpretation of Waits' &quot;Temptation&quot; is far more sultry than Holly Cole's because Krall understands this pop song to be a jazz tune rather than a jazzy pop song. &quot;Black Crow&quot; exists in its own space in the terrain of the album, because Krall understands that jazz is not mere articulation but interpretation. Likewise, her reverent version of Costello's &quot;Almost Blue&quot; takes it out of its original countrypolitan setting and brings it back to the blues.\nAs wonderful as these songs are, however, they serve a utilitarian purpose; they act as bridges to the startling, emotionally charged poetics in the material Krall has composed with Costello. Totaling half the album, this material is full of grief, darkness, and a tentative re-emergence from the shadows. It begins in the noir-ish melancholy of the title track, kissed with bittersweet agony by Gershwin's &quot;Summertime.&quot; The grain in Krall's pained voice relates an edgy third-person tale that is harrowing in its lack of revelation and in the way it confounds the listener; it features John Clayton on bass and Jeff Hamilton on drums. In &quot;I've Changed My Address,&quot; Krall evokes the voices of ghosts such as Louis Armstrong and Anita O'Day in a sturdy hip vernacular that channels the early beat jazz of Waits and Allison. The lyric is solid and wonderfully evocative not only of time and place, but of emotional terrain. Krall's solo in the tune is stunning. &quot;Narrow Daylight,&quot; graced by gospel overtones, is a tentative step into hope with its opening line: &quot;Narrow daylight enters the room, winter is over, summer is near.&quot; This glimmer of hope is short-lived, however, as &quot;Abandoned Masquerade&quot; reveals the shattered promise in the aftermath of dying love. &quot;I'm Coming Through&quot; and &quot;Departure Bay,&quot; which close the set, are both underscored by the grief experienced at the loss of Krall's mother. They are far from sentimental, nor are they sophomoric, but through the eloquence of Krall's wonderfully sophisticated melodic architecture and rhythmic parlance they express the experience of longing, of death, and of acceptance. The former features a beautiful solo by guitarist Anthony Wilson and the latter, in its starkness, offers memory as reflection and instruction. This is a bold new direction by an artist who expresses great willingness to get dirt on her hands and to offer its traces and smudges as part and parcel of her own part in extending the jazz tradition, through confessional language and a wonderfully inventive application that is caressed by, not saturated in, elegant pop. (AllMusic)\n\nTrack list:\n01 - Stop This World\n02 - The Girl In The Other Room\n03 - Temptation\n04 - Almost Blue\n05 - I've Changed My Address\n06 - Love Me Like A Man\n07 - I'm Pulling Through\n08 - Black Crow\n09 - Narrow Daylight\n10 - Abandoned Masquerade\n11 - I'm Coming Through\n12 - Departure Bay\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:85a673b6007345e0c241a3975ea48e6e5843db1d","amp;dn":"Diana+Krall+-+2004+-+The+Girl+In+The+Other+Room+%2824+88+SACD%29+FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a673b6007345e0c241a3975ea48e6e5843db1d","infoHashBuffer":{"type":"Buffer","data":[133,166,115,182,0,115,69,224,194,65,163,151,94,164,142,110,88,67,219,29]},"announce":[],"urlList":[]}}