{"title":"Chemistry, A volatile history BBC 3 part series","uid":5336308,"size":2202267648,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:86055eeaadc3fce1656e55e8d53fd2a0bcb32bb8&amp;dn=Chemistry%2C+A+volatile+history+BBC+3+part+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":5,"uploader":"Pharos2001","files":3,"time":1265328510,"description":"Series in which Jim Al-Khalili traces the story of how the elements, the building blocks that make up our entire world, were discovered and mapped\n\n1. Discovering the Elements\nThe explosive story of chemistry is the story of the building blocks that make up our entire world - the elements. From fiery phosphorous to the pure untarnished lustre of gold and the dazzle of violent, violet potassium, everything is made of elements - the earth we walk on, the air we breathe, even us. Yet for centuries this world was largely unknown, and completely misunderstood.\n\nIn this three-part series, professor of theoretical physics Jim Al-Khalili traces the extraordinary story of how the elements were discovered and mapped. He follows in the footsteps of the pioneers who cracked their secrets and created a new science, propelling us into the modern age.\n\nJust 92 elements made up the world, but the belief that were only four - earth, fire, air and water - persisted until the 19th Century. Professor Al-Khalili retraces the footsteps of the alchemists who first began to question the notion of the elements in their search for the secret of everlasting life.\n\nHe reveals the red herrings and rivalries which dogged scientific progress, and explores how new approaches to splitting matter brought us both remarkable elements and the new science of chemistry.\n\n2. The Order of the Elements\nIn part two, Professor Al-Khalili looks at the 19th century chemists who struggled to impose an order on the apparently random world of the elements. From working out how many there were to discovering their unique relationships with each other, the early scientists' bid to decode the hidden order of the elements was driven by false starts and bitter disputes. But ultimately the quest would lead to one of chemistry's most beautiful intellectual creations - the periodic table.\n\n3. The Power of the Elements\nIn the final part, Professor Al-Khalili uncovers tales of success and heartache in the story of chemists' battle to control and combine the elements, and build our modern world. He reveals the dramatic breakthroughs which harnessed their might to release almost unimaginable power, and he journeys to the centre of modern day alchemy, where scientists are attempting to command the extreme forces of nature and create brand new elements.\n\nDuration: approx 60min per episode\nA/R (WxH): 1:1.78 (720x400)\nVCodec: XviD (2 pass)\nACodec: AC3 2ch 192Kbps\n\nFlawless encoding\nPls. help seed to keep torrent alive.\n","torrent":{"xt":"urn:btih:86055eeaadc3fce1656e55e8d53fd2a0bcb32bb8","amp;dn":"Chemistry%2C+A+volatile+history+BBC+3+part+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86055eeaadc3fce1656e55e8d53fd2a0bcb32bb8","infoHashBuffer":{"type":"Buffer","data":[134,5,94,234,173,195,252,225,101,110,85,232,213,63,210,160,188,179,43,184]},"announce":[],"urlList":[]}}