{"title":"Clips4sale - Mandy Flores - Bonding with Step Mom HD 720p","uid":15208392,"size":1319393936,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:861e8656abe1a63909261c704a961d615396d486&amp;dn=Clips4sale+-+Mandy+Flores+-+Bonding+with+Step+Mom+HD+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ElitePorn","files":1,"time":1467647285,"description":"Clips4sale - Mandy Flores - Bonding with Step Mom HD 720p\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nYou have only been my stepmom for a little while. You are much younger than my father. You tend to walk around the house in skimpy clothing asthat's what you're comfortable wearing. You don't realize how that impacts me, you're young teemage stepson. My father loves seeing you do that so there's no pressure for you not to. When it comes to me, you feel we've never bonded. Trying to replace someone's mother can be difficult and you've discussed this with my dad. When it comes to my birthday, my dad gives you his credit card and tells you that you can get whatever you want for a present, no limits. Not knowing what to get me, you come into my room, dressed in something skimp as usual, and ask me what I would like formy birthday (which is tomorrow). You tell me to think big, do I want a new car, do I want to take a trip to Europe, what do I fantasize about. I'm a bit shy about telling you but I eventually say if I could have anything I wanted for my birthday, that it would be you. To be able to have you for the entire day. At first you're a bit shocked. You had no idea I thought of you that way. You know my father certainly wouldn't approve. On the other hand, you did want to bond with me. You also get really turned on by the fact that I could have anything in the world for my birthday and I choose you. The more you think about it the more excited you get. You tell me that you'll sneak into my bedroom tomorrow morning to get started. This is where it can get a little ambitious. -mandy flores- On my birthday my father will be in the house and I'll want to have sex with you 3, 4 maybe 5 times through out the day. The first in my bedroom in the morning when you ride me. Maybe a second time in your bedroom while my father is in the shower, you ride me again with urgency to get me off before my father gets out of the shower. A third time in the kitchen when my father is watching TV in the next room, you on your back for this one. A fourth time in my room again while my father is in the pool. And the last time I sneak into your bedroom and we have sex while my father is sleeping next to us, you on your back.Mandy Flores\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://picturescream.com/x/clean/G8ID\r\n \nhttp://picturescream.com/x/clean/G8IU\r\n \nhttp://picturescream.com/x/clean/G8IY\r\n \nhttp://picturescream.com/x/clean/G8Ib\r\n \nhttp://picturescream.com/x/clean/G8In\r\n \nhttp://picturescream.com/x/clean/G8Io\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 1.23 GB\r\nDuration: 25:21 min \t\r\nResolution: 1280x720\r\n\r\n\r\nShow Your Appreciation - BitCoin: 1JxUQqRrvGC6txChvaZEbqSSsq9wtswoto","torrent":{"xt":"urn:btih:861e8656abe1a63909261c704a961d615396d486","amp;dn":"Clips4sale+-+Mandy+Flores+-+Bonding+with+Step+Mom+HD+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861e8656abe1a63909261c704a961d615396d486","infoHashBuffer":{"type":"Buffer","data":[134,30,134,86,171,225,166,57,9,38,28,112,74,150,29,97,83,150,212,134]},"announce":[],"urlList":[]}}