{"title":"Olivia Tremor Control - 4 albums + demos","uid":4405960,"size":357040440,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:862d069100758fcbdfde41f3de26d4a5f7c2ebb4&amp;dn=Olivia+Tremor+Control+-+4+albums+%2B+demos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"kras77","files":99,"time":1221948757,"description":"Dusk At Cubist Castle\nBlack Foliage\n\nPresents: Singles and beyond\nExplanations II \n+ a few demos \n\nOne of the best bands of the 90&amp;#039;s! This from wikipedia:\n\nThe Olivia Tremor Control was an Athens, Georgia indie rock band in the mid- to late 1990s which, along with The Apples in Stereo and Neutral Milk Hotel, was one of the three original Elephant 6 projects. The band was founded by the remnants of the group Synthetic Flying Machine (Jeff Mangum, Bill Doss, and Will Cullen Hart) in 1994 and disbanded in early 2000.\n\nFrom Pitchfork:\n One reason record reviews exist is to help people make purchasing decisions. I tell you a new album is great, you buy it, you dig it, you say, &quot;What should I buy next?&quot; Well, buy Black Foliage next-- you&amp;#039;ll love it. You&amp;#039;ll get insanely catchy &amp;#039;60s- inspired pop music in addition to sound collages, field recordings, drony ambience, cathartic noise, and outlandish production that makes Phil Spector&amp;#039;s &quot;Wall of Sound&quot; look like a cubicle divider. You&amp;#039;ll get an exceedingly long album that&amp;#039;s high on concept and low on tedium. You&amp;#039;ll get a lot for your $15. So buy it, already! It really is a fine, fine piece of work-- better even than the band&amp;#039;s strong debut, Dusk At Cubist Castle. Trust me.\n\nSo, now that you own Black Foliage, let&amp;#039;s talk about what you can do to maximize your enjoyment of it. The first thing you&amp;#039;ll need is a box of Q-tips. In order for your ears to have a chance at capturing the 32,486,978 distinct sounds that collectively make up Black Foliage, you&amp;#039;ll want those canals to be whistle clean. The next question is: headphones or hi-fi? It should be noted that, at times, the sonic ambitions of the Olivia Tremor Control exceed the ability of their recording equipment to capture it. The end result of this is that parts of Black Foliage can sound just a bit muddy in your average listening environment, where microscopic sonic details can easily disappear into those ferns hanging in the corners. Headphones alleviate this problem and bring a mind- boggling amount of aural nuance to the fore, but they are far from ideal if the album is listened to in a social setting.\n\nSo, you&amp;#039;re settled in and your ears are open, and now you want to know exactly what to listen for. It&amp;#039;s not easy to say, as there will be as many approaches to this record as there are listeners. The band&amp;#039;s real talent, like that of the late- &amp;#039;60s- era Beatles, is in combining accessible pop with more experimental elements and making them work together perfectly. Only the Flaming Lips are making comparable strides at bridging the &quot;catchy vs. avant garde&quot; gap within a single piece of work. While the Olivia Tremor Control is wildly successful in that respect on Black Foliage, it&amp;#039;s possible that some will be turned off by either the syrupy- sweet melody of &quot;Hideaway&quot; or the quick- cutting tape collage of &quot;The Boat Below It,&quot; depending on which end of this continuum you&amp;#039;re coming from. The key factor in the synthesis is that the Olivia Tremor Control are head over heels in love with sound-- it shows in every saturated inch of their master tapes. And sound certainly takes precedence over lyrics, to the degree that you remember the melodies and textures much more than the words, which are really just one component of the whole.\n\nIn the case of Black Foliage, that whole is a complex, ear- pleasing conundrum, from the opening organ chords of &quot;Opening&quot; to the final chorus of &quot;Hilltop Procession,&quot; whose fade- out makes you sad that the lengthy album is over. Part of the album&amp;#039;s puzzle- like nature comes from the constant references to other songs-- both Olivia Tremor Control works and other band&amp;#039;s songs. The album&amp;#039;s theme, &quot;Black Foliage,&quot; appears in four very different versions, one for each side of the double album, and is alluded to again in the sound collages. The song title &quot;California Demise&quot; comes from the band&amp;#039;s rare 7&quot; EP debut of the same name. References to Dusk At Cubist Castle are also made, hidden bits of one song are in another, and the occasional musical quote, such as the vocal break lifted from &quot;God Only Knows&quot; for &quot;The Silvan Screen,&quot; all add to the fun.\n\nThe overall concept is also cryptic but worth trying to fathom. I&amp;#039;ve only listened to the album 15 or so times, not the 50 that Olivia Tremor Control co- frontman Bill Doss says is required to decipher it, so I can&amp;#039;t help you there. If I had to guess, I&amp;#039;d say that the album is really about listening, really listening to what&amp;#039;s going on around you and realizing that sounds are music and music are sounds. Or, to paraphrase John Cage&amp;#039;s famous question, &quot;Are sounds just sounds or are they the Olivia Tremor Control?&quot;\n\n- Mark Richard-San, December 31, 1999 ","torrent":{"xt":"urn:btih:862d069100758fcbdfde41f3de26d4a5f7c2ebb4","amp;dn":"Olivia+Tremor+Control+-+4+albums+%2B+demos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"862d069100758fcbdfde41f3de26d4a5f7c2ebb4","infoHashBuffer":{"type":"Buffer","data":[134,45,6,145,0,117,143,203,223,222,65,243,222,38,212,165,247,194,235,180]},"announce":[],"urlList":[]}}