{"title":"Hospitality - Trouble (2014) [FLAC]","uid":9530440,"size":214876702,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:86407dc2f8ebd2d56daaba41e7e61e8c57ab82ae&amp;dn=Hospitality+-+Trouble+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"politux","files":-1,"time":1390833017,"description":"  Hospitality - Trouble (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Pop, Alternative\n  Source: WEB \n  Codec: FLAC\n  Bitrate: ~ 900 kbps \n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n \n  01 Nightingale\n  02 Going Out\n  03 I Miss Your Bones\n  04 Inaguration\n  05 Rockets and Jets\n  06 Sullivan\n  07 It's Not Serious \n  08 Last Words\n  09 Sunship\n  10 Call Me After\n\n  Hospitality's self-titled debut album showed the Brooklyn trio had three very important things going for them: Amber Papini's off-kilter vocal charms, her sweetly catchy indie pop songs, and their skill at making familiar sounds seem fresh and full of life. On their second record, Trouble, these vital factors are still firmly in place, but the band stretches beyond bouncy pop and tender introspection into all kinds of new directions. From the guitar-heavy &quot;Nightingale,&quot; which kicks off the album in a crunchy, Neil Young-ian swirl that allows Papini to show off some real toughness to go with all the tender, to the very next song, &quot;Going Out, which slowly rides a sunset-soft mid-'70s Laurel Canyon disco vibe, it's easy to see right away that Hospitality were inspired to explore all kinds of ways to grow their sound into something a bit more challenging and heady. \n\n  Whether it's rollicking indie pop with exciting dynamics (&quot;I Miss Your Bones&quot;), very moody and atmospheric ballads (&quot;Sullivan&quot;), or epic-length synth pop songs that almost sound like an entirely different band (&quot;Last Words&quot;), the trio doesn't make a wrong move. And people who loved the simplicity and bounce of the first record aren't totally left out in the cold; there are a few songs like the cute &quot;It's Not Serious&quot; to keep them happy, even as they absorb the much improved sound and vision the group displays elsewhere. Thanks to the improved production that adds all kinds of interesting instrumentation to the mix (courtesy of Matt Boynton and the band's jack-of-all-trades, Nathan Michel), the album has a rich and varied sound that is a big step forward from the debut. Where that album was all-caps INDIE pop, Trouble is a darker, more intense, and more rewarding experience that uses far more of the paintbox and feels far more adult and real. Unlike many bands that have tried similar ways to change things up, Hospitality make all the right moves on Trouble, and not only equal their impressive debut but surpass it both sonically and emotionally.","torrent":{"xt":"urn:btih:86407dc2f8ebd2d56daaba41e7e61e8c57ab82ae","amp;dn":"Hospitality+-+Trouble+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86407dc2f8ebd2d56daaba41e7e61e8c57ab82ae","infoHashBuffer":{"type":"Buffer","data":[134,64,125,194,248,235,210,213,109,170,186,65,231,230,30,140,87,171,130,174]},"announce":[],"urlList":[]}}