{"title":"Buzz: Urban Beekeeping and the Power of the Bee (2013)","uid":10897010,"size":4084509,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:870c913a56ed0564b817da66ba77abc9ed8844ea&amp;dn=Buzz%3A+Urban+Beekeeping+and+the+Power+of+the+Bee+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1409160889,"description":"Book Description:\n\n&quot;Buzz is a fascinating reminder of the interconnections between humans and animals, even in that most urban of environments, New York City.&quot;\n--Gary Alan Fine, author of Authors of the Storm: Meteorologists and the Culture of Prediction\n\nBees are essential for human survival--one-third of all food on American dining tables depends on the labor of bees. Beyond pollination, the very idea of the bee is ubiquitous in our culture: we can feel buzzed; we can create buzz; we have worker bees, drones, and Queen bees; we establish collectives and even have communities that share a hive-mind. In Buzz, authors Lisa Jean Moore and Mary Kosut convincingly argue that the power of bees goes beyond the food cycle, bees are our mascots, our models, and, unlike any other insect, are both feared and revered.\n\nIn this fascinating account, Moore and Kosut travel into the land of urban beekeeping in New York City, where raising bees has become all the rage. We follow them as they climb up on rooftops, attend beekeeping workshops and honey festivals, and even put on full-body beekeeping suits and open up the hives. In the process, we meet a passionate, dedicated, and eclectic group of urban beekeepers who tend to their brood with an emotional and ecological connection that many find restorative and empowering. Kosut and Moore also interview professional beekeepers and many others who tend to their bees for their all-important production of a food staple: honey. The artisanal food shops that are so popular in Brooklyn are a perfect place to sell not just honey, but all manner of goods: soaps, candles, beeswax, beauty products, and even bee pollen.\n\nBuzz also examines media representations of bees, such as children's books, films, and consumer culture, bringing to light the reciprocal way in which the bee and our idea of the bee inform one another. Partly an ethnographic investigation and partly a meditation on the very nature of human/insect relations, Moore and Kosut argue that how we define, visualize, and interact with bees clearly reflects our changing social and ecological landscape, pointing to how we conceive of and create culture, and how, in essence, we create ourselves.\n\nLisa Jean Moore is a feminist medical sociologist and Professor of Sociology and Gender Studies at Purchase College, State University of New York.\n\nMary Kosut is cultural sociologist and Associate Professor of Media, Society and the Arts and Gender Studies at Purchase College, State University of New York.\n\nIn the Biopolitics series\n\nProduct Details:\n\nSeries: Biopolitics Series\nPDF: 252 pages\nPublisher: NYU Press (September 27, 2013)\nLanguage: English\nISBN-10: 147982738X\nISBN-13: 978-1479827381\n\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up\n------------------------------------------------","torrent":{"xt":"urn:btih:870c913a56ed0564b817da66ba77abc9ed8844ea","amp;dn":"Buzz%3A+Urban+Beekeeping+and+the+Power+of+the+Bee+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870c913a56ed0564b817da66ba77abc9ed8844ea","infoHashBuffer":{"type":"Buffer","data":[135,12,145,58,86,237,5,100,184,23,218,102,186,119,171,201,237,136,68,234]},"announce":[],"urlList":[]}}