{"title":"Pitchfork Top 200 Songs of the 2000s","uid":5063931,"size":1613363402,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:874d6c62dd6db822a380ef37f290f728daf2c571&amp;dn=Pitchfork+Top+200+Songs+of+the+2000s&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":11,"uploader":"serge2k8","files":200,"time":1250843085,"description":"1. OutKast\n&quot;B.O.B.&quot;\n[LaFace/Arista; 2000]\n\nSo you've spent the past five days clicking through pages of this countdown only to find out that the best single of the 2000s was released just 10 months into the decade. (To the ensuing nine or so years of music: thanks for showing up.) And that it's the very same song that topped Pitchfork's Best Songs of 2000-2004 list from five years ago. Now you know how your parents feel when they tune into a long-weekend classic-rock radio countdown for the inevitable valedictory spin of &quot;Stairway to Heaven&quot;.\n\nBut really, do we have any other choice? &quot;B.O.B.&quot; is not just the song of the decade-- it is the decade. Appropriately, the contemporary hip-hop act most in tune with the Afro-Futurist philosophies of Sun Ra, George Clinton, and Afrika Bambaataa, wound up effectively crafting a fast-forwarded highlight-reel prophecy of what the next 10 years held in store. The title-- aka &quot;Bombs Over Baghdad&quot;, a phrase that sounded oddly anachronistic in 2000, sadly ubiquitous two and a half years later-- is only the start of it. In &quot;B.O.B&quot;'s booty-bass blitzkrieg, we hear an obliteration of the boundaries separating hip-hop, metal, and electro, setting the stage for a decade of dance/rock crossovers. We hear a bloodthirsty gospel choir inaugurating a presidential administration of warmongering evangelicals. We hear AndrÃƒÂ© 3000 and Big Boi fire off a synapse-bursting stream of ripped-from-the-headlines buzzwords (&quot;Cure for cancer/ Cure for AIDS&quot;), personal anecdotes (&quot;Got a son on the way by the name of Bamboo&quot;) and product placements (&quot;Yo quiero Taco Bell&quot;) that read like the world's first Twitter feed. We hear four minutes of utter fucking chaos yielding to a joyously optimistic denouement (a point reinforced by the Stankonia cover's re-imagination of the American flag, which anticipates a White House set to be painted black).\n\nOf course, there is a downside of being ahead of your time-- upon its release, &quot;B.O.B.&quot; didn't even dent the Billboard Hot 100, and merely peaked at No. 69 on the Hip-Hop/R&amp;B Chart. But unlike OutKast's subsequent number one singles (&quot;Ms. Jackson&quot; and &quot;Hey Ya&quot;) &quot;B.O.B.&quot; is too disorienting and exhausting an experience to ever succumb to over-saturation, and its majesty has never been diminished by ironic cover versions from cred-hungry rock bands. Because even after a decade that's seen the act of copying music become as easy as a mouse-click, and the process of performing simplified for toy video-game guitars, the future-shocked ferocity &quot;B.O.B.&quot; is something that just cannot be duplicated. --Stuart Berman\n\n\n\nPitchfork Top 200 Songs of the 2000s\n\nFor full list check the file list\n\n001 OutKast - B.O.B.\n002 LCD Soundsystem - All My Friends\n003 M.I.A. feat. Bun B and Rich Boy - Paper Planes (Diplo Remix)\n004 BeyoncÃƒÆ’Ã‚Â© feat. Jay-Z - Crazy in Love\n005 Daft Punk - One More Time\n006 Yeah Yeah Yeahs - Maps\n007 Missy Elliott - Get Ur Freak On\n008 Radiohead - Idioteque\n009 Animal Collective - My Girls\n010 Arcade Fire - Neighborhood #1 (Tunnels)\n011 Gnarls Barkley - Crazy\n012 OutKast - Hey Ya!\n013 LCD Soundsystem - Losing My Edge\n014 Jay-Z - 99 Problems\n015 The Knife - Heartbeats\n016 The Rapture - House of Jealous Lovers\n017 Annie - Heartbeat\n018 Hercules and Love Affair - Blind\n019 R. Kelly - Ignition (Remix)\n020 The Walkmen - The Rat","torrent":{"xt":"urn:btih:874d6c62dd6db822a380ef37f290f728daf2c571","amp;dn":"Pitchfork+Top+200+Songs+of+the+2000s","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"874d6c62dd6db822a380ef37f290f728daf2c571","infoHashBuffer":{"type":"Buffer","data":[135,77,108,98,221,109,184,34,163,128,239,55,242,144,247,40,218,242,197,113]},"announce":[],"urlList":[]}}