{"title":"Dungeon_Siege-FLT","uid":8612964,"size":1406681907,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:875ddbbe79bfcae6ef1d58dd09b6eb34b98fd1c5&amp;dn=Dungeon_Siege-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Totenkruez","files":-1,"time":1372187056,"description":"Dungeon Siege (C) Microsoft\n\nSupplied by: FAIRLIGHT\nRelease Date: 3/29/2002\nCracked by: FAIRLIGHT\nGame Type: RPG\nPackaged by: FAIRLIGHT\nImage Format: BIN/CUE\n\nCDS: 2\nProtection: SD Lite\nCD1 archives: 47 x 15 MB\nCD1: flt-ds1.001 -&gt; .047\nCD2 archives: 49 x 15 MB\nCD2: flt-ds2.001 -&gt; .049\n\nSystem Requirements: Pentium 333 MHz or Higher, 64 MB RAM,1 GB HD\n\nGame information :\n==================\nDungeon Siege combines the immersive elements of a role-playing game with\nover-the-top intensity and non-stop action. Dungeon Siege plunges you into a\ncontinuous 3D fantasy world where you face off against an army of evil that has\nbeen unleashed. You begin as a humble farmer, and as you travel through the\nworld and gain new skills, you can gather a party of up to eight characters to\naid you.\n\nFace off against an army of evil!\n\nBegin your quest as a humble farmer, and as you travel through the world and\ngain new skills, you can gather a party of up to eight characters to aid you.\n\nAdditional Features:\n\nIntense combat, &quot;Dungeon Siege&quot; style - Dungeon Siege pushes the envelope of\nrole-playing games with fully animated 3-D characters, over-the-top battles,\nintense special effects and awe-inspiring vertical landscapes. With true 3-D\nenvironments, an advanced particle system for spells and dungeons that can\nextend in three dimensions, &quot;Dungeon Siege&quot; keeps you focused on the action by\nproviding tools that simplify party combat and management with a broad array of\nfamiliar game controls such as drag select, way points and formations.\n\n\nAdventure on a new scale - Customize your party to include up to eight\ncharacters. There are no rules or restrictions, and you can have any combination\nof fighters, archers and magic users. Characters join your party as they journey\nthroughout the world - some are hired, others are rescued and some are brought\nback from beyond the grave. Lead your party into epic battles against a range of\nenemies - from marauding hordes to monsters of a scale never before seen in a\nfantasy role-playing game.\n\n\nBreaking the rules in the name of action - Dungeon Siege is engaging yet easy to\nunderstand, action-packed yet easy to control, deep and involving yet quick to\nlearn. The skill-based character system plunges you almost immediately into the\naction, where your skills develop real-time. If treasure is more your focus,\ngrab a pack mule or two. Never again worry about passing on that armor you found\nbecause you didn't have enough space.\n\n\nFull multiplayer support - Dungeon Siege will support up to eight players via a\nlocal area network (LAN) or through the built-in matchmaking server available\ninside the game. You can take part in both &quot;short game&quot; multiplayer experiences\nsuch as `capture the castle' and the more traditional &quot;campaign&quot; style of play.\n\n\nImmersive, continuous, fully 3-D environment - The setting of Dungeon Siege is\none gigantic, continuous world where you can seamlessly journey from the highest\nmountain to the deepest dungeon without ever having to see a loading screen.\nDiscovering fantastic locations to explore - strange and mysterious dungeons,\nenormous castles and secret underground lairs - you become immersed in the\nfantasy of the surrounding world.\n\n\nMore than just a game, also a gaming platform - The proprietary Siege Editor in\nDungeon Siege gives you the freedom to rework nearly every aspect of the game,\nmaking Dungeon Siege not only a game, but also a role-playing platform for those\nwho want to create their own characters, spells, dungeons - even entire worlds.\nYou can post these user-created files to the Web, making them available for\nanyone to download and explore or play as a multiplayer game.","torrent":{"xt":"urn:btih:875ddbbe79bfcae6ef1d58dd09b6eb34b98fd1c5","amp;dn":"Dungeon_Siege-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"875ddbbe79bfcae6ef1d58dd09b6eb34b98fd1c5","infoHashBuffer":{"type":"Buffer","data":[135,93,219,190,121,191,202,230,239,29,88,221,9,182,235,52,185,143,209,197]},"announce":[],"urlList":[]}}