{"title":"The Addicted Brain - Why We Abuse Drugs, Alcohol And Nicotine (P","uid":9611241,"size":8970237,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8776d5e4b19c435774787cae2fb81e79867f6ea7&amp;dn=The+Addicted+Brain+-+Why+We+Abuse+Drugs%2C+Alcohol+And+Nicotine+%28P&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1392323304,"description":"Addiction destroys lives. In The Addicted Brain, leading  neuroscientist Michael Kuhar, Ph.D., explains how and why this  happensand presents advances in drug addiction treatment and  prevention. Using breathtaking brain imagery and other research, Kuhar  shows the powerful, long-term brain changes that drugs can cause,  revealing why it can be so difficult for addicts to escape their grip.\n\nDiscover  why some people are far more susceptible to addiction than others as  the author illuminates striking neural similarities between drugs and  other pleasures potentially capable of causing abuse or  addictionincluding alcohol, gambling, sex, caffeine, and even Internet  overuse. Kuhar concludes by outlining the 12 characteristics most often  associated with successful drug addiction treatment.\n\nAuthoritative and easy to understand, The Addicted Brain offers  todays most up-to-date scientific explanation of addictionand what  addicts, their families, and society can do about it.\n\nFrom the Back Cover\n\nWhat Science Has Learned About Addiction:\n\nWhat causes it?\n\nHow do drugs change the brain?\n\nWhos most vulnerable?\n\nDoes treatment work?\n\nWhat can we do?\n\nAddiction destroys lives. In The Addicted Brain,  a leading neuroscientist explains how and why this happensand presents  advances in treatment and prevention. Using breathtaking brain imagery  and other research, Michael Kuhar, Ph.D., shows the powerful, long-term  brain changes that drugs can cause, revealing why it can be so difficult  for addicts to escape their grip.\n\nIn  plain English, Kuhar describes why some people are far more susceptible  to addiction than others. He illuminates striking neural similarities  between drugs and other pleasures potentially capable of causing abuse  or addictionincluding alcohol, gambling, sex, caffeine, and even  Internet overuse. Finally, he outlines the 12 characteristics most often  associated with successful treatment.\n\nAuthoritative and easy to understand, The Addicted Brain offers todays most up-to-date scientific explanation of addictionand  what addicts, their families, and society can do about it.\nAbout the Author\nMichael Kuhar, Ph.D., is currently a professor at the  Yerkes National Primate Research Center, Candler professor in the Emory  University School of Medicine, and a Georgia Research Alliance Eminent  Scholar. His general interests have been the structure and function of  the brain, mental illness, and the drugs that affect the brain.  Addiction has been his major focus for many years, and he is one of the  most productive and highly cited scientists worldwide. He has trained a  large cadre of students, fellows, and visitors, received a number of  prestigious awards for his work, and remains involved in many aspects of  addiction research and education. In June 2011, he received the Nathan  B. Eddy lifetime achievement award from the College on Problems of Drug  Dependence.","torrent":{"xt":"urn:btih:8776d5e4b19c435774787cae2fb81e79867f6ea7","amp;dn":"The+Addicted+Brain+-+Why+We+Abuse+Drugs%2C+Alcohol+And+Nicotine+%28P","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8776d5e4b19c435774787cae2fb81e79867f6ea7","infoHashBuffer":{"type":"Buffer","data":[135,118,213,228,177,156,67,87,116,120,124,174,47,184,30,121,134,127,110,167]},"announce":[],"urlList":[]}}