{"title":"Picture Collage Maker Pro v3.3.8 (1-click run)(registred)","uid":8095463,"size":62198225,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:879846de1215d644fbbb140159908208f0533369&amp;dn=Picture+Collage+Maker+Pro+v3.3.8+%281-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1359826005,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes, \nNo boring installation of tool-bars in your browser,\nYou can even run this torrent from USB-Stick.\nThis makes a '1-click run' version a better version.\n\nPearl Mountain Picture Collage Maker Pro\n\nCollageIt is an easy-to-use and automatic collage maker, which makes photo collage automatically. There are only three steps to make your stunning collage: add photo, set parameters and generate collage preview, save collage as image format, such as BMP, JPEG, PNG, TGA, GIF etc. \n\nFeatures:\n\nGenerate collage in an automatic way; Click Generate Previewbutton, CollageIt will create photo collage automatically according to the added photos and parameters without any manual adjustment.\n\nEasy-to-Use; Easy enough for users of all experience levels to use. Pretty collage will be made by just few mouse clicks.\n\nJust 3 steps required; Just 3 steps to make a collage: add photos-&gt; set parameters and generate preview-&gt;save collage as image file.\n\nProvide enhanced features and functionality to create diverse types of collage; Support creating collage with few photos to 100 photos. The &quot;Auto rotation mode&quot; and &quot;Sparse mode&quot; make the collage more varied. \n\nRealtime preview, super speed; Preview the final collage in one second. \nVariable parameters; Number of photo, photo space, photo frame, shadow, page margin, auto rotation mode, sparse mode, page size and background setup.\n\nSave and share collage; Save the collage in common image formats such as bmp, jpeg, png, tga, tif etc to share with your friends and family.","torrent":{"xt":"urn:btih:879846de1215d644fbbb140159908208f0533369","amp;dn":"Picture+Collage+Maker+Pro+v3.3.8+%281-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879846de1215d644fbbb140159908208f0533369","infoHashBuffer":{"type":"Buffer","data":[135,152,70,222,18,21,214,68,251,187,20,1,89,144,130,8,240,83,51,105]},"announce":[],"urlList":[]}}