{"title":"Introduction to Cryptography: Principles and Applications, 3rd E","uid":13688678,"size":4412756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87cb55d185217ca8dd537860dfe3875c7a800c2f&amp;dn=Introduction+to+Cryptography%3A+Principles+and+Applications%2C+3rd+E&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"NoctDeath","files":2,"time":1456580887,"description":"Title: Introduction to Cryptography: Principles and Applications \r\nSeries: Information Security and Cryptography \r\nAuthor: Hans Delfs, Helmut Knebl \r\nFormat: PDF \r\nHardcover: 508 pages \r\nPublisher: Springer; 3rd ed. 2015 edition (September 29, 2015) \r\nLanguage: English \r\nISBN: 9783662479735 \r\n\r\n\r\nThe first part of this book covers the key concepts of cryptography on an undergraduate level, from encryption and digital signatures to cryptographic protocols. Essential techniques are demonstrated in protocols for key exchange, user identification, electronic elections and digital cash. In the second part, more advanced topics are addressed, such as the bit security of one-way functions and computationally perfect pseudorandom bit generators. The security of cryptographic schemes is a central topic. Typical examples of provably secure encryption and signature schemes and their security proofs are given. Though particular attention is given to the mathematical foundations, no special background in mathematics is presumed. The necessary algebra, number theory and probability theory are included in the appendix. Each chapter closes with a collection of exercises.\r\n\r\nIn the second edition the authors added a complete description of the AES, an extended section on cryptographic hash functions, and new sections on random oracle proofs and public-key encryption schemes that are provably secure against adaptively-chosen-ciphertext attacks. The third edition is a further substantive extension, with new topics added, including: elliptic curve cryptography; Paillier encryption; quantum cryptography; the new SHA-3 standard for cryptographic hash functions; a considerably extended section on electronic elections and Internet voting; mix nets; and zero-knowledge proofs of shuffles.\r\n\r\nThe book is appropriate for undergraduate and graduate students in computer science, mathematics, and engineering","torrent":{"xt":"urn:btih:87cb55d185217ca8dd537860dfe3875c7a800c2f","amp;dn":"Introduction+to+Cryptography%3A+Principles+and+Applications%2C+3rd+E","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87cb55d185217ca8dd537860dfe3875c7a800c2f","infoHashBuffer":{"type":"Buffer","data":[135,203,85,209,133,33,124,168,221,83,120,96,223,227,135,92,122,128,12,47]},"announce":[],"urlList":[]}}