{"title":"Fundamentals of Structural Engineering.pdf","uid":9710286,"size":23390398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87cc18b6bafb80259f268745ce2ab1154ce8bdf5&amp;dn=Fundamentals+of+Structural+Engineering.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394103457,"description":"2013 | 1160 Pages | PDF | 22 Mb\n\nFundamentals of Structural Engineering provides a balanced, seamless treatment of both classic, analytic methods and contemporary, computer-based techniques for conceptualizing and designing a structure. The book's principle goal is to foster an intuitive understanding of structural behavior based on problem solving experience for students of civil engineering and architecture who have been exposed to the basic concepts of engineering mechanics and mechanics of materials.\nDistinct from many undergraduate textbooks, which are focused mainly on either teaching manual analysis methods and applying them to simple, idealized structures or reformulating structural analysis methods in terms of matrix notation, this text instead encourages the student to develop intuition about structural behavior. The authors of this text recognize the notion that engineers reason about behavior using simple models and intuition they acquire through problem solving. The approach adopted in this text develops this type of intuition by presenting extensive, realistic problems and case studies together with computer simulation, which allows rapid exploration of how a structure responds to changes in geometry and physical parameters.","torrent":{"xt":"urn:btih:87cc18b6bafb80259f268745ce2ab1154ce8bdf5","amp;dn":"Fundamentals+of+Structural+Engineering.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87cc18b6bafb80259f268745ce2ab1154ce8bdf5","infoHashBuffer":{"type":"Buffer","data":[135,204,24,182,186,251,128,37,159,38,135,69,206,42,177,21,76,232,189,245]},"announce":[],"urlList":[]}}