{"title":"Antares Autotune DX v4.30 [piratox]","uid":3401767,"size":5084308,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:88317d4c36fbf0b337821757e50f69b8093303e0&amp;dn=Antares+Autotune+DX+v4.30+%5Bpiratox%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Piratox2000","files":2,"time":1130369388,"description":"Hailed as a &quot;holy grail of recording&quot; by Recording magazine,  Auto-Tune \n    is a multi-platform plug-in that corrects intonation problems in vocals \n    or solo  instruments, in  real time,  without distortion  or artifacts, \n    while  preserving  all  of  the  expressive  nuance  of  the   original \n    performance with  audio quality  so pristine  that the  only difference \n    between what  goes in  and what  comes out  is the  intonation. Over  a \n    typical pitch correction range, it is simply not possible to tell  that \n    a sound has been processed, except that it is perfectly in tune. \n              \n    Auto-Tune is used daily by thousands of audio professionals around  the \n    world. Whether to save studio and editing time, ease the frustration of \n    endless retakes, to save that otherwise once-in-a-lifetime performance, \n    or  to create  striking special  effects, Auto-Tune  4 is  the tool  of \n    choice.   \n              \n    Prepare to be amazed. \n              \n    Automatic Mode Most common pitch problems can be corrected by Auto-Tune \n    4's Automatic Mode. Automatic Mode instantaneously detects the pitch of \n    the  input,  identifies the  closest  pitch in  a  user-specified scale \n    (including minor,  major, chromatic  and 26  historical and  microtonal \n    scales),  and corrects  the input  pitch to  match the  scale pitch.  A \n    Retune Speed control  lets you match  the retune rate  to virtually any \n    performance style. \n              \n    Graphical Mode For meticulous tweaking, the Graphical Mode displays the \n    performance's detected  pitch envelope  and allows  you to  draw in the \n    desired  pitch  using a  variety  of graphics  tools.  This mode  gives \n    complete  control  over  the correction  or  modification  of the  most \n    elaborate expressive gestures. \n              \n    What's  New  in  Auto-Tune  4  Building  on  the  great  sound quality, \n    transparent processing and ease  of use that have  always distinguished \n    Auto-Tune, Auto-Tune 4 adds significant new features as well as a sleek \n    new user interface. \n              \n    Key new Auto-Tune 4 features include: \n              \n    Automatic Mode \n              \n    * The  ability to  specify target  note behaviors  (Scale Note, Remove, \n      Bypass) in individual octaves \n              \n    * Virtual keyboard for target note control \n              \n    * Improved Targeting option for problem vibratos \n              \n    * Enhanced Vibrato functions for more realistic (or wacky) vibratos \n              \n    * A Hold function to help analyze pitch errors \n              \n    * Other assorted niceties (Dual Detune display, new Scale Edit buttons, \n      etc.)   \n              \n    Graphical Mode \n              \n    * Larger Pitch Edit Display \n              \n    * Seriously expanded and reworked Graphical Editing Tools \n              \n    * Multi-level Undo/Redo (up to 20 levels) \n              \n    * Vibrato Scaling for modifying the depth of vibrato while  maintaining \n      its shape and character \n              \n    * Streamlined navigation controls \n              \n    * Cursor Pitch Display (back again by popular demand) \n              \n    * Selectable Edit Display color schemes \n              \n    Other     \n              \n    * 192kHz compatibility (host and hardware dependent) \n              \n    * Selectable knob control \n              \n    * Sleek new interface \n              \n              \n    more info available at: \n              \n    http://www.antarestech.com","torrent":{"xt":"urn:btih:88317d4c36fbf0b337821757e50f69b8093303e0","amp;dn":"Antares+Autotune+DX+v4.30+%5Bpiratox%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88317d4c36fbf0b337821757e50f69b8093303e0","infoHashBuffer":{"type":"Buffer","data":[136,49,125,76,54,251,240,179,55,130,23,87,229,15,105,184,9,51,3,224]},"announce":[],"urlList":[]}}