{"title":"Radio Futura.(Discografia) .","uid":4445141,"size":747133425,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:888dabd67af1d409c01380586c174b9abbcc4cc0&amp;dn=Radio+Futura.%28Discografia%29+.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":7,"uploader":"cholo24","files":135,"time":1224007781,"description":"Radio Futura\n\n\nLos hermanos Santiago y Luis AuserÃƒÂ³n (voz y bajo, respectivamente) y Enrique Sierra (guitarra) son el nÃƒÂºcleo de Radio Futura, uno de los grupos mÃƒÂ¡s importantes de lo que vino a denominarse la movida madrileÃƒÂ±a durante los aÃƒÂ±os ochenta: Radio Futura.\nLa historia comienza cuando los hermanos AuserÃƒÂ³n escriben en una revista, en 1978, bajo el nombre de Corazones AutomÃƒÂ¡ticos. El artÃƒÂ­culo en cuestiÃƒÂ³n habla de las excelencias de los Talking Heads. Su visiÃƒÂ³n de la mÃƒÂºsica les conecta con Herminio Molero, un pintor que les ayuda a formar un grupo. El propio Herminio se ocupa de los teclados. Enrique Sierra (que anteriormente militaba en el grupo Kaka de Luxe), hace lo propio con la guitarra. El grupo lo completan Javier PÃƒÂ©rez Grueso y los propios hermanos AuserÃƒÂ³n. Debutan en 1979, en un festival dedicado al tema de la ciencia ficciÃƒÂ³n.\nPoco mÃƒÂ¡s tarde, Paloma Chamorro, directora del programa de TV la edad de oro, los presenta en su programa de televisiÃƒÂ³n ImÃƒÂ¡genes. En 1980 se publioca el primer ÃƒÂ¡lbum del grupo, titulado &quot;MÃƒÂºsica Moderna&quot;.\nEn 1984 Radio Futura publican su segundo trabajo, &quot;La ley del desierto, la ley del mar&quot;, ahora ya sin Herminio, quien decidiÃƒÂ³ dejar el grupo en vista del giro en el estilo del grupo. En este segundo disco se incluyen temas legendarios de Radio Futura, como son &quot;Escuela de calor&quot; y &quot;Semilla negra&quot;. (1985), con participaciÃƒÂ³n de Raimundo Amador.\nA La ley del desierto del sigue otro gran trabajo, titulado &quot;De un paÃƒÂ­s en llamas&quot;, un aÃƒÂ±o despuÃƒÂ©s. En 1996 publican &quot;La CanciÃƒÂ³n de Juan Perro&quot;, en Nueva York, bajo la producciÃƒÂ³n de Jo Dworniak.\nEn 1989 aparece &quot;Escuela de calor&quot;, un doble ÃƒÂ¡lbum en directo con lo mejor de Radio Futura. Un aÃƒÂ±o despuÃƒÂ©s publican uno de sus discos destacados, &quot;Veneno en la piel&quot;, con Ollie Halsall a la guitarra y Antonio Moreno a la baterÃƒÂ­a. Tras la publicaciÃƒÂ³n del ÃƒÂ¡lbum &quot;Tierra para bailar&quot; en 1992, el grupÃƒÂ² anuncia su disoluciÃƒÂ³n, a la vista de la escasa creatividad que mostraban sus ÃƒÂºltimos trabajos. A partir de ese momento, los miembros de Radio futura se dedican a sus carreras en solitario, siendo Santiago AuserÃƒÂ³n el que mÃƒÂ¡s relevancia a tomado a raiz de sus trabajos como Juan Perro.\n","torrent":{"xt":"urn:btih:888dabd67af1d409c01380586c174b9abbcc4cc0","amp;dn":"Radio+Futura.%28Discografia%29+.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"888dabd67af1d409c01380586c174b9abbcc4cc0","infoHashBuffer":{"type":"Buffer","data":[136,141,171,214,122,241,212,9,192,19,128,88,108,23,75,154,187,204,76,192]},"announce":[],"urlList":[]}}