{"title":"UDEMY HACKING WIRELESS NETWORKS THEORY AND PRACTICE TUTORIAL","uid":12059693,"size":825637655,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:88bfe1a2837987b56e612b48f6a55db467832f40&amp;dn=UDEMY+HACKING+WIRELESS+NETWORKS+THEORY+AND+PRACTICE+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"RandalPaul","files":27,"time":1435226287,"description":"UDEMY HACKING WIRELESS NETWORKS THEORY AND PRACTICE TUTORIAL\n\nWelcome to Hacking School!\n\nEthical Wireless Network Hacking Course:\nHacking Wireless Networks. Theory and practice\n\nBefore we begin: the practical use of the course you\nare going to see has been proven by thousands of people all\nover the world beginners and computer geeks as well. People\nwho make their first steps in computer / network security and\nprofessionals: network administrators, programmers, pentesters\nblack- and white hat hackers. Please, read carefully what we'd\nlike to share with you\n\nThis course covers all the important techniques\nrelated with WIRELESS NETWORK (or WiFi) HACKING used\nby hackers, system administrators and pentesters\n\nWireless networks are all around us. You want it or\nnot, you ARE part of this system. As new wireless\nencryption-standards are being developed, new attack\ntechniques are being discovered and presented at the same\ntime. It s a real arms race\n\nEither you want to make your home WiFi network more secure, you\nwant to recover a forgotten password, or you want to break into\nyour wireless network to prove it is secure - regardless of\nthe WiFi encryption-type used (WEP, WPA, WPA2), you will find the\nanswer in this course\n\nWhat you can expect from this course:\n\n* You will get access to over 60 interesting lectures\non Wireless Network Hacking\n* You can download the course Handbook in PDF (over\n180 pages)\n* You can download the Training Operating System v2.0 CE (CUDA\nExtension) which is equipped with all the tools described in\nthis course\n* It is a step by step training on WiFi ethical hacking\n* It covers over 25 different Wireless Network Hacking techniques\nand experiments\n* This course can be treated as a valuable source of knowledge by\nwhite- and blackhat hackers, pentesters and\nnetwork analysts\n* You can get access to all the source codes and\ntools described in the course it s already\nprepared for you in the Training Operating System\nenvironment\n* You can boot the Training Operating System from\nCD/DVD or start it inside a virtual machine (using\nVirtualBox on Windows and VMware Fusion on MAC OSX)\n\nWhat you need to know before you begin:\n\n* This ethical hacking course is intended to help you regardless\nof your current knowledge and skills. All you need is a basic\ncomputer knowledge and our Training Operating System v2.0 (you\nwill also get access to it!)\n* We will show you how to prepare your training\nenvironment. In this environment you can\nexperiment freely, without doing harm to anybody\n* You will find all the source codes and examples\ninside your Training OS to avoid unnecessary code\nretyping\n* Most of the modules (lessons) contain the attack\nrelated part, as well as a guidance to protect your own\nwireless network\n* What you will find inside can also be used by beginners\nthanks to live Video Training attached to the course\n\nThe complete list of all the video training sessions included\nin this course:\n\n* The configuration of wireless network card modes\n* Changing the MAC address of the wireless network\ncard\n* Finding a hidden access point with disabled ESSID\nbroadcast\n* The use of deauthentication attack for jamming\nnetwork traffic\n* The overview and demonstration of the chop-chop attack\n* Generating packets without knowing the network key\n* Interactive packet replay and ARP request replay\n* The demonstration of the PTW and KoreK attacks\n* Creating a fake access point the Caffe Latte attack\n* The dictionary attack on WPA/WPA2\n* The dictionary attack on WPA/WPA2 using hash tables\n* CUDA the initial preparation of the environment\n* The installation of CUDA-SDK and CUDA-Toolkit\n* The compilation and installation of the tools with\nCUDA support\n* The optimization of the parameters of an nVidia\nvideo card\n* CUDA preparation for the attack\n* CUDA the attack on WPA/WPA2\n* Generating your own dictionary\n* Applications for cracking MD4 and MD5 hashes with the use of\nCUDA technology\n\nPlease be advised that all the techniques presented in this\ncourse can only be used ethically and in your own testing /\nresearching environment. Note that you will get all the\nrequired tools and information to prepare your own training\nsystem. Please see the Legal information in the\n1st section for further legal reference\n\nWe guarantee your 100% satisfaction or you will get\nyour money back. You have 30 days to decide if the\nWireless Network Hacking Course is for you. You\nwill get access to the whole system. If for any\nreason you're not satisfied with your training, you will get a\nfull refund. No questions asked\n\nGood luck and see you on the other side\nAndrew Harper || Hacking School Team","torrent":{"xt":"urn:btih:88bfe1a2837987b56e612b48f6a55db467832f40","amp;dn":"UDEMY+HACKING+WIRELESS+NETWORKS+THEORY+AND+PRACTICE+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88bfe1a2837987b56e612b48f6a55db467832f40","infoHashBuffer":{"type":"Buffer","data":[136,191,225,162,131,121,135,181,110,97,43,72,246,165,93,180,103,131,47,64]},"announce":[],"urlList":[]}}