{"title":"David Gilmour - On An Island (2006) [EAC] [FLAC] vtwin88cube","uid":6174119,"size":314866002,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89748c3d3dc182b6877be603550d9eeda0de3e14&amp;dn=David+Gilmour+-+On+An+Island+%282006%29+%5BEAC%5D+%5BFLAC%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1297702056,"description":"\n\nDavid Gilmour\nOn An Island (2006)\n\nDavid Gilmour gained international fame for his incisive, atmospheric guitar work and vocals with Pink Floyd, and eventually became the leader of the group during their late period as well as pursuing a successful solo career and working with some of the most respected names in British rock. Gilmour was born in Cambridge, England on March 6, 1946; his parents were both involved in education -- his father was a lecturer in Zoology at Cambridge University and his mother was a teacher.\n\nGilmour made his recording debut with Pink Floyd on 1968's A Saucerful of Secrets, and over the next several years, the group's sound evolved from pop-friendly psychedelic to ambitious progressive and experimental rock. Gilmour's guitar became a key part of Pink Floyd's aural signature, and he played a larger role in the group's songwriting; their evolving approach culminated with 1973's The Dark Side of the Moon, which became a massive international hit and firmly established them as one of the biggest British acts of the day. Pink Floyd's success continued with 1975's Wish You Were Here, but as Waters began to dominate the group's songwriting and conceptualizing, Gilmour began looking for other opportunities to express himself. He'd already made guest appearances on albums by Roy Harper and Hawkwind, and during the recording of 1977's Animals, Gilmour began work on his first solo album, released in 1978 simply as David Gilmour. In 1978, he also produced Kate Bush's debut album, The Kick Inside, and he contributed guitar work to Wings' 1979 release Back to the Egg. 1979's The Wall became another massive success for Pink Floyd, and Gilmour co-wrote the stand-out track &quot;Comfortably Numb,&quot; but tensions within the group grew during the recording of the album -- Rick Wright was fired during the sessions -- and after the long sessions which produced 1983's The Final Cut, Pink Floyd briefly fell apart.\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\n\nAudio Quality:\t\tPerfect (Lossless)\nGrabber:\t\tExact Audio Copy 1.1.2 -5\nEncoder:\t\tFlac 1.2.1\nEncoder Settings:\tHigh\t\nContains:\t\tAlbum Art, CRC, ID Tag [Vorbis Comments]\n\t\t\t\nFormat:\t\t\tFlac\nGenre:\t\t\tPop/Rock\nLabel: \t\t\tSony\n\n01.Castellorizon\n02.On An Island\n03.The Blue\n04.Take A Breath\n05.Red Sky At Night\n06.This Heaven\n07.Then I Close My Eyes\n08.Smile\n09.A Pocketful Of Stones\n10.Where We Start\n","torrent":{"xt":"urn:btih:89748c3d3dc182b6877be603550d9eeda0de3e14","amp;dn":"David+Gilmour+-+On+An+Island+%282006%29+%5BEAC%5D+%5BFLAC%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89748c3d3dc182b6877be603550d9eeda0de3e14","infoHashBuffer":{"type":"Buffer","data":[137,116,140,61,61,193,130,182,135,123,230,3,85,13,158,237,160,222,62,20]},"announce":[],"urlList":[]}}