{"title":"Damaged Series (1-2) by H.M. Ward [MU]","uid":8618809,"size":2657552,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89d2d2077c453f6cdfd14e4c5082a52d0ed65d2c&amp;dn=Damaged+Series+%281-2%29+by+H.M.+Ward+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Max-Upload","files":-1,"time":1372318933,"description":"Damaged Series (1-2) by H.M. Ward in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - {spam link removed}download \nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter \n\nDamaged (Damaged #1) by H.M. Ward (April 7th 2013)\n\nLife sucks. And, as soon as Sidney picks up the pieces something always knocks her back onto her butt. It's never pretty, but this time is different. This time pretty isn't even the right word.\n\nPeter is the personification of perfection. It's like he fell off his angel perch in purgatory, because let's face it--any guy that hot has got to be naughty. He was probably sent here to ruin her life.\n\nPeter is beyond beautiful with his sexy blue eyes, dark hair, and toned body. Add in his charming wit and Peter is everything Sidney ever wanted in a man, but when things get hot and heavy Peter shows her the door. Sidney takes the walk of shame and leaves. It's the end of the worst blind date ever. Her life couldn't possibly reach higher levels of suckage, but it does.\n\nThe next morning everything comes crashing down. The insanely hot guy from last night, the one that saw her half naked, is teaching at the front of the class room.\n\nDamaged 2 (Damaged #2) by H.M. Ward (June 24th 2013)\n\nHome isn't supposed to be dangerous, but for Sidney it is. Returning home means that she has to face her past. It's not just the man who hurt Sidney that makes it horrible, but the family that didn't believe her. They were dead to her, but now that her mom is really dying things seem different. It's a chance to set things right.\n\nWhat Sidney doesn't realize is that she's dragging Peter into a collision course with his past. Peter must deal with the demons haunting him if he wants to move forward with Sidney. He's willing to give up everything for her, even wade deeper into his past life to help her move forward. But, Peter isn't sure if he can get over what happened to him in New York.\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:89d2d2077c453f6cdfd14e4c5082a52d0ed65d2c","amp;dn":"Damaged+Series+%281-2%29+by+H.M.+Ward+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d2d2077c453f6cdfd14e4c5082a52d0ed65d2c","infoHashBuffer":{"type":"Buffer","data":[137,210,210,7,124,69,63,108,223,209,78,76,80,130,165,45,14,214,93,44]},"announce":[],"urlList":[]}}