{"title":"PDFCreator 0.9.8","uid":4840216,"size":17518208,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:89edf03703a24f4e9892c3cdc68ba8aa486e9fb6&amp;dn=PDFCreator+0.9.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"olofolleola4","files":-1,"time":1239471930,"description":"Copied from pdfforge Homepage:\n\n\nPDFCreator is a free tool to create PDF files from nearly any Windows application.\n\n\nWhy OpenSource?\n\nOpenSource software gives you the flexibility and reliability that you need.\nYou can be really sure, that noone has placed spyware or other malicious software in it, because you can look into the source. You can also extend the software for your needs, crop unwanted features or make it look nicer in you environment. OpenSource software also has a large community, that contributes experience and improvements. With this amount of testing bugs are found and fixed quickly.\nIn PDFCreator, the community has also created a large amount of translations, that further improve the easyness with that PDFCreator runs on other machines than english.\n\nKey Features:\n\nCreate PDFs from any program that is able to print\n\nSecurity: Encrypt PDFs and protect them from being opened, printed etc.\n\nSend generated files via eMail\n\nCreate more than just PDFs: PNG, JPG, TIFF, BMP, PCX, PS, EPS\n\nAutoSave files to folders and filenames based on Tags like Username, Computername, Date, Time etc.\n\nMerge multiple files into one PDF\n\nEasy Install: Just say what you want and everything is installed\n\nTerminal Server: PDFCreator also runs on Terminal Servers without problems\n\nAnd the best: PDFCreator is free, even for commercial use!\nIt is Open Source and released under the Terms of the GNU General Public License.","torrent":{"xt":"urn:btih:89edf03703a24f4e9892c3cdc68ba8aa486e9fb6","amp;dn":"PDFCreator+0.9.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89edf03703a24f4e9892c3cdc68ba8aa486e9fb6","infoHashBuffer":{"type":"Buffer","data":[137,237,240,55,3,162,79,78,152,146,195,205,198,139,168,170,72,110,159,182]},"announce":[],"urlList":[]}}