{"title":"The Oxford Handbook of Thinking and Reasoning -Holyoak/Morrison-","uid":9872431,"size":14659181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8a8d415d904711eed4be7e2e3061a2fcec2ba823&amp;dn=The+Oxford+Handbook+of+Thinking+and+Reasoning+-Holyoak%2FMorrison-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"K-Slender","files":3,"time":1396427960,"description":"Print Length: 864 pages\nPublisher: Oxford University Press, USA; Reprint edition (April 10, 2013)\nSold by: Amazon Digital Services, Inc.\nLanguage: English\nASIN: B00I6G25FI\n\nThinking and reasoning, long the academic province of philosophy, have over the past century emerged as core topics of empirical investigation and theoretical analysis in the modern fields of cognitive psychology, cognitive science, and cognitive neuroscience. Formerly seen as too complicated and amorphous to be included in early textbooks on the science of cognition, the study of thinking and reasoning has since taken off, brancing off in a distinct direction from the field from which it originated.\n\nThe Oxford Handbook of Thinking and Reasoning is a comprehensive and authoritative handbook covering all the core topics of the field of thinking and reasoning. Written by the foremost experts from cognitive psychology, cognitive science, and cognitive neuroscience, individual chapters summarize basic concepts and findings for a major topic, sketch its history, and give a sense of the directions in which research is currently heading. Chapters include introductions to foundational issues and methods of study in the field, as well as treatment of specific types of thinking and reasoning and their application in a broad range of fields including business, education, law, medicine, music, and science. The volume will be of interest to scholars and students working in developmental, social and clinical psychology, philosophy, economics, artificial intelligence, education, and linguistics. ","torrent":{"xt":"urn:btih:8a8d415d904711eed4be7e2e3061a2fcec2ba823","amp;dn":"The+Oxford+Handbook+of+Thinking+and+Reasoning+-Holyoak%2FMorrison-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a8d415d904711eed4be7e2e3061a2fcec2ba823","infoHashBuffer":{"type":"Buffer","data":[138,141,65,93,144,71,17,238,212,190,126,46,48,97,162,252,236,43,168,35]},"announce":[],"urlList":[]}}