{"title":"Babylon 5 - Season 1","uid":6342596,"size":9700825691,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8aa8803c104806978138e9323c5003d9c38a458b&amp;dn=Babylon+5+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"Darphfudd","files":23,"time":1303727640,"description":"Season 1, Episode 1: Midnight on the Firing Line\n\nThe Narn attack a Centauri colony, while Raiders attack transport ships. And Talia Winters arrives at the station.\n\nSeason 1, Episode 2: Soul Hunter\n\nA mysterious alien who steals the souls of the living arrives on the station putting Delenn's life in danger.\n\nSeason 1, Episode 3: Born to the Purple\n\nLondo falls for a beautiful slave, whose owner wants to steal sensitive information. Garibaldi discovers that someone is using a restricted communications channel.\n\nSeason 1, Episode 4: Infection\n\nA living weapon wreaks havoc on the station. \n\nSeason 1, Episode 5: The Parliament of Dreams\n\nA week long cultural festival is takes place on board the station. Catherine Sakai, Sinclair's old girlfriend, arrives on the station and G'Kar receives a death threat. \n\nSeason 1, Episode 6: Mind War\n\nThe Psi-Cops arrive at the station to capture Talia's old Psi Corps instructor. Catherine is warned not to survey a sector of space by G'Kar. \n\nSeason 1, Episode 7: The War Prayer\n\nA pro-Earth group attacks a Mimbari poet and two Centauri lovers seek Londo's help. \n\nSeason 1, Episode 8: And the Sky Full of Stars\n\nSinclair is kidnapped by people who want to know what happened when he disappeared in the last battle of the Earth/Minbari war, knowledge that even Sinclair does not know. \n\nSeason 1, Episode 9: Deathwalker\n\nA war criminal scientist who is the last of the notorious Dilgars is discovered on B5 bearing an extraordinary medication that all the powers want. \n\nSeason 1, Episode 10: Believers\n\nAn alien family refuses surgery to save their dying child. \n\nSeason 1, Episode 11: Survivors\n\nGaribaldi is blamed for an accident aboard B5, leading to his return to the bottle. \n\nSeason 1, Episode 12: By Any Means Necessary\n\nThe station's dock workers stage an illegal strike. G'Kar tries to take part in a Narn religious ceremony. \n\nSeason 1, Episode 13: Signs and Portents\n\nLondo obtains a priceless Centauri artifact and a stranger visits each alien ambassador asking only one question. \n\nSeason 1, Episode 14: TKO\n\nA disgraced boxer comes to Babylon 5 to compete in the Mutai, an alien fighting match. Meanwhile, an old friend visits Ivanova so that she can mourn the loss of her father. \n\nSeason 1, Episode 15: Grail\n\nA man searching for the Holy Grail arrives. Ambassador Kosh may be behind a string of attacks on the station. \n\nSeason 1, Episode 16: Eyes\n\nA Colonel investigates Sinclair and his command staff for recent station actions. \n\nSeason 1, Episode 17: Legacies\n\nA Minbari military leader's dead body disappears on the station. \n\nSeason 1, Episode 18: A Voice in the Wilderness: Part 1\n\nOne of Delenn's old friends arrives on the station when an extinct civilization is found on the planet that Babylon 5 orbits. \n\nSeason 1, Episode 19: A Voice in the Wilderness: Part 2\n\nAn Earthforce captain and an alien race both lay claim to the planet below. \n\nSeason 1, Episode 20: Babylon Squared\n\nB5's immediate predecessor, Babylon 4, suddenly reappears after mysteriously vanishing years ago. \n\nSeason 1, Episode 21: The Quality of Mercy\n\nTalia must enter the mind of a convicted murderer while Dr. Franklin goes to Downbelow to investigate a doctor who apparently is 'magically' healing people. \n\nSeason 1, Episode 22: Chrysalis\n\nGaribaldi investigates a death on the station which leads him to a terrible discovery.\n","torrent":{"xt":"urn:btih:8aa8803c104806978138e9323c5003d9c38a458b","amp;dn":"Babylon+5+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8aa8803c104806978138e9323c5003d9c38a458b","infoHashBuffer":{"type":"Buffer","data":[138,168,128,60,16,72,6,151,129,56,233,50,60,80,3,217,195,138,69,139]},"announce":[],"urlList":[]}}