{"title":"Jack White...Blunderbuss(2012)[FLAC]","uid":7189383,"size":264018519,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b031a24653a338f3bbf2a6c2ef0c4a0acda0dea&amp;dn=Jack+White...Blunderbuss%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"dickspic","files":17,"time":1334570108,"description":"\n01. Missing Pieces (3:28)\n02. Sixteen Saltines (2:37)\n03. Freedom at 21 (2:52)\n04. Love Interruption (2:38)\n05. Blunderbuss (3:07)\n06. Hypocritical Kiss (2:50)\n07. Weep Themselves to Sleep (4:19)\n08. I'm Shakin' (3:00)\n09. Trash Tongue Talker (3:20)\n10. Hip (Eponymous) Poor Boy (3:03)\n11. I Guess I Should Go to Sleep (2:37)\n12. On and On and On (3:56)\n13. Take Me with You When You Go (4:10)\n\nFor all the records that have borne his name over the past five years -- Dead Weather, Raconteurs, multiple guest spots and productions -- it feels like we haven't really gotten any unadulterated Jack White music since the White Stripes' swan song, &quot;Icky Thump.&quot; And one listen to &quot;Blunderbuss&quot; shows why: He's been woodshedding, carefully developing a template and a manifesto for a solo career that (incongruously, given his prolific output) begins with this album. \n  \n&quot;Blunderbuss&quot; has elements of nearly every project he's worked on -- even some of the 1950s bounce of the White-produced Wanda Jackson album on &quot;I'm Shakin'&quot; and &quot;Trash Tongue&quot; -- but also shows sides that the self-imposed, regimented simplicity of the White Stripes didn't allow. There are softer piano-driven songs (&quot;Love Interruption&quot;) and, at the opposite extreme, filthy guitar raunch (&quot;16 Saltines&quot;), but also elaborate tracks reminiscent of late-'60s psychedelia, like the Zombies or Small Faces: &quot;Hip (Eponymous) Poor Boy&quot; in particular is unlike anything White's ever done, with a complex, hopscotching melody and rhythm; similarly, &quot;I Guess I Should Go to Sleep&quot; has a soaring vocal, a jazzy tempo and a violin solo. With a sound that's vintage and organic but also very clean, the album is so diverse that virtually every song comes as a surprise -- a trend that will continue on White's forthcoming tour, where he'll be bringing along two different backing bands (one all-male, one all-female, as seen on his recent &quot;Saturday Night Live&quot; performance) and deciding on the morning of each gig which band will accompany him that night. \n  \n&quot;Blunderbuss&quot; is familiar enough to please the fan base, adventurous enough to forge a new path ahead, and satisfying enough to make fans realize anew just how much we've missed Jack's songs. But perhaps most of all, the album's diversity and musical ambition show that the White Stripes were as on-message musically as they were sartorially -- it wasn't that Jack White couldn't write complex songs, he just didn't, and now that he is, Blunderbuss isn't just (arguably) the best album of the year so far, it opens up a whole new world for him.\n\ncd ripped by EAC\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:8b031a24653a338f3bbf2a6c2ef0c4a0acda0dea","amp;dn":"Jack+White...Blunderbuss%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b031a24653a338f3bbf2a6c2ef0c4a0acda0dea","infoHashBuffer":{"type":"Buffer","data":[139,3,26,36,101,58,51,143,59,191,42,108,46,240,196,160,172,218,13,234]},"announce":[],"urlList":[]}}