{"title":"iMazing 1.4.5 (was DiskAid) [MAC OS X]","uid":13462195,"size":38138880,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:8b2ce6562947b0e93d966df9d23394c4ba2c6494&amp;dn=iMazing+1.4.5+%28was+DiskAid%29+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"iAlexander","files":1,"time":1454892387,"description":"MADE IN UKRAINE\r\n\r\niMazing 1.4.5 – Complete iOS device manager (was DiskAid).\r\n\r\niMazing (was DiskAid) is the ultimate iOS device manager with capabilities far beyond what iTunes offers. With iMazing and your iOS device (iPhone, iPad, or iPod), you can:\r\n- Copy music to and from any iOS device (even from one iOS device to another!), regardless of what Mac or PC the device is already synced to. Music transfer done right, without limitations or restrictions.\r\n- Backup and restore individual iOS apps along with your custom saved data, perfect for freeing up space on your iOS device without losing your files, great for installing apps including your data on another iOS device you own.\r\n- Transfer files to and from an iOS device, and browse the iOS file system.\r\n- Use your iOS device like a USB key.\r\n- Browse and save messages (SMS, MMS, iMessage), voicemails, and call logs, none of which iTunes can do.\r\n- Browse, save, and add contacts to your iPhone, without automatically adding them to your iCloud account.\r\n- Browse and manage multiple backups of the same iOS device. Chose which data sets you want to restore.\r\n- And other amazing things you never thought possible!\r\n\r\nWhat's new in version 1.4.5:\r\n- Messages: optimised loading of large sets of messages (Mac).\r\n- Music copy to device: transfer speed improved.\r\n- App backup restore: it is now possible to fully restore apps which use shared containers: data of WhatsApp and Readdle’s Documents can now be backed up and restored fully.\r\n- Backups are now completely editable - no readonly sections anymore, tinker away!\r\n- Photos in Camera section are now sorted by date by default.\r\n- Fixed an issue when exporting Messages as PDF or Text (Windows).\r\n- Fixed an issue when restoring some .imazingapp files &quot;Backup manifest is invalid&quot; (Candy Crush).\r\n- Fixed an issue with transfer progress bars when clicking on &quot;Skip&quot;.\r\n- Fixed an issue where &quot;Import from Contacts&quot; will not ask again the permission to access Contacts stored on the computer (Mac).\r\n- Exporting photo albums will now propose a &quot;Merge&quot; button instead of &quot;Skip&quot; when the folder already exists on the computer.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:8b2ce6562947b0e93d966df9d23394c4ba2c6494","amp;dn":"iMazing+1.4.5+%28was+DiskAid%29+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b2ce6562947b0e93d966df9d23394c4ba2c6494","infoHashBuffer":{"type":"Buffer","data":[139,44,230,86,41,71,176,233,61,150,109,249,210,51,148,196,186,44,100,148]},"announce":[],"urlList":[]}}