{"title":"Keep of Kalessin - Epistemology (2015)","uid":11673782,"size":134987507,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b3cb57acf926b99303946a600b45b8079f47c91&amp;dn=Keep+of+Kalessin+-+Epistemology+%282015%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"analogkid6103","files":10,"time":1422757126,"description":"1. Cosmic Revelation (Intro) 01:13\n2. The Spiritual Relief 09:53\n3. Dark Divinity 07:31\n4. The Grand Design 07:36\n5. Necropolis 07:18\n6. Universal Core 03:52\n7. Introspection 05:03\n8. Epistemology 09:38\nBonus Tracks:\n9. Anima Mund 02:04\n10. Novae Ruptis 01:48\nTotal Playing Time 56:11\n\n\n\nHistory\n\nKeep Of Kalessin was founded in 1995 and after recording their demo, the band got signed to italian label Avantgarde Music for whom they recorded two albums, &quot;Through times of war&quot; (1997) and &quot;Agnen - a journey through the dark&quot; (1999). In the year 2000 the band was put on ice because of personal disputes, but the band was brought back to life in 2003 by guitarist and songwriter Obsidian C. when the EP &quot;Reclaim&quot; was released. The EP hit like a bomb in the norwegian metal underground and expectations on what was to follow was the talk of the scene for nearly three years before the band was re-inforced with a new line-up and ready to release the massive new fullength album.\n\nIn April 2006 a new standard was set for norwegian metal with the release of &quot;Armada&quot;. Keep Of Kalessin was suddenly one of the most talked about norwegian metalbands and got standing ovations from the press all over the world. The new trademark of &quot;epic extreme metal&quot; was introduced on this monster of an album. A variety of thrash, death and black metal with classical and heavy metal melodies, acoustic flamenco-parts and epic metal of the most advanced kind. Keep Of Kalessin finally took the step up amongst the true elite of Norway and the album was also nominated to the norwegian Grammy awards and the Alarm awards.\n\nThe band toured several full european tours as main support for bands like Satyricon and Enslaved and played several festivals including the Inferno festival where the band gave the grandest opening in the festival's history. Keep Of Kalessin was also one of the few metalbands that was invited to many of the more mainstream festivals in Norway and started to earn many fans in the more mainstream rock scene.\n\nAfter heavy touring the band was ready to record a new album, but instead of using all their budget on renting a studio, the band actually invested in their own and by the end of 2007 they had brand new studio (Morningstar Studio) and a new album ready for release.\nimage\nAs a warmup to the release, Keep Of Kalessin did a month long tour in North America together with Dimmu Borgir and Behemoth in the spring of 2008. The band met alot of fans that had been waiting since 1997 to see them and also gained alot of new fans that now were thrilled with excitement for the new album.\n\n&quot;Kolossus&quot; was the natural successor to &quot;Armada&quot; and the band pushed the boundries of extreme metal even further. More variation, more melodic and more epic! Continuing the story from Armada, Kolossus tells the tale of the winning captain from Armada war who now takes the war against the gods, to bring down the gods and become a god himself.\nLike the previous one, Kolossus also got great response from the press and got top reviews all around the world in the metal media and was the second album from Keep Of Kalessin to be nominated for the norwegian Grammy awards. It was also named album of the month in Norway's biggest metal mag., Scream Magazine.\n\nThe band played about 150 shows in support of Kolossus including some of the biggest festivals in Europe like Graspop, Hellfest, Metalcamp, Masters of Metal and many more. They toured the world with bands like Morbid Angel, Samael, Marduk, Kataklysm and Amon Amarth and also took even greater steps into the mainstream rock scene of Norway when they played live in the opening of the norwegian Grammy awards in front of a live audience and 1,2 million viewers on TV.\n\nThe bands video for &quot;Ascendant&quot; was also a big youtube hit with 1,4 million views and their fans grew by the thousands.\n\nNot being afraid of breaking new ground, Keep Of Kalessin shocked the world in January 2010 by being one of the bands competing to represent Norway in the Eurovision Song Contest. They had small hopes to actually get to the final, but the band was just as shocked as the audience when it was announced that Keep Of Kalessin had won the entire first final. A direct ticket to the final gained the band starlike status in Norway and they are now one of the favourites to win the whole national final and compete for Norway in Eurovision 2010!\nimage\nThey have also found time to record their new album which is, according to the band, their strongest album to date! It's entitled &quot;Reptilian&quot; and will be released in May 2010.\n\nWith masterpiece of epic metal and heavy touring, Keep Of Kalessin is one of the bands to watch in 2010!\nGenre: Black\nSubgenre: Melodic Black / Death Metal\nBitrate: 320 k\nSize: 128.73 MB\nShow/Hide Files:\n10 files","torrent":{"xt":"urn:btih:8b3cb57acf926b99303946a600b45b8079f47c91","amp;dn":"Keep+of+Kalessin+-+Epistemology+%282015%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b3cb57acf926b99303946a600b45b8079f47c91","infoHashBuffer":{"type":"Buffer","data":[139,60,181,122,207,146,107,153,48,57,70,166,0,180,91,128,121,244,124,145]},"announce":[],"urlList":[]}}