{"title":"Crash Bandicoot 3 Warped","uid":9455184,"size":113123328,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:8b6bf82b0bb6ea2cc1b614d48614412f81efa555&amp;dn=Crash+Bandicoot+3+Warped&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"thedeathroller","files":-1,"time":1389254010,"description":"Crash Bandicoot: Warped is a platform game in which the player controls Crash and Coco Bandicoot, who must travel back in time and gather the 25 Crystals from the previous game in their original places in time before the antagonists of the story do so. Much of the game takes place in the Time-Twisting Machine, which acts as the hub area of the game. The Time-Twisting Machine is split up into five chambers; only the first chamber is initially available. Each chamber has five buttons that open portals to different levels.[2] The goal in each level is to find and obtain the Crystal hidden in the area. In some levels, the Crystal will be located at the end of a level or must be earned by completing a specific challenge.[3] Some levels contain a &quot;Bonus Platform&quot; that leads to a special bonus area, where the player must navigate through a separate area and collect everything in sight. As no lives are lost in the bonus areas, the bonus areas can be played through as often as the player desires until the bonus area can be cleared.[4] After completing all five levels in a chamber, a sixth button that opens a portal to a boss level will appear. By defeating the boss, the next chamber will become available for play.[2] When all 25 Crystals are found and all five boss characters are defeated, the game is won.[5]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Crash_Bandicoot:_Warped&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Crash_Bandicoot:_Warped&lt;/a&gt;\n\nEnjoy this torrent, i loved this game when i was a child, so i thought i would upload it im sure there are lots of people who are looking for this specific game, so enjoy :)","torrent":{"xt":"urn:btih:8b6bf82b0bb6ea2cc1b614d48614412f81efa555","amp;dn":"Crash+Bandicoot+3+Warped","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b6bf82b0bb6ea2cc1b614d48614412f81efa555","infoHashBuffer":{"type":"Buffer","data":[139,107,248,43,11,182,234,44,193,182,20,212,134,20,65,47,129,239,165,85]},"announce":[],"urlList":[]}}