{"title":"Freaked (1993) 720p BrRip x264 CLOWNSEC (PhreakyFlix)","uid":9086887,"size":2193268470,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:8ba4ca114f1ecf52bcb3c5c2d08e7835fd63fef3&amp;dn=Freaked+%281993%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"clownsec","files":-1,"time":1382509146,"description":"Freaked (1993) 720p BrRip x264 CLOWNSEC (PhreakyFlix)\n\nBy the time the pair of bloodshot, gun-toting, Rastafarian eyeballs appears, you know you're witnessing the birth of a new cult film. In the delirious Freaked, a sleazy multinational corporation hires a spoiled-rotten former child star named Ricky Coogin (Alex Winter, Bill &amp; Ted's Excellent Adventure) to be the spokesman for a toxic biochemical fertilizer. When Ricky goes down to the poverty-stricken third world country where the toxin is used, he---along with his best friend and a comely anti-corporate activist (Megan Ward, Joe's Apartment)--get sidetracked to a freakshow presented by the flamboyant Elijah C. Skuggs (Randy Quaid, Kingpin). But Skuggs doesn't just display freaks, he creates them, and Ricky is going to be his masterpiece. This is only the beginning of a crass, tasteless, and hysterical (in both senses of the word) movie. Co-writer/co-director Winter and his pals pile on joke after idiosyncratic joke (clearly influenced by the shotgun-style humor of Airplane! and Mad magazine). You can feel that they fell all over themselves with laughter when they conceived each bit--no tepid Hollywood committee would have turned a movie's love interest into a double-gendered conjoined twin or cast Mr. T as a Bearded Lady, along with such an eclectic bunch as Bobcat Goldthwait, Brooke Shields, and an uncredited Keanu Reeves. Freaked is clearly a labor of love that deserves to find its infatuated audience. This dvd features a bushel of extras, including some unjustly deleted scenes. --Bret Fetzer","torrent":{"xt":"urn:btih:8ba4ca114f1ecf52bcb3c5c2d08e7835fd63fef3","amp;dn":"Freaked+%281993%29+720p+BrRip+x264+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba4ca114f1ecf52bcb3c5c2d08e7835fd63fef3","infoHashBuffer":{"type":"Buffer","data":[139,164,202,17,79,30,207,82,188,179,197,194,208,142,120,53,253,99,254,243]},"announce":[],"urlList":[]}}