{"title":"Divekick-HI2U","uid":8884094,"size":839505855,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8bad99e1b208c7bf4bbcbbf60a951b15cc5f52fb&amp;dn=Divekick-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"Mr.Stifmeister","files":2,"time":1378407106,"description":"HI2U\n\nDivekick (c) Iron Galaxy Studios\n\nRelease Date : 5th of September, 2013\nProtection   : Steam\nType         : Action / Troll\nSize         : 17 x 50mb\n\nDescription\n\nDivekick is the worlds first two-button fighting game. It distills the essence\nof the fighting game genre into just two buttons with no d-pad directional\nmovement. Divekicks focused gameplay demonstrates how much depth a single move\nactually has, and introduces (or reinforces) skills fundamental to the genre:\nmind games, spacing, timing, and quick reactions.\n\nAt Iron Galaxy we love fighting games. To the average fan, most of what makes\nthem fun is hidden behind a never-ending series of input combinations that they\nhave to memorize. Thats why Divekick has just two buttons: Dive (into the air)\nmakes your character jump straight up. Kick causes your character to fly foot\nfirst at a downward angle. If you press Kick on the ground, you can jump away\nfrom your opponent. Utilizing these moves, the first hit will win the round, and\nthe player that wins five rounds first wins the game. Its pure adrenaline,\nawareness, and outsmarting your enemy. Its a fighting game deconstructed into\nits purest form.\n\nFeatures\n\n13 Completely unique and original characters, each with their own fighting\nstyle and special techniques. That's 91 unique match-ups to play and learn.\n\nA story for every character in the game, including an intro, ending, and rival\nbattles. You will be moved to tears\n\nRanked and non-ranked GGPO-powered online play, the most trusted netcode in\nfighting games. Includes ranking boards for each character, as well as overall.\n\nLocal VS play for two players, with quick and easy button reconfiguration to\naccommodate a room full of unique personalities.\n\nFull Steamworks integration, including Big Picture Mode\n\nInstall\n\nUnrar, mount/burn, install, copy crack from Crack folder on the DVD to where\nyou installed the game. Enjoy\n","torrent":{"xt":"urn:btih:8bad99e1b208c7bf4bbcbbf60a951b15cc5f52fb","amp;dn":"Divekick-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bad99e1b208c7bf4bbcbbf60a951b15cc5f52fb","infoHashBuffer":{"type":"Buffer","data":[139,173,153,225,178,8,199,191,75,188,187,246,10,149,27,21,204,95,82,251]},"announce":[],"urlList":[]}}