{"title":"The Figure The Classic Approach to Drawing &amp; Construction by","uid":9583887,"size":12442584,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c8cd0c4124df2540548c6a4c0e8f175dbfd3cae&amp;dn=The+Figure+The+Classic+Approach+to+Drawing+%26amp%3B+Construction+by&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"perseu","files":-1,"time":1391798643,"description":"From previous attempts you may have concluded that\ndrawing the figure is difficult. This book will show\nyou how to reduce complex figures into a variety of\nbasic shapes that are easy to master, helping you to\nreach your goal of producing lifelike drawings. Tested\nthrough years of classroom use, the principles stressed\nhere bring clear insights into drawing the human form.\nYou'll find a logical, step-by-step method for mastering\nthe construction and proportions of all figure types.\nFirst the basic forms are analyzed - the proportions of\nthe various parts and their relations to the total figure.\nYou'll then learn how these parts are connected and how\nthey move and find exercises in drawing the complete figure\nin any position, engaged in a variety of activities.\nAlso included are detailed studies of anatomy - examining\nbone and muscle structure - plus special instructions for\ndrawing such intricate parts of the body as the head,\nhands and feet. You'll learn:\n\n\nHow relative body proportions change at different ages\n\nHow bones and muscles affect the surface of the figure\n\nHow to create many types of faces from the same model\n\nHow different lighting angles affect facial shadows\n\nHow to select the most descriptive pose\n\n&quot;Concentrate on this basic form figure until you can do\nanything you want with it. Draw it in as many positions\nas possible,&quot; Walt Reed says in his introduction.\n&quot;Practice of this kind will help train your hand and your\nmind in the proportions, construction, and relationships\nof the individual forms so that you will never forget them.&quot;\n\nThe Figure: The Classic Approach\nto Drawing &amp; Construction\nBy: Walt Reed\nISBN13: 9780891340973\nFormat: EPUB\nLanguage: EN\nPages: 210","torrent":{"xt":"urn:btih:8c8cd0c4124df2540548c6a4c0e8f175dbfd3cae","amp;dn":"The+Figure+The+Classic+Approach+to+Drawing+%26amp%3B+Construction+by","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c8cd0c4124df2540548c6a4c0e8f175dbfd3cae","infoHashBuffer":{"type":"Buffer","data":[140,140,208,196,18,77,242,84,5,72,198,164,192,232,241,117,219,253,60,174]},"announce":[],"urlList":[]}}