{"title":"CCNA Video Mentor - 640-802 2nd Edition - Full ISO image","uid":4404045,"size":1408419840,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8d38e7fb7fe78e8281fac9e00daed9e69ee5684f&amp;dn=CCNA+Video+Mentor+-+640-802+2nd+Edition+-+Full+ISO+image&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"shemyaza","files":1,"time":1221852075,"description":"CCNA Video Mentor: (CCNA Exam 640-802) (Video Learning), 2nd Edition\n\nMore than four hours of personal, visual instruction\n\nCCNA 640-802\n\nWendell Odom, CCIE No. 1624\n\nCCNA Video Mentor is a unique video product that provides you with more than four hours of personal visual instruction from best-selling author and instructor Wendell Odom. In the 20 videos presented on the DVD, Wendell walks you through common Cisco router and switch configuration topics. Designed to develop and enhance hands-on skills, each video guides you through essential configuration tasks for both the CCENT and CCNA certification exams, including router and switch configuration, IP subnetting, RIP, OSPF, and EIGRP configuration, configuring VLANs, IPv6, PAT, PPP and CHAP, and access lists.\n\nLab Layout:\n\nEach video lab presents suggested reading lists, detailed objectives, lab diagrams, and video captures. Audio instruction throughout offers tips and shortcuts that truly make learning easy.\n\nNetwork Animation:\n\nAnimated network diagrams show you lab setup, device addressing, and how traffic flows through the network.\n\nCommand-Line Interface (CLI) Video:\n\nVideo screencasts of router and switch CLI demonstrate command entry, configuration techniques, and device response.\n\nCategory: Cisco Certification\n\nCovers: CCNA Exam 640-802\n\nWendell Odom, CCIE No. 1624, splits time between writing books for Cisco Press and teaching authorized Cisco classes for Skyline ATS (www.skyline-ats.com). He has been involved with the networking industry for more than 25 years and was one of the first certified Cisco instructors. Additionally, Wendell has worked as a network engineer and as both a pre-sales and post-sales technical consultant. His current titles include the best-selling CCNA Official Exam Certification Library (CCNA Exam 640-802), Third Edition, as well as exam certification titles for the QoS and CCIE R/S written exams.\n\nThis product is part of the Cisco Press Video Mentor Series. The video products in this series present expert training from industry-leading instructors and technologists. This dynamic learning environment combines animations, screencasts, and audio instruction to help users bridge the gap between conceptual knowledge and hands-on application.\n\nICND1\n\nLab 1: Navigating a Router/Switch Command-Line Interface (Video Length: 12:50)\n\nLab 2: Router Configuration and Managing Configuration Files (Video Length: 12:15)\n\nLab 3: Switch Basics: Learning, Forwarding/Filtering, and Interface Settings(Video Length: 10:32)\n\nLab 4: Finding the Subnet Number (Video Length: 6:03)\n\nLab 5: Finding the Broadcast Address and Range of Addresses in a Subnet(Video Length: 8:44)\n\nLab 6: Finding All Subnets of a Network with Less Than 8 Subnet Bits (Video Length: 7:15)\n\nLab 7: IP Subnet Design and Implementation (Video Length: 15:13)\n\nLab 8: Static and Connected Routes (Video Length: 13:15)\n\nLab 9: RIP Configuration (Video Length: 13:54)\n\nICND2\n\nLab 1: Configuring VLANs (Video Length: 10:10)\n\nLab 2: VTP Servers and Clients (Video Length: 15:44)\n\nLab 3: RIP with Split Horizon, Route Poisoning, and Poison Reverse (Video Length: 12:22)\n\nLab 4: Single Area and Multi-area OSPF Configuration (Video Length: 18:02)\n\nLab 5: EIGRP Configuration and Operation (Video Length: 11:33)\n\nLab 6: Understanding EIGRP Metric Calculations (Video Length: 12:26)\n\nLab 7: NAT Overload (PAT) (Video Length: 13:27)\n\nLab 8: IPv6 Subnetting and Address Configuration (Video Length: 18:16)\n\nLab 9: PPP and CHAP Configuration (Video Length: 12:25)\n\nLab 10: Access Lists (Video Length: 9:32)\n\nLab 11: Access Lists II (Video Length: 10:43)\t\t","torrent":{"xt":"urn:btih:8d38e7fb7fe78e8281fac9e00daed9e69ee5684f","amp;dn":"CCNA+Video+Mentor+-+640-802+2nd+Edition+-+Full+ISO+image","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d38e7fb7fe78e8281fac9e00daed9e69ee5684f","infoHashBuffer":{"type":"Buffer","data":[141,56,231,251,127,231,142,130,129,250,201,224,13,174,217,230,158,229,104,79]},"announce":[],"urlList":[]}}