{"title":"Black Swan Theory by Steven Holl and Michael Bell[MyeBookShelf]","uid":11192462,"size":14337031,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d3d34595a0eacb3dca0bf207d378fb1d9cf0b50&amp;dn=Black+Swan+Theory+by+Steven+Holl+and+Michael+Bell%5BMyeBookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1413019949,"description":"Black Swan Theory by Steven Holl and Michael Bell[MyeBookShelf] \n\n=======================================================\n             =                Find good eBooks on                  =\n             =             &lt;a href=&quot; http://www.MyeBookShelf.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.MyeBookShelf.net&lt;/a&gt;            =        \n             =======================================================\n\n\nHouse: Black Swan Theory by Steven Holl and Michael Bell\nEnglish | 2007 | ISBN: 1568985878 | 176 pages | PDF | 14 MB\n\nIn 1989, Princeton Architectural Press published Anchoring, the first book on the work of the then up-and-coming architect Steven Holl. Since then, Holl has become one of the most famous and highly regarded architects in the world through his award-winning residential and institutional work; his teaching, writings, and drawings; and his persistent vision of an architecture that takes into consideration its place, time, and all the senses of the viewer.\n\nThis philosophy helped to create some of the richest and most celebrated buildings of the past several decades. Indeed, in 2001, Time magazine called Holl &quot;America's Best Architect for 'buildings that satisfy the spirit as well as the eye.'&quot;\n\nSequels to AnchoringIntertwining and Parallaxchronicled Holl's work from the period 1988 to 1995. House brings us up-to-date on Holl's most recent residences and collects his best-known projects from the past including a total of fifteen of Holl's residential works. Rather than having an unvarying style, these houses aim at the sometimes elusive ideal of the specific. Each house tackles a different design challenge, using site as the physical and metaphysical foundation upon which to build. Fusing building and situation, Holl creates a unique expression in each home. Beautiful andinnovative, the houses span the globe, ranging from a secluded location in Hawaii, to the Catskill Mountains of New York, to Martha's Vineyard, to the Hague in the Netherlands. Each project is accompanied by Holl's charming watercolor building studies as well as an insightful explanation of how he was inspired by the land upon which the house sits and how the sumptuous materials utilized reflect the spirit of the location.\n","torrent":{"xt":"urn:btih:8d3d34595a0eacb3dca0bf207d378fb1d9cf0b50","amp;dn":"Black+Swan+Theory+by+Steven+Holl+and+Michael+Bell%5BMyeBookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d3d34595a0eacb3dca0bf207d378fb1d9cf0b50","infoHashBuffer":{"type":"Buffer","data":[141,61,52,89,90,14,172,179,220,160,191,32,125,55,143,177,217,207,11,80]},"announce":[],"urlList":[]}}