{"title":"Standup Comedy - Myq Kaplan - Small, Dork, and Handsome (2014)","uid":11654292,"size":135894194,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8d6a8a873e5698b71adc5a0c778bfb7e46672f2d&amp;dn=Standup+Comedy+-+Myq+Kaplan+-+Small%2C+Dork%2C+and+Handsome+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"rambam1776","files":-1,"time":1417911728,"description":"---------------------------------------------------------------------\n               Myq Kaplan - Small, Dork, and Handsome\n---------------------------------------------------------------------\n\nArtist...............: Myq Kaplan\nAlbum................: Small, Dork, and Handsome\nGenre................: Comedy\nYear.................: 2014\nCodec................: LAME 3.99\nVersion..............: MPEG 1 Layer III\nQuality..............: CBR 256, (avg. bitrate: 256kbps)\nChannels.............: Stereo / 44100 hz\nTags.................: ID3 v1.1, ID3 v2.3\n &lt;a href=&quot;\nhttp://myqkaplan.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://myqkaplan.com/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://bayimg.com/mAIgBAagg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/mAIgBAagg&lt;/a&gt;\n\n---------------------------------------------------------------------\n                       Tracklisting\n---------------------------------------------------------------------\n\n   1. Myq Kaplan - Comedy, Jazz, or Poetry                    [03:35]\n   2. Myq Kaplan - Necrophilia, Pedophilia, and Bestiality    [02:34]\n   3. Myq Kaplan - A Swastika, a Barista, and the Magic of Photography[03:51]\n   4. Myq Kaplan - Ducklings, Cheerleaders, and Legal Proceedings[02:11]\n   5. Myq Kaplan - Ham and Cheese and Philosophy              [03:08]\n   6. Myq Kaplan - Buddhism, Feminism, and Math               [03:24]\n   7. Myq Kaplan - Adam and Eve and Vegans                    [02:22]\n   8. Myq Kaplan - Gay Parents, Mythology, and the Manliest Man Possible[03:46]\n   9. Myq Kaplan - Horses, Pregnant Men, and Don't Listen to This Track, Grandma![04:08]\n  10. Myq Kaplan - Batman, Bat-men, and Google                [02:03]\n  11. Myq Kaplan - Television, Doctors, and Snakes            [02:25]\n  12. Myq Kaplan - Fun, Statistics, and Lana Backwards        [03:33]\n  13. Myq Kaplan - Ham and Cheese and Time Travel             [02:39]\n  14. Myq Kaplan - Sports, Analogies, and Copyright Infringement[02:21]\n  15. Myq Kaplan - Jews, Goys, and Elevators                  [03:34]\n  16. Myq Kaplan - Sleeping, Driving, and Pasta               [02:29]\n  17. Myq Kaplan - The Wright Brothers, an Alternative to Radiation, and Horses Again[04:10]\n  18. Myq Kaplan - Fist Bumps, Duck Heads, and Don't Listen to This One Either, Grandma![02:26]\n  19. Myq Kaplan - Back to the Future, Groundhog Day, and Hitler[04:47]\n  20. Myq Kaplan - A Butcher, a Vegan, and the Internet (Bonus Track)[07:57]\n\nPlaying Time.........: 01:07:35\nTotal Size...........: 129.33 MB\n\nMyq Kaplan has returned and it's fun to once again check in on our favorite &quot;Small, Dork, and Handsome&quot; comedian. If you're already a fan of Kaplan's, then you know what to expect: Rapid-fire, smart comedy from a guy who occasionally works himself up into a frenzy and immediately calms himself with a mumbled aside, all in the matter of milliseconds. He's a comedian who doesn't slow down to make sure you're keeping up but instead plows through at full speed and dares you to stay with him.\n\nThis is someone who's been steadily dropping albums on an annual basis and if you're a fan of comedy you know that's a rarity (especially when the comedian in question is able to keep up the quality level along with the quantity). A few of Kaplan's bits from his last album, Meat Robot, bleed over and find their way onto this new CD, but it's not a game changer and I can't hate on someone for doing a slightly different version of what's worked in the past. It happens with musicians all the time: A new version of a hit? Sure, I'll take it. So when Kaplan revisits a couple of jokes that still work well, I don't see anything wrong with that.\n\nKaplan has always been a smart comic and this time around he manages to delve deeper than ever before. He begins by musing on the very essence of comedy and the fact that it's the only art form that has to be good in order to even be the thing that it claims to be. Deep, yeah, but you have to admit he has a point. This, countered with his theories on time travel (and why Back to the Future didn't need to end the way it did) and a ham and cheese story that concludes eight tracks later, shows that we're not just going for laughs. We're going for laughs that are thought out; mapped and plotted as if written by George Clooney and the rest of his Ocean's gang.\n\nEmbracing the theme of timeline-hopping, Kaplan begins his set with the end (&quot;In conclusion, a joke about time travel. But first, everything else&quot;) and it's a great callback that works well when we finally get around to what we started off with by beginning at the end. He keeps us on our toes by putting off what he's trying to get to and teasing us about eventually getting to his joke that &quot;puts the &quot;fist&quot; in 'sophisticated.'&quot;\n\nI'm sure I'm not doing it justice with my explanation but trust me when I tell you that no matter where we are on the linear map, there are a lot of great laughs to be had along the way. Kaplan displays the proper way to Google something while you happen to be inside the internet giant's building and smugly shows how women are screwing up feminism (or, as he puts it, &quot;feMANism&quot;). He's got the best idea for a tattoo that incorporates a Post-It note and few people can dance around the topic of throwing babies into dumpsters and get away with it as cleanly as he does.\n\nMyq Kaplan is a man of ideas. Most of them are punctuated with a laugh you didn't see coming and some of them prove how Jews win things through math and/or trickery, but they all leave you wondering if these are the rantings of a madman or a comedy genius. The answer, of course, is yes","torrent":{"xt":"urn:btih:8d6a8a873e5698b71adc5a0c778bfb7e46672f2d","amp;dn":"Standup+Comedy+-+Myq+Kaplan+-+Small%2C+Dork%2C+and+Handsome+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d6a8a873e5698b71adc5a0c778bfb7e46672f2d","infoHashBuffer":{"type":"Buffer","data":[141,106,138,135,62,86,152,183,26,220,90,12,119,139,251,126,70,103,47,45]},"announce":[],"urlList":[]}}