{"title":"Mosby's Pocketbook of Mental Health, 2E [PDF][StormRG]","uid":11732892,"size":1809294,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8d86f86c198823b455ee5c091f3d5bdd0be158eb&amp;dn=Mosby%27s+Pocketbook+of+Mental+Health%2C+2E+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"0xmovva","files":2,"time":1425454835,"description":"TITLE/EDITION Mosby's Pocketbook of Mental Health, 2e \nBy: Eimear Muir-Cochrane BSc(Hons) RN CMHN GradDip-Adult Ed MNS PhD FACMHN MACN (Author), Patricia Barkway RN CMHN FACMHN BA MSc(PHC) (Author), Debra Nizette RN Credentialed MHN DipAppSc(Nursing Ed) BAppSc(Nursing) MNurStudies FRCNA FACMHN (Author)\nPaperback: 218 pages\nPublisher: Mosby; 2 edition (October 8, 2014)\nLanguage: English\nISBN-10: 0729541908\nISBN-13: 978-0729541909\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n___________________________________________________________________________________\n\n\nPerfect For:\n\n- Nursing Students\n- Health Care Professionals\n- Social Service Professionals\nMosby's Pocketbook of Mental Health 2nd Edition written by leading professional nurses and academics, Professor Eimear Muir-Cochrane, Patricia Barkway and Debra Nizette, is a convenient reference guide for nursing students and health professionals required to respond to individuals in crisis.\n\nThis user-friendly pocket guide from Muir-Cochrane, Barkway and Nizette delivers practical strategies and skills for nursing students and professionals, general practitioners, paramedics, police and allied health workers to implement. With a focus on social inclusion, recovery, culture and the promotion of consumer rights, this mental health textbook plays a pivotal guide for holistic modern health care practices.\n\nBenefit from the updated content of Mosby's Pocketbook of Mental Health 2nd Edition, which features a new opening chapter, the latest research and evidence (including the recently released National Practice Standards), tips for a successful clinical placement and guidance on psychiatric medications.\n\nMuir-Cochrane, Barkway and Nizette have delivered an exemplary mental health textbook that provides students and professional nurses with helpful &quot;dos and don'ts&quot; and &quot;what to do&quot; in commonly encountered medical circumstances.\n\n. Written specifically for Australian and New Zealand contexts.\n\n. Hands-on and inclusive strategies enable readers to develop practical skills.\n\n. Convenient size and user-friendly layout that offers readers immediate access to information","torrent":{"xt":"urn:btih:8d86f86c198823b455ee5c091f3d5bdd0be158eb","amp;dn":"Mosby%27s+Pocketbook+of+Mental+Health%2C+2E+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d86f86c198823b455ee5c091f3d5bdd0be158eb","infoHashBuffer":{"type":"Buffer","data":[141,134,248,108,25,136,35,180,85,238,92,9,31,61,91,221,11,225,88,235]},"announce":[],"urlList":[]}}