{"title":"NIK-SOFTWARE-SILVER-EFEX- PRO-V2.0.0.0","uid":6333394,"size":34777656,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8d9064101809dc25520a3ccce6dd499c66ad94f6&amp;dn=NIK-SOFTWARE-SILVER-EFEX-+PRO-V2.0.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"rico200","files":5,"time":1303371904,"description":"Powerful All-in-One\nBlack and White Workflow\n\n \n\nWhether you are a professional or a hobbyist yearning for those days in the darkroom,\n\nSilver Efex Pro 2 gives you all the power and control you need to create high\n\nquality black and white images.\n\n\nIn the past, black and white tools often meant compromising on the quality of the\n\nconversion or required a complex and lengthy multi-step process that didn't ensure\n\npredictable results. We set out to create a single workflow solution that provides\n\neverything you need for the highest quality results.\n\n \nGreat beginnings\n\n\nStart with dozens of visual presets as starting points. If you like what you see,\n\nyou're done. If you want to go further, use an extensive set of global controls such as\n\nbrightness, contrast, saturation, structure, film types, toning, and much more to craft your image.\n\n \nSelective editing and finishing touches\n\n\nFor the ultimate in selective enhancements, look no further than the revolutionary U Point technology for incredibly precise selections and adjustments. You can even use the Zone Map built into the software to help guide your edits. Finally, add a vignette, burn in the edges, or add a natural image border to finish your black and white masterpiece. Experimenting is fast and fun, especially with the ability to compare different editing states with the brand new History Browser.\n\n \nLooking to the future\n\n\nYou'll discover that although black and white photography is nearly 200 years old, Silver Efex Pro 2 gives you the very best of that legacy in one easy-to-use tool, plus new capabilities that make it possible to do more than ever before. What will you do with it?","torrent":{"xt":"urn:btih:8d9064101809dc25520a3ccce6dd499c66ad94f6","amp;dn":"NIK-SOFTWARE-SILVER-EFEX-+PRO-V2.0.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d9064101809dc25520a3ccce6dd499c66ad94f6","infoHashBuffer":{"type":"Buffer","data":[141,144,100,16,24,9,220,37,82,10,60,204,230,221,73,156,102,173,148,246]},"announce":[],"urlList":[]}}