{"title":"White Girl Bleed A Lot : The Return of Racial...- Colin Flaherty","uid":11904784,"size":4027726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8db104e4e82a711422583879f62ee6a1819a0e95&amp;dn=White+Girl+Bleed+A+Lot+%3A+The+Return+of+Racial...-+Colin+Flaherty&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"MANTESH","files":2,"time":1431372388,"description":"\n\n'White Girl Bleed A Lot': The Return of Racial Violence to America and How the Media Ignore It - Colin Flaherty\n\nPublisher: WND Books; 1 edition  \n2013\nLanguage: English\nISBN-10: 1938067061\nISBN-13: 978-1938067068\n\nFerguson might be the worst, but it is not the first.  Ferguson is just the latest of hundreds of examples of black mob violence around the country.\n\nWhite Girl Bleed a Lot: The return of racial violence and how the media ignore it  was written for the deniers: Reporters and public officials and others who deny black mob violence has reached epidemic levels.\n\nThat is why so many readers get another copy: They send it to someone who needs to read it.\n\nDenial is not an option any more. Many of these cases are now on YouTube. \nAnd for the first time, readers will be able to scan QR codes to follow the black mob violence on video as they read about it in the book.\n\nFor the first time, readers will be able to see the huge difference between what big city newspapers say is happening. And what the videos show is really happening.\n\nThe new edition of White Girl Bleed a Lot documents more than 500 cases of black mob violence in more than 100 cities around the country. Many in 2013. And how the local and national media ignore, excuse and even condone it.\n\nWriting in National Review, Thomas Sowell said: &quot;Reading Colin Flaherty's book made painfully clear to me that the magnitude of this problem is greater than I had discovered from my own research. He documents both the race riots and the media and political evasions in dozens of cities.&quot;","torrent":{"xt":"urn:btih:8db104e4e82a711422583879f62ee6a1819a0e95","amp;dn":"White+Girl+Bleed+A+Lot+%3A+The+Return+of+Racial...-+Colin+Flaherty","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8db104e4e82a711422583879f62ee6a1819a0e95","infoHashBuffer":{"type":"Buffer","data":[141,177,4,228,232,42,113,20,34,88,56,121,246,46,230,161,129,154,14,149]},"announce":[],"urlList":[]}}