{"title":"Spitfire Audio Albion II Loegria [Kontakt]","uid":9454688,"size":34858601195,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8dc2466bd7f437514a3245a494d4c2fe9e32b5de&amp;dn=Spitfire+Audio+Albion+II+Loegria+%5BKontakt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":8,"uploader":"elitistinen","files":-1,"time":1389240253,"description":"Following in the huge success of the thundering Albion I - Epic Cinematic Tools - Spitfire are delighted to announce Albion II - Loegria. Ablion II is designed as a stand-alone tool, and everything you would need to write beautiful and esoteric film scores out-of-the-box. We are excited to present an incredible Chamber sized String group of the first call session players in the UK, again designed as High and Low Ensembles. At last this intimate sound is available with Spitfire's mic mixing ability, and with strings that concentrate also on an array of additional techniques not found in Albion I, and woods and brass that centre more on &quot;choral&quot; use of such sections. Loegria is a must buy for Albion users wishing to expand on the possibilities of that broad &amp; thumping tool-set, but also stands alone as a superb tool for creating intimate scores.\n\nALBION ORCHESTRA - As with Albion I, everything is recorded at Air-Studios Lyndhurst Hall through the finest and rarest vintage valve and ribbon mics onto 2&quot; tape. Every patch is available with four way mic control and all shorts patches work with the newly enriched &quot;Ostinatum&quot; v3 gadget. We have a mixture of true legato, longs, and shorts patches, the latter of which are recorded with 4 round robins.\n\nKONTAKT 5.2 and above\n\nSEED AFTER YOU FINISH!","torrent":{"xt":"urn:btih:8dc2466bd7f437514a3245a494d4c2fe9e32b5de","amp;dn":"Spitfire+Audio+Albion+II+Loegria+%5BKontakt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc2466bd7f437514a3245a494d4c2fe9e32b5de","infoHashBuffer":{"type":"Buffer","data":[141,194,70,107,215,244,55,81,74,50,69,164,148,212,194,254,158,50,181,222]},"announce":[],"urlList":[]}}