{"title":"SAS 9.2 | September 2012","uid":7045274,"size":3318509185,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8dfa48c44d9a3ac992582f3c28b361ec2ed8cb61&amp;dn=SAS+9.2+%7C+September+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Doubzstep","files":-1,"time":1329724157,"description":"SAS 9.2 will work on Windows PC's running XP, Vista (ew), and 7 for x86 and x64 architectures. \nPIC: http://i1117.photobucket.com/albums/k585/JugzG0nn4G3tY4/sas.jpg\n\nInstall SAS 9.2 for Windows XP/Vista\nPURPOSE\nInstructions for installing SAS 9.2 via the UCSF network.\n\n\t\nBefore You Install\n\n\t\n-  You must have Windows administrative rights on your computer, or have your Windows system administrator on site to assist you.\n-  Uninstall any previous versions or evaluation copies of the software.\n-  Close all open applications.\n-  Disable any virus scanning software on your computer.\n-  You must be connected to the UCSF network and confirm that the UCSF DNS is included in your network configuration:\n     1. Right-click on My Network Places and select Properties\n     2. Right-click on Local Area Connections and select Properties\n     3. Click on Internet Protocol (TCP/IP) and select Properties\n     4. Click Advanced and select DNS tab\n     5. Check to see if &quot;ucsf.edu&quot; is listed as a DNS suffix\n     6. If it is not listed, add it and restart your computer as directed\n\n\t\nInstallation Instructions\n\n\t\nOpen My Computer and from the Tools menu, select Map Network Drive.\nFor folder, enter \\\\rsl.library.ucsf.edu\\sas9.2win\nClick Connect using a different user name.\nFor the User name, enter sasuser. For the Password, enter the password you received in an email from RSL (note: these passwords expire every week on Sunday night).\nClick OK, then click Finish.\nThe SAS Deployment Wizard will start automatically. You will be prompted to choose a language for your installation.\nAt the next screen, choose Install SAS Software and click Next.\nSelect the products you want to install. By default, all the modules available under our license (except the advanced modules) are checked. Click Next when you're ready to proceed.\nYou will be prompted for a SAS Installation Data File. You do not need to change anything. Just click Next to continue.\nClick Start to begin installing the software. Keep in mind that the installation can take a long time (up to an hour). The installer will first run the System Requirements Wizard, which may need to update your system. After that, you will be prompted if the installer needs any more information from you.\nOnce the software has been installed, you will be given the option to send information about your installation to SAS.\nWhen your installation is complete, launch the SAS application to make sure it was installed properly.\nTo disconnect from the download server, open My Computer and from the Tools menu, select Disconnect Network Drive.\nPlease contact RSL Help if you have any questions or problems.\n\nFurther info: http://www.sas.com/software/sas9/\n \n*************************************************************************************\nInstructions:\n\n01. Mount .iso using favorite client.\n02. Disconnect from interwebs.\n03. Set computer date back three years (any time after June 2008 but before June 2009)\n04. Install. (takes a loooooong time)\n05. When asked for SID, use the text file called &quot;ORIGINAL SID (June2009)&quot;\n06. After install is complete, you can now reconnect interwebs and set system date back to original time.\n07. Search for &quot;Renew SAS Software&quot; Run as Administrator. \n08. Select the &quot;Sept2012&quot; text file.\n09. Done!\n\nEnjoy.\n\n-Doubzstep\n(first torrent!)","torrent":{"xt":"urn:btih:8dfa48c44d9a3ac992582f3c28b361ec2ed8cb61","amp;dn":"SAS+9.2+%7C+September+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfa48c44d9a3ac992582f3c28b361ec2ed8cb61","infoHashBuffer":{"type":"Buffer","data":[141,250,72,196,77,154,58,201,146,88,47,60,40,179,97,236,46,216,203,97]},"announce":[],"urlList":[]}}