{"title":"Goal - A process of continuous improvement -Eliyahu Goldratt [Qw","uid":7905491,"size":630969,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8dfcf39fe15b7e6ce1dd5287390b233b6fb737f0&amp;dn=Goal+-+A+process+of+continuous+improvement+-Eliyahu+Goldratt+%5BQw&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"KatQwerty","files":3,"time":1355084393,"description":"Written in a fast-paced thriller style, The Goal is the gripping novel which is transforming management thinking throughout the Western world. The author has been described by Fortune as a 'guru to industry' and by Businessweek as a 'genius'. It is a book to recommend to your friends in industry - even to your bosses - but not to your competitors. \n\nAlex Rogo is a harried plant manager working ever more desperately to try and improve performance. His factory is rapidly heading for disaster. So is his marriage. He has ninety days to save his plant - or it will be closed by corporate HQ, with hundreds of job losses. It takes a chance meeting with a colleague from student days - Jonah - to help him break out of conventional ways of thinking to see what needs to be done. \n\nThe story of Alex's fight to save his plant is more than compulsive reading. It contains a serious message for all managers in industry and explains the ideas which underline the Theory of Constraints (TOC) developed by Eli Goldratt. Eliyahu M. Goldratt is an internationally recognized leader in the development of new business management concepts and systems, and acts as an educator to many of the world's corporations. The 20th anniversary edition includes a series of detailed case study interviews by David Whitford, Editor at Large, Fortune Small Business, which explore how organizations around the world have been transformed by Eli Goldratt's ideas.","torrent":{"xt":"urn:btih:8dfcf39fe15b7e6ce1dd5287390b233b6fb737f0","amp;dn":"Goal+-+A+process+of+continuous+improvement+-Eliyahu+Goldratt+%5BQw","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfcf39fe15b7e6ce1dd5287390b233b6fb737f0","infoHashBuffer":{"type":"Buffer","data":[141,252,243,159,225,91,126,108,225,221,82,135,57,11,35,59,111,183,55,240]},"announce":[],"urlList":[]}}