{"title":"Wheat Belly (Unabridged)  -  Dr William Davis .m4b","uid":6938447,"size":481204241,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8eb560f01aa351610357079233cc876043de1ad8&amp;dn=Wheat+Belly+%28Unabridged%29++-++Dr+William+Davis+.m4b&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"stu1000","files":1,"time":1325917060,"description":"The wheat of today is not the wheat of even 30 years ago, it is all genetically modified and is making us very ill. Even organic wheat and pasta wheat is genetically modified. \n\nDr Davis explains how we are becoming obese, suffering strokes, heart attacks, arthritis, mental illnesses, diabetes and many other illnesses all because of just eating wheat.  Wheat also contains opiate like substances that make you crave it. It destroys the lining of the gut making it porous even in people with no symptoms.\n\nWheat makes us crave more, it spikes our blood sugar and then 2 hours later you become hungry again.  It is much much worse for our health than even eating sugar, it raises our blood sugar levels higher.\n\nYet every diabetic organisation in the modern world recommends 'healthy whole grains', but in the case of wheat there are no 'healthy whole grains'.  Modern wheat, since the mid 1980's makes many obese and diabetic.  And if you are not obese or diabetic the chances of becoming both are almost guaranteed at somepoint in the future if you continue to eat wheat. \n\nThis very important book is in ipod book format .mb4  I can make it into mp3 format if you ask for it as well.","torrent":{"xt":"urn:btih:8eb560f01aa351610357079233cc876043de1ad8","amp;dn":"Wheat+Belly+%28Unabridged%29++-++Dr+William+Davis+.m4b","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eb560f01aa351610357079233cc876043de1ad8","infoHashBuffer":{"type":"Buffer","data":[142,181,96,240,26,163,81,97,3,87,7,146,51,204,135,96,67,222,26,216]},"announce":[],"urlList":[]}}