{"title":"Satellite Reign (v2.8.0.12) [GOG]","uid":15584611,"size":1043342540,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8eb78ba072489ecc6d58d6a900825addaa133d3e&amp;dn=Satellite+Reign+%28v2.8.0.12%29+%5BGOG%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"ojusko","files":7,"time":1471447569,"description":"Install instructions:\r\n- Run &quot;setup_satellite_reign_2.8.0.12.exe&quot;\r\n- Play\r\n\r\nChangelog for Patch 1.13.06 / GOG-12 (added 16 August 2016): \r\n- We've just released an update for Satellite Reign. This build contains some significant changes to the networking backend. Basically, it allows players to connect to one another directly, rather than via the Unity relay servers (though the relay servers are still there as a fallback). This not only allows for significantly lower latency, but it should also get around some player's inability to play together from different regions. \r\n- Having said that, while this should allow friends in different regions to connect, they still won't show up in the default server list. However, if you change your filter to &quot;Friends&quot; you should see any games being hosted by people on your friends list, regardless of their region. \r\n- When you're connected, you'll see one of the following in the menu, next to the version number: \r\n- [DC] - Direct connection. Exactly as it sounds, you're communicating with the host directly over the internet. \r\n- [PT] - NAT Punch-through. A service hosted on our own server facilitates the connection between the client and host, after which point they will communicate directly. \r\n- [RL] - The Unity Relay servers. This is the existing communication method, where all traffic is routed through Unity's relay servers.\r\n\r\nTitle: SATELLITE REIGN\r\nGenre: Action - Strategy - Sci-fi\r\nWorks on: Windows (7, 8)\r\nLanguages: Audio and text: English\r\nModes: Single-player\r\nReleased: August 28, 2015\r\nSize: 560 MB\r\nCompany: 5 Lives Studios / 5 Lives Studios\r\nStore page: https://www.gog.com/game/satellite_reign\r\n\r\nAbout:\r\nSatellite Reign is a real-time, class-based strategy game. You control a team of four agents, each with distinct and unique abilities, collectively battling for control of a simulated, living cyberpunk city.\r\nCustomise your team with the strength to destroy your enemies head-on, or hack into their facilities to manipulate their infrastructure without them ever knowing you were even there.\r\nWill you take down your enemies with brute-force? Covert espionage and infiltration? Or will you use propaganda to influence the citizens of the city and overthrow the controlling powers?\r\nThe world's governments are controlled by mega-corporations, democracy to the highest bidder. Society is structured for the benefit of those in power. The poor exist in the dark squalid underbelly of the city, while the wealthy swim in opulence and luxury on the upper tiers, and the vast middle-class are too comfortable with their lives of convenience to see the world for what it really is. Corporate police patrol the streets, brutally maintaining the status quo, all under the guise of keeping the people safe. The time for change is now, as a mysterious organisation rises from the slums of the city. They'll have to bribe, steal, hack, kill and augment their way through the barriers between them and their ultimate goal...but what are they trying to achieve? To free the masses from the corporate stranglehold, or to take control for themselves? That, is up to you.\r\n\r\nMinimum system requirements - Windows: Windows 7 or later\r\nProcessor: x86 Dual Core 2.4 GHz \r\nMemory: 3 GB RAM \r\nGraphics: DirectX 9 GPU with 1GB of memory \r\nDirectX: Version 9.0c \r\nHard Drive: 2 GB available space\r\n\r\nRecommended system requirements - Windows: Windows 7 or later\r\nProcessor: x86 Quad Core 3.4GHz or greater \r\nMemory: 4 GB RAM \r\nGraphics: DirectX 11 GPU with 2GB of memory \r\nDirectX: Version 11 \r\nHard Drive: 2 GB available space","torrent":{"xt":"urn:btih:8eb78ba072489ecc6d58d6a900825addaa133d3e","amp;dn":"Satellite+Reign+%28v2.8.0.12%29+%5BGOG%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8eb78ba072489ecc6d58d6a900825addaa133d3e","infoHashBuffer":{"type":"Buffer","data":[142,183,139,160,114,72,158,204,109,88,214,169,0,130,90,221,170,19,61,62]},"announce":[],"urlList":[]}}