{"title":"Live Long, Die Short - A Guide to Authentic Health and Successfu","uid":9846173,"size":1322758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ef17a1e7718f89def40bd9cc7b920ba7df4372f&amp;dn=Live+Long%2C+Die+Short+-+A+Guide+to+Authentic+Health+and+Successfu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"AtomTPB","files":1,"time":1396078006,"description":"Pages: 264 pages\nPublisher: Greenleaf Book Group Press; 1 edition (January 14, 2014)\nLanguage: English\nISBN-10: 1626340390\nISBN-13: 978-1626340398\n\n\n\nA rousing call to rethink the aging process\nOver a decade ago, a landmark ten-year study by the MacArthur Foundation shattered the stereotypes of aging as a process of slow, genetically determined decline. Researchers found that that 70 percent of physical aging, and about 50 percent of mental aging, is determined by lifestyle, the choices we make every day. That means that if we optimize our lifestyles, we can live longer and ''die shorter''--compress the decline period into the very end of a fulfilling, active old age.\n\nDr. Roger Landry and his colleagues have spent years bringing the MacArthur Study's findings to life with a program called Masterpiece Living. In Live Long, Die Short, Landry shares the incredible story of that program and lays out a path for anyone, at any point in life, who wants to achieve authentic health and empower themselves to age in a better way.\n\nWriting in a friendly, conversational tone, Dr. Landry encourages you to take a ''Lifestyle Inventory'' to assess where your health stands now and then leads you through his ''Ten Tips,'' for successful aging, each of which is backed by the latest research, real-life stories, and the insights Landry--a former Air Force surgeon and current preventive medicine physician--has gained in his years of experience.\n\nThe result is a guide that will reshape your conception of what it means to grow old and equip you with the tools you need to lead a long, healthy, happy life.","torrent":{"xt":"urn:btih:8ef17a1e7718f89def40bd9cc7b920ba7df4372f","amp;dn":"Live+Long%2C+Die+Short+-+A+Guide+to+Authentic+Health+and+Successfu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ef17a1e7718f89def40bd9cc7b920ba7df4372f","infoHashBuffer":{"type":"Buffer","data":[142,241,122,30,119,24,248,157,239,64,189,156,199,185,32,186,125,244,55,47]},"announce":[],"urlList":[]}}