{"title":"Cute Knight","uid":9519114,"size":11866112,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8f115030c0f6fc26106960333366ee84a74dbb5b&amp;dn=Cute+Knight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Rafeweisz","files":1,"time":1390595436,"description":"Cute Knight ~ Kishi Kawaii\n\nAn orphan girl searches for her destiny... Train in jobs and classes to raise skills, make friends, and find romance - then use those skills to conquer the monsters in the dungeon. Design and dress your unique character to reach one of fifty storybook endings.\n\nA princess or a pauper? It's all up to you!\n\n--------------------------------------------\n\nCute Knight is a life simulation/role-playing video game where the player takes the role of Michiko from 18 to 21. The game uses stats which determine how well she does in various tasks and her combat ability. In addition, her stats and key events determine the jobs she is able to do. The goal of the game is to unlock unlockable content and various endings, particularly good endings. The game ends after three years unless a special event ends the game sooner or Michiko's dream stat reaches 0; if the latter occurs the game still unlocks an ending, but its always a bad ending based on her stats and key events triggered.\n\nTasks affect stats, generally positively. Michiko's stats determine whether the task is completed successfully in a given day, with success often resulting in monetary gain. Each task takes one week of game time unless an annual event interferes with it. In addition, these annual events last for a varying number of days. During some of these events various mini-games can occur. Winning these mini-games may trigger key events or grant items, money, and/or stats boost. The game starts out with a few available tasks, but more open up by triggering key events and/or working at a particular place for some time. Several jobs can also be removed because of key events or high level of the sin stat.\n\nCombat occurs inside a multi-level dungeon. Time passes as the player moves through the dungeon. The player can chose to either defeat the monster in combat or attempt to tame the monster, getting it to leave Michiko alone. If the player kills a living creature (as opposed to golems or undead), it increases Michiko's sin. Sin goes down if the player works at the church or the doctor's. Combat is turn-based and features magic point-based charms (spells). These spells use nine elements, including the classical four. If Michiko's hit points (HP) drop to zero the player is automatically rescued. There is no character death, but she may need to pay to recover her lost health. Regardless, it will deplete the Dream meter during her recovery period and may lead to the bad ending.","torrent":{"xt":"urn:btih:8f115030c0f6fc26106960333366ee84a74dbb5b","amp;dn":"Cute+Knight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f115030c0f6fc26106960333366ee84a74dbb5b","infoHashBuffer":{"type":"Buffer","data":[143,17,80,48,192,246,252,38,16,105,96,51,51,102,238,132,167,77,187,91]},"announce":[],"urlList":[]}}