{"title":"Soil Mechanics and Foundations - M.Budhu - 3rd edition","uid":15581119,"size":22515042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f249ec2d2a0129c3cda0bb592bd2540febe00fa&amp;dn=Soil+Mechanics+and+Foundations+-+M.Budhu+-+3rd+edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"BChastko","files":1,"time":1471410129,"description":"Soil Mechanics and Foundations 3rd Edition presents the basic concepts and principles of soil mechanics and foundations in the context of basic mechanics, physics, and mathematics. It is appropriate for a single course combining introduction to soil mechanics and foundations, or for a two-course geotechnical engineering sequence. The author presents topics thoroughly and systematically without diluting technical rigor, and gives students confidence in learning the principles of soil mechanics and its application to foundation analysis by clearly defining what they should learn from this text, and providing tools to help them organize and assess their own learning. Soil Mechanics and Foundations 3rd Edition supports active learning and student self-assessment by defining learning outcomes and objectives, providing questions to guide their reading, definitions of key terms, multimedia supporting self-assessment, and homework exercises defined to target theory, problem-solving, and practical applications. Web-based applications available with the text include interactive animations, interactive problem solving, interactive step-by-step examples, virtual soils laboratory,e-quizzes,and more! The text is written using 100% SI Units","torrent":{"xt":"urn:btih:8f249ec2d2a0129c3cda0bb592bd2540febe00fa","amp;dn":"Soil+Mechanics+and+Foundations+-+M.Budhu+-+3rd+edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f249ec2d2a0129c3cda0bb592bd2540febe00fa","infoHashBuffer":{"type":"Buffer","data":[143,36,158,194,210,160,18,156,60,218,11,181,146,189,37,64,254,190,0,250]},"announce":[],"urlList":[]}}