{"title":"The Encyclopedia of Conspiracies and Conspiracy Theories","uid":6404001,"size":19742243,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f254cf3207312719b672eed0d5474f196fdfd23&amp;dn=The+Encyclopedia+of+Conspiracies+and+Conspiracy+Theories&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Djofullinn","files":1,"time":1305748481,"description":"Conspiracies and conspiracy theories, both documented and undocumented, abound in our world. Many of these, even though documented, are only theoretical and not actual fact, and as author Newton states, &quot;some are absurd, transparently ridiculous, or even physically impossible.&quot; However, they certainly make for fascinating reading.\n\nThis volume's 500-plus entries are arranged alphabetically and encompass people; conspiratorial organizations and movements; nations involved in conspiracies; specific events; and general essays on social, political, or religious movements. The selection of topics represents what Newton considers &quot;significant&quot; conspiracy and conspiracy theories--that is, those that affect large numbers of people or inspire widespread interest. Entries are typically one-half to three and one-half pages in length. Names or terms in small caps within an entry refer to subjects with their own entries. The volume contains more than 80 black-and-white photographs. The 200 or so listings in the bibliography are limited to sources published or translated in the English language.\n\nTopics include those one would expect to find: Alien abductions, Holocaust and Holocaust denial, Iran-Contra conspiracy, Oklahoma City bombing, and UFOs. Treating less-familiar theories are Barbie dolls, Suppressed inventions, and Undead outlaws. There are also entries on police departments from several major cities, such as Chicago and L.A. In addition to John F. Kennedy, other presidents have entries--for example, both Bushes, Clinton, Johnson, Lincoln, Nixon, and Washington.\n\nMany entries overlap with those in the more scholarly Conspiracy Theories in American History: An Encyclopedia (ABC-CLIO, 2003). However, several subjects in the volume under review are not in the 2003 publication (e.g., Apollo project; Enron; Silkwood, Karen; Simpson, O. J.; USA Patriot Act). With their different scopes, both works would be a great addition to a library's collection. If funds won't allow the purchase of both, however, this recent volume would be a good choice on its own, especially for high-school and public libraries. kaye talley\nCopyright Ã‚Â© American Library Association. All rights reserved \n &lt;a href=&quot;\nhttp://www.amazon.com/Encyclopedia-Conspiracies-Conspiracy-Theories-Library/dp/0816055408/ref=sr_1_2?ie=UTF8&amp;qid=1305740907&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Encyclopedia-Conspiracies-Conspiracy-Theories-Library/dp/0816055408/ref=sr_1_2?ie=UTF8&amp;qid=1305740907&amp;sr=8-2&lt;/a&gt;","torrent":{"xt":"urn:btih:8f254cf3207312719b672eed0d5474f196fdfd23","amp;dn":"The+Encyclopedia+of+Conspiracies+and+Conspiracy+Theories","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f254cf3207312719b672eed0d5474f196fdfd23","infoHashBuffer":{"type":"Buffer","data":[143,37,76,243,32,115,18,113,155,103,46,237,13,84,116,241,150,253,253,35]},"announce":[],"urlList":[]}}