{"title":"Professional JavaScript for Web Developers, 3rd Edition By RxV","uid":8903768,"size":54795018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f50b465b4dbbb956b34802f50f1420a35d8252f&amp;dn=+Professional+JavaScript+for+Web+Developers%2C+3rd+Edition+By+RxV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"rohnakzz","files":2,"time":1378863957,"description":"for more ebooks and software visit :- www.minionvilla.com\n\nThis book provides a developer-level introduction along with more advanced and useful features of JavaScript. Coverage includes:\n\n    JavaScript use with HTML to create dynamic webpages, language concepts including syntax and flow control statements\n    variable handling given their loosely typed nature\n    built-in reference types such as object and array\n    object-oriented programing\n    powerful aspects of function expressions\n    Browser Object Model allowing interaction with the browser itself\n    detecting the client and its capabilities\n    Document Object Model (DOM) objects available in DOM Level 1\n    how DOM Levels 2 and 3 augmented the DOM\n    events, legacy support, and how the DOM redefined how events should work\n    enhancing form interactions and working around browser limitations\n    using the &lt;canvas &gt; tag to create on-the-fly graphics\n    JavaScript API changes in HTML5\n    how browsers handle JavaScript errors and error handling\n    features of JavaScript used to read and manipulate XML data\n    the JSON data format as an alternative to XML\n    Ajax techniques including the use of XMLHttpRequest object and CORS\n    complex patterns including function currying, partial function application, and dynamic functions\n    offline detection and storing data on the client machine\n    techniques for JavaScript in an enterprise environment for better maintainability\n\nThis book is aimed at three groups of readers: Experienced object-oriented programming developers looking to learn JavaScript as it relates to traditional OO languages such as Java and C++; Web application developers attempting to enhance site usability; novice JavaScript developers.\n\nNicholas C. Zakas worked with the Web for over a decade. He has worked on corporate intranet applications used by some of the largest companies in the world and large-scale consumer websites such as MyYahoo! and the Yahoo! homepage. He regularly gives talks at companies and conferences regarding front-end best practices and new technology\n\nFile size:53.1 MB\n\nfor more ebooks and software visit :- www.minionvilla.com","torrent":{"xt":"urn:btih:8f50b465b4dbbb956b34802f50f1420a35d8252f","amp;dn":"+Professional+JavaScript+for+Web+Developers%2C+3rd+Edition+By+RxV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f50b465b4dbbb956b34802f50f1420a35d8252f","infoHashBuffer":{"type":"Buffer","data":[143,80,180,101,180,219,187,149,107,52,128,47,80,241,66,10,53,216,37,47]},"announce":[],"urlList":[]}}