{"title":"Common Core Literacy for Math, Science Grades 6-12 [PDF] [StormR","uid":11635709,"size":6069768,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8f549077acb974ef3f69379687e84f211b0ae6d2&amp;dn=Common+Core+Literacy+for+Math%2C+Science+Grades+6-12+%5BPDF%5D+%5BStormR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"krystine","files":-1,"time":1417731042,"description":"Common Core Literacy for Math, Science, and Technical Subjects: Strategies to Deepen Content Knowledge (Grades 6-12) (Jossey-Bass Teacher)\nAuthor: Katherine S. McKnight\nPublished: 2014\nPublisher: Jossey-Bass\nISBN: 9781118710203\nFormat: Retail PDF\n\n\nResources and guidance for the journey of Common Core implementation\n\nIn this age of the Common Core State Standards, all content area teachers must integrate literacy standards into their curriculum. If you're like most content area educators, you're feeling a bit overwhelmed at the thought of addressing all the new standards, or you might just need a little extra help.\n\nIn this hands-on resource, Common Core literacy expert Katherine McKnight offers secondary teachers a clear understanding of what literacy looks like in math, science, and technical subjects. McKnight gives educators proven teaching techniques that help develop literacy skills in students. She also offers a wealth of practical strategies and ready-to-use activities that content area teachers can integrate seamlessly. Included are * Ideas for implementing the literacy requirements of the Common Core across content areas * A selection of activities that support literacy skills and build content knowledge in math, science, and technology classrooms * An easy-to-use Difficulty Dial that indicates the complexity of each activity * Robust student samples that bring the activities to life across a variety of grade levels and subjects\n\nCommon Core Literacy for Math, Science, and Technical Subjects is designed for practicality. With bonus web downloads, a literacy resource guide, and countless ideas for deepening content knowledge, this book provides excellent support for rigorous Common Core implementation.\n\nPraise for Common Core Literacy for Math, Science, and Technical Subjects\n\n&quot;A realist with an incisive wit, Katie's robust pedagogy and trenchant analysis inspire all of us to incorporate the CCSS meaningfully in specific content areas. For her gifted writing, let alone her substantive and easy-to-implement ideas, this is a godsend for content area teachers. Move it to the top of the priority reading stack.&quot; --Rick Wormeli, veteran educator, author, and teacher trainer\n\n&quot;McKnight eloquently dispels much of the mythology surrounding the new standards, and explains how to help students find success. You'll find this engaging book your 'go-to' resource for implementing the Common Core.&quot; --Richard M. Cash, Ed.D., educational consultant; author, Advancing Differentiation: Thinking and Learning for the 21st Century","torrent":{"xt":"urn:btih:8f549077acb974ef3f69379687e84f211b0ae6d2","amp;dn":"Common+Core+Literacy+for+Math%2C+Science+Grades+6-12+%5BPDF%5D+%5BStormR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f549077acb974ef3f69379687e84f211b0ae6d2","infoHashBuffer":{"type":"Buffer","data":[143,84,144,119,172,185,116,239,63,105,55,150,135,232,79,33,27,10,230,210]},"announce":[],"urlList":[]}}