{"title":"How to Raise an Adult By Julie Lythcott-Haims (epub)","uid":12212801,"size":1440283,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9094f05b9aa5d465e087d02fc430310b0e320d8a&amp;dn=How+to+Raise+an+Adult+By+Julie+Lythcott-Haims+%28epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ebookism","files":3,"time":1439155584,"description":"Across a decade as Stanford University's Dean of Freshmen, Lythcott-Haims noticed a startling rise in parental involvement in students' lives. Every year, more parents were exerting control over students' academic work, extracurriculars, and career choices, often taking matters into their own hands rather than risk their child's failure or disappointment. Meanwhile, Lythcott-Haims encountered increasing numbers of students who, as a result of hyper-attentive parenting, lacked a strong sense of self and were poorly equipped to handle the demands of adult life. Alarmed-for the students, for their parents, and for society at large - she decided to fight back, with this book. In How to Raise an Adult, she draws on research, conversations with educators and employers, and her own insights as a mother and student dean to highlight the ways in which over-parenting harms children and their stressed-out parents. She identifies types of helicopter parents and, while empathizing with parents' universal worries, offers practical alternative strategies that underline the importance of allowing children to make their own mistakes and develop the resilience, resourcefulness, and inner determination necessary for success. Relevant to parents of toddlers as well as of twenty somethings, this book is a rallying cry for those who wish to ensure that the next generation can take charge of their own lives with competence and confidence.\n\nHow to Raise an Adult: Break Free of the Overparenting Trap and Prepare Your Kid for Success By Julie Lythcott-Haims\n2015 | 256 Pages | ISBN: 1627791779 | EPUB | 1 MB\n &lt;a href=&quot;\nhttp://extraimago.com/images/2015/08/09/00362ccb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/images/2015/08/09/00362ccb.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:9094f05b9aa5d465e087d02fc430310b0e320d8a","amp;dn":"How+to+Raise+an+Adult+By+Julie+Lythcott-Haims+%28epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9094f05b9aa5d465e087d02fc430310b0e320d8a","infoHashBuffer":{"type":"Buffer","data":[144,148,240,91,154,165,212,101,224,135,208,47,196,48,49,11,14,50,13,138]},"announce":[],"urlList":[]}}