{"title":"CockyBoys - Answered Prayers - The Lamb (pt2)- Episode 5 - The A","uid":11229538,"size":742380156,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:90cc30d7f017686d10ee4b22a06d6240dbdf82aa&amp;dn=CockyBoys+-+Answered+Prayers+-+The+Lamb+%28pt2%29-+Episode+5+-+The+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"mindcrasher","files":1,"time":1413504713,"description":"CockyBoys - Answered Prayers - The Lamb (pt2)- Episode 5 - The Assumption of the Lamb.mp4 \nThe Assumption of the Lamb \n\n\n\nJake Jaxson's year-in-the-making erotic fantasy epic ANSWERED PRAYERS continues with THE ASSUMPTION OF THE LAMB, the second part of a two-part story centered on a mysterious orphan boy known only as the Lamb. The last time we saw the Lamb, he'd just been expelled from a strict boarding school for attempting to escape after being bullied by his cruel classmates Pain, Cain, and Vain. His benevolent yet frustrated guardian, Moloch, consequentially transfers the Lamb to the care of his father, Seth, Son of Snakes, and a new chapter begins. \n\nOnce under Seth's guidance, the Lamb begins to excel. Like others before him, he realizes he's being prepared for something much more. Yet the Lamb's fate is not in Seth's hands alone -- a much larger battle is being fought by Moloch and his brother Jinks, a fight that will soon also consume the Lamb. \n\nGoing from an orphan boy to a position of great power, the Lamb's greatest fears still linger beneath the surface dictating his every move. He is balancing on a thread of chance, and before he knows it, his vulnerability is exploited by his old classmates creating a imbalance of power that gives the Lamb untold and unexpected strength. With Seth standing in his way, the Lamb is eager to seduce, manipulate, and transform himself into anything (or anyone) to overcome and hide his greatest weaknesses. \n\nFeaturing career-making performances by Max Ryder, Max Carter, and the legendary Dean Monroe, with special appearances by Jake Bass, Duncan Black, Frankie Valentine, and Jasper Robinson, THE ASSUMPTION OF THE LAMB explores the responsibilities of power and the tremendous consequences of fear and their impact on self realized possibility. \n\n---------- \n\nIt's taken me a year to finish &quot;The Lamb.&quot; Released in two parts, it is the third chapter in our sexual morality tale. Why so long? It's hard to exactly pin point -- but sometimes the story needs to find itself or sometimes I need to find the story. In this case I was still exploring the possibilities, complexities and talents of two of AP's main actors -- Max Carter and Levi Karter. \n\nWhile I have been working with Max Ryder and Jake Bass for the past few years I've known them, their limits, their ambitions, and their will to push their talent beyond all of our expectations. And they delivered -- we all worked hard exploring the limits of their personalities/characters. \n\nHowever, it literally took me a year to unlock the mystery that is Max Carter -- a complex and vividly eccentric boy. He's easy to judge and perhaps simplify from just his looks and whisper of a voice. I was eager to cast him in a role that would challenge us both -- and it did, both on screen and off. Max is such a sweet, friendly, funny guy -- but under it all I could feel his mind racing with so many conflicting thoughts and realities. And this is what I wanted Moloch to be! Off screen, we had been shooting this film for a year and yet still he had nothing to show for it. No matter how much I reassured him and told him to be patient, and that it would be worth the wait, impatience ruled the day. For many of us the clock is always ticking -- tick-tock tick-tock. Like many of us, I knew what he was thinking. When will it be my time? When will my work be appreciated? When will I be appreciated? \n\nThere's never a day when working with Max, and really all of our performers, that I do not appreciate them. What I do is not possible without them. I often hope they can see and know that by the end result of our work together. However, I realize this is something that must be said more and more often. \n\nSo with that -- Max, my quiet one, thank you! This is a love letter of sorts to that beautiful boy on the inside -- the one always questioning, wondering, and discovering. You have delivered one of the most beautiful performances. Thank you for helping make this project all that I had hoped it could be. I'm so proud of you, your work and talent. \n\nLove always, \n\n\nJake Jaxson \n\n***************need a proxy to get on the pirate bay******************\n               &lt;a href=&quot;\nhttp://unlockthispage.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://unlockthispage.com/&lt;/a&gt;\n               &lt;a href=&quot;\nhttp://unlockthispageplease.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://unlockthispageplease.com/&lt;/a&gt;\n               &lt;a href=&quot;\nhttp://schooltimequiz.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://schooltimequiz.com/&lt;/a&gt;\n               &lt;a href=&quot;\nhttp://quiztimeschool.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://quiztimeschool.com/&lt;/a&gt;\t\t\n         &lt;a href=&quot;\nhttp://bypassthiswall.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bypassthiswall.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://funisthepants.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://funisthepants.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://funtimefunhax.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://funtimefunhax.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://huskymadness.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://huskymadness.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://pr0xyroxy.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pr0xyroxy.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://quizbowls.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://quizbowls.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://schooltimefun.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://schooltimefun.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://thisrainbowproxy.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thisrainbowproxy.info/&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://timetostudy.info/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://timetostudy.info/&lt;/a&gt;","torrent":{"xt":"urn:btih:90cc30d7f017686d10ee4b22a06d6240dbdf82aa","amp;dn":"CockyBoys+-+Answered+Prayers+-+The+Lamb+%28pt2%29-+Episode+5+-+The+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90cc30d7f017686d10ee4b22a06d6240dbdf82aa","infoHashBuffer":{"type":"Buffer","data":[144,204,48,215,240,23,104,109,16,238,75,34,160,109,98,64,219,223,130,170]},"announce":[],"urlList":[]}}