{"title":"Billie Holiday--Greatest Hits--vikingsfreak","uid":4574410,"size":37109837,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:91134c6915a7e4a7d46f7d5720bef2b3d92d4edd&amp;dn=Billie+Holiday--Greatest+Hits--vikingsfreak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"vikingsfreak","files":-1,"time":1229178039,"description":"!!!To anyone who downloaded Billie's Blues, the files were corrupted by Media Player, and it has been fixed.  Please check back, and the new torrent will be uploaded.  Until now, here is a great one!!!\n\n\n\n\n\n\nCuriously, yet not surprisingly given the enormity of his sway, Billie Holiday's greatest vocal influence was &quot;Pops&quot;--Louis Armstrong, whose trumpet was his first signature (though he's often credited with being the first great jazz singer as well). One hears Armstrong in Holiday's sense of phrasing, timing, and the warmth she invests in a lyric. This package, containing such touchstone Holiday renderings as &quot;I Cried for You,&quot; &quot;Body and Soul,&quot; and &quot;When a Woman Loves a Man&quot; (poetic, given the fact that Billie was notoriously unlucky at love), also boasts her signature song, &quot;God Bless the Child.&quot; Her accompanists are a hall-of-fame lot, including trumpeters Roy Eldridge and Buck Clayton; saxmen Lester Young (with whom she had a close relationship), Ben Webster, Johnny Hodges, and Harry Carney; drummers Cozy Cole and Jo Jones; bassists John Kirby and Walter Page; and her frequent pianist, Teddy Wilson. --Willard Jenkins\nProduct Details:\nAudio CD Release Date: \tNovember 17, 1998\nStudio: \tSony\nNumber Of Discs: \t1\nFormat: \tOriginal recording remastered\nAverage Customer Rating: \tbased on 16 reviews\nTrack Listing:\n1. \tMiss Brown to You - Billie Holiday, Robin, Leo\n2. \tWhat a Little Moonlight Can Do - Billie Holiday, Woods, Harry\n3. \tI Cried for You - Billie Holiday, Lyman, Abe\n4. \tBillie's Blues - Billie Holiday, Holiday, Billie\n5. \tA Sailboat in the Moonlight - Billie Holiday, Lombardo, Carmen\n6. \tI Can't Get Started - Billie Holiday, Gershwin, Ira\n7. \tWhen a Woman Loves a Man - Billie Holiday, Mercer, Johnny\n8. \tSome Other Spring - Billie Holiday, Herzog, Arthur Jr.\n9. \tSolitude - Billie Holiday, Ellington, Duke\n10. \tGod Bless the Child - Billie Holiday, Herzog, Arthur Jr.\n11. \tGloomy Sunday - Billie Holiday, Javor, Laszlo\n12. \tThe Very Thought of You - Billie Holiday, Noble, Ray\n13. \tBody and Soul - Billie Holiday, Heyman, Edward","torrent":{"xt":"urn:btih:91134c6915a7e4a7d46f7d5720bef2b3d92d4edd","amp;dn":"Billie+Holiday--Greatest+Hits--vikingsfreak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91134c6915a7e4a7d46f7d5720bef2b3d92d4edd","infoHashBuffer":{"type":"Buffer","data":[145,19,76,105,21,167,228,167,212,111,125,87,32,190,242,179,217,45,78,221]},"announce":[],"urlList":[]}}