{"title":"Habemus Papam 2011 720p H.264 DivX HD (moviesbyrizzo) MKV","uid":7017367,"size":2319649870,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:911e73afe55e8911d7df1269ce3152be6bb47d6a&amp;dn=Habemus+Papam+2011+720p+H.264+DivX+HD+%28moviesbyrizzo%29+MKV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1328709593,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt1456472/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt1456472/&lt;/a&gt;\n\nThis is a 2GB 720p H.264 DivX version (created using DivX Plus converter)\n1280 X 696 video 2800k video bitrate 192k audio 1hr 44minutes 23.97fps\n\nThis movie features the most beautiful actress in all of Italy - \nMs. Margherita Buy and a real nicest man of Europe - Mr. Michael Piccoli\nwho could well be German as much as he is of Italian stock.\n\nSubtitles are included for English, along with Dutch French Greek Polish\nPortuguese - brazil Romanian Serbian and Spanish\n\nThe movie looks at whether the Pope is chosen from men as being above\nreproach in normal human frailties, and with special qualities instead -\nin such matters as intellect, moral superiority of spirit and in general\nwith merit that should justify his call to such highest office. In particular\nthe man must be protective of family unit and women and children most of all\nif he is to be almost as &quot;god on earth&quot; to many in whatever manner\n\nIts a fun movie and I quite enjoyed seeing it myself - Michael Piccolo's\ncharacter in the movie is still one of a greatest man - far above the\ncaliber of the multicultural misfits we are shown as playing on the team too -\nas hopeful equals someday no doubt.\n\nNow if only they would nay the hitting of little girls by even little boys -\neven in such apparently minor skirmishes as shown in the movie for discussion -\nit is an anathema for the best of men that must be emphatically driven home\nfor all concerned (the subject is only touched on in this movie). The gals of\nItaly such as the gal shown are the most precious a gift from God and must\nbe treated dearly and with all the care we can muster instead - god forbid\nwe do otherwise in this way!\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\nNote: Converted from a 4.3GB cinefile mkv (which contained no chapter \nmarkers either). In the future we hope to bring you a 4GB version with an\nembedded chapter markers file - you can add one to any mkv in 60 seconds\nflat using mkvmerge once you have the text file created with the information.","torrent":{"xt":"urn:btih:911e73afe55e8911d7df1269ce3152be6bb47d6a","amp;dn":"Habemus+Papam+2011+720p+H.264+DivX+HD+%28moviesbyrizzo%29+MKV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"911e73afe55e8911d7df1269ce3152be6bb47d6a","infoHashBuffer":{"type":"Buffer","data":[145,30,115,175,229,94,137,17,215,223,18,105,206,49,82,190,107,180,125,106]},"announce":[],"urlList":[]}}