{"title":"Shandora - Unique Real Estate and Car Dealership Wordpress Theme","uid":10332935,"size":66951014,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:914166e0da2f01c1808f83c6d21711b7a8f71cc8&amp;dn=Shandora+-+Unique+Real+Estate+and+Car+Dealership+Wordpress+Theme&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"nulledGOD","files":-1,"time":1402434022,"description":"Shandora is clean &amp; flexible Real Estate WordPress Theme based on Foundation 4 framework. It suits for both complex and simple real estate property listings.\n\nIDX Integration using dxIDXpress Plugin. Starting from Shandora version v1.0.1 already supporting IDX MLS Listing using dsIDXpress plugin. What you got for the listing from dsIDXpress plugin is not the default one but the extended one by the theme to fit the design. You can compare this with the other themes.\n\nFully Responsive . Build using Foundation 4 which is Mobile First CSS framework for responsive design.\n\nOffset Navigation . Support offset navigation in mobile view.\n\nPost formats . Support for post formats means you can jazz up your blog with your own video, images, galleries and of course good old standard posts.\n\nPowerful Customizeable Search Panel This theme let you choose custom field to use in the search panel. Select up to 9 fields from 19 available options\n\nBuilt-in Quiz Engine . Let you interact with your user by providing quiz engine feature for your user.\n\nBuilt-in Polling System . Let you interact with your user by providing polling system feature for your user.\n\nBuilt-in Page Builder. Shandora comes up with page builder features which will allow you to easily build your own page\n\nPost Layouts . Support post layouts for pages / posts.\n\nThe theme also comes with a Live Support Chat Plugin.\n\nThis wordpress theme has been fully nulled, to install simply upload it to your host like you would any other wordpress theme. \n","torrent":{"xt":"urn:btih:914166e0da2f01c1808f83c6d21711b7a8f71cc8","amp;dn":"Shandora+-+Unique+Real+Estate+and+Car+Dealership+Wordpress+Theme","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914166e0da2f01c1808f83c6d21711b7a8f71cc8","infoHashBuffer":{"type":"Buffer","data":[145,65,102,224,218,47,1,193,128,143,131,198,210,23,17,183,168,247,28,200]},"announce":[],"urlList":[]}}