{"title":"ATLAS.ti v7.5.7 Multilanguage","uid":12707837,"size":91832357,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:915238248b5f7af59ac0723578fc5f06b4c253e9&amp;dn=ATLAS.ti+v7.5.7+Multilanguage&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"edmacri","files":4,"time":1446858716,"description":"The next milestone in professional qualitative data analysis.\r\nATLAS.ti is one of the most powerful tools for qualitative research. Managed documents, multi-document view, high-performance multimedia engine, intuitive margin-area coding for all data types, and much more.\r\n\r\nAnalysis Tools\r\nATLAS.ti 7 is a powerful analytical tool. Its individual analysis options are centrally organized and designed for maximum efficiency, accuracy, and performance. Cloud views provide very quick, accurate, and yet intuitive analytical access to your data material. The query tool, ccooccurence explorer and the codes-PD-table allow in-depth analysis.\r\n\r\nAll ATLAS.ti’s analysis tools can be used in complimentary combinations for extremely accurate and in-depth exploration of your material.\r\n\r\nMultimedia\r\nATLAS.ti offers state-of-the art multimedia processing. Frame-level and wave previews make coding audio and video material a joy; images can be fully coded in every detail and segments can even be moved and re-sized.\r\n\r\nVideo\r\nWhen you add a video document to a project, preview images are created. Next to the preview images you see the audio wave form. By right-clicking on the video preview you can set a number of display options in the context menu.\r\n\r\nAudio\r\nLike with video clips, you can zoom in on the audio wave as needed\r\n\r\nMulti-Language\r\nSimply switch the user interface to your desired language directly from the main menu (Tools &gt; Preferences &gt; Set User Interface Language).\r\n\r\nMulti-Docs\r\nYou can open up to four documents side-by-side in the ATLAS.ti HU editor. This opens up fantastic possibilities for comparative work and makes work faster and more efficient all around.\r\nWork on Multiple Documents At The Same Time\r\nDocuments can be dragged from the navigation pane or the P-Docs Manager onto the region button to open them.\r\n\r\n----------------------------\r\n\r\n¿Qué es ATLAS.ti?\r\nPor más de una década, ATLAS.ti ha sido el líder del mercado en software profesional QDA (software para el análisis cualitativo de Datos). ATLAS.ti es utilizado en todo el mundo por instituciones e investigadores líderes. Siempre que se precisa de un análisis profesional de texto y datos multimedia, simplemente no existe alternativa a ATLAS.ti.\r\n\r\nCompatibilidad con todos los idiomas\r\nATLAS.ti puede procesar datos prácticamente en cualquier idioma, utilizando caracteres diversos idiomas, incluidos japonés, chino, árabe, hebreo y muchos más Ahora, la interfaz está disponible en idioma español","torrent":{"xt":"urn:btih:915238248b5f7af59ac0723578fc5f06b4c253e9","amp;dn":"ATLAS.ti+v7.5.7+Multilanguage","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"915238248b5f7af59ac0723578fc5f06b4c253e9","infoHashBuffer":{"type":"Buffer","data":[145,82,56,36,139,95,122,245,154,192,114,53,120,252,95,6,180,194,83,233]},"announce":[],"urlList":[]}}