{"title":"WAMP Server","uid":5077982,"size":16032571,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:91942b6563827dd1c85974a657b3bb8d1d45a60f&amp;dn=WAMP+Server&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Mac-Sparrow","files":-1,"time":1252027945,"description":"Presentation\n\nWampServer is a Windows web development environment. It allows you to create web applications with Apache, PHP and the MySQL database. It also comes with PHPMyAdmin to easily manage your databases.\n\nWampServer installs automatically (installer), and its usage is very intuitive. You will be able to tune your server without even touching the setting files.\n\nWampServer is the only packaged solution that will allow you to reproduce your production server. Once WampServer is installed, you have the possibility to add as many Apache, MySQL and PHP releases as you want.\n\nWampServer also has a trayicon to manage your server and its settings.\nimage menu WampServer\n\nInstalling\n\nDouble click on the downloaded file and just follow the instructions. Everything is automatic. The WampServer package is delivered whith the latest releases of Apache, MySQL and PHP.\n\nOnce WampServer is installed, you can add other releases by downloading them on this website. They will then appear in the WampServer menu and you will be able to switch releases with a simple click.\nEach release of Apache, MySQL and PHP has its own settings and its own files (datas for MySQL).\n\n\nFunctionalities\n\nWampServer's functionalities are very complete and easy to use so we won't explain here how to use them.\n\nWith a left click on WampServer's icon, you will be able to:\n- manage your Apache and MySQL services\n- switch online/offline (give access to everyone or only localhost)\n- install and switch Apache, MySQL and PHP releases\n- manage your servers settings\n- access your logs\n- access your settings files\n- create alias\n\nWith a right click :\n- change WampServer's menu language\n- access this page\n\n\nHow to start\n\nWhen you install WampServer, a &quot;www&quot; directory is created (generally c:wampwww). Create a directory inside for your project and put your PHP files in it.\nClick on the link &quot;Localhost&quot; in the WampServer menu or open your browser and open the http://localhost address.\n\n\n\n\nAdd Apache, MySQL and PHP releases\n\nWampServer allows you to install almost all the existing releases of Apache, PHP and MySQL so you can reproduce exactly the settings of your production server.\nTo add a new release, donwload it here and install it.\n\nThen click on the WampServer menu and activate the release that you want to use.\n\n\n\nWait until the WampServer icon become white again and start to work.\n\nWARNING : all the PHP releases aren't compatible with the Apache releases. WampServer knows which releases can work together and lets you know when it is not possible to switch.\n","torrent":{"xt":"urn:btih:91942b6563827dd1c85974a657b3bb8d1d45a60f","amp;dn":"WAMP+Server","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91942b6563827dd1c85974a657b3bb8d1d45a60f","infoHashBuffer":{"type":"Buffer","data":[145,148,43,101,99,130,125,209,200,89,116,166,87,179,187,141,29,69,166,15]},"announce":[],"urlList":[]}}