{"title":"Orthopaedic and Trauma Nursing- Clarke [PDF] [StormRG]","uid":10707473,"size":4393490,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91c62e1bba1cebd59a70d1a488d2d1e742f69e05&amp;dn=Orthopaedic+and+Trauma+Nursing-+Clarke+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":2,"time":1407310971,"description":"Author: Sonya Clarke (Author), Julie Santy-Tomlinson (Author)\nPaperback: 360 pages\nPublisher: Wiley-Blackwell; 1 edition (September 22, 2014)\nLanguage: English\nISBN-10: 111843885X\nISBN-13: 978-1118438855\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nOrthopaedic and Trauma Nursing provides practitioners working in orthopaedic and musculoskeletal trauma settings with the essential evidence, guidance and knowledge required to underpin effective practice. This comprehensive and contemporary textbook explores the variety of adult and paediatric clinical settings where orthopaedic and trauma practitioners work, including acute wards, clinics, community hospitals, nursing homes and patients' homes.\n\nDivided into 5 sections, this book looks at: key issues in orthopaedic and musculoskeletal trauma care; specialist practice issues; common orthopaedic conditions and their care and management; musculoskeletal trauma care; and care of children and young people. Suitable for students at degree level as well as those clinicians practicing in more advanced orthopaedic and trauma care roles, Orthopaedic and Trauma Nursing is a foremost authority on orthopaedic and musculoskeletal practice for both students and practitioners.\n\nOrthopaedic and Trauma Nursing:\n\nIs strongly supported by the latest evidence, with chapters summarizing evidence, with reference to relevant and seminal research\nOffers practical guidance based on the relevant evidence\nFocuses on the perspective of the patient with patient narrative and case studies throughout\nIncludes a section specifically dealing with children and young people","torrent":{"xt":"urn:btih:91c62e1bba1cebd59a70d1a488d2d1e742f69e05","amp;dn":"Orthopaedic+and+Trauma+Nursing-+Clarke+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91c62e1bba1cebd59a70d1a488d2d1e742f69e05","infoHashBuffer":{"type":"Buffer","data":[145,198,46,27,186,28,235,213,154,112,209,164,136,210,209,231,66,246,158,5]},"announce":[],"urlList":[]}}