{"title":"Prince.of.Persia.The.Forgotten.Sands.Crackfix.Repack-SKIDROW","uid":5661512,"size":21000322,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:91e99492a696b04e6f7b36b5d66a680213e55fea&amp;dn=Prince.of.Persia.The.Forgotten.Sands.Crackfix.Repack-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Shroo","files":5,"time":1277992634,"description":"Eboy\n\n\nproudly presents\nPrince of Persia: The Forgotten Sands Crackfix Repack\n\n\nRELEASE DATE : 28-06-2010 PROTECTION : Ubisoft DRM\nGAME TYPE : Action DISKS : CRACKFIX\n\n\nRelease Notes:\nA little statement about the work involved:\n\nTo clear the minds of the individuals who think: Game x was\ndone fast and this one taking ages etc. The way the Ubisoft\nDRM works makes it so that every game is like a brand new\nchallenge. What it does do is offload certain parts of the\ngame to a server game then requests those things at runtime.\nThese parts can be anything that the developer wants. In the\ncase with Prince of Persia: The Forgotten Sands those things\nwere:\n\n- Levers logic\n- Door timing\n- Upgrades\n- Abilities\n- XP Levels\n- Area codes\n\nEvery time you step on a button in game it sends a request\nto server asking what to do. Server then sends the door code\nto open including how much time it stays open. Levers work\nsimilarly every time you press the TAB button to display\nskills game asks again server: What skills do player have\n\nAll that stuff takes a lot of time to implement right and we\ndo implement it like the original do. All our doors open and\nclose with exact same time factors as the retail do. We just\nwanted to clarify a little how the Ubisoft DRM really does\nwork because a lot of those individuals we mentioned in the\nbeginning of this statement didn t seem to understand yet\nwhat kind of monster this is. It s not some simply Values\ngoing around like it were with Assassin s Creed II.\n\n_______ __ ___ _____ / __\n____/ _ _ __/ ___/ / /_/ _/ __/_/ ____/\ntwice the fun / double the trouble\n\n\nRepack Notes:\nWe packed the wrong dll file. We apologize again \n\n\nCrackfix Notes:\nSome bugs were reported and they re fixed now. We apologize\n\nReplace the included files with these ones.\nWe included an easter egg try to find it )\n\n\nSaving Notes:\nIf you have a savegame with you trapped behind a door because\nyou returned to a checkpoint after you died then you need to\nrestart a new game.\n\nIt s not possible to fix your save as your save relay on old\npackets that are wrong.\n\n\nOn with the game release information:\nPrince of Persia The Forgotten Sands is the next chapter in\nthe fan-favorite Sands of Time universe. Visiting his\nbrother s kingdom following his adventure in Azad the Prince\nfinds the royal palace under siege from a mighty army bent on\nits destruction. When the decision is made to use the ancient\npower of the Sand in a desperate gamble to save the kingdom\nfrom total annihilation the Prince will embark on an epic\nadventure in which he will learn to bear the mantle of true\nleadership and discover that great power often comes with a\ngreat cost. Game features include:\n\nClassic Gameplay Reinvented: From huge-scale multi-enemy\ncombat to dizzying feats of acrobatic prowess in gigantic\nenvironments enhanced by the Prince s ability to control\nnature and time Prince of Persia The Forgotten Sands will\npush the Prince s prodigious abilities to unseen levels.\n\nA Blockbuster Experience: Prince of Persia The Forgotten Sands\nwill offer players unforgettable set pieces made possible by\nthe advanced technology offered by the award-winning Anvil\nengine. With all-out war at the gates of the kingdom the\nPrince s abilities will be challenged like never before\nthrough the course of epic wow moments.\n\nMastery Over Nature: Wielding powers of nature and time the\nPrince will have unparalleled mastery over his environment and\nhis enemies. The Prince will discover that harnessing the\nforces of nature itself will prove to be a devastating\ncompanion to his ability to rewind time.\n\nReturn of a Fan-Favorite Franchise: Set between Prince of\nPersia: The Sands of Time and Prince of Persia: Warrior\nWithin Prince of Persia The Forgotten Sands will provide fans\na new chapter in the Prince of Persia universe and deepen\ntheir understanding of the Sands of Time series.\n\n\nInstall Notes:\n1. Unpack release\n2. Mount image or burn it\n3. Install\n4. Copy the content from the SKIDROW folder on the DVD to your\ninstallation directory and overwrite\n5. Play the game\n\nAdditional Notes:\nBig thanks to GENESIS for supplying this monster and their\nbeloved support","torrent":{"xt":"urn:btih:91e99492a696b04e6f7b36b5d66a680213e55fea","amp;dn":"Prince.of.Persia.The.Forgotten.Sands.Crackfix.Repack-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91e99492a696b04e6f7b36b5d66a680213e55fea","infoHashBuffer":{"type":"Buffer","data":[145,233,148,146,166,150,176,78,111,123,54,181,214,106,104,2,19,229,95,234]},"announce":[],"urlList":[]}}