{"title":"Closed Casket - Sophie Hannah [EN EPUB MOBI AZW3] [ebook] [p_s]","uid":16016804,"size":1585515,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91fe5afb8881b2e060a396121075763c4cf14384&amp;dn=Closed+Casket+-+Sophie+Hannah+%5BEN+EPUB+MOBI+AZW3%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"perfect_stan","files":4,"time":1476302608,"description":"Closed Casket by Sophie Hannah (New Hercule Poirot Mysteries #2)\r\nEnglish | 2016 | Mystery &amp; Thriller | 1.5 MB\r\n\r\n\r\nHercule Poirot returns in another brilliant murder mystery that can be solved only by the eponymous Belgian detective and his ‘little grey cells’.\r\n‘What I intend to say to you will come as a shock….’\r\nLady Athelinda Playford has planned a house party at her mansion in Clonakilty, County Cork, but it is no ordinary gathering. As guests arrive, Lady Playford summons her lawyer to make an urgent change to her will – one she intends to announce at dinner that night. She has decided to cut off her two children without a penny and leave her fortune to someone who has only weeks to live….\r\nAmong Lady Playford’s guests are two men she has never met – the famous Belgian detective Hercule Poirot and Inspector Edward Catchpool of Scotland Yard. Neither knows why he has been invited…until Poirot starts to wonder if Lady Playford expects a murderer to strike. But why does she seem so determined to provoke in the presence of a possible killer?\r\nWhen the crime is committed in spite of Poirot’s best efforts to stop it, and the victim is not who he expected it to be, will he be able to find the culprit and solve the mystery?\r\nFollowing the phenomenal global success of The Monogram Murders, which was published to critical acclaim following a coordinated international launch in September 2014, international best-selling crime writer Sophie Hannah has been commissioned by Agatha Christie Limited to pen a second fully authorised Poirot novel. The new audiobook marks the centenary of the creation of Christie’s world-famous detective, Hercule Poirot, introduced in her first novel, The Mysterious Affair at Styles.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:91fe5afb8881b2e060a396121075763c4cf14384","amp;dn":"Closed+Casket+-+Sophie+Hannah+%5BEN+EPUB+MOBI+AZW3%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91fe5afb8881b2e060a396121075763c4cf14384","infoHashBuffer":{"type":"Buffer","data":[145,254,90,251,136,129,178,224,96,163,150,18,16,117,118,60,76,241,67,132]},"announce":[],"urlList":[]}}