{"title":"CCNP ROUTE Lab Manual (Lab Companion)","uid":7891856,"size":4163363,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9205bd4d24a96eac71711f417bcea7081109ad10&amp;dn=CCNP+ROUTE+Lab+Manual+%28Lab+Companion%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"IT_DOCsForFree","files":1,"time":1354742225,"description":"Publication Date: November 21, 2010 | ISBN-10: 1587133032 | ISBN-13: 978-1587133039 | Edition: 1\nThe only authorized Lab Manual for Cisco Networking Academy's newly-updated course CCNP ROUTE: Implementing IP Routing, V.6 (Exam 642-902)\n \nA portable, bound copy of all 32 CCNP V 6.x ROUTE Labs: convenient, lightweight and friendly\nAllows students to review or walk through hands-on labs without a huge textbook or live Web connection\nContains additional pages between labs for in-class note-taking\nSeparate answer key available at Cisco Academy Connection and the PearsonHighered.com Instructor Resource site\n \nThis hands-on routing Lab Manual is the perfect companion for all Cisco Networking Academy students who are taking the new course CCNP ROUTE: Implementing IP Routing (V. 6) as part of their CCNP preparation. It offers a portable, bound copy of all 32 CCNP V 6.x ROUTE network routing labs in a convenient, lightweight format that allows students to walk through key procedures and easily take notes without a large textbook or a live Internet connection. Working with these conveniently-formatted labs, students will gain practical experience and skills for using advanced IP addressing and routing in implementing scalable and secure Cisco ISR routers connected to LANs and WANs; and for configuring secure routing solutions to support branch offices and mobile workers.","torrent":{"xt":"urn:btih:9205bd4d24a96eac71711f417bcea7081109ad10","amp;dn":"CCNP+ROUTE+Lab+Manual+%28Lab+Companion%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9205bd4d24a96eac71711f417bcea7081109ad10","infoHashBuffer":{"type":"Buffer","data":[146,5,189,77,36,169,110,172,113,113,31,65,123,206,167,8,17,9,173,16]},"announce":[],"urlList":[]}}