{"title":"Concrete Pavement Design, Construction, and Performance by Norbe","uid":6520373,"size":3792898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:924140ed2f5b6379f16399d2cc4904606a4388a3&amp;dn=Concrete+Pavement+Design%2C+Construction%2C+and+Performance+by+Norbe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1309971156,"description":"Concrete Pavement Design, Construction, and Performance by Norbert Delatte\n\nProduct Description\nAddressing the interactions between the different design and construction variables and techniques this book illustrates best practices for constructing economical, long life concrete pavements.\nThe book proceeds in much the same way as a pavement construction project. First, different alternatives for concrete pavement solutions are outlined. The desired performance and behaviour parameters are identified. Next, appropriate materials are outlined and the most suitable concrete proportions determined. The design can be completed, and then the necessary construction steps for translating the design into a durable facility are carried out. Although the focus reflects highways as the most common application, special features of airport, industrial, and light duty pavements are also addressed.\nUse is made of modeling and performance tools such as HIPERPAV and LTPP to illustrate behavior and performance, along with some case studies. As concrete pavements are more complex than they seem, and the costs of mistakes or of over-design can be high, this is a valuable book for engineers in both the public and private sectors.\n\nProduct Details\nHardcover: 392 pages\nPublisher: Spon Press (October 30, 2007)\nLanguage: English\nISBN-10: 0415409705\nISBN-13: 978-0415409704","torrent":{"xt":"urn:btih:924140ed2f5b6379f16399d2cc4904606a4388a3","amp;dn":"Concrete+Pavement+Design%2C+Construction%2C+and+Performance+by+Norbe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"924140ed2f5b6379f16399d2cc4904606a4388a3","infoHashBuffer":{"type":"Buffer","data":[146,65,64,237,47,91,99,121,241,99,153,210,204,73,4,96,106,67,136,163]},"announce":[],"urlList":[]}}