{"title":"Work the System: The Simple Mechanics of Making More and Working","uid":8974243,"size":2443101,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:929221b535488488395a1aa2088e9995e8e37713&amp;dn=Work+the+System%3A+The+Simple+Mechanics+of+Making+More+and+Working&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"leopardog","files":1,"time":1380398213,"description":"Work the System: The Simple Mechanics of Making More and Working Less by Sam Carpenter\n &lt;a href=&quot;\nhttp://www.amazon.com/exec/obidos/ASIN/160832253X/4353-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/exec/obidos/ASIN/160832253X/4353-20&lt;/a&gt;\n\nPDF FORMAT\n\nWork The System: The Simple Mechanics of Making More and Working Less, guides the reader in modifying his or her perception of the world, moving from a false vision of chaotic conglomeration, to a more accurate one: that life is an orderly collection of individual linear systems each of which can be improved and perfected. The reader is guided through the process of ''getting'' this new vision, and then through the specifics of applying it via a &quot;system improvement&quot; protocol. For start-ups or existing businesses the methodology is simple, believable, and mechanical; not mystical or theoretical. Carpenter developed this &quot;Systems Mindset&quot; protocol in the business he purchased in 1984 and still owns today. With that company, he moved from an 80-100 hour workweek to a 2 hour workweek, while multiplying his income dozens of times over. He is CEO of an international business consulting firm and several other businesses and non-profits, each operated in the same systems mindset fashion. With a diverse background in engineering, construction, publishing, telecommunications and journalism, he calls his approach a &quot;workingman's philosophy.&quot; See workthesystem.com/testimonials.\n\nWork the System: The Simple Mechanics of Making More and Working Less will show business owners how to achieve a positive macro result by looking at their business and work on a micro level; by analyzing and refining each of the internal systems, the systems that, added together, comprise the whole business entity. Readers will learn how to tweak this &quot;system of systems&quot; in order to maximize profits, create client loyalty, and develop autonomous employees. The strategies also help individuals dramatically improve performance as well as decrease the stress of being overtaxed and disorganized, ultimately resulting in a substantially shorter work week and a much improved bottom line. See testimonials of readers at workthesystem.com/testimonials.","torrent":{"xt":"urn:btih:929221b535488488395a1aa2088e9995e8e37713","amp;dn":"Work+the+System%3A+The+Simple+Mechanics+of+Making+More+and+Working","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"929221b535488488395a1aa2088e9995e8e37713","infoHashBuffer":{"type":"Buffer","data":[146,146,33,181,53,72,132,136,57,90,26,162,8,142,153,149,232,227,119,19]},"announce":[],"urlList":[]}}