{"title":"At the Point of a Cutlass: The Pirate Capture of Philip Ashton","uid":15796298,"size":4829553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:92e716541dd34083d29f6750ead6b3af9cf297d4&amp;dn=At+the+Point+of+a+Cutlass%3A+The+Pirate+Capture+of+Philip+Ashton&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"marty14","files":1,"time":1473460957,"description":"At the Point of a Cutlass: The Pirate Capture, Bold Escape and Lonely Exile of Philip Ashton - Gregory N. Flemming [epub]\r\n\r\nBased on a rare manuscript from 1725, At the Point of a Cutlass uncovers the amazing voyage of Philip Ashton - a nineteen-year old fisherman who was captured by pirates, escaped on an uninhabited Caribbean island, and then miraculously arrived back home three years later to tell his incredible story.\r\n\r\nTaken in a surprise attack near Nova Scotia in June 1722, Ashton was forced to sail across the Atlantic and back with a crew under the command of Edward Low, a man so vicious he tortured victims by slicing off an ear or nose and roasting them over a fire. &quot;A greater monster,&quot; one colonial official wrote, &quot;never infested the seas.&quot; Ashton barely survived the nine months he sailed with Low's crew -- he was nearly shot in the head at gunpoint, came close to drowning when a ship sank near the coast of Brazil, and was almost hanged for secretly plotting a revolt against the pirates.\r\n\r\nLike many forced men, Ashton thought constantly about escaping. In March of 1723, he saw his chance when Low's crew anchored at the secluded island of Roatan, at the western edge of the Caribbean. Ashton fled into the thick, overgrown woods and, for more than a year, had to claw out a living on the remote strip of land, completely alone and with practically nothing to sustain him. The opportunity to escape came so unexpectedly that Ashton ran off without a gun, a knife, or even a pair of shoes on his feet. Yet the resilient young castaway - who has been called America's real-life Robinson Crusoe - was able to find food, build a crude shelter, and even survive a debilitating fever brought on by the cool winter rains before he was rescued by a band of men sailing near the island. Based on Ashton's own first-hand account, as well trial records, logbooks, and a wealth of other archival evidence, At the Point of a Cutlass pieces together the unforgettable story of a man thrust into the violent world of a pirate ship and his daring survival and escape","torrent":{"xt":"urn:btih:92e716541dd34083d29f6750ead6b3af9cf297d4","amp;dn":"At+the+Point+of+a+Cutlass%3A+The+Pirate+Capture+of+Philip+Ashton","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92e716541dd34083d29f6750ead6b3af9cf297d4","infoHashBuffer":{"type":"Buffer","data":[146,231,22,84,29,211,64,131,210,159,103,80,234,214,179,175,156,242,151,212]},"announce":[],"urlList":[]}}