{"title":"The Missing 2014 S01E01 HDTV x264 - GHOST DOG","uid":11319600,"size":354740479,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:93e22ba0f22d6d64c8e1180296fb628a8dd19720&amp;dn=The+Missing+2014+S01E01+HDTV+x264+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"marxph","files":-1,"time":1414592589,"description":"The Missing is a drama told through a delicate and complex narrative that reflect the frantic battle for a lost child. When five year-old Oliver disappears from his holiday in France, it causes a manhunt that will last for many years. The series will go inside the mind of the father, Tony, a man desperate to find his lost son. Tony's frantic and exhausting search breaks his marriage to Emily and begins to consume his life. Julien who was the detective who had launched the initial search for the child, also finds himself drawn back into the hunt, in a desperate attempt to resolve the mystery of Oliver's disappearance. The story will be two over two time frames and in two countries.\n\nEpisode 1 of 8:\n2006. Tony and Emily Hughes' life changes forever when their five-year-old son Oliver goes missing on a family holiday to France. A huge manhunt led by Julien Baptiste, one of France's finest detectives, is launched. The French police face an uphill struggle in their mission to find the young boy - Oliver seems to have disappeared into thin air. Tony and Emily are in a foreign land - they do not speak the language and do not understand the rules. As their desperation and the profile of the case grows, Tony and Emily find themselves thrown into a media maelstrom, learning the hard way that not everyone they meet is willing to operate in their best interests.\n\nPresent day. Eight years on from Oliver's disappearance, the fallout has resulted in the end of Tony and Emily's marriage. Tony refuses to believe that Oliver is dead and doggedly continues his search to find his son. After years of searching, Tony is given new hope when a shred of evidence emerges. This reignites the interest of Julien Baptiste, the lead French detective at the time of the disappearance, who returns to Chalons Du Bois to try and finally get to the bottom of what happened to Oliver Hughes.\n\n===================================================================================\nSource.......: HDTV\nRipper.......: marxph\nSize.........: 338MB\nFormat.......: mp4\nResolution...: 640x360\nVideo........: h.264, 703Kbps @ 25 fps\nAudio........: aac, 93Kbps, 48 KHz, 2 channels\n===================================================================================\n\nghost dog","torrent":{"xt":"urn:btih:93e22ba0f22d6d64c8e1180296fb628a8dd19720","amp;dn":"The+Missing+2014+S01E01+HDTV+x264+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93e22ba0f22d6d64c8e1180296fb628a8dd19720","infoHashBuffer":{"type":"Buffer","data":[147,226,43,160,242,45,109,100,200,225,24,2,150,251,98,138,141,209,151,32]},"announce":[],"urlList":[]}}