{"title":"Mindware: Tools for Smart Thinking by Richard E. Nisbett","uid":14469176,"size":601019603,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:943896f015e0937175e514217723c9b3a849d7f8&amp;dn=Mindware%3A+Tools+for+Smart+Thinking+by+Richard+E.+Nisbett&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Dr.Soc","files":79,"time":1461886951,"description":"Mindware: Tools for Smart Thinking [Audiobook] by Richard E. Nisbett \r\nEnglish | August 18, 2015 | ASIN: B012BNM718 | Unabridged | MP3 @128 kbps | 10 hrs 17 mins | 573 MB\r\nNarrator: Joe Barrett \r\n\r\nMany scientific and philosophical ideas are so powerful that they can be applied to our lives at home, work, and school to help us think smarter and more effectively about our behavior and the world around us. Surprisingly, many of these ideas remain unknown to most of us. In Mindware, the world-renowned psychologist Richard Nisbett presents these ideas in clear and accessible detail, offering a tool kit for better thinking and wiser decisions.\r\n\r\nHe has made a distinguished career of studying and teaching such powerful problem-solving concepts as the law of large numbers, statistical regression, cost-benefit analysis, sunk costs and opportunity costs, and causation and correlation, probing how best to teach others to use them effectively in their daily lives. In this groundbreaking book, he shows that a course in a given field - statistics or economics, for example - often doesn't work as well as a few minutes of more practical instruction in analyzing everyday situations.\r\n\r\nMindware shows how to reframe common problems in such a way that these powerful scientific and statistical concepts can be applied to them. The result is an enlightening and practical guide to the most powerful tools of reasoning ever developed - tools that can easily be used to make better professional, business, and personal decisions","torrent":{"xt":"urn:btih:943896f015e0937175e514217723c9b3a849d7f8","amp;dn":"Mindware%3A+Tools+for+Smart+Thinking+by+Richard+E.+Nisbett","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"943896f015e0937175e514217723c9b3a849d7f8","infoHashBuffer":{"type":"Buffer","data":[148,56,150,240,21,224,147,113,117,229,20,33,119,35,201,179,168,73,215,248]},"announce":[],"urlList":[]}}