{"title":"Dracula - Bram Stoker","uid":11994524,"size":419612088,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:947dc8e32d95290bdd3574e52f3c5197b436ae20&amp;dn=Dracula+-+Bram+Stoker&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"captainelliotspencer","files":16,"time":1433597251,"description":"The novel is mainly composed of journal entries and letters written by several narrators who also serve as the novel's main protagonists; Stoker supplemented the story with occasional newspaper clippings to relate events not directly witnessed by the story's characters. The tale begins with Jonathan Harker, a newly qualified English solicitor, journeying by train and carriage from England to Count Dracula's crumbling, remote castle (situated in the Carpathian Mountains on the border of Transylvania and Moldavia). The purpose of his mission is to provide legal support to Dracula for a real estate transaction overseen by Harker's employer, Peter Hawkins, of Exeter in England. At first seduced by Dracula's gracious manner, Harker soon discovers that he has become a prisoner in the castle. He also begins to see disquieting facets of Dracula's nocturnal life. One night while searching for a way out of the castle, and against Dracula's strict admonition not to venture outside his room at night, Harker falls under the spell of three wanton female vampires, the Brides of Dracula. He is saved at the last second by the Count, however, who ostensibly wants to keep Harker alive just long enough because his legal advice and teachings about England and London (Dracula's planned travel destination was to be among the &quot;teeming millions&quot;) are needed by Dracula. Harker barely escapes from the castle with his life.\n\nRead by Robert Whitfield\nFormat: MP3\nBitrate: 64 Kbps\nUnabridged\n\n------------------------\nVisit us for more:\n\nwww.audiobookvault.ws","torrent":{"xt":"urn:btih:947dc8e32d95290bdd3574e52f3c5197b436ae20","amp;dn":"Dracula+-+Bram+Stoker","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947dc8e32d95290bdd3574e52f3c5197b436ae20","infoHashBuffer":{"type":"Buffer","data":[148,125,200,227,45,149,41,11,221,53,116,229,47,60,81,151,180,54,174,32]},"announce":[],"urlList":[]}}