{"title":"The Sherlockian ebook by Graham Moore epub mobi Fiction","uid":10488096,"size":839183,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94ca78b5182ef119b1e6597f6d74e8419226cbde&amp;dn=The+Sherlockian+ebook+by+Graham+Moore+epub+mobi+Fiction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"KiwiSue49","files":-1,"time":1404508711,"description":"\n(description courtesy of Amazon)\n\n\nTHE SHERLOCKIAN by Graham Moore\n\nIn December 1893, Sherlock Holmes-adoring Londoners eagerly opened their Strand magazines, anticipating the detective's next adventure, only to find the unthinkable: his creator, Arthur Conan Doyle, had killed their hero off. London spiraled into mourning -- crowds sported black armbands in grief -- and railed against Conan Doyle as his assassin. \n\nThen in 1901, just as abruptly as Conan Doyle had &quot;murdered&quot; Holmes in &quot;The Final Problem,&quot; he resurrected him. Though the writer kept detailed diaries of his days and work, Conan Doyle never explained this sudden change of heart. After his death, one of his journals from the interim period was discovered to be missing, and in the decades since, has never been found.\n\nOr has it?\n\nWhen literary researcher Harold White is inducted into the preeminent Sherlock Holmes enthusiast society, The Baker Street Irregulars, he never imagines he's about to be thrust onto the hunt for the holy grail of Holmes-ophiles: the missing diary. But when the world's leading Doylean scholar is found murdered in his hotel room, it is Harold - using wisdom and methods gleaned from countless detective stories - who takes up the search, both for the diary and for the killer.\n\n\n\nNotes: Both file types have been tested on a Samsung Note 10.1 (2012 model). I used version 3.0.4 of the Aldiko app. For the epub file, and version 4.4.0.71 of the Kindle for Android to test the mobi file. On my desktop PC I used Calibre version 1.42 and Kindle 1.10.8.\n\n\nEnjoy.\n\n\n","torrent":{"xt":"urn:btih:94ca78b5182ef119b1e6597f6d74e8419226cbde","amp;dn":"The+Sherlockian+ebook+by+Graham+Moore+epub+mobi+Fiction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ca78b5182ef119b1e6597f6d74e8419226cbde","infoHashBuffer":{"type":"Buffer","data":[148,202,120,181,24,46,241,25,177,230,89,127,109,116,232,65,146,38,203,222]},"announce":[],"urlList":[]}}