{"title":"Walpola Rahula - What the Buddha Taught (improved pdf)","uid":8077891,"size":9820577,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94d46a5e966ba723810f071eb7e84cc160ee2159&amp;dn=Walpola+Rahula+-+What+the+Buddha+Taught+%28improved+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"pharmakate","files":3,"time":1359423750,"description":"What the Buddha Taught by Walpola Rahula. \n\nThis short book is available in several forms on the internet, but this one is unique. It's a high quality scan of the paperback edition, and has had Acrobat's clearscan applied. In my opinion this is the highest quality version of this book currently available.\n\nAbout the book:\n\nThis short book is considered a classic in explaining the basic teachings of the Buddha. \n\nHere's a longer description:\n\n\nThis indispensable volume is a lucid and faithful account of the Buddha's teachings. &quot;For years,&quot; says the Journal of the Buddhist Society, &quot;the newcomer to Buddhism has lacked a simple and reliable introduction to the complexities of the subject. Dr. Rahula's What the Buddha Taught fills the need as only could be done by one having a firm grasp of the vast material to be sifted. It is a model of what a book should be that is addressed first of all to 'the educated and intelligent reader.' Authoritative and clear, logical and sober, this study is as comprehensive as it is masterly.&quot;\n\nThis edition contains a selection of illustrative texts from the Suttas and the Dhammapada (specially translated by the author), sixteen illustrations, and a bibliography, glossary, and index.\n\nAmazon.com Review\n\nBeneath the enormous umbrella of Buddhism, there is a diverse galaxy of customs and beliefs, but there is also a kernel of truth that every sect holds dear. Rahula Walpola, scholar and monk, discovers this foundation of Buddhism for us first through straightforward explication, never skipping over a point that has yet to be substantiated, then through translations from key scriptures. Logical and focused, these are the essentials of Buddhism; know them first, then move comfortably on to other Buddhist works.\n\nFrom Library Journal\n\nRahula is a scholar monk who trained in the Theravadan tradition in Ceylon. His succinct, clear overview of Buddhist concepts has never been surpassed. It is the standard. \n","torrent":{"xt":"urn:btih:94d46a5e966ba723810f071eb7e84cc160ee2159","amp;dn":"Walpola+Rahula+-+What+the+Buddha+Taught+%28improved+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d46a5e966ba723810f071eb7e84cc160ee2159","infoHashBuffer":{"type":"Buffer","data":[148,212,106,94,150,107,167,35,129,15,7,30,183,232,76,193,96,238,33,89]},"announce":[],"urlList":[]}}