{"title":"The Oxford Companion to the English Language (1992)","uid":5499439,"size":34924902,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95f7185206f81185927b7a826bd1d67b34084ea6&amp;dn=The+Oxford+Companion+to+the+English+Language+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"artpepper","files":-1,"time":1271449980,"description":"The Oxford Companion to the English Language\nEdited by Tom McArthur\n\nOxford University Press | 1992 | ISBN 019214183X | 1216 Pages | PDF | 33.3 MB\n\n\n\n\n\n\n\n\n\n\n\nPeople who love English already have a few books about advanced English usage, such as Fowler, and various style guides. I love Fowler; browsing its pages is a delight. \n\n\nThe Oxford Companion is different. It's much more objective, and more encylopedic. There are entries on many important linguistic terms and concepts, excellent definitions of all the grammatical terms you'll come across (what does &quot;dative&quot; mean?), accurate surveys of areas like what is a dialect and what isn't, and the major threads of the academic debate are presented. \n\n\nEvery letter of the alphabet is given its history. Curious about Scouse? About the impact of Samuel Johnson and his dictionary? What is the state of opinion about the Sapir-Whorfian Hypothesis? Estuary English? Regional dialects of North America? \n\n\nThis book is one of the best volumes anyone interested in the English lanuage could ever aquire. Every time I need a detail about the English language, literary devices and terminology, or grammatical usage, this book always has a couple of paragraphs to explain what I need to know -- and usually a handful of cross references to related topics. \n\n\nAll is done with the usual careful and thorough treatment you expect from Oxford University Press. Every library should have a copy of this book. A breakthrough contribution to books about English. \n","torrent":{"xt":"urn:btih:95f7185206f81185927b7a826bd1d67b34084ea6","amp;dn":"The+Oxford+Companion+to+the+English+Language+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95f7185206f81185927b7a826bd1d67b34084ea6","infoHashBuffer":{"type":"Buffer","data":[149,247,24,82,6,248,17,133,146,123,122,130,107,209,214,123,52,8,78,166]},"announce":[],"urlList":[]}}