{"title":"Tyler.Perrys.House.Of.Payne.Volume.1.XviD-HeaT","uid":4700569,"size":3685253167,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:962952e5a4b1e3d054fdd4df201778c087e2db6d&amp;dn=Tyler.Perrys.House.Of.Payne.Volume.1.XviD-HeaT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"HeaT15","files":21,"time":1233703759,"description":"[img]http://img508.imageshack.us/img508/2691/mainphpg2viewcoremf4.jpg[/img]\n\nTyler Perry's House of Payne is an American sitcom/comedy-drama TV series that airs on TBS. Created and produced by playwright, director, and producer Tyler Perry, the show revolves around a multi-generational family living under one roof in Atlanta, Georgia. The family is often involved in hectic and dramatic situations. The show premiered in syndication on June 21, 2006, and has been broadcast exclusively on TBS since June 6, 2007.\n\n1 \t&quot;Bully and The Beast&quot; \tJune 6, 2007\nWhile Janine proceeds to become more unaccountable and less reliable, Malik is being bullied at school by none other than Nikki (Keke Palmer), the foster daughter of Madea.\nCrossover: This episode proves that &quot;Madea's Family Reunion&quot; is a part of the same reality as &quot;House of Payne&quot;. \n\n2 \t&quot;I Can Cry If I Want To&quot; \tJune 6, 2007\nWhile the family contrives a surprise 50th birthday bash for Curtis, C.J. moves in with Ella and Curtis when his house burns down. Meanwhile, Curtis' old friend Mr. Brown irks the Paynes at Curtis' party.\nCrossover: This episode proves that &quot;Meet the Browns&quot; is a part of the same reality as &quot;House of Payne&quot;. \n\n3 \t&quot;More Than Meets the Eye&quot; \tJune 13, 2007\nWhile Jazmine misses her toys and friends, C.J. has suspicions Janine is cheating on him and is concerned about her unsettled behavior. \n\n4 \t&quot;Busted&quot; \tJune 13, 2007\nWhile Calvin sells &quot;replica&quot; designer items, Janine's drug abuse is official. \n\n5 \t&quot;Lost and Found&quot; \tJune 20, 2007\nWhile Curtis goes to anger management class, C.J. looks for Janine. \n\n6 \t&quot;Down and Outted&quot; \tJune 20, 2007\nC.J is dispirited about his life and his wife. Meanwhile, Curtis sees Malik wearing a tutu. \n\n7 \t&quot;No Money, Mo' Problems&quot; \tJune 27, 2007\nWhile Calvin shows off &quot;his&quot; house to a girl, C.J. puts Janine in rehab after accepting money from Curtis. \n\n8 \t&quot;Just Say No&quot; \tJune 27, 2007\nWhile the firefighters have a &quot;Sick Out&quot;, Jazmine is stirred by a &quot;Say No to Drugs&quot; seminar at school. \n\n9 \t&quot;Surprise, Surprise&quot; \tJuly 4, 2007\nJanine's parents show up looking for her. Claretha believes she knows Janine's father. \n\n10 \t&quot;Father Knows Best&quot; \tJuly 4, 2007\nJanine's parents return and want custody of the kids. The firefighters &quot;misplace&quot; the fire truck. \n\n11 \t&quot;I Keep Coming Up Short&quot; \tJuly 11, 2007\nCurtis has impotency issues. Meanwhile, C.J. tries to work out his debt. \n\n12 \t&quot;The Buck Stops Here&quot; \tJuly 11, 2007\nThe firehouse has a fundraiser. Meanwhile, Jazmine sells candy for her school. A new co-worker at the fire house turns out to be a woman. \n\n13      &quot;Wax On, Wax Off&quot; \tJuly 18, 2007\nMalik's going through puberty and the women in the house are clueless. Meanwhile, a failing inspection at the firehouse is Curtis's fault. \n\n14 \t&quot;Head of the Class&quot; \tJuly 18, 2007\nJazmine runs for class president in a mock election. Meanwhile, Curtis and Ella take an art class together with models. \n\n15 \t&quot;Paternity and Fraternity: Part 1&quot; \tJuly 25, 2007\nAn old high school flame of C.J.'s comes back in his life with a claim that is bound to rock his world. Meanwhile, Malik's hanging around a bad group of kids and gets into trouble.\nNote: China Anne McClain's real-life sister, Sierra Aylina McClain, guest stars in this episode. \n\n16 \t&quot;Paternity and Fraternity: Part 2&quot; \tJuly 25, 2007\nC.J. gets the results of the paternity test. Meanwhile, Bart does some extreme stunts while the firefighters place bets on him.\nNote: China Anne McClain's real-life sister, Sierra Aylina McClain, guest stars in this episode. \n\n17 \t&quot;Cracking Under Pressure&quot; \tAugust 1, 2007\nJanine and her associates steal from the Paynes. Meanwhile, Calvin trains for a marathon. \n\n18 \t&quot;Club PCP&quot; \tAugust 1, 2007\nCalvin plans a house party when the rest of the family visits relatives in Florida. \n\n19 \t&quot;Sadly Mistaken&quot; \tAugust 8, 2007\nBeverly steals Ella's identity, which compels Ella to confront Janine. Meanwhile, Calvin crams for mid-terms. \n\n20 \t&quot;And Justice for All&quot; \tAugust 8, 2007\nMalik meets someone on the Internet, who turns out to be a pedophile. Meanwhile, Curtis and Claretha have jury duty together. \n\n\nNOTES:\nRipped Straight Off The DVDs And Converted To XviD. This is a EXCLUSIVE. i just ripped these myself. These are the best quality of House Of Payne Vol. 1 u can get on torrents. VOLUME 2 COMING SOON!","torrent":{"xt":"urn:btih:962952e5a4b1e3d054fdd4df201778c087e2db6d","amp;dn":"Tyler.Perrys.House.Of.Payne.Volume.1.XviD-HeaT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962952e5a4b1e3d054fdd4df201778c087e2db6d","infoHashBuffer":{"type":"Buffer","data":[150,41,82,229,164,177,227,208,84,253,212,223,32,23,120,192,135,226,219,109]},"announce":[],"urlList":[]}}