{"title":"Sexually Broken--Japanese girls sound like Anime  Marica Hase  M","uid":8248960,"size":1264888197,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:962ce0cffe5f8c37ad2a38cda48a8c60f4382eef&amp;dn=Sexually+Broken--Japanese+girls+sound+like+Anime++Marica+Hase++M&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"merzedes","files":-1,"time":1363120037,"description":"It turns out Japanese girls really do sound like Anime when you brutally fucked them in bondage! | Marica Hase | Matt Williams\n\nMarch 11, 2013 \n \n\nMP4 only.\n\n \nWe welcome Marica Hase back to Sexually Broken. Born and raised in Japan, Marica has come to the United States to share with us her incredible desire to be bound and fucked, and we thank her for it.\n\nThis is our &quot;Meet and Greet&quot; with Marica. All the bondage is done on screen and the action is unrehearsed. We make it all up spontaneously as we go. It is the purest form of real bondage, sex and domination in the world. \n\nWe start by simply binding Marica's hands in front of her and pulling the arms straight up. We stretch our sexy Japanese girl out so we can play with her tiny, tight body. We molest and humiliate her, slowly stripping and then vibrating her to her first humiliating orgasm. She fights for control but we rip it from her with pleasure. She struggles to stand on two small blocks, fully spread, as she is cumming. We own her sexually and she knows it. \n\nWe take her hands and pull them tight to her pussy. A rope around her waist with a crotch rope keeps her hand down and unable to move without the rope burning her sensitive clit. We clamp her huge nipples with homemade Japanese nipple traps. The wood severely pinches and punishes Marica's oversensitive nipples. \n\nNow on her knees, we introduce the hard cock to the back of Marcia's throat. We are not gentle, and soon Marica is struggling from the brutal skull fucking she must endure. If you are a fan of rough, messy, bound throat-fucking, this is the update for you. Marica makes those cute sounds just like you hear in Anime, and truthfully, that fuels us to fuck her skull even harder. Deep throat spit soon covers Marica's face and she is completely humiliated from her mouth being used so throughly.\n\nA few changes and before your eyes Marica is trapped in a pile driver on the floor. The hard cock slides deep into her pussy and a rough fucking commences. Marica is fucked to one brutal orgasm. The cock pounds her helpless pussy. All Marica can do is cum and moan. We jack up the bondage further, pull out a vibrator and make our Japanese slut cum a few more times for good measure. Marica is left covered in in her own juices, out of breath struggling to figure out what the hell just happened....  \n \nScreens   &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_11mhase/SexuallyBroken-Marica-Hase-Matt-Williams-It-turns-out-Japanese-girls-really-do-sound-like-Anime-when-you-brutally-fucked-them-in-bondage.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/03_11mhase/SexuallyBroken-Marica-Hase-Matt-Williams-It-turns-out-Japanese-girls-really-do-sound-like-Anime-when-you-brutally-fucked-them-in-bondage.php&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:962ce0cffe5f8c37ad2a38cda48a8c60f4382eef","amp;dn":"Sexually+Broken--Japanese+girls+sound+like+Anime++Marica+Hase++M","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"962ce0cffe5f8c37ad2a38cda48a8c60f4382eef","infoHashBuffer":{"type":"Buffer","data":[150,44,224,207,254,95,140,55,173,42,56,205,164,138,140,96,244,56,46,239]},"announce":[],"urlList":[]}}