{"title":"The Story of Civilization - Will Durant (Unabridged)","uid":4556957,"size":9323507228,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:965c2bdd552b6453b0bb984f8954de04746b2e13&amp;dn=The+Story+of+Civilization+-+Will+Durant+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"eddie1969","files":602,"time":1228517616,"description":"The Story of Civilization by Will Durant is an eleven-volume set of books, which is considered by many to be the twentieth century's classic masterwork of history for the general reader. \n\nThe books are organized in such a way that they can be read as individual works or be read out of sequence with no loss to their meaning. The style of the books is conversational and peppered with puns and they are highly enjoyable to read. \n\nDurant is amazingly concise while still making his point. That being said, he does require the reader to do some work in that they must remember people and events. However, the books do not require heavy note taking or indeed anything of the sort because the books are a fun read.\n\nHis style is a good mix of history as literature and history as a science. The mix is necessary for the sake of readability and those of you who have been reading modern histories that seem to rely too much on footnotes and data points or conversely provide little at all will find his style refreshing. \n\nFor the student of history, this set is a fantastic collection. If you are looking to find an all encompassing treatise of world history, this is where to start. \n\nYou will not be disappointed. Unprecedented and unparalleled! \n\n\n\nSERIES OUTLINE:\n\n01. Our Oriental Heritage - This volume covers Near Eastern history until the fall of the Persian Empire, and the history of India, China, and Japan to the 1930s. \n\n02. The Life of Greece - This volume covers Ancient Greece and the Hellenistic Near East down to the Roman conquest. \n\n03. Caesar and Christ - This volume covers the history of Rome and of Christianity until the time of Constantine the Great. \n\n04. The Age of Faith and Religion - This volume covers the Middle Ages in both Europe and the Near East, from the time of Constantine to that of Dante. \n\n05. The Renaissance - This volume covers the history of Italy from c.1300 to the mid 16th century, focusing on the Italian Renaissance. \n\n06. The Reformation - This volume covers the history of Europe outside of Italy from around 1300 to 1564, focusing on the Protestant Reformation. \n\n07. The Age of Reason Begins - This volume covers the history of Europe and the Near East from 1559 to 1648. \n\n08. The Age of Louis XIV - This volume covers the period of Louis XIV of France in Europe and the Near East. \n\n09. The Age of Voltaire - This volume covers the period of the Age of Enlightenment, as exemplified by Voltaire, focusing on the period between 1715 and 1756 in France, Britain, and Germany. \n\n10. Rousseau and Revolution - This volume centers on Jean-Jacques Rousseau and his times. It received the Pulitzer Prize for General Non-Fiction in 1968. \n\n11. The Age of Napoleon - This volume centers on Napoleon I of France and his times. \n\n\nAudio Books : Literary : Unabridged","torrent":{"xt":"urn:btih:965c2bdd552b6453b0bb984f8954de04746b2e13","amp;dn":"The+Story+of+Civilization+-+Will+Durant+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"965c2bdd552b6453b0bb984f8954de04746b2e13","infoHashBuffer":{"type":"Buffer","data":[150,92,43,221,85,43,100,83,176,187,152,79,137,84,222,4,116,107,46,19]},"announce":[],"urlList":[]}}