{"title":"Buttmans Bouncing British Babes (Evil Angel) XXX (DVDRip)","uid":11823394,"size":1466501120,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:967de2f8ac9e3ddd1af93c1b063b8841cf36fe10&amp;dn=Buttmans+Bouncing+British+Babes+%28Evil+Angel%29+XXX+%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"xuluhulu","files":2,"time":1429374066,"description":"This blast from the past reminds us why John Stagliano's The Adventures Of Buttman ignited the gonzo revolution changing porn forever. Brit babes Roxanne Hall and Nicky Foster lead off the activities when they take on a young Rocco Siffredi and Buttman himself. A pairing of British T&amp;A model Linzi Drew and the toothsome Nici Sterling (credited as Nicky Teen), shot in a London beauty salon, is a rare lesbian treat, especially since Linzi didn't perform sex for anyone other than Buttman's roving camera. Nicky's budding sexuality was a taste of things to come when she landed in America and found fame as Nici Sterling. Britannia rules the waves when she bends over a car hood for garage muscleman Alberto Rey, giving up her tight ass for Buttman's camera and Alberto's throbbing cock. Like Sherlock Holmes, Buttman returns to the scene of an earlier crime where he again encounters Nicky T / Nici Sterling. This time he brought legendary cocksman Joey Silvera with buddies James Smith and Steve Thorpe who probe away at Nici who reveals the best kept secret of all: her passion extends beyond lesbian encounters and in fact, she's a cock hungry limey whore. He gorgeous smile and sexy British accent drive the yanks crazy, so she gives them all a yank and a little more. The finale is always a topper in the Buttman scenarios, in this case it's a five-way group grope with Nicky Foster, busty Black British beauty Rosanna Melendez, Roxanne Hall, Joey Silvera and Rocco Siffredi. The two legends tag team Rosanna in an early double penetration, but Rocco saves his load for the delightful ass-crack of horny lass Roxanne Hall. In the 20 years since Stagliano unleashed Buttman on the world, a lot has changed, but one thing has remained consistent: Buttman's love of ass and his need to share it with his legions of butt loving fans.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=10745799331928916619.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=10745799331928916619.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=55689264359188840887.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=55689264359188840887.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=00028357449411518731.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=00028357449411518731.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imghell.com/viewer.php?file=72914951628914395820.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imghell.com/viewer.php?file=72914951628914395820.jpg&lt;/a&gt;\n\n\nCAST:\n\nJoey Silvera, Rocco Siffredi, Roxanne Hall, John Stagliano, Alberto Rey, Linzi Drew, Britannia, Nicky Foster, Rosanna Melendez, James Smith, Nicky Teen, Steve Thorp\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:967de2f8ac9e3ddd1af93c1b063b8841cf36fe10","amp;dn":"Buttmans+Bouncing+British+Babes+%28Evil+Angel%29+XXX+%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"967de2f8ac9e3ddd1af93c1b063b8841cf36fe10","infoHashBuffer":{"type":"Buffer","data":[150,125,226,248,172,158,61,221,26,249,60,27,6,59,136,65,207,54,254,16]},"announce":[],"urlList":[]}}