{"title":"Lux Delux (Risk-like game)","uid":3962918,"size":28382562,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:967f61456e29e08bf670ecdd60a2d8e8c4008aa0&amp;dn=Lux+Delux+%28Risk-like+game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"depiratenbaai","files":1,"time":1199560669,"description":"Lux Delux is a game of strategy and domination inspired by the board game Risk. Control your armies to conquer and hold strategic countries on the map. The object of the game is simple: Take over the entire world!\n\nHundreds of Maps\nLux comes with over 400 different maps. Play on historical, geometric, geographic, and fantasy settings. New maps get added all the time.\n\nChallenging Artificial Intelligence\nPlay versus 11 different computer AI personalities. They start at easy and go all the way to hard (with a capital HARD). Lux provides a strong matchup even for experienced Risk game players. \n\nEasy Network Play\nJoining an online multiplayer game is as easy as 2 clicks - no need to muck about with IP addresses. Hosting an internet-wide game is just as simple. Now is the perfect time to start climbing the world wide rankings.\n\nStrong User Base\nLux has an active user community. The regulars can be found hanging around in the forums and playing multiplayer games online. Come and join the party.\n\nHackable\nUse the built-in Map Editor to create your own maps. Send it in and we&amp;#039;ll add it to the Plugin Manager. Programmers can create AIs and random map generators with the Lux SDK provided by Sillysoft.\n\nUnlimited Fun\nLux comes with a free 30 game trial period. The cost to buy the full version is $24.95 US. Full registration comes with unlimited gameplay, all of the maps, and inclusion in the online rankings. Register now securely and you will receive full access instantly. \n &lt;a href=&quot;\nhttp://sillysoft.net/lux/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sillysoft.net/lux/&lt;/a&gt;","torrent":{"xt":"urn:btih:967f61456e29e08bf670ecdd60a2d8e8c4008aa0","amp;dn":"Lux+Delux+%28Risk-like+game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"967f61456e29e08bf670ecdd60a2d8e8c4008aa0","infoHashBuffer":{"type":"Buffer","data":[150,127,97,69,110,41,224,139,246,112,236,221,96,162,216,232,196,0,138,160]},"announce":[],"urlList":[]}}