{"title":"Mary J Blige - What's The 411? -(1992)[EAC-MP3@320KBPS]","uid":4272173,"size":132297486,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96c93501d09d4a98c4a2878c84e1216bb2777ac7&amp;dn=Mary+J+Blige+-+What%5C%27s+The+411%3F+-%281992%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"seanprince","files":22,"time":1214992105,"description":"Mary J Blige - What&amp;#039;s The 411? -(1992)[EAC-MP3@320KBPS]\n\nTrack list\n\nMary J. Blige - What&amp;#039;s The 411\n\n01.\tLeave A Message\t\t\t\t03:38\n02.\tReminisce\t\t\t\t05:24\n03.\tReal Love\t\t\t\t04:32\n04.\tYou Remind Me\t\t\t\t04:19\n05.\tIntro Talk\t\t\t\t02:17\n06.\tSweet Thing\t\t\t\t03:46\n07.\tLove No Limit\t\t\t\t05:01\n08.\tI Don&amp;#039;t Want To Do Anything\t\t05:52\n09.\tSlow Down\t\t\t\t04:33\n10.\tMy Love\t\t\t\t\t04:14\n11.\tChanges I&amp;#039;ve Been Going Through\t\t05:15\n12.\tWhat&amp;#039;s The 411?\t\t\t\t04:13\n\nBiography\tby Stacia Proefrock\n\nWhen her debut album, What&amp;#039;s the 411?, hit the street in 1992, critics and fans alike were floored by its powerful combination of modern R&amp;B with an edgy rap sound that glanced off of the pain and grit of Mary J. Blige&amp;#039;s Yonkers, NY, childhood. Called alternately the new Chaka Khan or new Aretha Franklin, Blige had little in common stylistically with either of those artists, but like them, she helped adorn soul music with new textures and flavors that inspired a whole generation of musicians. With her blonde hair, self-preserving slouch, and combat boots, Blige was street-tough and beautiful all at once, and the record company execs who profited off of her early releases did little to dispel the bad-girl image that she earned as she stumbled through the dizzying first days of her career. As she exorcised her personal demons and softened her style to include sleek designer clothes, she remained a hero to thousands of girls growing up in the same kinds of rough places she came from. Blige reinvented her career again and again by shedding the bad habits and bad influences that kept her down; by the time her fourth album, Mary, was released in 1999, she had matured into an expressive singer able to put the full power of her voice behind her music, while still reflecting a strong urban style. With her fifth album, No More Drama, it wasn&amp;#039;t just Blige&amp;#039;s style that shone through the structures set up for her by songwriters and producers, it was her own vision -- spiritual, emotional, personal, and full of wisdom, it reflected an artist who was comfortable with who she was and how far she had come.\nBorn in the Bronx on January 11, 1971, Blige spent the first few years of her life in Savannah, GA, before moving with her mother and older sister to the Schlobam housing projects in Yonkers, NY. Her rough life there produced more than a few scars, physical and otherwise, and Blige dropped out of high school her junior year, instead spending time doing her friends&amp;#039; hair in her mother&amp;#039;s apartment and hanging out. When she was at a local mall in White Plains, NY, she recorded herself singing Anita Baker&amp;#039;s &quot;Caught Up in the Rapture&quot; into a karaoke machine. The resulting tape was passed by Blige&amp;#039;s stepfather to Uptown Records CEO Andre Harrell. Harrell was impressed with Blige&amp;#039;s voice and signed her to sing backup for local acts like Father MC. In 1991, however, Sean &quot;Puffy&quot; Combs took Blige under his wing and began working with her on What&amp;#039;s the 411?, her debut album. Combs had a heavy hand in What&amp;#039;s the 411?, along with producers Dave Hall, Mark Morales, and Mark Rooney, and the stylish touches that they added to Blige&amp;#039;s unique vocal style created a stunning album that bridged the gap between R&amp;B and rap in a way that no female singer had before. Uptown tried to capitalize on the success of What&amp;#039;s the 411? by issuing a remixed version of it a year later, but it was only a modest success creatively and commercially.\nHer 1995 follow-up, My Life, again featured Combs&amp;#039; handiwork, and if it stepped back stylistically from its urban roots by featuring less of a rap sound, it made up for it with its subject matter. My Life was full of ghetto pathos and Blige&amp;#039;s own personal pain shone through like a beacon. Her rocky relationship with fellow Uptown artist K-Ci Hailey likely contributed to the raw emotions on the album. The period following the recording of My Life was also a difficult time professionally for Blige, as she severed her ties with Combs and Uptown, hired Suge Knight as a financial advisor, and signed with MCA.\nReleased in 1997, Share My World marked the beginning of Blige&amp;#039;s creative partnerships with Jimmy Jam and Terry Lewis. The album was another hit for Blige and debuted at number one on the Billboard charts. Critics soured somewhat on its more conventional soul sound, but Blige&amp;#039;s fans seemed undaunted. By the time her next studio album, Mary, came out in 1999, the fullness and elegance of her new sound seemed more developed, as Blige exuded a classic soul style aided by material from Elton John and Bernie Taupin, Stevie Wonder, and Lauryn Hill. Mary made it obvious that the ghetto fabulous style and more confrontational aspects of her music were gone, while the emotive power still remained.\nThat power also helped carry the more modern-sounding 2001 release No More Drama, a deeply personal album that remained a collective effort musically yet reflected more of Blige&amp;#039;s songwriting than any of her previous efforts. The Mary J. Blige on No More Drama seemed miles away from the flashy kid on What&amp;#039;s the 411?, yet it was still possible to see the path through her music that produced an older, wiser, but still expressive artist. In 2003 she was reunited with P. Diddy, who produced the majority of that year&amp;#039;s patchy Love and Life album. The Breakthrough followed two years later and was a tremendous success, spawning a handful of major singles. By the December 2006 release of Reflections (A Retrospective), The Breakthrough&amp;#039;s lead single, &quot;Be Without You,&quot; had spent nearly a year on the R&amp;B chart, while the album&amp;#039;s fifth single, &quot;Take Me as I Am,&quot; had been on the same chart for over four months. A year later Blige came out with her eight studio album, Growing Pains, whose single &quot;Work That&quot; was featured on an iTunes commercial.\n\nReview\tby Stanton Swihart\n\nWith this cutting-edge debut, Mary J. Blige became the reigning queen of her own hybrid category: hip-hop soul. In retrospect, it is easier to place the album into the context of her career and, as such, to pinpoint the occasions when it runs wide of the rails. For instance, the synthesizer-heavy backdrops (&quot;Reminisce,&quot; &quot;Love No Limit&quot;) are sometimes flatter or more plastic than either the songs or Blige&amp;#039;s passionate performances deserve, while the answering-machine skits, much-copied in the wake of What&amp;#039;s the 411?, haven&amp;#039;t worn well as either stand-alone tracks or conceptual segues. Despite the minor flaws, the music is indeed revelatory on a frequent basis. &quot;Real Love&quot; and the gospel-thrusted &quot;Sweet Thing&quot; (the primary reason for the Chaka Kahn comparisons) are and likely will always remain timeless slices of soul even after their trendiness has worn off, and &quot;You Remind Me&quot; and the duet with Jodeci&amp;#039;s K-Ci (&quot;I Don&amp;#039;t Want to Do Anything&quot;) are nearly as effecting in their own right. It is nevertheless unclear how much of the hip-hop swagger in her soul was a genuine expression of Blige&amp;#039;s own vision or that of her admittedly fine collaborators (Svengali Sean &quot;Puffy&quot; Combs, R&amp;B producers Dave Hall and DeVante Swing, rap beatsmith Tony Dofat, rapper Grand Puba). Certainly the singer comes across as street-savvy and tough -- &quot;real,&quot; in the lingo of the day -- and even tries her hand at rhyming on the title track, but never again would her records lean this heavily on the sonic tricks of the rap trade. The eloquence and evocativeness that comes through in her voice, on the other hand, could be neither borrowed nor fabricated, making What&amp;#039;s the 411? one of the decade&amp;#039;s most explosive, coming-out displays of pure singing prowess. A momentous album, it is not Blige&amp;#039;s finest. In fact, those who prefer their soul more stirring, heart-on-sleeve, or close to the bone would likely find her fluid, powerfully vulnerable next recording (My Life) or one of the consistently strong subsequent efforts that followed it more to their liking. For broad appeal and historical importance, though, What&amp;#039;s the 411? is an inarguably paramount and trailblazing achievement. \n\nEnjoy.","torrent":{"xt":"urn:btih:96c93501d09d4a98c4a2878c84e1216bb2777ac7","amp;dn":"Mary+J+Blige+-+What%5C%27s+The+411%3F+-%281992%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c93501d09d4a98c4a2878c84e1216bb2777ac7","infoHashBuffer":{"type":"Buffer","data":[150,201,53,1,208,157,74,152,196,162,135,140,132,225,33,107,178,119,122,199]},"announce":[],"urlList":[]}}