{"title":"THE_FLY_2_1989_Xvid.avi","uid":4351680,"size":734015488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9723c43c3aaa5190ebcd563a3021da6f96eb6676&amp;dn=THE_FLY_2_1989_Xvid.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"samosa81","files":1,"time":1219186902,"description":"I thought it was about time this film was available in video format there were hardly no places to get this film so i thought id make the effort and convert it to AVI and post it for all you fly fans. ENJOY!\n\nplease keep this torrent alive and seed. This is my first torrent i&amp;#039;v dedicated to sharing for as long as it takes.\n\nChears SAMOSA!\n\nWIDTH: 640 PIXELS\nHEIGHT: 352 PIXELS\nDURATION: 01:40:19\nVIDEO COMPRESSION: XVID\n\ntaken from LMDB.com\n\n&quot;After Seth Brundle was &quot;debugged&quot;, his son, Martin Brundle, born of the human fly, is adopted by his father&amp;#039;s place of employment (Bartok Inc.) while the employees simply wait for his mutant chromosomes to come out of their dormant state. And thus &quot;THE FLY&quot; is reborn!!  Written by Eric Creed\n\nSeth Brundle was a renowned scientist whose warped experiments with teleportation transformed him into a man/fly hybrid called BrundleFly. A few months after the BrundleFly insect met its demise by his lover&amp;#039;s, Veronica, shotgun, she dies while giving birth to their son, Martin. Seth&amp;#039;s corrupt employer, Bartok, adopts Martin, only so Martin can solve the new problems that the still-functioning TelePods present and to use him as a science project because of the dormant insect genes. Martin is now fully grown, even though he is five, and the fly genes begin to awaken and make him just like dear, dead dad. With the help of his girlfriend, Beth, they go to wherever they can find a possible cure before Bartok finds them and brings them back, but not before Martin finishes his transformation into MartinFly, the deadliest of the BrundleFly species. Written by Will\n\nSeth Brundle was a research scientist whose genes were fused with a housefly in a matter transmission experiment and he transformed into the terrifying mutant creature &quot;Brundlefly&quot; and the journalist who he fell in love with, Vernoica Quaife killed him by blowing out his brains with a shotgun. Veronica has died giving birth to Seth&amp;#039;s son Martin. Martin is raised by Seth&amp;#039;s evil employer Anton Bartok who requires Martin&amp;#039;s help to solve the problems of the Telepods, believing the Telepods are the key for worldwide domination. Growing at a accelerated rate and inheriting his father&amp;#039;s mutated genes, Martin finds himself suffering his father&amp;#039;s fate as he himself transforming into a even more fierce and terrifying &quot;Brundlefly&quot;. Befriend by beautiful computer specialist Beth Logan, Martin sets out a way to cure himself, as the answer lies within the Telepod which is his only chance of saving himself from a terrible death. Written by Daniel Williamson &quot;\n","torrent":{"xt":"urn:btih:9723c43c3aaa5190ebcd563a3021da6f96eb6676","amp;dn":"THE_FLY_2_1989_Xvid.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9723c43c3aaa5190ebcd563a3021da6f96eb6676","infoHashBuffer":{"type":"Buffer","data":[151,35,196,60,58,170,81,144,235,205,86,58,48,33,218,111,150,235,102,118]},"announce":[],"urlList":[]}}