{"title":"New Directions of Modern Cryptography By Zhenfu Cao","uid":9413155,"size":19923301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9729d03e601dd73b8e0273de8d253bbdc88fe783&amp;dn=New+Directions+of+Modern+Cryptography+By+Zhenfu+Cao&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"420weedman","files":7,"time":1388359587,"description":"Modern cryptography has evolved dramatically since the 1970s. With the rise of new network architectures and services, the field encompasses much more than traditional communication where each side is of a single user. It also covers emerging communication where at least one side is of multiple users. New Directions of Modern Cryptography presents general principles and application paradigms critical to the future of this field. \nThe study of cryptography is motivated by and driven forward by security requirements. All the new directions of modern cryptography, including proxy re-cryptography, attribute-based cryptography, batch cryptography, and noncommutative cryptography have arisen from these requirements. Focusing on these four kinds of cryptography, this volume presents the fundamental definitions, precise assumptions, and rigorous security proofs of cryptographic primitives and related protocols. It also describes how they originated from security requirements and how they are applied. \nThe book provides vivid demonstrations of how modern cryptographic techniques can be used to solve security problems. The applications cover wired and wireless communication networks, satellite communication networks, multicast/broadcast and TV networks, and newly emerging networks. It also describes some open problems that challenge the new directions of modern cryptography. \nThis volume is an essential resource for cryptographers and practitioners of network security, security researchers and engineers, and those responsible for designing and developing secure network systems.","torrent":{"xt":"urn:btih:9729d03e601dd73b8e0273de8d253bbdc88fe783","amp;dn":"New+Directions+of+Modern+Cryptography+By+Zhenfu+Cao","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9729d03e601dd73b8e0273de8d253bbdc88fe783","infoHashBuffer":{"type":"Buffer","data":[151,41,208,62,96,29,215,59,142,2,115,222,141,37,59,189,200,143,231,131]},"announce":[],"urlList":[]}}