{"title":"Daniel Goleman - Emotional Intelligence: Why it can matter more","uid":12653664,"size":1948858144,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9899675b62b8441db8180b70e2bbcff18067f89e&amp;dn=Daniel+Goleman+-+Emotional+Intelligence%3A+Why+it+can+matter+more+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"acer47x","files":118,"time":1446186679,"description":"There was a time when IQ was considered the leading determinant of success. In this fascinating book, based on brain and behavioral research, Daniel Goleman argues that our IQ-idolizing view of intelligence is far too narrow. Instead, Goleman makes the case for &quot;emotional intelligence&quot; being the strongest indicator of human success. He defines emotional intelligence in terms of self-awareness, altruism, personal motivation, empathy, and the ability to love and be loved by friends, partners, and family members. People who possess high emotional intelligence are the people who truly succeed in work as well as play, building flourishing careers and lasting, meaningful relationships. Because emotional intelligence isn't fixed at birth, Goleman outlines how adults as well as parents of young children can sow the seeds.\r\n\r\nNew York Times science writer Goleman argues that our emotions play a much greater role in thought, decision making and individual success than is commonly acknowledged. He defines &quot;emotional intelligence&quot;?a trait not measured by IQ tests?as a set of skills, including control of one's impulses, self-motivation, empathy and social competence in interpersonal relationships. Although his highly accessible survey of research into cognitive and emotional development may not convince readers that this grab bag of faculties comprise a clearly recognizable, well-defined aptitude, his report is nevertheless an intriguing and practical guide to emotional mastery. In marriage, emotional intelligence means listening well and being able to calm down. In the workplace, it manifests when bosses give subordinates constructive feedback regarding their performance. Goleman also looks at pilot programs in schools from New York City to Oakland, Calif., where kids are taught conflict resolution, impulse control and social skills","torrent":{"xt":"urn:btih:9899675b62b8441db8180b70e2bbcff18067f89e","amp;dn":"Daniel+Goleman+-+Emotional+Intelligence%3A+Why+it+can+matter+more+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9899675b62b8441db8180b70e2bbcff18067f89e","infoHashBuffer":{"type":"Buffer","data":[152,153,103,91,98,184,68,29,184,24,11,112,226,187,207,241,128,103,248,158]},"announce":[],"urlList":[]}}