{"title":"Red Army Choir - Russian Favourites  FLAC","uid":5556106,"size":292171847,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:98e91fe1a8d3b359fb3a7fc92bcbbb8ddd8db50d&amp;dn=Red+Army+Choir+-+Russian+Favourites++FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"keeybee","files":26,"time":1273688207,"description":"Please seed!\n\nThe A.V. Alexandrov Russian army twice red-bannered academic song and dance ensemblein short, the Alexandrov ensemble is a performing ensemble that serves as the official army choir of the Russian armed forces.The ensemble consists of\na male choir, an orchestra, and a dance ensemble. The songs they perform range from Russian folk tunes to church hymns, operatic arias and popular music. After the Soviet period, the ensemble has continued performing, entertaining audiences both inside and outside Russia. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Red_Army_Choir&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Red_Army_Choir&lt;/a&gt;\n\nThe songs on this album were recorded at the Mosfilm Studio in Moscow, Russia, in August 1994. Linear notes included as a pdf file.\n\n\nVictor Fedorov: Red Army Choir and Band\nRussian Favourites\n1996\n\n01  Victor Fedorov: Red Army Choir - Russian Favourites - Farewell Of Slavianka  \n02  Victor Fedorov: Red Army Choir - Russian Favourites - O, Field, My Field (Polyushko Polye)  \n03  Victor Fedorov: Red Army Choir - Russian Favourites - We Are The Red Cavalry  \n04  Victor Fedorov: Red Army Choir - Russian Favourites - There, Far Away, Beyond The River  \n05  Victor Fedorov: Red Army Choir - Russian Favourites - The Sacred War  \n06  Victor Fedorov: Red Army Choir - Russian Favourites - There Marched The Soldiers  \n07  Victor Fedorov: Red Army Choir - Russian Favourites - In The Forest By The Combat Line  \n08  Victor Fedorov: Red Army Choir - Russian Favourites - The Sun Set Beyond The Mountain  \n09  Victor Fedorov: Red Army Choir - Russian Favourites - Decembrists - Chorus Of Soldiers  \n10  Victor Fedorov: Red Army Choir - Russian Favourites - Song Of The Volga Boatmen  \n11  Victor Fedorov: Red Army Choir - Russian Favourites - Troika  \n12  Victor Fedorov: Red Army Choir - Russian Favourites - The Cliff  \n13  Victor Fedorov: Red Army Choir - Russian Favourites - Hey, There's The Village  \n14  Victor Fedorov: Red Army Choir - Russian Favourites - The Volga Burlack's Song  \n15  Victor Fedorov: Red Army Choir - Russian Favourites - Dark Eyes (Ochi Chernye)  \n16  Victor Fedorov: Red Army Choir - Russian Favourites - The Brave Lads Of The Don   \n17  Victor Fedorov: Red Army Choir - Russian Favourites - On The Road (A Soldier's Song)  \n18  Victor Fedorov: Red Army Choir - Russian Favourites - Moscow Nights","torrent":{"xt":"urn:btih:98e91fe1a8d3b359fb3a7fc92bcbbb8ddd8db50d","amp;dn":"Red+Army+Choir+-+Russian+Favourites++FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98e91fe1a8d3b359fb3a7fc92bcbbb8ddd8db50d","infoHashBuffer":{"type":"Buffer","data":[152,233,31,225,168,211,179,89,251,58,127,201,43,203,187,141,221,141,181,13]},"announce":[],"urlList":[]}}