{"title":"Train Simulator 2013 (Steam Cracked Version)","uid":7909179,"size":2573998817,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:997975c7f13b1283ca87c34044f71e58e941ff7c&amp;dn=Train+Simulator+2013+%28Steam+Cracked+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"IiTraxiI","files":-1,"time":1355168180,"description":"Train Simulator 2013 - (Steam Cracked Version)\n\n*This version can be used Online \n\n\n\nDeveloped by : RailSimulator.com | Type of distribution : Game | Language : English | Year : 2012 | Genre: Simulation | Release Date: 3 Nov 2012\n\n\n\nAbout the Game\nThe best just got even better! RailSimulator.com pushes the boundaries of simulation once again with Train Simulator 2013, the latest addition to the multi-award winning series. Feel the power as you drive some of the worlds mightiest machines on railroads across the globe. Master these heavy duty trains as you complete missions and face fearsome challenges, build your career or simply drive for pleasure. Use the built-in tools to create new railroads, or add to your collection from our huge range of DLC locos and routes.\n\nKey Features:\nStunningly accurate locomotives with realistic sounds, controls and physics including ES44AC, SW10, Electrostar, ICE 3 and DB 101.\nFantastic routes including the fabulous Sherman Hill, London to Brighton and Munich-Augsburg.\nDrive with Xbox 360 controller, keyboard or mouse\nIntegrated STEAM workshop free mission download centre\nEnhanced graphics and performance\nScore your driving and join the global leader board with Career System\nQuick Drive menu system: drive what you like, where you like\nInteractive maps and task lists\nThe Union Pacific shield is a trademark of the Union Pacific Railroad Company. Amtrak is a registered service mark of the National Railroad Passenger Corporation. All rights reserved. Used with Permission.\n\nHow to Install: (Read Carefully)\n\n\nInstall Cracked Steam:\n\nInstall CSIW_Setup_09_Dec_2012 first during the setup it will ask you to view an advert before it highlights next just click the picture of the Cat then click next. Deselect Steam Tweaker and continue to install. When promted to Launch - Cracked Steam deselect and don't run or you will just get an &quot;error&quot; message which is not too big of a deal. \n\nLaunch cracked Steam by going to the following:\n\nFor X86 Users:\nc:program filescracked steam\n\nFor X64 users:\nc:program files (x86)cracked steam\n\nAnd select Cracked steam, you will see that it's updating Steam platform. \nOnce it's all updated you can either create a new account or login to an existing one.\nWhen you have either created or logged into an existing account you will see that it's updating again. \nSteam subscriber Agreement launches click &quot;I Accept&quot;\nPrivacy Policy click &quot;I Accept&quot;\nNow your logged into Steam you will see a whole bunch of games that you can install but as of yet this feature does not work correctly so there's no point trying to download any as you will only get an &quot;error&quot; Message.\nThen click Steam on the top left and select exit to Install Train Simulator 2013.\n\n\nInstall Train Simulator 2013:\n\nIt's easy all you have to do is extract the 7zip file:\nFor X86 Users:\nc:program filescracked steam\n\nFor X64 users:\nc:program files (x86)cracked steam\n\nOnce all is extracted launch cracked steam again in the account you created or the existing one and you will see that Train Simulator 2013 is highlighted to play. Just click play and have fun!\n\nBrought to you by:\nTeam RailGamer &amp; DarkHaze\n\nVisit Us At:     &lt;a href=&quot;\nhttp://www.railgamer.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.railgamer.co.uk/&lt;/a&gt;\n\n\nMore Torrents over at:        &lt;a href=&quot;\nhttp://1337x.org/user/RailGamer/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://1337x.org/user/RailGamer/&lt;/a&gt;\n\n\nLike Us On Facebook:\nSearch &quot;Rail Gamer&quot;\nTo keep up to date on new releases\t\n\t\t","torrent":{"xt":"urn:btih:997975c7f13b1283ca87c34044f71e58e941ff7c","amp;dn":"Train+Simulator+2013+%28Steam+Cracked+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"997975c7f13b1283ca87c34044f71e58e941ff7c","infoHashBuffer":{"type":"Buffer","data":[153,121,117,199,241,59,18,131,202,135,195,64,68,247,30,88,233,65,255,124]},"announce":[],"urlList":[]}}