{"title":"Mariah Carey - Studio Discography 1990 - 2010 (mp3 320kbps)","uid":7484802,"size":1745067688,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:99b8a63581c7cfd9aa6272622e060179ed915458&amp;dn=Mariah+Carey+-+Studio+Discography+1990+-+2010+%28mp3+320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"piratetorrent1989","files":180,"time":1343547459,"description":"Mariah Carey (born March 27, 1970) is an American singer, songwriter, record producer, and actress. She made her recording debut in 1990 under the guidance of Columbia Records executive Tommy Mottola, and released her self-titled debut studio album, Mariah Carey. The album went multi-platinum and spawned four consecutive number one singles, on the U.S. Billboard Hot 100 chart. Following her marriage to Mottola in 1993, a series of hit records, including Emotions (1991), Music Box (1993) and Merry Christmas (1994), established her position as Columbia's highest-selling act. Daydream (1995), made music history when the second single, &quot;One Sweet Day&quot; a duet with Boyz II Men, spent a record sixteen weeks on top of the Billboard Hot 100, and remains the longest-running number-one song in US chart history. During the recording of the album Carey began to deviate from her pop background, and slowly traversed into R&amp;B and Hip-hop. After her separation from Mottola, this musical change was evident with the release of Butterfly (1997).\nCarey left Columbia in 2000, and signed a record-breaking $100 million recording contract with Virgin Records. In 2001, Carey ventured into film with Glitter (2001). Before the film's release she suffered a physical and emotional breakdown and was hospitalized for severe exhaustion. Following the film's poor reception, she was bought out of her recording contract for $50 million, which led to a decline in her career. She signed a multi-million dollar contract deal with Island Records in 2002, and after an unsuccessful period, returned to the top of music charts with The Emancipation of Mimi (2005). Its second single &quot;We Belong Together&quot; became her most successful single of the 2000s, and was later named &quot;Song of the Decade&quot; by Billboard. Carey once again ventured into film, and starred in Precious (2009). Her role in the film was well-received, and she was awarded the &quot;Breakthrough Performance Award&quot; at the Palm Springs International Film Festival, and a NAACP Image Award nomination.\nIn a career spanning over two decades, Carey has sold more than 200 million records worldwide, making her one of the best-selling music artists of all time. In 1998, she was honored as the world's best-selling recording artist of the 1990s at the World Music Awards. Carey was also named the best-selling female artist of the millennium in 2000. According to the Recording Industry Association of America (RIAA), she is the third-best-selling female artist in the United States, with 63 million certified albums. With the release of &quot;Touch My Body&quot; (2008), Carey gained her eighteenth number one single in the United States, more than any other solo artist. Aside from her commercial accomplishments, Carey has won five Grammy Awards, and is famed for her five-octave vocal range, power, melismatic style and signature use of the whistle register.\n\nAlbums:\n\nMariah Carey (1990)\nEmotions (1991)\nMusic Box (1993)\nMerry Christmas (1994)\nDaydream (1995)\nButterfly (1997)\nRainbow (1999)\nGlitter (2001)\nCharmbracelet (2002)\nThe Emancipation of Mimi (2005)\nE=MCÂ² (2008)\nMemoirs of an Imperfect Angel (2009)\nMerry Christmas II You (2010)","torrent":{"xt":"urn:btih:99b8a63581c7cfd9aa6272622e060179ed915458","amp;dn":"Mariah+Carey+-+Studio+Discography+1990+-+2010+%28mp3+320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99b8a63581c7cfd9aa6272622e060179ed915458","infoHashBuffer":{"type":"Buffer","data":[153,184,166,53,129,199,207,217,170,98,114,98,46,6,1,121,237,145,84,88]},"announce":[],"urlList":[]}}