{"title":"Nothing Lasts Forever 1984 [XviD] (VHS)","uid":4527225,"size":524303415,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9a2c1fd8540359c249cb7a3cd900403eabba73a2&amp;dn=Nothing+Lasts+Forever+1984+%5BXviD%5D+%28VHS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"Glennza","files":2,"time":1227401160,"description":"As we may wait forever for this to get a DVD release (it has never even had a VHS release), I have ripped this from my 20 year old tape taken from cable. I have cleaned it up and for it looks pretty good.\n\nNothing Lasts Forever is a 1984 movie starring a number of high profile Hollywood actors. It was directed by Tom Schiller, who had previously worked on Saturday Night Live. Although widely regarded as a classic, and highly sought after, the movie was given only a very limited theatrical release, and, as of 2007 has not been released on home video.\n\nThe movie stars Zach Galligan and Lauren Tom in the lead roles, with a supporting cast including Bill Murray, Dan Aykroyd, Sam Jaffe and Mort Sahl. John Belushi was to appear in the film, but he died 6 weeks before production began.\n\nThe making of the film, through interviews with Tom Schiller, Lorne Michaels, Zach Galligan, Lauren Tom, Bill Murray and others involved with the film, is chronicled in the book Nothing Lost Forever: The Films of Tom Schiller by Michael Streeter (BearManor Media, 2005).\n\nLegal status\n\nA Warner Brothers spokesman stated in 2003 and again in February 2006 that the film cannot be released for unspecified &quot;legal difficulties&quot; . The film includes a large number of clips to give it the feel of the 1930s, and it is possible that getting copyright clearance for these clips has proved difficult. In 2007, another chat was conducted and Warner claimed it was &quot;on the middle burner -- not the front, but not the back.&quot; It is possible that this means the legal issues have been cleared up, but this was not explicitly stated.\n\nBill Murray and Dan Aykroyd have both agreed to take part in DVD special features, should the film be finally released [4]. Murray and Schiller held a screening of the film on April 13, 2004 at the BAM Cinematek in Brooklyn, New York. On September 6, 2005, Murray, Schiller and Zach Galligan attended another screening, this time at Lincoln Center&amp;#039;s Walter Reade Theater. The screening was followed by a Q&amp;A session and a book signing of Nothing Lost Forever: The Films of Tom Schiller.\n\nPlot\n\nThe plot concerns a young man (Galligan) who dreams of becoming an artist. On returning to his relatives in Manhattan, he finds that the Port Authority has taken control of the city, and is forced to work in a menial job under a trigger-happy boss (Aykroyd). His kindness to a tramp leads him to be taken into an underground network where he discovers that the city&amp;#039;s tramps are controlling the destiny of all the cities in the world. They instruct him to travel to the moon on a mission to spread peace and find his true love (Lauren Tom). Galligan accidentally finds a bus travelling to the moon. Bill Murray plays the bus conductor.\n\nDirector: Tom Schiller\nProducer: Lorne Michaels\n\n\nActor Role\n\nZach Galligan Adam Beckett\nApollonia Van Ravenstein Mara Hofmeier\nLauren Tom Ely\nDan Aykroyd Buck Heller\nImogene Coca Daisy Schackman\nAnita Ellis Aunt Anita\nEddie Fisher Himself\nSam Jaffe Father Knickerbocker\nMort Sahl Uncle Mort\nJan Triska Swedish Architect\n\n\nComments are appreciated","torrent":{"xt":"urn:btih:9a2c1fd8540359c249cb7a3cd900403eabba73a2","amp;dn":"Nothing+Lasts+Forever+1984+%5BXviD%5D+%28VHS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a2c1fd8540359c249cb7a3cd900403eabba73a2","infoHashBuffer":{"type":"Buffer","data":[154,44,31,216,84,3,89,194,73,203,122,60,217,0,64,62,171,186,115,162]},"announce":[],"urlList":[]}}