{"title":"Adyashanti - Resurrecting Jesus","uid":10950520,"size":317430332,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9ab9863d5bd3ec06f7e811f8a76e35b1993be746&amp;dn=Adyashanti+-+Resurrecting+Jesus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"flame2moth","files":-1,"time":1409629529,"description":"The life of Jesus offers each one of us a map to the direct realization of our eternal and divine nature. On Resurrecting Jesus, Adyashanti excavates the deep, mythic underpinnings of the Gospels to show how we can all find in the story of Jesus the spark for our own spiritual unfolding. \n\nJesus crossed all of the boundary lines that separated the people of his time because he viewed the world from the perspective of what unites us, not what divides us. In these intimate sessions, Adyashanti invites us to consider the man known as Jesus as a model of enlightened engagement with the world. He examines the story of Jesus from his birth to the Resurrection to reveal how the central events in Jesus' life parallel the stages of awakening that we may be called to experience ourselves. Adyashanti concludes by illuminating five central archetypes of the Jesus story -- Peter, John, Mary Magdalene, Judas, and Pontius Pilate -- and the key insights they hold about the way we may relate to the spiritual impulse within. \n\n&quot;Jesus symbolizes the spiritual mystery of each one of us,&quot; explains Adyashanti, &quot;and points us toward the radiance available right now -- the grace through which we realize that we are each sons and daughters of a living God.&quot; Resurrecting Jesus will inspire you to pour yourself fully into &quot;the transmission of infinite love&quot; that he represents -- to discover how that love revolutionizes our lives and our world.\n\nHighlights:\n\nDiscovering your essence as divine being\nThe deeper motive for Jesus' healing ministry\nBreaking through the structures of ignorance and separation\nOpening our eyes to the miracles all around us\n&quot;Quiet, be still&quot; -- the most potent spiritual practice\nEleven hours of teachings on the life of Jesus as a template for spiritual awakening\n\nÂ© 2014 by Adyashanti.","torrent":{"xt":"urn:btih:9ab9863d5bd3ec06f7e811f8a76e35b1993be746","amp;dn":"Adyashanti+-+Resurrecting+Jesus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ab9863d5bd3ec06f7e811f8a76e35b1993be746","infoHashBuffer":{"type":"Buffer","data":[154,185,134,61,91,211,236,6,247,232,17,248,167,110,53,177,153,59,231,70]},"announce":[],"urlList":[]}}