{"title":"Free Energy - The Race To Zero Point Energy [AVI - Over Unity]","uid":4334624,"size":392308224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b4cda8ceb4dcc132ced7f0bafc3dbdb8beb42c4&amp;dn=Free+Energy+-+The+Race+To+Zero+Point+Energy+%5BAVI+-+Over+Unity%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"lkobescak","files":1,"time":1218234405,"description":"Free Energy\n-----------\n\n\nIn this award-winning, feature length, two-hour broadcast-quality Documentary you will learn about the latest developments in the field of Free and Zero Point Energy from Tesla to Dennis Lee. Hosted by Bill Jenkins, formerly of ABC Radio, this comprehensive documentary features physicists and inventors who are challenging orthodox science to bring this non-polluting technology forward despite ridicule and suppression. See actual working prototypes that defy classical physics including phenomenal experiments in anti-gravity and the transmutation of metals. \n\nNominated for the UN Sasakawa Environmental Award\n\nFrom Nicola Tesla to cold fusion, magnetic motors to anti-gravity propulsion Ã‚Â­ this program presents powerful information!\n\nVisionary Inventors and Scientists Reveal Non-Polluting Technologies That Will Change Our World\n\nA groundbreaking and inspiring look at the leading theories and practical devices that tap into &quot;zero point energy&quot; - now acknowledged by physicists to exist in all space as a &quot;running river&quot; of infinite and accessible electromagnetic energy.\n\nFollow the fascinating stories of dedicated inventors and scientists engaged in the struggle for revolutionary innovations that will change our collective future forever. This program will transform the way you think about science and the natural laws of the universe by illuminating the historical contributions of the visionaries pioneering this field.\n\nExplore the latest Free Energy breakthroughs, including:\n\n~ Technologies based on working with nature instead of against it.\n\n~ Radical inventions that emit hydrogen and oxygen as by-products.\n\n~Transmutation processes that neutralize radioactive waste.\n\n~ Electric vehicles with magnetic motors that recharge their own batteries.\n\nFeaturing: The Patterson cold fusion power cell ~ Troy Reed&amp;#039;s magnetic &quot;Surge&quot; motors ~ Paul Pantone&amp;#039;s GEET processor for increasing fuel efficiency in cars ~ Joseph Newman&amp;#039;s rotating magnet &quot;over unity&quot; motor ~ Dennis Lee&amp;#039;s Low temperature phase-change technologies ~ John Hutchison&amp;#039;s amazing anti-gravity experiments ~ Along with internationally recognized scientists and authors: Tom Bearden ~ Hal Fox ~ Shiuji Inomita Moray King ~ Eugene Mallove ~ Jeanne Manning Brian O&amp;#039;Leary &amp; Tom Valone. \n\n\nRun Time: 109 minutes\n\n\n------------------------------------------------------------------------\n\nAdditional information on September 11th, NWO, the Illuminati and the great threat to you can be found at www infowars com or www.prisonplanet.com\n\n------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:9b4cda8ceb4dcc132ced7f0bafc3dbdb8beb42c4","amp;dn":"Free+Energy+-+The+Race+To+Zero+Point+Energy+%5BAVI+-+Over+Unity%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4cda8ceb4dcc132ced7f0bafc3dbdb8beb42c4","infoHashBuffer":{"type":"Buffer","data":[155,76,218,140,235,77,204,19,44,237,127,11,175,195,219,219,139,235,66,196]},"announce":[],"urlList":[]}}