{"title":"Near-Infrared Spectroscopy - Principles, Instruments, Applicatio","uid":15988831,"size":29533791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ba05763ddc52afa1441d700d4fe83228f40414f&amp;dn=Near-Infrared+Spectroscopy+-+Principles%2C+Instruments%2C+Applicatio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"clouderone","files":1,"time":1475988604,"description":"Near-Infrared Spectroscopy - Principles, Instruments, Applications - H. W Siesler et al. (Wiley-VCH, 2002).pdf\r\n\r\nOver the last few years, near-infrared (NIR) spectroscopy has rapidly developed into an important and extremely useful method of analysis. In fact, for certain research areas and applications, ranging from material science via chemistry to life sciences, it has become an indispensable tool because this fast and cost-effective type of spectroscopy provides qualitative and quantitative information not available from any other technique.\r\nThis book offers a balanced overview of the fundamental theory and instrumentation of NIR spectroscopy, introducing the material in a readily comprehensible manner. A considerable part of the text is dedicated to practical applications, including sample preparation and investigations of polymers, textiles, drugs, food and animal feed. However, special topics, such as two-dimensional correlation analysis, are also covered in separate chapters. \r\nWritten by eight experts in different fields, this book presents an introduction to the current state of developments and is valuable to spectroscopists and to practitioners applying NIR spectroscopy as a daily analytical tool","torrent":{"xt":"urn:btih:9ba05763ddc52afa1441d700d4fe83228f40414f","amp;dn":"Near-Infrared+Spectroscopy+-+Principles%2C+Instruments%2C+Applicatio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba05763ddc52afa1441d700d4fe83228f40414f","infoHashBuffer":{"type":"Buffer","data":[155,160,87,99,221,197,42,250,20,65,215,0,212,254,131,34,143,64,65,79]},"announce":[],"urlList":[]}}