{"title":"Ploytec USB Audio ASIO driver ver. 2.8.40 (32/64bit, w/ serial)","uid":11783773,"size":7994366,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9ba26b15997e669216cf20bbcb3eb4b25e7bef3c&amp;dn=Ploytec+USB+Audio+ASIO+driver+ver.+2.8.40+%2832%2F64bit%2C+w%2F+serial%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"ShiningOver","files":98,"time":1427682149,"description":"Ever thought about using your laptop as a synthesizer or digital effect-box? Did you notice there's some delay related to the computer's sound processing?\n\nThe USB Audio ASIO driver is the solution. It enables buffersizes down to 32 samples (0.73 ms) and creates an ultra highspeed USB audio connection, bypassing the operating system's audio.\n\nThis does not only give you low latencies, but better sound quality also.\n\nSoundManager (Mac) and MultiMedia Extensions (MME / Win) use non-highend sample rate conversion in order to sync the different audio signals from applications to the sample rates used on the external soundcard. And sometimes there's not even a way to control the rate to be the prefered one. (E.g. 48kHz instead of 44.1kHz.)\n\nUsing ASIO it's possible to do direct &quot;one to one&quot; hardware connections and even use higher bitrates (e.g. 20bit or 24bit) if supported by the device.\n\nBut of course, you need an ASIO compatible application like Audition, Cubase, Wavelab, Logic Audio, Reason, Live, Studio One, Digital Performer, Sonar, BPM Studio, etc. If the app supports ASIO2 you'll be able to benefit from more features.\n\nCompanies including Access, AKAI, Alesis, Allen&amp;Heath, Alva, American Audio, CME, DirectOut, DJ-Tech, ESI, Infrasonic, Lexicon, Numark, Reloop, SIMS, Sound Devices, SPL, Steinberg, Swissonic, Tascam, Terrasoniq, Terratec, Voxoa, Yamaha and Yellowtec decided to license and bundle this driver. So fully functional custom drivers are available for Access Virus TI, Access Virus TI snow, AKAI EIE pro, AKAI MPC Rennaissance, Alesis Multimix 8 USB2.0, Alesis Multimix 16 USB2.0, Allen&amp;Heath Wizard USB Audio Option, Allen&amp;Heath XONE:23C, Allen&amp;Heath XONE:2D, Allen&amp;Heath XONE:4D, Allen&amp;Heath XONE:DX, Allen&amp;Heath XONE:DB2, Allen&amp;Heath XONE:DB4, Alva Nanoface, American Audio Versa Port, American Audio Encore 2000, CME XCORPIO, DirectOut i64.USB, DJ-Tech Reloaded, ESI ESU1808, ESI Gigaport AG / DG, ESI Maya 44 USB, Infrasonic Amon, Lexicon I-ONIX U22, Lexicon I-ONIX U42S, Lexicon I-ONIX U82S, Mindprint DI-MOD USB, Numark 4Trak, Numark DJ IO, Numark NS6, Numark NS7-II, Numark Omni Control, Numark V7, Reloop Digital Jockey, Reloop Jockey 3ME, SIMS Primus, Sound Devices USBpre, Sound Devices USBpre 2, SPL Crimson, Steinberg MI2, Steinberg MI4, Swissonic Easy USB, Tascam M-164UF, Tascam UH-7000, Tascam US-122L, Tascam US-144, Tascam US-122mkII, Tascam US-144mkII, Tascam US-200, Tascam US-600, Tascam US-1200, Tascam US-1641, Tascam US-1800, Tascam US-2000, Tascam US-322, Tascam US-366, Terratec Area 61, Terrasoniq Phase X64, Terratec Phase 26 USB, Voxoa S60, Voxoa A50, Voxoa C60, Yamaha UW10, Yamaha UW500, Yellowtec PUC2 and many others.\n\nThere's also a commercial version of the USB ASIO driver supporting Alesis' USB 1.1 mixing desks, ART USB, Audiotrak EX / EX5 / Maya 5.1 USB (48kHz only), Audiotrak EX7 / Maya 7.1 USB, Audiotrak OPTOPlay, Creative Audigy 2 NX (48 kHz only / not on Mac OS X yet), Creative Extigy (48kHz only), Creative MP3+ (48kHz only), Creative SoundBlaster Live 24bit external, Digidesign Mbox, Elektor USB audio, Event EZBus, Edirol UA-1A (44.1kHz only), Edirol UA1-X, Edirol UA-3(D), Griffin iMic, Griffin PowerWave, HHB Portadisc, Hercules MusePocket (48kHz only), Lexicon Omega, M-Audio Audiophile USB, Opcode DAT-/SonicPort (optical), Onkyo MSE-U33(HB), Onkyo SE-U55(X(S)), Philips Aurilium (48kHz only), Roland-ED UA-30, Sitecom's 5.1 Audio Adapter (48kHz only), Terratec Aureon 5.1 USB (48 kHz only), Vivanco 5.1 Audio Converter (48kHz only), Waveidea UASC-1, Yamaha USB mixing desks and a number of more devices available at the online shop. \n\nLimitations using Creative Extigy with this driver: 48 kHz, stereo output, line or mic input (digital input only while output is muted), no MIDI, no remote control functionality. We worked hard to change this, still it seems to be impossible at the moment. But low latency at least...\n\n==================================================================================\n\nDownload, install 2.8.40 (the right version for your OS) 32 bit or 64 bit. Use the included serial. Done","torrent":{"xt":"urn:btih:9ba26b15997e669216cf20bbcb3eb4b25e7bef3c","amp;dn":"Ploytec+USB+Audio+ASIO+driver+ver.+2.8.40+%2832%2F64bit%2C+w%2F+serial%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ba26b15997e669216cf20bbcb3eb4b25e7bef3c","infoHashBuffer":{"type":"Buffer","data":[155,162,107,21,153,126,102,146,22,207,32,187,203,62,180,178,94,123,239,60]},"announce":[],"urlList":[]}}