{"title":"Sublime Frequencies - Near Discography (36 albums,6 movies)","uid":4134563,"size":7028236772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9c30939479da5dd57fbadb6cf4dc4c20ba1acb46&amp;dn=Sublime+Frequencies+-+Near+Discography+%2836+albums%2C6+movies%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":5,"uploader":"mvick","files":735,"time":1208199980,"description":"SUBLIME FREQUENCIES is a collective of explorers dedicated to acquiring and exposing obscure sights and sounds from modern and traditional urban and rural frontiers via film and video, field recordings, radio and short wave transmissions, international folk and pop music, sound anomalies, and other forms of human and natural expression not documented sufficiently through all channels of academic research, the modern recording industry, media, or corporate foundations. SUBLIME FREQUENCIES is focused on an aesthetic of extra-geography and soulful experience inspired by music and culture, world travel, research, and the pioneering recording labels of the past including OCORA, SMITHSONIAN FOLKWAYS, ETHNIC FOLKWAYS, LYRICHORD, NONESUCH EXPLORER, MUSICAPHONE, BARONREITER, UNESCO, PLAYASOUND, MUSICAL ATLAS, CHANT DU MONDE, B.A.M., TANGENT, and TOPIC.\n\nIncluded Albums: All albums at least 192kbps or LAME VBR\n[ANOM26] Various Artists - Leaf Music, Drunks, Distant Drums\n[SF001] Various Artists - Folk And Pop Sounds Of Sumatra Vol. 1\n[SF002] Various Artists - Radio Java\n[SF003] Various Artists - Night Recordings From Bali\n[SF006] Various Artists - Folk And Pop Music Of Myanmar (Burma)\n[SF007] Various Artists - Radio Morocco\n[SF008] Various Artists - Radio Palestine: Sounds Of The Eastern Mediterranean \n[SF009] Various Artists - I Remember Syria\n[SF011] Various Artists - Cambodian Cassette Archives: Khmer Folk &amp; Pop Music Vol. 1\n[SF012] Various Artists - Bush Taxi Mali: Field Recordings From Mali\n[SF013] Brokenhearted Dragonflies: Insect Electronica From Southeast Asia\n[SF014] Various Artists - Radio India: The Eternal Dream Of Sound\n[SF016] Various Artists - Streets Of Lhasa\n[SF017] Various Artists - Harmika Yab Yum: Folk Sounds From Nepal\n[SF018] Various Artists - Folk And Pop Sounds Of Sumatra Vol. 2\n[SF019] Various Artists - Molam: Thai Country Groove From Isan\n[SF020] Various Artists - Radio Phnom Penh\n[SF021] Various Artists - Radio Sumatra: The Indonesian FM Experience\n[SF023] Various Artists - Radio Pyongyang: Commie Funk And Agit Pop From The Hermit Kingdom\n[SF024] Various Artists - Guitars Of The Golden Triangle: Folk And Pop Music Of Myanmar Vol. 2\n[SF025] Various Artists - Choubi Choubi! Folk And Pop Sounds From Iraq\n[SF027] Various Artists - Ethnic Minority Music Of Northeast Cambodia\n[SF028] Various Artists - Radio Thailand: Transmissions From The Tropical Kingdom\n[SF029] Various Artists - Radio Algeria\n[SF030] Group Doueh - Guitar Music From The Wester Sahara\n[SF031] Omar Souleyman - Highway To Hassake (Folk And Pop Sounds Of Syria)\n[SF032] Various Artists - Thai Pop Spectacular (1960&amp;#039;s-1980&amp;#039;s)\n[SF033] Various Artists - Molam: Thai Country Groove From Isan Vol. 2\n[SF034] Group Inerane - Guitars From Agadez (Music Of Niger)\n[SF035] Various Artists - Music Of Nat Pwe: Folk And Pop Music Of Myanmar Vol. 3\n[SF036] Various Artists - Ethnic Minority Music Of Southern Laos\n[SF037] Various Artists - Ethnic Minority Music Of North Vietnam\n[SF038] Various Artists - Proibidao C.V.: Forbidden Gang Funk From Rio de Janeiro\n[SF039] Various Artists - Latinamericarpet: Exploring The Vinyl Warp Of Latin American Psychedelia Vol. 1\n[SF042] Various Artists - Shadow Music Of Thailand\n[SF043] Various Artists - Bollywood Steel Guitar\n\nIncluded Movies:\n[SF004] Nat Pwe: Burma&amp;#039;s Carnival Of Spirit Soul\n[SF005] Jemaa El Fna: Morocco&amp;#039;s Rendezvous Of The Dead \n[SF010] Folk Music Of The Sahara: Among The Tuareg Of Libya\n[SF015] Isan: Folk And Pop Music Of Northeast Thailand\n[SF022] Niger: Magic And Ecstasy In The Sahel\n[SF026] Phi Ta Khon: Ghosts Of Isan\n\nOther Notes:\nAll albums include proper id3 tags, album art, release notes and .nfo files\nAll videos include video art, release notes and codec information .txt files\n\n**THE ONLY MISSING ITEMS FROM THIS DISCOGRAPHY ARE:\n[SF040] Sumatran Folk Cinema *dvd*\n[SF041] Musical Brotherhoods From The Trans-Saharan Highway *dvd*\n\n*Thanks to all those who have helped me obtain these albums - you know who you are*\n\n*I do not have the fastest connection in the world, but I will continually be seeding, so just hang in there - it will complete eventually!","torrent":{"xt":"urn:btih:9c30939479da5dd57fbadb6cf4dc4c20ba1acb46","amp;dn":"Sublime+Frequencies+-+Near+Discography+%2836+albums%2C6+movies%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c30939479da5dd57fbadb6cf4dc4c20ba1acb46","infoHashBuffer":{"type":"Buffer","data":[156,48,147,148,121,218,93,213,127,186,219,108,244,220,76,32,186,26,203,70]},"announce":[],"urlList":[]}}