{"title":"The.King.of.Fighters.XIII.Update.v1.1c-RELOADED","uid":8978727,"size":15373128,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9cca1331e59a20afd576d7681297880453c41238&amp;dn=The.King.of.Fighters.XIII.Update.v1.1c-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mr.Stifmeister","files":3,"time":1380504643,"description":"\nnERv\n\nThe King of Fighters XIII Update v1.1c (c) SNK Playmore\n\n09/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n- :.......... DISC(S) .. GAME.TYPE ........: Action\n\nUpdate notes:\n\n- Includes alternative resolutions.\n\n--\n\nTHE KING OF FIGHTERS XIII, SNK PLAYMORE's flagship 2D versus fighting\ntitle returns in an ultimate version on Steam\nThe many features exclusive to the console version of the game, such as\nthe ONLINE Mode that allows you to enjoy smooth online versus matches\nwith rivals from around the world, the Tutorial Mode which can be\nenjoyed by KOF novice players, and the Story Mode which features several\nexclusive episodes in a Visual Novel format, have been improved are\nstill available in THE KING OF FIGHTERS XIII Steam Edition\nIn addition, &quot;Iori with the Power of Flames, NESTS Style Kyo, and\nMr. Karate&quot; DLC characters are now playable from the start, for a total\nroster of 36 characters\nThe time has come to face rivals worldwide\nMAIN FEATURES\n3-ON-3 TEAM BATTLE:\nChoose a default team of 3 characters or make your own team by picking\nup 3 characters of your choice, and fight against teams until victory\nDevelop your own team strategy by choosing the best characters for you\n\nSTORY:\nIn this mode, you will experience a variety of background stories not\ntouched upon in the games original Arcade Version. Discover the truth\nabout KOF's Ash Saga and its secrets through the eyes of the main\ncharacter, Ash Crimson, and other characters who were not directly\nparticipating in the tournament. Your decisions and battle results may\nlead you to discovering new story elements try out all the different\noptions and every scene\n\nNETWORK:\n&quot;THE KING OF FIGHTERS XIII Steam Edition&quot; now features vastly improved\nnetcode that will provide you with the most comfortable online\nexperience yet The new netcode features improved communication speeds\nbetween you and your opponent, and also tailors your online experience\naccording to your PC environment\n\nTHE KING OF FIGHTERS XIII Steam Edition features three different types\nof ONLINE VERSUS Matches, allowing players to challenge other rivals\nworldwide in endless and intense battles:\n- Ranked Match: fight under specified regulations, and your results\nwill be reflected in the rankings.\n- Player Match: playing in this mode will not affect your results. You\ncan fight against others casually.\n- Friend Match: invite online players and challenge them through this\nmode for heated competition\n\nMISSION:\nTackle three different kinds of missions in this mode, and improve your\nskills\n- TIME ATTACK: Defeat all CPU opponents in the shortest time you can.\n- SURVIVAL: Select a character and fight your way through as many CPU\nopponents as you can.\n- TRIAL: In this mode, each character has 10 tasks, which mainly focus\non combos. By the time you complete all 10 tasks, you will have mastered\nsome combos for that character.\n\nTUTORIAL:\nRose Bernstein, hostess of the tournament, will teach you the basic\ntechniques as well as explain the gauges and their uses. First time KOF\nplayers should start here to get used to the game.\n\nCUSTOMIZE:\nThis mode allows you to edit your online profile and change character\ncolor palette. You can create a team to use online, add icons collected\nwhile playing, or enter a preset message that you want to use in your\nprofile. For each character, you can make up to five custom color\npatterns. Show off your personality on the worldwide stage\n\nOPTION:\nA GRAPHICS OPTION feature, allowing the players to switch between\ndifferent frame rates and simplify backgrounds, has been newly added.\n\n1. Unrar.\n2. Install the update on top of our The King of Fighters XIII release.\n3. Play the game.\n4. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:9cca1331e59a20afd576d7681297880453c41238","amp;dn":"The.King.of.Fighters.XIII.Update.v1.1c-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cca1331e59a20afd576d7681297880453c41238","infoHashBuffer":{"type":"Buffer","data":[156,202,19,49,229,154,32,175,213,118,215,104,18,151,136,4,83,196,18,56]},"announce":[],"urlList":[]}}