{"title":"Bob Dylan - Blood On The Tracks [320k MP3]","uid":11634238,"size":134926930,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d0303645e19b0f3de1f2bd6a811b217db0b44ce&amp;dn=Bob+Dylan+-+Blood+On+The+Tracks+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"smbdownload","files":-1,"time":1417711866,"description":"Blood on the Tracks is the fifteenth studio album by American singer-songwriter Bob Dylan, released on January 20, 1975 by Columbia Records. The album marked Dylan's return to Columbia Records after a two-album stint with Asylum Records. Dylan commenced recording the album in New York City in September 1974. In December, shortly before Columbia was due to release the record, Dylan abruptly re-recorded much of the material in a studio in Minneapolis. The final album contained five tracks from New York and five tracks from Minneapolis.\n\nBlood on the Tracks was initially received with mixed reviews, but has subsequently been acclaimed as one of Dylan's greatest albums by critics and fans. The songs have been linked to tensions in Dylan's personal life, including estrangement from his then-wife Sara, and one of their children, Jakob Dylan, has described the songs as &quot;my parents talking&quot;. The album has been viewed as an outstanding example of the confessional singer-songwriter's craft, and it has been called &quot;the truest, most honest account of a love affair from tip to stern ever put down on magnetic tape&quot;. In interviews, Dylan has denied that the songs on the album are autobiographical. In 2003, the album was ranked number 16 on Rolling Stone's list of the 500 greatest albums of all time, and in 2004, it was placed at number 5 on Pitchfork Media's list of the top 100 albums of the 1970s. \n\nThe album reached #1 on the Billboard 200 charts and #4 on the UK Albums Chart. The single &quot;Tangled Up in Blue&quot; peaked at #31 on the Billboard Hot 100 singles chart. The album remains one of Dylan's best-selling studio releases, with a double-platinum US certification by the Recording Industry Association of America (RIAA). \n\nTrack Listing [320k MP3]\n\n01. \t&quot;Tangled Up in Blue&quot;   \t5:42\n02. \t&quot;Simple Twist of Fate&quot;   \t City \t4:19\n03. \t&quot;You're a Big Girl Now&quot;   \t4:36\n04. \t&quot;Idiot Wind&quot;   \t7:48\n05. \t&quot;You're Gonna Make Me Lonesome When You Go&quot;   \t2:55\n06. \t&quot;Meet Me in the Morning&quot;   \t4:22\n07. \t&quot;Lily, Rosemary and the Jack of Hearts&quot;   \t8:51\n08. \t&quot;If You See Her, Say Hello&quot;   \t4:49\n09. \t&quot;Shelter from the Storm&quot;   \t5:02\n10. \t&quot;Buckets of Rain&quot;   \t \t3:22","torrent":{"xt":"urn:btih:9d0303645e19b0f3de1f2bd6a811b217db0b44ce","amp;dn":"Bob+Dylan+-+Blood+On+The+Tracks+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d0303645e19b0f3de1f2bd6a811b217db0b44ce","infoHashBuffer":{"type":"Buffer","data":[157,3,3,100,94,25,176,243,222,31,43,214,168,17,178,23,219,11,68,206]},"announce":[],"urlList":[]}}