{"title":"Distant Worlds Universe v1.9.5.8 beta update","uid":10899605,"size":18168432,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9d59c0f2fae2adf64d6e3a8178a7816e8f8941f1&amp;dn=Distant+Worlds+Universe+v1.9.5.8+beta+update&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1409180168,"description":"Distant Worlds Universe v1.9.5.8 beta update\n\n\nExtract 7zip to your game folder &amp; play!\n\n\nThis build has the following changes from 1.9.5.7:\n\n\n\nCRASH FIXES\n- fixed rare crash when ships in combat\n\nBUG FIXES\n- fixed bug where race-specific diplomacy mood music was not working in a theme\n\nSHIP DESIGN\n- AI ship design process now automatically adds extra energy collector components to match static energy requirements of design (similar to the way reactors are added)\n- AI ship design now increases size of Carrier designs (beyond default design template) when construction size allows (like Capital Ships already did)\n- added medium and large freighter designs to AI ship design shrinking process (attempt to fit within current maximum construction size)\n- fighter firepower now listed in ship design detail screen (Weapons panel), to allow better comparison of military designs (firepower and fighters listed separately)\n\nMODDING\n- now optionally allow setting battle tactics, invasion tactics and fleeWhen settings for designs in design template files. To do this, for any design template file for any race, use the following entries (Entry name with possible values after the colon):\nTacticsWeaker: Evade, Standoff, AllWeapons, PointBlank\nTacticsStronger: Evade, Standoff, AllWeapons, PointBlank\nTacticsInvasion: DoNotInvade, InvadeWhenClear, InvadeImmediately\nFleeWhen: EnemyMilitarySighted, Attacked, Shields50, Shields20, Never\n\nOTHER\n- increased the maximum per-resource cargo space at spaceports and other bases from 30000 to 120000\n- ship decision whether to use tractor beams to pull or push a target now uses optimal attack ranges defined by battle tactics, e.g. when set to Point Blank then will pull within close range, when set to Evade will always push. Spaceports defending a colony will push when enemy troop transport gets too close in an attempt to prevent them from dropping invading troops at the colony\n- idle automated AI fleets and troop transports will now unload troops at colonies that have pirate facilities but insufficient troops to clear them","torrent":{"xt":"urn:btih:9d59c0f2fae2adf64d6e3a8178a7816e8f8941f1","amp;dn":"Distant+Worlds+Universe+v1.9.5.8+beta+update","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d59c0f2fae2adf64d6e3a8178a7816e8f8941f1","infoHashBuffer":{"type":"Buffer","data":[157,89,192,242,250,226,173,246,77,110,58,129,120,167,129,110,143,137,65,241]},"announce":[],"urlList":[]}}