{"title":"Kant libros PDF en español (1)","uid":15875849,"size":60364209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d72358724efd238caa7b83e9d0b4dc5245905c7&amp;dn=Kant+libros+PDF+en+espa%26ntilde%3Bol+%281%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Nach128","files":18,"time":1474504290,"description":"Obras (Precrítico)\r\n\r\nNueva dilucidación de los primeros principios del conocimiento metafísico (Principiorum primorum cognitionis metaphysicae nova dilucidatio) (1755).\r\n\r\nObservaciones sobre el sentimiento de lo bello y lo sublime (Beobachtungen über das Gefühl des Schönen und Erhabenen) (1764).\r\n\r\nLos sueños de un visionario explicados por los sueños de la metafísica (Träume eines Geistersehers erläutert durch Träume der Metaphysik) (1766).\r\n\r\n\r\n(Crítico)\r\n\r\nCrítica de la razón pura (Kritik der reinen Vernunft). (1781, 2ª edic. 1787).\r\n\r\nProlegómenos a toda metafísica futura que pueda presentarse como ciencia, (Prolegomena zu einer jeden künftigen Metaphysik, die als Wissenschaft wird auftreten können) (1783). \r\nBajo el nombre de &quot;Prolegómenos a toda metafísica del porvenir&quot;\r\n\r\n\r\nRespuesta a la pregunta: ¿qué es ilustración? (Beantwortung der Frage: Was ist Aufklärung?) (1784).\r\nBajo el nombre de &quot;Filosofía de la historia - Qué es la ilustración&quot; \r\n\r\nIdea para una historia universal en sentido cosmopolita (Idee zu einer allgemeinen Geschichte in weltbürgerlicher Absicht) (1784). EN FORMATO EPUB Y WORD. No lo encontré en PDF\r\n\r\nFundamentación de la metafísica de las costumbres, (Grundlegung zur Metaphysik der Sitten) (1785). EN FORMATO WORD.\r\n\r\n¿Qué significa orientarse en el pensamiento? (Was heisst: sich im Denken orientieren?) (1786).  Bajo el nombre de &quot;Cómo orientarse en el pensamiento&quot;\r\n\r\nCrítica de la razón práctica (Kritik der praktischen Vernunft) (1788). \r\n\r\nCrítica del juicio (Kritik der Urteilskraft) (1790).\r\n\r\nLa religión dentro de los límites de la mera razón (Die Religion innerhalb der Grenzen der blossen Vernunft) (1793).\r\n\r\nLa paz perpetua (Zum ewigen Frieden, ein philosophischer Entwurf) (1795).\r\n\r\nMetafísica de las costumbres (Metaphysik der Sitten) (1797).\r\n\r\nAntropología en sentido pragmático (Anthropologie in pragmatischer Hinsicht) (1798).\r\n\r\nLógica (Logik. Ein Handbuch zu Vorlesungen) (1800, publicada por Jäsche).\r\n\r\nTransición desde los primeros fundamentos metafísicos de la ciencia natural a la Física (Vom Übergange von den metaphysischen Anfangsgründen der Naturwissenschaft zur Physik) (1888, edición de Krause)","torrent":{"xt":"urn:btih:9d72358724efd238caa7b83e9d0b4dc5245905c7","amp;dn":"Kant+libros+PDF+en+espa%26ntilde%3Bol+%281%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d72358724efd238caa7b83e9d0b4dc5245905c7","infoHashBuffer":{"type":"Buffer","data":[157,114,53,135,36,239,210,56,202,167,184,62,157,11,77,197,36,89,5,199]},"announce":[],"urlList":[]}}