{"title":"Rabindranath Tagore - Nobel Prize in Literature, 1913 (21 books)","uid":11896933,"size":46512088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d7cd0bd7c66c7adcc3902b800e8c3dabe39d6be&amp;dn=Rabindranath+Tagore+-+Nobel+Prize+in+Literature%2C+1913+%2821+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":36,"time":1431189739,"description":"\nRABINDRANATH TAGORE (1861-1941) was a Bengali poet, playwright, novelist, visual artist, and composer who reshaped Bengali literature and music in the late 19th and early 20th centuries.  Dubbed &quot;the Indian Goethe&quot; by Albert Schweitzer, Tagore was the first non-European to win the Nobel Prize in Literature in 1913 for &quot;his profoundly sensitive, fresh and beautiful verse, by which, with consummate skill, he has made his poetic thought, expressed in his own English words, a part of the literature of the West.&quot;\n\nTagore modernised Bengali art by spurning rigid classical forms and resisting linguistic strictures.  He introduced new prose and verse forms and the use of colloquial language, thereby freeing Bengali literature from traditional models based on classical Sanskrit.  He was highly influential in introducing the best of Indian culture to the West and vice versa, and he is generally regarded as the outstanding creative artist of the modern Indian subcontinent, being highly commemorated in India and Bangladesh, as well as in Sri Lanka, Nepal and Pakistan.\n\nHis novels, stories, songs, dance-dramas, and essays spoke to topics political and personal.  GITANJALI (Song Offerings), GORA (Fair-Faced), and Ghare-Baire (THE HOME AND THE WORLD) are his best-known works, and his verse, short stories, and novels were acclaimed -- or panned -- for their lyricism, colloquialism, naturalism, and unnatural contemplation.\n\nThis collection includes selections from his poetry, plays, novels, short stories, letters, essays and other prose.\n\n\nThe following books are in PDF or ePUB format as indicated:\n\n* CHOKHER BALI (Random House India, 2012).  Translated by Radha Chakravarty. -- ePUB\n\n* GITANJALI &amp; FRUIT-GATHERING (Macmillan, 1918).  Illustrated edition. -- PDF\n\n* GLIMPSES OF BENGAL: Selected from the Letters of Rabindranath Tagore, 1885-1895 (Macmillan, 1921) -- PDF\n\n* GORA (Penguin Modern Classics, 2009).  Translated by Radha Chakravarty. -- ePUB\n\n* HE [Shey] (Penguin Modern Classics, 2007).  Translated by Aparna Chaudhuri, with an Introduction by Sankha Ghosh. -- ePUB\n\n* THE HOME AND THE WORLD (Penguin Classics, 2005).  Translated by Surendranath Tagore with an Introduction by Anita Desai. -- ePUB\n\n* I WON'T LET YOU GO: Selected Poems (Bloodaxe, 2010).  New expanded edition translated by Ketaki Kushari Dyson. -- ePUB\n\n* THE KING OF THE DARK CHAMBER (Macmillan, 1914) -- PDF\n\n* THE LAND OF CARDS: Stories, Poems and Plays for Children (Puffin, 2010).  Translated by Radha Chakravarty, with an Introduction by Mahasweta Devi. -- ePUB\n\n* THE LOVER OF GOD (Copper Canyon, 2003).  Translated by Tony K. Stewart and Chase Twichell.-- PDF + ePUB\n\n* MY REMINISCENCES (Macmillan, 1916).  Translated by Surendranath Tagore. -- PDF\n\n* NATIONALISM (Macmillan, 1918) -- PDF\n\n* PERSONALITY (Macmillan, 1917) -- PDF\n\n* QUARTET (Chaturanga) (Heinemann, 1993).  Translated by Kaiser Haq. -- PDF\n\n* THE RABINDRANATH TAGORE COLLECTION: 50 Classic Works (Waxkeep, 2012) -- ePUB\n\n* THE RELIGION OF MAN: The 1930 Hibbert Lectures (Beacon, 1961). -- PDF\n\n* SACRIFICE &amp; OTHER PLAYS (Macmillan, 1917) -- PDF\n\n* SADHANA: The Realization of Life (Start, 2012). -- ePUB\n\n* SELECTED POEMS (Penguin Classics, 2005).  Translated by William Radice -- ePUB\n\n* SELECTED SHORT STORIES (Penguin Classics, 2005).  Translated with an Introduction by William Radice. -- ePUB\n\n* A TAGORE READER (Beacon, 1966).  Edited by Amiya Chakravarty. -- PDF\n\n_____________________________________________________________________________\n\n\n&gt;&gt; CONTACT ME\nYou may reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n              &lt;a href=&quot;\nhttps://pirates-forum.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://pirates-forum.org/User-workerbee&lt;/a&gt;  \n\n&gt;&gt; PLEASE HELP TO SEED!\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:9d7cd0bd7c66c7adcc3902b800e8c3dabe39d6be","amp;dn":"Rabindranath+Tagore+-+Nobel+Prize+in+Literature%2C+1913+%2821+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d7cd0bd7c66c7adcc3902b800e8c3dabe39d6be","infoHashBuffer":{"type":"Buffer","data":[157,124,208,189,124,102,199,173,204,57,2,184,0,232,195,218,190,57,214,190]},"announce":[],"urlList":[]}}