{"title":"ACLS, CPR, and PALS [PDF] [StormRG]","uid":10329920,"size":3948030,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9db132688a8eb998f9abe200160472375ae85cb0&amp;dn=ACLS%2C+CPR%2C+and+PALS+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"0xmovva","files":-1,"time":1402359020,"description":"Author: Shirley A. Jones \nSpiral-bound: 208 pages\nPublisher: F.A. Davis Company; 1 edition (March 25, 2014)\nLanguage: English\nISBN-10: 0803623143\nISBN-13: 978-0803623149\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Don't hesitate to PM me if you have any questions or problem with the download,as comments on torrents are easy to miss. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n+__________________________________________________________________________________\n\n\nThe only pocket guide to cover Healthcare Professional CPR, ACLS, and PALS!\n\nHere's all the information you need to respond to cardiac emergencies in one pocket-sized book! This quick-reference guide provides easy-to-access coverage of all three levels of care--infant, child, and adult--plus listings for all drugs required for ACLS and PALS in both adult and pediatric dosages. You'll also find the latest in PALS concepts and protocols and the ACLS guidelines. Critical-thinking exercises and megacodes make it an ideal resource to help you prepare for certification and recertification exams. Waterproof, write-on/wipe off pages are HIPAA-compliant and great for on the go.\n\nKey Features\nIncludes ACLS, CPR, and PALS guidelines. Lists the drugs required for ACLS and PALS, including adult and pediatric dosages. Covers PALS concepts and protocols that are unique to the newborn, infant, and pediatric patient, including formulas. Identifies important clinical implications in &quot;Clinical Tips&quot;. \n\nTable of Contents\nTab 1. ECG \nTab 2. CPR \nTab 3. ACLS \nTab 4. PALS \nTab 5. Meds \nTab 6. Skills \nTab 7. Megacode \nTab 8. Tools \n\nFor all healthcare professionals!\nKeep it on your code cart\nKeep it in your scrub pocket or lab coat\nKeep it on the ambulance\nUse it to study for your initial or refresher ACLS, CPR, or PALS courses\n","torrent":{"xt":"urn:btih:9db132688a8eb998f9abe200160472375ae85cb0","amp;dn":"ACLS%2C+CPR%2C+and+PALS+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9db132688a8eb998f9abe200160472375ae85cb0","infoHashBuffer":{"type":"Buffer","data":[157,177,50,104,138,142,185,152,249,171,226,0,22,4,114,55,90,232,92,176]},"announce":[],"urlList":[]}}