{"title":"Secrets of a German POW: Revelations of Hauptmann Herbert Cleff","uid":15749274,"size":9208060,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9dec71dcaed42c570bc510f3bedbdc116c1aaff8&amp;dn=Secrets+of+a+German+POW%3A+Revelations+of+Hauptmann+Herbert+Cleff&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"marty14","files":1,"time":1473011944,"description":"Secrets of a German POW: The Revelations of Hauptmann Herbert Cleff - Brian Brinkworth [epub]\r\n\r\nThis is the riveting and extraordinary story of Kapitan Herbert Cleff, presented here for the first time by Brian Brinkworth. Cleff, an Officer on the staff of General Wilhelm Ritter von Thoma, attached to the 21st Panzer division operating in the Western desert, was captured near El Dab'a in Libya on the 6th November, 1942. He was interrogated both in the Western Desert and in the United Kingdom, following assessments that led his British captors to believe that he might prove useful to the Allied war effort.\r\n\r\nDuring this interrogation period, Cleff kept releasing tantalizing snippets of information about various advanced projects being undertaken by the scientific and engineering community back in Germany, such as the development of AFV tank engines and armor plating and, most interesting perhaps to the Allies, the progress the Germans were making with jet-powered aircraft propulsion, faster-than-sound flight, and unmanned offensive missiles.\r\n\r\nEvery time his captors thought they had teased all the information out of him that they could, Cleff offered another bit ensured he was kept focus of much attention—and away from a Prisoner of War camp. Cleff's explosive revelations intrigued and perplexed in equal measure, and his reputation quickly grew amongst the Allied interrogation fraternity.\r\n\r\nDespite countless investigative efforts, the truth of Cleff's enigmatic revelations were never able to be fully proven, meaning that the compelling question remains: were his revelations merely flights of fancy or were they genuine exploded secrets?","torrent":{"xt":"urn:btih:9dec71dcaed42c570bc510f3bedbdc116c1aaff8","amp;dn":"Secrets+of+a+German+POW%3A+Revelations+of+Hauptmann+Herbert+Cleff","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dec71dcaed42c570bc510f3bedbdc116c1aaff8","infoHashBuffer":{"type":"Buffer","data":[157,236,113,220,174,212,44,87,11,197,16,243,190,219,220,17,108,26,175,248]},"announce":[],"urlList":[]}}