{"title":"Amateur Introductions 21 (Amateur Allure) XXX 2015 DVDRip","uid":13082223,"size":1746539409,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9df1707eb7742d4cb1e3520fe673412ab8d48283&amp;dn=Amateur+Introductions+21+%28Amateur+Allure%29+XXX+2015+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"EndYou","files":1,"time":1450914351,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/Lt\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 2015\r\nCountry: USA\r\nGenre: 18+ Teens, Amateur, Blowjobs, Cumshots, Gonzo, Point Of View, Swallowing\r\nDuration: 2:02:52\r\nEnglish language\r\n\r\nDirected by: Thomas, Ray Dark\r\nStudio: Amateur Allure\r\n\r\nJasmine Delatori, Victoria Rae Black, Ashley Abbott, Alison Rey, Naomi Woods, Adria Rae, Athena Amour, Kelly Greene.\r\n\r\nWelcome Adria Rae who works at a financial firm back home. This slender 5'5 &quot;babe is quite the cock sucker and she gives a full service blowjob. Ray goes balls deep in her beautiful pussy before firing TWO nice loads down her throat! Dorothy (aka Alison Rey) is out looking for candy when she stumbles onto Ray &amp; Justin setting up for the big party. Alison bounces her gorgeous ass back and forth between both dicks until they blow two big cum loads in her pretty mouth. Alison swallows it all with a smile! Welcome Ashley Abbott! She is 21 and from San Francisco. She comes by to visit and she just can not wait to suck cock. This girl really goes at it and she loves to fuck too! We give her two nice big loads She devours it all with a smile. Wow ! Victoria Rae Black (aka 'Hadley) is 22 years old and ready to be naughty for the first time! Victoria loves sucking cock and has never swallowed before. Today is the day. Ray does the honors! Two massive loads get dumped down her eager throat! Enjoy, Thomas. Jasmine Delatori loves to suck cock and swallow cum. Jasmine gets really turned on while going down on Ray and she wants him to fuck her tight pussy. He bangs her silly and shoots a huge load into her mouth. Jasmine wants more so she sucks and jerks out another big load and licks it off her fingers! Ray met Athena Amour at a party and gave her his number. To his surprise, she called him and said she wanted to come by for her first swallowing audition! Ray bangs Athena hard and delivers a HUGE, hot payload down her throat. Athena swallows it down with a smile and a polite &quot;thank you&quot; What a great girl. Beautiful Naomi Woods returns and she brings her new friend Kelly Greene! The girls show up to have a little BJ party with Ray 1, &amp; Justin. A double-header unfolds as the girls take turns. sucking off both cocks and draining their balls!\r\n\r\nQuality of video: DVDRip\r\nVideo Format: MP4\r\nVideo: 720 x 400 (1895 Kbps) 29.970 fps AVC\r\nAudio: AAC at 144 Kbps, 2 channels, 48.0 KHz","torrent":{"xt":"urn:btih:9df1707eb7742d4cb1e3520fe673412ab8d48283","amp;dn":"Amateur+Introductions+21+%28Amateur+Allure%29+XXX+2015+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9df1707eb7742d4cb1e3520fe673412ab8d48283","infoHashBuffer":{"type":"Buffer","data":[157,241,112,126,183,116,45,76,177,227,82,15,230,115,65,42,184,212,130,131]},"announce":[],"urlList":[]}}