{"title":"the constructus corporation - the ziggurat (Die Antwoord)","uid":5559396,"size":182692886,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9e0256ab527cf0d3edd621bbda43bc15aa416822&amp;dn=the+constructus+corporation+-+the+ziggurat+%28Die+Antwoord%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pievc","files":-1,"time":1273781960,"description":"The Constructus Corporation - The Ziggurat\nLabel: African Dope Records\nCatalog#: ADOPECD009\nFormat: CD, Limited Edition, Album\nCountry: South Africa\nReleased: 2003\nGenre: Electronic\nStyle: Illbient, Abstract, Trip Hop, ZEF\n\n\nCD comes in a numbered hardcover book containing lyrics, a comic and a free \nblank CD you can use to download free material and make your own album.\n\nTracks are all compiled from various sources. \nBit rates vary, but all are at least 128kbps.\n\n\nFrom Wikipedia:\n\nThe Constructus Corporation was an electronic / hiphop act from Cape Town, \nSouth Africa, that burst into life in early 2002 and had disbanded by mid-2003, \nleaving only the one-of-a-kind concept album / book &quot;The Ziggurat&quot; (African \nDope Records, 2002) as legacy.\n\nAt the time, The Constructus Corporation (aka Constructus) was somewhat of a \nCape Town underground supergroup, combining the creative talents of chameleon-\nlike rapper / satirist Waddy Jones (aka Watkin Tudor Jones) and his long-time \nDJ partner Sibot, with Cape Town's electronic music producers - Felix Laband \nand Markus Wormstorm.\n\nIn early 2002, Waddy had summarily disbanded his previous group Max Normal (in \nwhich Sibot was a member), just as the band was reaching South African stardom, \nheadlining festivals like Oppikoppi and charting on 5FM (citing being creatively \nstifled as reason). He relocated to Cape Town and began collaborating with DJ \nDope of Krushed &amp; Sorted and Felix Laband on the music for a multi-media project \nhe had conceptualised involving a graphic novel with soundtrack and live show. \nThese sessions spawned the Man With No Name track on African Dope's 'Cape Of \nGood Dope' compilation in 2002, but gradually mutated into The Constructus \nCorporation outfit with personnel as listed above. During the year-long \nproduction process a young female vocalist joined the group, listed as Anica \nThe Snuffling on the credits. She and Waddy became involved and remain together \ntoday, forming the core of his current incarnation Die Antwoord (where Anica has \nbecome Yolandi Visser), and have a daughter, Sixteen Jones.\n\nAfter a mammoth production process including mix and master by Krushed &amp; Sorted, \nin December 2002 &quot;The Ziggurat&quot; was released. This remains one of the most \nambitious and extravagant music packagings to come from South Africa: an 88 page \npink hard-covered book containing a hand-written hiphop fantasy story by Waddy, \nwhich follows the adventures of two kids on a giant futuristic floating world / \nshopping mall called The Ziggurat, detailed etched digital illustrations by Nikhil \nSingh, a soundtrack CD on which Waddy plays several different characters, and a \nbonus blank CD at the back of the book with instructions on where to download an \nentire second album of music and narrations for free, with which to fill the CD.\n\nThe Ziggurat may have instantly achieved cult status in South African electronic \nmusic folklore, but in spite of a memorable album launch performance at the Cape \nTown Victoria &amp; Alfred Waterfont Aquarium (in front of the sharktank), the band \nimploded less than six months after its release. The various members have all \nflourished in their respective careers thereafter, and enjoyed some fruitful \ncollaborations. Sibot and Markus Wormstorm are now The Real Estate Agents together, \nFelix Laband went on to be signed by distinguished German independent Compost \nRecords (who released a Sibot remix of Felix's 'Minka' on 12&quot; in 2006), Waddy has \nreleased several albums under different guises (including the Sibot-produced The \nKill and Markus Wormstorm-produced promo-only EP &quot;Emmanuel Rothchild - My Favourite \nSongs&quot; and &quot;Markus Wormstorm Is Not Gay&quot;), and expanded into graphic art, fluffy \ntoy-making and other aspects of his creativity.\n\n\nDISC 1\n______\n\n101 The Ziggurat\n102 How To Become A Better Person\n103 Rick Flare\n104 Pooka\n105 Randomboy And Kidtronic\n106 Long Street\n107 On The Way To The Arcade\n108 The Competition\n109 Ooh Lala\n110 Jellyfish\n111 Metatron One\n112 Hot Water\n113 Invisible Sentinels\n114 You Sound Dumb\n115 I'll See You Now Now\n116 Recharge\n117 Johnny's Birthday Song\n118 Wakey Wakey\n119 Brotherly Love\n120 Sweet Thing\n121 V\n122 Super Psyche\n123 Choose Your Own Adventure\n\nDISC 2\n______\n\n201 Dream\n202 Ambrosial Hours\n203 Touchy Feely\n204 Robot\n205 Derreck And Darrel\n206 Mommy And Daddy\n207 The Magic Ear\n208 Incredible Machine\n209 Eat Dirt Copperman\n210 The Krakula Cometh\n211 Natalie\n212 Bom\n213 A Thousand Miles\n214 Scum Deluxe\n215 Dudus\n216 Ripples In The Mesh - The Radioplay","torrent":{"xt":"urn:btih:9e0256ab527cf0d3edd621bbda43bc15aa416822","amp;dn":"the+constructus+corporation+-+the+ziggurat+%28Die+Antwoord%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e0256ab527cf0d3edd621bbda43bc15aa416822","infoHashBuffer":{"type":"Buffer","data":[158,2,86,171,82,124,240,211,237,214,33,187,218,67,188,21,170,65,104,34]},"announce":[],"urlList":[]}}