{"title":"Inherent Vice by Thomas Pynchon -- Audiobook","uid":11175837,"size":418896381,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9e72ea8d3b1ec7fb28fdc9e2a9a61d414b343a26&amp;dn=Inherent+Vice+by+Thomas+Pynchon+--+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"tyl3rdurd3n","files":-1,"time":1412783918,"description":"Part noir, part psychedelic romp, all Thomas Pynchon- private eye Doc Sportello comes, occasionally, out of a marijuana haze to watch the end of an era as free love slips away and paranoia creeps in with the L.A. fog.\n\nIt's been awhile since Doc Sportello has seen his ex-girlfriend. Suddenly out of nowhere she shows up with a story about a plot to kidnap a billionaire land developer whom she just happens to be in love with. Easy for her to say. It's the tail end of the psychedelic sixties in L.A., and Doc knows that &quot;love&quot; is another of those words going around at the moment, like &quot;trip&quot; or &quot;groovy,&quot; except that this one usually leads to trouble. Despite which he soon finds himself drawn into a bizarre tangle of motives and passions whose cast of characters includes surfers, hustlers, dopers and rockers, a murderous loan shark, a tenor sax player working undercover, an ex-con with a swastika tattoo and a fondness for Ethel Merman, and a mysterious entity known as the Golden Fang, which may only be a tax dodge set up by some dentists.\n\nIn this lively yarn, Thomas Pynchon, working in an unaccustomed genre, provides a classic illustration of the principle that if you can remember the sixties, you weren't there . . . or . . . if you were there, then you . . . or, wait, is it . . .\n\n\n\n\nUnabridged audiobook read by Ron McLarty. ","torrent":{"xt":"urn:btih:9e72ea8d3b1ec7fb28fdc9e2a9a61d414b343a26","amp;dn":"Inherent+Vice+by+Thomas+Pynchon+--+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e72ea8d3b1ec7fb28fdc9e2a9a61d414b343a26","infoHashBuffer":{"type":"Buffer","data":[158,114,234,141,59,30,199,251,40,253,201,226,169,166,29,65,75,52,58,38]},"announce":[],"urlList":[]}}