{"title":"Emma Cline - The Girls","uid":14920953,"size":281773770,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9f571344d3dc869079af22325dfe5c20e7064779&amp;dn=Emma+Cline+-+The+Girls&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Cybotage","files":18,"time":1465927092,"description":"Girls—their vulnerability, strength, and passion to belong—are at the heart of this stunning first novel for readers of Jeffrey Eugenides’s The Virgin Suicides and Jennifer Egan’s A Visit from the Goon Squad.\r\n \r\nNorthern California, during the violent end of the 1960s. At the start of summer, a lonely and thoughtful teenager, Evie Boyd, sees a group of girls in the park, and is immediately caught by their freedom, their careless dress, their dangerous aura of abandon. Soon, Evie is in thrall to Suzanne, a mesmerizing older girl, and is drawn into the circle of a soon-to-be infamous cult and the man who is its charismatic leader. Hidden in the hills, their sprawling ranch is eerie and run down, but to Evie, it is exotic, thrilling, charged—a place where she feels desperate to be accepted. As she spends more time away from her mother and the rhythms of her daily life, and as her obsession with Suzanne intensifies, Evie does not realize she is coming closer and closer to unthinkable violence, and to that moment in a girl’s life when everything can go horribly wrong.\r\n \r\nEmma Cline’s remarkable debut novel is gorgeously written and spellbinding, with razor-sharp precision and startling psychological insight. The Girls is a brilliant work of fiction—and an indelible portrait of girls, and of the women they become.\r\n\r\nRead by Cady McClain\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:9f571344d3dc869079af22325dfe5c20e7064779","amp;dn":"Emma+Cline+-+The+Girls","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f571344d3dc869079af22325dfe5c20e7064779","infoHashBuffer":{"type":"Buffer","data":[159,87,19,68,211,220,134,144,121,175,34,50,93,254,92,32,231,6,71,121]},"announce":[],"urlList":[]}}