{"title":"The Syrian Jihad: Al-Qaeda, the Islamic State (2016) pdf","uid":13839293,"size":4121651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f81c3d1182b8e52cf112de329caa7150846e884&amp;dn=The+Syrian+Jihad%3A+Al-Qaeda%2C+the+Islamic+State+%282016%29+pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"bookzilla","files":1,"time":1457785427,"description":"The Syrian Jihad: Al-Qaeda, the Islamic State and the Evolution of an Insurgency \r\n\r\n\r\nThe eruption of the anti-Assad revolution in Syria has had many unintended consequences, among which is the opportunity it offered Sunni jihadists to establish a foothold in the heart of the Middle East. That Syria's ongoing civil war is so brutal and protracted has only compounded the situation, as have developments in Iraq and Lebanon. Ranging across the battlefields and international borders have been dozens of jihadi Islamist fighting groups, of which some coalesced into significant factions such as Jabhat al Nusra and the Islamic State.\r\n\r\nThis book assesses and explains the emergence since 2011 of Sunni jihadist organizations in Syria's fledgling insurgency, charts their evolution and situates them within the global Islamist project. Unprecedented numbers of foreign fighters have joined such groups, who will almost certainly continue to host them. Thus, external factors in their emergence are scrutinized, including the strategic and tactical lessons learned from other jihadist conflict zones and the complex interplay between Al-Qaeda and the Islamic State and how it has influenced the jihadist sphere in Syria. Tensions between and conflict within such groups also feature in this indispensable volume.\r\n\r\nOxnard university press","torrent":{"xt":"urn:btih:9f81c3d1182b8e52cf112de329caa7150846e884","amp;dn":"The+Syrian+Jihad%3A+Al-Qaeda%2C+the+Islamic+State+%282016%29+pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f81c3d1182b8e52cf112de329caa7150846e884","infoHashBuffer":{"type":"Buffer","data":[159,129,195,209,24,43,142,82,207,17,45,227,41,202,167,21,8,70,232,132]},"announce":[],"urlList":[]}}