{"title":"SwitchRes 4.2.1 Intel + sn + read me from v3.8.6","uid":6253300,"size":8969433,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:9fa566ef5cd8263fdc92add75cc71978b176f058&amp;dn=SwitchRes+4.2.1+Intel+%2B+sn+%2B+read+me+from+v3.8.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"polisdavid","files":-1,"time":1300479422,"description":"Official Web SIte: &lt;a href=&quot; http://www.madrau.com/indexSRX4.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.madrau.com/indexSRX4.html&lt;/a&gt;\n\nSwitchResX is a tool designed to manage resolutions of all your monitors. Here's a quick summary:\n\n* As standard features: it gives you access to most of your monitor \n   settings within its customizable menus (in the Menu Bar or with a \n   Contextual Menu Plugin [also on Snow Leopard] on the Finder \n   Desktop). SwitchResX incorporates features relative to the Monitor \n   Resolution, Color Depth, Video Mirroring, Display Rotation, Display\n   Overscan into one single utility.\n\n* Other useful features include saving desktop layout, i.e. positions of \n   the icons on the desktop and positions of the windows of all open\n   applications, and restore them automatically when the resolution is \n   changed or when you plug or unplug an external monitor.\n\n* You can disable or deactivate a monitor without having to physically\n   unplug it, allowing you to use a laptop in clamshell mode with external \n   monitor, keyboard and mouse.\n\n* Specialized features allow you to link your monitor settings with system \n   events: Key shortcut pressed, Apple Scripts, Application launched.\n\n* Advanced features lets you create and enable new resolutions for \n   your monitor, HDTV, Plasma or LCD screen or Video Projector. This\n   advanced feature is very powerful for users requesting complete control \n   over their display resolution.\n\nYes, some other tools also have some of these features. But only SwitchResX does all that within one single utility.\n\nExamples of applications:\n\n* Create custom resolutions for using your Mac as a home theater, and \n  plug it to your HDTV\n\n* Create the custom resolutions needed to correctly use your MacMini in\n  your car.\n\n* Add only the resolutions that you need to the menu bar, and give them\n   names that you can recognize quickly.\n\n* Define settings for all your monitors in one set, and give them explicit \n   names (&quot;DVD&quot;, &quot;Games&quot;)\n\n* Let these settings be applied automatically when an application starts,\n   and set back when the application ends.\n\n* Save icons on your desktop automatically before a resolution change\n   occurs, replace them after the change to an other saved position\n\n* Save positions and size of your windows, remember their position\n   when you plug an external monitor, automatically back to the previous\n   layout when you unplug the monitor\n\n* Rearrange your desktop icons on a grid, with finer precision than the\n   Finder\n\n* SwitchResX can be scripted for resolutions and color depth changes.\n   SwitchResX is even recordable: When it is running, every resolution\n   change is automatically recorded in the script editor...\n\nAll that are simple examples, but show the flexibility of SwitchResX. There are certainly other examples which I don't even know at this time that makes SwitchResX a useful tool, even on MacOS X.\n\nSystem Requirements:\n\nIntel Processor Mac IS X.5 and above\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:9fa566ef5cd8263fdc92add75cc71978b176f058","amp;dn":"SwitchRes+4.2.1+Intel+%2B+sn+%2B+read+me+from+v3.8.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fa566ef5cd8263fdc92add75cc71978b176f058","infoHashBuffer":{"type":"Buffer","data":[159,165,102,239,92,216,38,63,220,146,173,215,92,199,25,120,177,118,240,88]},"announce":[],"urlList":[]}}