{"title":"You Are Not So Smart :  Why You Have Too Many Friends on Faceboo","uid":6847655,"size":1616457,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fea0f17f78142c8cd62af88f3e8cedcc9eaab29&amp;dn=You+Are+Not+So+Smart+%3A++Why+You+Have+Too+Many+Friends+on+Faceboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"freaktorrent07","files":-1,"time":1322408425,"description":"\nGotham (10-2011) | EPUB+MOBI | 447 pages | 1592406599 | 1.4Mb\n\nYou Are Not So Smart: Why You Have Too Many Friends on Facebook, Why Your Memory Is Mostly Fiction, and 46 Other Ways You're Deluding Yourself /by David McRaney. You believe you are a rational, logical being who sees the world as it really is, but journalist David McRaney is here to tell you that you're as deluded as the rest of us.\nBut that's OK- delusions keep us sane. You Are Not So Smart is a celebration of self-delusion. It's like a psychology class, with all the boring parts taken out, and with no homework.\nBased on the popular blog of the same name, You Are Not So Smart collects more than 46 of the lies we tell ourselves everyday, including:\n* Dunbar's Number - Humans evolved to live in bands of roughly 150 individuals, the brain cannot handle more than that number. If you have more than 150 Facebook friends, they are surely not all real friends.\n* Hindsight bias - When we learn something new, we reassure ourselves that we knew it all along.\n* Confirmation bias - Our brains resist new ideas, instead paying attention only to findings that reinforce our preconceived notions.\n* Brand loyalty - We reach for the same brand not because we trust its quality but because we want to reassure ourselves that we made a smart choice the last time we bought it.\nPacked with interesting sidebars and quick guides on cognition and common fallacies, You Are Not So Smart is a fascinating synthesis of cutting-edge psychology research to turn our minds inside out.\n","torrent":{"xt":"urn:btih:9fea0f17f78142c8cd62af88f3e8cedcc9eaab29","amp;dn":"You+Are+Not+So+Smart+%3A++Why+You+Have+Too+Many+Friends+on+Faceboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fea0f17f78142c8cd62af88f3e8cedcc9eaab29","infoHashBuffer":{"type":"Buffer","data":[159,234,15,23,247,129,66,200,205,98,175,136,243,232,206,220,201,234,171,41]},"announce":[],"urlList":[]}}