{"title":"Wondershare Video Editor 4.0.1.0 Multilang Portable","uid":10614177,"size":99996101,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a17021c3a6d3c550bbfbf6e386d5b3d8e3b0d826&amp;dn=Wondershare+Video+Editor+4.0.1.0+Multilang+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"JUHAX69X","files":-1,"time":1406078560,"description":"Wondershare Video Editor 4.0.1.0 Multilang Portable\n\n \n \nIf you're looking for an easy way to edit videos, but aren't ready for Premier,\nWondershare Video Editor is a good place to start. It may lack subtle features,\nbut its essential editing tools work well and can give you good looking results.\n \n \nThanks to its intuitive UI, Wondershare Video Editor makes creating movies from\nvideos taken via mobile phone, digital camera or camcorder an easy undertaking.\nAfter launching the program, the user can choose between two aspect ratios - 16:9\nand 4:3. The workspace contains a file manager, a timeline and a preview pane.\nOnce video, image and audio files are imported, they are moved onto the timeline\nfor editing, where the options include trim, cut, split, rotate, set fade in and out,\nspeed and more. To add a creative touch, Wondershare Video Editor offers a large\nnumber of effects and filters like comic or vintage styles, transitions and color\ncorrections. Audio of the recording can be adjusted, muted or overlaid with music.\nFinalized movies are exported to variety of formats for portable devices or high-quality viewing,\nfor example DVD. Online sharing is made easy with direct upload to video platforms such as YouTube.\n\nHomepage:\n \nOnline Guide:\n \n \n \nPortable: No installation needed. Extract 7-Zip file where ever You want and start using.\n \nPreckracked: No serials or cracks needed. Scanned with F-Secure and Malwarebytes: Clean.\n \nCredits for creating this Portable version goes to &quot;Sn1Per&quot;. I have test started this and seems to work.\n \nIt tries to access internet twice during start, so maybe better to block with Firewall(?)\n \n \nIf You like this upload, please share it with others by seeding. Thank You.","torrent":{"xt":"urn:btih:a17021c3a6d3c550bbfbf6e386d5b3d8e3b0d826","amp;dn":"Wondershare+Video+Editor+4.0.1.0+Multilang+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a17021c3a6d3c550bbfbf6e386d5b3d8e3b0d826","infoHashBuffer":{"type":"Buffer","data":[161,112,33,195,166,211,197,80,187,251,246,227,134,213,179,216,227,176,216,38]},"announce":[],"urlList":[]}}