{"title":"Monroe Institute / Norman Shealy - Hemi-Sync Relaxation","uid":6557691,"size":180628940,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1e091ab3f0076b4aac83582c699b6a3b98ce1ac&amp;dn=Monroe+Institute+%2F+Norman+Shealy+-+Hemi-Sync+Relaxation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"baldcd123","files":-1,"time":1311339860,"description":"Experience total relaxation with this verbally guided Hemi-SyncÃ‚Â® exercise voiced by Dr. C. Norman Shealy. Hemi-SyncÃ‚Â® Relaxation uses a progressive relaxation technique along with Hemi-SyncÃ‚Â® audio signals to gently guide you into a deep, receptive state of relaxation. While in this state, you will hear positive affirmations for health and well-being. As a pioneer in the field of alternative medicine, Dr. Shealy has helped medical practitioners to understand more fully the power of the mind-body connection and its relationship to maintaining or restoring wellness following a trauma such as surgery or a life-threatening disease. (Verbal; 50 min.) Mind Food Series\n\nMonroe Product\\'s binaural beat CDs can help you experience enhanced mental, physical, and emotional states.\n\nRobert Monroe\\'s work inspired an entire industry of mind/brain products. After 50 years of research, and thousands of lab sessions, the internationally acclaimed patented Hemi-SyncÃ‚Â® process remains unparalleled in its ability to assist us in harnessing our human potential.\n\nThanks to the cooperation of notable medical institutions and universities, the scientifically and clinically proven Hemi-SyncÃ‚Â® technology continues to be the focus of a variety of specialized research projects. In addition, many therapists, physicians, educators, and other professionals use Hemi-SyncÃ‚Â® extensively.\n\nSuch research is indispensable in revealing the influence of specific Hemi-SyncÃ‚Â® sound patterns on consciousness. Over the years, these efforts have resulted in the development of scores of individual products for specific applications such as focused attention, stress management, meditation, sleep enhancement, and pain management, to name a few.","torrent":{"xt":"urn:btih:a1e091ab3f0076b4aac83582c699b6a3b98ce1ac","amp;dn":"Monroe+Institute+%2F+Norman+Shealy+-+Hemi-Sync+Relaxation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1e091ab3f0076b4aac83582c699b6a3b98ce1ac","infoHashBuffer":{"type":"Buffer","data":[161,224,145,171,63,0,118,180,170,200,53,130,198,153,182,163,185,140,225,172]},"announce":[],"urlList":[]}}