{"title":"Juelz_Santana-What_The_Games_Been_Missing-2005-RNS","uid":3429003,"size":108934674,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a1f7c82d8c6d4aee9cd5dd5ce2f61084deb74488&amp;dn=Juelz_Santana-What_The_Games_Been_Missing-2005-RNS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"pi3rr0t","files":25,"time":1136677798,"description":"ARTIST: Juelz Santana\nTITLE: What The Game's Been Missing!\nLABEL: Def Jam\nGENRE: Rap\nBITRATE: 190kbps avg\nPLAYTIME: 1h 15min total\nRELEASE DATE: 2005-11-22\nRIP DATE: 2005-11-09\n\nTrack List\n----------\n01. Intro                           2:18\n02. Rumble Young Man Rumble         2:34\n03. Oh Yes                          3:01\n04. Shottas (Feat. Cam'Ron &amp;        4:35\n    Sizzla)\n05. Clockwork                       3:05\n06. Kill 'Em (Feat. Cam'Ron)        3:26\n07. This Is Me                      2:54\n08. Make It Work For You (Feat.     3:51\n    Lil' Wayne &amp; Young Jeezy)\n09. Whatever U Wanna Call It        4:10\n    (Feat. Hell Rell)\n10. Gangsta Shit                    3:09\n11. Lil' Boy Fresh                  3:53\n12. Good Times                      3:29\n13. Freaky                          2:58\n14. Murda Murda (Feat. Cam'Ron)     4:04\n15. Gone                            3:58\n16. Kid Is Back                     2:46\n17. Changes (Feat. Razah)           3:51\n18. I Am Crack                      3:37\n19. There It Go (The Whistle Song)  3:00\n20. Violence (Feat. Bezel)          4:14\n21. Daddy                           4:08\n22. Mic Check                       2:56\n\nRelease Notes:\n\nHip hop and rap artist Juelz Santana has been everywhere of late. Whether it's\nhis near-constant guest-hosting duties on BET and MTV, his ubiquitous presence\non the mixtape circuit, or his addictive new heat rock &quot;There It Go (The Whistle\nSong)&quot; - Blender Magazine's &quot;Song Of The Month&quot; - blasting from every car stereo\nand club sound system in the country, Juelz has become everyone's\nrapper-du-jour. Even the hipster set has joined the movement: indie-dance\ndarling M.I.A. frequently namedrops Juelz as her favorite rapper, and the Dipset\nlieutenant even teamed up with UK Grime hero Kano for a free outdoor concert in\nNew York's ultra-hip Lower East Side. What's next? A hotline, of course.\n1-888-DIPSET7 announces the November 22 release of his new Diplomats / Def Jam\nalbum What The Game's Been Missing.\n\nOf course, all this heat didn't just happen overnight. Over the past few years,\nthe game has watched Juelz Santana grow from his role as Cam'ron's protÃˆgÃˆ to\nbecome one of rap hip-hop's brightest stars, its biggest personalities, and its\nfinest MCs. With a certain cooler-than-thou swagger, and plenty of uptown\nattitude, Juelz has become, as he so eloquently puts it, &quot;Human Crack In The\nFlesh.&quot;\n\nAnd now, with his second Def Jam effort, What The Game's Been Missing, the\nhip-hop nation is headed back to Santana's town, to rediscover Harlemworld's\ndistinct style as only Juelz can bring it.\n\nAnd a funny thing happened to Santana on his way to making his sophomore album.\nHe fell in love with making music. To facilitate the creative storm that would\nbecome What The Game's Been Missing, Santana indulged his gift of gab by\nconstructing his own studio.\n\n&quot;When you have your own place to make music, it becomes that much more of a\npriority,&quot; says Juelz. &quot;When you can dictate everything about your project that\nway, you start to really feel the music, feel every beat, every line. It becomes\na part of you in a way that just doesn't happen when you're on someone else's\ndime and someone else's schedule.&quot;\n\nYou can feel the passion in the music. With the first two singles off What The\nGame's Been Missing, Santana has landed a 1-2 combo that still has hip-hop heads\nspinning. The royal horns of &quot;Mic Check&quot; and the absolutely addictive whistles\nof &quot;There It Go&quot; show off an even more focused Juelz Santana, tossing off\nad-libs that other MC's would sign over their lives for (&quot;Don't watch me. Watch\nT.V.&quot;). The dancehall-infused stomp of &quot;Shottas&quot; featuring Sizzla is pure\nDipset, a street banger reminiscent of the Diplomats classic &quot;Gangsta Music.&quot;\n\n&quot;On my first album, I feel like I let a lot of things just go. This time around\nthough, I felt like it was all on me,&quot; Juelz continues. &quot;That's why I built my\nown studio. That's why I directed my own video. They always say, you wait your\nwhole life to make that first album and pour your whole life into it. But I feel\nlike this one, man, this is my baby.&quot;\n\nSo, what has the game been missing? &quot;Leadership,&quot; says Santana, &quot;Everybody is\nfollowing everyone else, nobody is willing to be their own man, to be creative.\nIt goes against what hip-hop is all about. The Dipset Movement is about forging\nour own path, people can go ahead and follow us.&quot;\n\nHip-hop fans will be following Juelz Santana for a long time to come.","torrent":{"xt":"urn:btih:a1f7c82d8c6d4aee9cd5dd5ce2f61084deb74488","amp;dn":"Juelz_Santana-What_The_Games_Been_Missing-2005-RNS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1f7c82d8c6d4aee9cd5dd5ce2f61084deb74488","infoHashBuffer":{"type":"Buffer","data":[161,247,200,45,140,109,74,238,156,213,221,92,226,246,16,132,222,183,68,136]},"announce":[],"urlList":[]}}