{"title":"The Netter Collection of Medical Illustrations, 2E, Vol 2- Endoc","uid":9878302,"size":19602756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a1fc3cbc93e27eb5a0ff86e3749e18df2f53cda2&amp;dn=The+Netter+Collection+of+Medical+Illustrations%2C+2E%2C+Vol+2-+Endoc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":3,"time":1396503981,"description":"Author: William F. Young Jr. \nSeries: Netter Green Book Collection\nHardcover: 256 pages\nPublisher: Saunders; 2 edition (February 18, 2011)\nLanguage: English\nISBN-10: 1416063889\nISBN-13: 978-1416063889 \nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\nEndocrine System, 2nd Edition provides a concise and highly visual guide to the anatomy, physiology, and pathophysiology of the endocrine glands. This volume in The Netter Collection of Medical Illustrations (the CIBA &quot;Green Books&quot;) has been expanded and revised by Dr. William F. Young, Jr. to reflect the many exciting advances that have been made in the field. Classic Netter art, updated illustrations, and modern imaging make this timeless work essential to your library.\n\n* Access rare illustrations in one convenient source from the only Netter work devoted specifically to the endocrine system.\n* Get a complete overview of the endocrine system through multidisciplinary coverage of endocrinology as a whole.\n* Gain a quick understanding of complex topics from a concise text-atlas format that provides a context bridge between primary and specialized medicine.\n* Apply a visual approach-with the classic Netter art, updated illustrations, new artwork and modern imaging-to normal and abnormal endocrine gland function and the clinical presentation patients with endocrine disorders.\n* Clearly see the connection between basic and clinical sciences with an integrated overview of normal structure and function as it relates to pathologic conditions.\n* Delve into updated text of new author and editor, William F. Young, Jr., MD., that illuminates and expands on the illustrated concepts.\n* Benefit from the perspectives of an international advisory board for content that reflects the current global consensus.\n* A reliable and effective reference on the endocrine system with the visual support of Netter","torrent":{"xt":"urn:btih:a1fc3cbc93e27eb5a0ff86e3749e18df2f53cda2","amp;dn":"The+Netter+Collection+of+Medical+Illustrations%2C+2E%2C+Vol+2-+Endoc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1fc3cbc93e27eb5a0ff86e3749e18df2f53cda2","infoHashBuffer":{"type":"Buffer","data":[161,252,60,188,147,226,126,181,160,255,134,227,116,158,24,223,47,83,205,162]},"announce":[],"urlList":[]}}