{"title":"Research Methodology : Methods and Techniques","uid":8702324,"size":1915511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a2b3bfb7d0229a95f2adc445dbad6f65b83d14ca&amp;dn=Research+Methodology+%3A+Methods+and+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Caspo","files":1,"time":1374080866,"description":"Title: Research Methodology : Methods and Techniques\n\nAuthor: C.R. Kothari\n\nSubject: Management and Commerce,Home Science, Mathematics, Bestsellers, Hotel Management, Statistics (Research Methodology)\n\nDescription:\n\nThis second edition has been thoroughly revised and updated and efforts have been made to enhance the usefulness of the book.\nIn this edition a new chapter The Computer : Its Role in Research have been added keeping in view of the fact that computers by now become a indispensable part of research equipment. The other salient feature of this revised edition; subject contents have been developed and restructured at several places. New problems have also been added in various chapters.;\n\nAdoption of appropriate methodology is an essential characteristic of quality research studies irrespective of the discipline with which they are related.\n\nThe present book provides the basic tenets of methodological research so that researchers may become familiar with the art of using research methods and techniques.; The book contains introductory explanations of several quantitative methods enjoying wide use in social sciences. It covers a fairly wide range; related to Research Methodology. The presentations are uniformly economical and cogent. Illustrations given are meaningful and relevant. The book can be taken as a well-organised guide for researchers whose methodological background is not extensive.;\n\nThe book is primarily intended to serve as a textbook for social science students of all Indian universities. It will also serve as a text for the students of M.Phil; Management; and students of various institutes. It will serve all practitioners doing research of one form or other in a general way","torrent":{"xt":"urn:btih:a2b3bfb7d0229a95f2adc445dbad6f65b83d14ca","amp;dn":"Research+Methodology+%3A+Methods+and+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2b3bfb7d0229a95f2adc445dbad6f65b83d14ca","infoHashBuffer":{"type":"Buffer","data":[162,179,191,183,208,34,154,149,242,173,196,69,219,173,111,101,184,61,20,202]},"announce":[],"urlList":[]}}