{"title":"Adobe Captivate v6.0.1.240 WIN And MAC [Multi]","uid":8173696,"size":8406793012,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:a2c2945bead96216fb4ec3247a5753a6858e14e3&amp;dn=Adobe+Captivate+v6.0.1.240+WIN+And+MAC+%5BMulti%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"gatasalvaje","files":-1,"time":1361474503,"description":"Adobe Captivate v6.0.1.240 WIN &amp; MAC [Multi]\n\nISO | MAC 3.4 GB, 2.3 GB X64 WIN, WIN X86 2.3 GB | Language: Spanish (SPA), English (ENG), French (FRE), German (DEU), Japanese (JAP) | Medicina Incl | WIN &amp; MAC | 32-Bit &amp; 64-Bit | NFO\n \nDescription:\n--------------\nWhat is Adobe Captivate 6?\nWith Adobe Â® Captivate Â® 6 you can create in the blink of an eye a variety of interactive online learning content and learning with mobile devices based on HTML5. Create product demonstrations in high definition, application simulations and training materials on compliance and social and communication skills with ease. Import Microsoft Â® PowerPoint slides and complete them with questionnaires and interactive multimedia elements. Your content can be displayed on virtually any device, including the iPad.\n\nSystem Requirements:\n---------------------------\nWindows:\n---------\n1 GHz or higher Intel Â® Pentium Â® 4, Intel Centrino Â®, Intel Xeon Â® or Intel Core â„¢ Duo (or compatible)\nMicrosoft Â® Windows Â® XP with Service Pack 3, Windows 7 with Service Pack 1 or Windows 8\nA minimum of 2 GB of RAM (4 GB recommended)\n3 GB of available disk space for installation, additional free space required during installation (can not install on storage devices based on flash)\nDVD-ROM\nScreen resolution of 1024 x 768 (1280 x 1024) video card 16-bit\nIt requires a connection to broadband Internet for online services and to validate Subscription Edition (if applicable) on an ongoing basis *. For updated information on system requirements, visit www.adobe.com / go / cp_sysreq_es.\nThis software will not work if not activated. You must have an Internet connection and broadband register to activate the software, validate subscriptions and online access services. * Not available telephone activation. Adobe online services and other third-party online services are available only for users age 13 and older and require agreement to additional conditions and privacy policy online Adobe (www.adobe.com / go / terms_es). Online services are not available in all countries or languages, it is possible for the user registration and are subject to change or cancellation without notice. May apply fees or additional subscription fees.","torrent":{"xt":"urn:btih:a2c2945bead96216fb4ec3247a5753a6858e14e3","amp;dn":"Adobe+Captivate+v6.0.1.240+WIN+And+MAC+%5BMulti%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2c2945bead96216fb4ec3247a5753a6858e14e3","infoHashBuffer":{"type":"Buffer","data":[162,194,148,91,234,217,98,22,251,78,195,36,122,87,83,166,133,142,20,227]},"announce":[],"urlList":[]}}