{"title":"M3 Bitlocker Recovery 4.0","uid":10989058,"size":4026177,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a3042a5115e6af232c5fd1b1254c66d097e0ba48&amp;dn=M3+Bitlocker+Recovery+4.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ExGenn","files":1,"time":1409965279,"description":"M3 Bitlocker Recovery - World's 1st Data Recovery Software for Bitlocker Encrypted Drive\n\nSafest, read-only and risk-free Bitlocker recovery software\nRecover deleted files from Bitlocker encrypted drive\nRecover data from formatted Bitlocker encrypted drive\nRecover data from deleted or lost Bitlocker encrypted drive\nRecover data from damaged or inaccessible Bitlocker encrypted drive\nFully recover documents, emails, photos, music, videos, etc.\nAn easy-to-use wizard, no prior recovery skills needed\nRecover 1 GB data for free with the Free Edition (Not this :)\n\nM3 Bitlocker Recovery is a safe and effective Bitlocker data recovery software to recover your lost videos, photos, music, documents, emails, etc. from your PC's hard drive as well as from USB flash drive, external hard drive, and other storage device in Windows Vista/Windows 7/Windows 8/Windows Server 2008/Windows Server 2012 so long as you remember your Bitlocker recovery key or Bitlocker encryption password.\n\n======\n\nSo I was watching movies from my external bitlocker protected hard drive, then I went to organize my stuff and suddely ... Shift-Deleted all my movies :S\nI looked around a little bit but I couldn't find any hacked version of any bitlocker recovery software (means only this one and Efs Data Recovery from Disk Internals!)\n\nThis crack is the best you can find! I've spend a few hours for this.\nOnly 2 bytes have changed (you can compare it to the original one) so there isn't any virus in it. If your anti-virus detects this as a virus, DO NOT RUN IT cuz someone may have infected it (not me ;)\n\n======\n\nInstallation:\n  1. Install M3 Bitlocker Recovery from installer provided or download from http://www.lost-recover.com/bitlocker-recovery.html (make sure it is version 4.0)\n\n  2. Copy the provided .exe to the installion directory\n\nEnjoy","torrent":{"xt":"urn:btih:a3042a5115e6af232c5fd1b1254c66d097e0ba48","amp;dn":"M3+Bitlocker+Recovery+4.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3042a5115e6af232c5fd1b1254c66d097e0ba48","infoHashBuffer":{"type":"Buffer","data":[163,4,42,81,21,230,175,35,44,95,209,177,37,76,102,208,151,224,186,72]},"announce":[],"urlList":[]}}