{"title":"What Technology Wants - Kevin Kelly","uid":10593810,"size":1039619,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a350a137537faaf8f57d18741b9c255c3c67adfc&amp;dn=What+Technology+Wants+-+Kevin+Kelly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405837252,"description":"Kevin Kelly, &quot;What Technology Wants&quot;\n\nEnglish | 2010-10-14 | ISBN: 0670022152 | 416 pages | EPUB \n\nA refreshing view of technology as a living force in the world.\n\nThis provocative book introduces a brand-new view of technology. It suggests that technology as a whole is not a jumble of wires and metal but a living, evolving organism that has its own unconscious needs and tendencies. Kevin Kelly looks out through the eyes of this global technological system to discover &quot;what it wants.&quot; He uses vivid examples from the past to trace technology's long course and then follows a dozen trajectories of technology into the near future to project where technology is headed. This new theory of technology offers three practical lessons: By listening to what technology wants we can better prepare ourselves and our children for the inevitable technologies to come. By adopting the principles of pro-action and engagement, we can steer technologies into their best roles. And by aligning ourselves with the long-term imperatives of this near-living system, we can capture its full gifts. Written in intelligent and accessible language, this is a fascinating, innovative, and optimistic look at how humanity and technology join to produce increasing opportunities in the world and how technology can give our lives greater meaning.\n","torrent":{"xt":"urn:btih:a350a137537faaf8f57d18741b9c255c3c67adfc","amp;dn":"What+Technology+Wants+-+Kevin+Kelly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a350a137537faaf8f57d18741b9c255c3c67adfc","infoHashBuffer":{"type":"Buffer","data":[163,80,161,55,83,127,170,248,245,125,24,116,27,156,37,92,60,103,173,252]},"announce":[],"urlList":[]}}