{"title":"Sol-Gel Science - The Physics and Chemistry of Sol-Gel Processin","uid":16018830,"size":18608520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a45deac5a17f25d554df9b15bd3b7edae17dac3a&amp;dn=Sol-Gel+Science+-+The+Physics+and+Chemistry+of+Sol-Gel+Processin&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"clouderone","files":1,"time":1476321047,"description":"Sol-Gel Science - The Physics and Chemistry of Sol-Gel Processing - C.J. Brinker, G.W. Scherer (AP, 1990).pdf\r\n\r\nSol-Gel Science: The Physics and Chemistry of Sol-Gel Processing presents the physical and chemical principles of the sol-gel process.\r\n\r\nThe book emphasizes the science behind sol-gel processing with a chapter devoted to applications. The first chapter introduces basic terminology, provides a brief historical sketch, and identifies some excellent texts for background reading. Chapters 2 and 3 discuss the mechanisms of hydrolysis and condensation for nonsilicate and silicate systems. Chapter 4 deals with stabilization and gelation of sols. Chapter 5 reviews theories of gelation and examines the predicted and observed changes in the properties of a sol in the vicinity of the gel point. Chapter 6 describes the changes in structure and properties that occur during aging of a gel in its pore liquor (or some other liquid). The discussion of drying is divided into two parts, with the theory concentrated in Chapter 7 and the phenomenology in Chapter 8. The structure of dried gels is explored in Chapter 9. Chapter 10 shows the possibility of using the gel as a substrate for chemical reactions or of modifying the bulk composition of the resulting ceramic by performing a surface reaction (such as nitridation) on the gel. Chapter 11 reviews the theory and practice of sintering, describing the mechanisms that govern densification of amorphous and crystalline materials, and showing the advantages of avoiding crystallization before sintering is complete. The properties of gel-derived and conventional ceramics are discussed in Chapter 12. The preparation of films is such an important aspect of sol-gel technology that the fundamentals of film formation are treated at length in Chapter 13. Films and other applications are briefly reviewed in Chapter 14.\r\n\r\nMaterials scientists and researchers in the field of sol-gel processing will find the book invaluable","torrent":{"xt":"urn:btih:a45deac5a17f25d554df9b15bd3b7edae17dac3a","amp;dn":"Sol-Gel+Science+-+The+Physics+and+Chemistry+of+Sol-Gel+Processin","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a45deac5a17f25d554df9b15bd3b7edae17dac3a","infoHashBuffer":{"type":"Buffer","data":[164,93,234,197,161,127,37,213,84,223,155,21,189,59,126,218,225,125,172,58]},"announce":[],"urlList":[]}}