{"title":"Mean Girls","uid":8759164,"size":732708864,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a485e434b2e077405ee8ce5ca6d8c1b4c83b161e&amp;dn=Mean+Girls+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"lara.croft","files":-1,"time":1375212298,"description":"Cady (Lindsay Lohan) is the 16-year-old homeschooled daughter of zoologist parents (Ana Gasteyer and Neil Flynn). They have returned to the United States after residing in Africa for 12 years for their research. Cady is unprepared for her first day of public high school. With the help of Janis (Lizzy Caplan) and Damian (Daniel Franzese), Cady learns about the various cliques. She is warned to avoid the school's most exclusive clique, the Plastics, the reigning trio of girls led by the queen bee Regina George (Rachel McAdams). The Plastics take an interest in Cady, inviting her to sit with them at lunch and go shopping with them after school. Upon realizing that Cady has been accepted into the Plastics, Janis hatches a plan to get revenge on Regina, using Cady to infiltrate the Plastics.\nHaving ingratiated herself with the Plastics per Janis's plan, Cady learns about a &quot;Burn Book.&quot; This notebook is Regina's top secret notebook filled with rumors, secrets, and gossip about all the other girls (and teachers) in their class. Cady soon falls in love with Regina's ex-boyfriend, Aaron Samuels (Jonathan Bennett), whom Regina successfully steals back from Cady in a fit of jealousy at a halloween party. Hurt and frustrated, Cady continues with Janis's plan, which involves cutting off Regina's &quot;resources,&quot; separating her from Aaron, destroying her beauty, and turning Regina's fellow Plastics, insecure rich girl Gretchen Wieners (Lacey Chabert) and sweet but ditzy Karen Smith (Amanda Seyfried), against her.\nIn her efforts to get revenge on Regina, Cady gradually loses her individual personality and remakes herself in the image of Regina. She soon becomes as spiteful as Regina, abandoning Janis and Damian and focusing more on her image.\nRegina responds by spreading the entire contents of her Burn Book around the school, inciting a riot. To avoid suspicion, Regina also inserts a fake libel of herself in the book in order to blame Cady, Gretchen, and Karen. The riot is eventually quelled by Principal Duvall (Tim Meadows). Math teacher Ms. Norbury (Tina Fey), who also appeared in the Burn Book in which Cady slandered her by saying that she sold drugs, makes the girls realize that all of them are guilty of hurting their peers. She has each girl confess and apologize to the rest of the girls. When Janis's turn comes, Regina makes an insulting joke about her sexuality, to which the crowd laughs. Janis retaliates by confessing her plan to destroy Regina with Cady's help and openly mocks Regina with the support of the entire school. Regina storms out, pursued by an apologetic Cady, and gets hit by a school bus in her haste.\nNow without friends, shunned by Aaron, and distrusted by everyone at school, even being distrusted by her own parents, Cady decides to make amends by taking full blame for the Burn Book. Though severely punished by her confession, her guilt dissolves and she returns to her old personality. As part of her punishment and her reformation, she joins the Mathletes,in their competition. There, Cady has an epiphany while competing against a very unattractive girl, realizing that even if she made fun of the girl's appearance it would not stop the girl from beating her.\nAt the Spring Fling dance, Cady is elected Spring Fling Queen, but in her acceptance speech, she declares her victory is meaningless: they are all wonderful in their own way and thus the victory belongs to everyone. As a symbolic gesture, she breaks her tiara and distributes the pieces to her classmates. Cady makes up with Janis and Damian, reconciles with Aaron, and reaches a truce with the Plastics.\nThe film ends with the Plastics disbanding by the start of the new school year: Regina joins the lacrosse team, Karen becomes the school weather girl, Gretchen joins the &quot;Cool Asians&quot;, and Cady hangs out with Damian and Janis.","torrent":{"xt":"urn:btih:a485e434b2e077405ee8ce5ca6d8c1b4c83b161e","amp;dn":"Mean+Girls+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a485e434b2e077405ee8ce5ca6d8c1b4c83b161e","infoHashBuffer":{"type":"Buffer","data":[164,133,228,52,178,224,119,64,94,232,206,92,166,216,193,180,200,59,22,30]},"announce":[],"urlList":[]}}