{"title":"Bamboo Fences (Architecture Art Ebook).pdf","uid":11471171,"size":26387242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a52600e04e1da9273760d891514762df1ad59787&amp;dn=Bamboo+Fences+%28Architecture+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"STBGD","files":-1,"time":1416089202,"description":"Bamboo Fences by Isao Yoshikawa and Suzuki Osamu\nEnglish | 2009 | ISBN: 1568988346 | 159 pages | PDF | 25 MB\n\nBamboo has emerged as the building material of choice for the twenty-first century. Designers in every fieldfrom architecture to aeronauticsare discovering ever more innovative uses for the miracle plant. Five times stronger than concrete and flexible enough to be woven like silk, bamboo has for millennia been an indispensable necessity of life for cultures around the world. \n\nBotanically classified as a grass, it is one of the fastest growing plants on earth. Its abundance and extreme durability have made it a natural choice as the raw material for fences and partitions. Indeed, in Japan, bamboo fence building has become an art form, and endless varieties of bamboo fences exist, from simple picket designs to elaborate fences woven with bamboo branches.\n\nBamboo Fences provides a detailed look at the complex art of bamboo fence design and presents these unique structures in more than 250 photographs and line drawings. Author Isao Yoshikawa gives a brief overview of the history of bamboo fence building in Japan and classifies the different designs by type. A glossary provides an explanation of Japanese fence names and structural terms. Yoshikawa explains how the wide range of fence designs had its origin partly in the full development of the tea ceremony during the sixteenth century, when elegant bamboo fences became important elements of tea ceremony gardens. Bamboo partitions were used in Zen temples, and from there spread to ordinary homes. Many fence styles are named for the temple in which the firstof their kind was built. From the widely used &quot;four-eyed fence&quot; (yotsume-gaki) and the fine &quot;raincoat fence&quot; (mino-gaki) to the expensive &quot;spicebush fence&quot; (kuromoji-gaki), the natural color andtexture of these exquisite bamboo fences could complement any landscape. Whether you plan to use bamboo to bring privacy to your yard, Zen to your garden, or are just seeking an environmentally friendly alternative to chain-link or wood; the simple beauty of these Japanese bamboo fences is sure to inspire","torrent":{"xt":"urn:btih:a52600e04e1da9273760d891514762df1ad59787","amp;dn":"Bamboo+Fences+%28Architecture+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52600e04e1da9273760d891514762df1ad59787","infoHashBuffer":{"type":"Buffer","data":[165,38,0,224,78,29,169,39,55,96,216,145,81,71,98,223,26,213,151,135]},"announce":[],"urlList":[]}}