{"title":"The Ferryman Institute - Colin Gigl [EN EPUB] [ebook] [p_s]","uid":15932096,"size":3296613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a52cbc672401922a42e84a21aa3c304e292e76bf&amp;dn=The+Ferryman+Institute+-+Colin+Gigl+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"perfect_stan","files":1,"time":1475366395,"description":"The Ferryman Institute by Colin Gigl\r\nEnglish | 2016 | Fantasy | 3.1 MB\r\n\r\n\r\nIn this stunning, fantastical debut novel from a bold new voice in the bestselling traditions of Christopher Moore and Jasper Fforde, a ferryman for the dead finds his existence unraveling after making either the best decision or the biggest mistake of his immortal life.\r\nFerryman Charlie Dawson saves dead people—somebody has to convince them to move on to the afterlife, after all. Having never failed a single assignment, he’s acquired a reputation for success that’s as legendary as it is unwanted. It turns out that serving as a Ferryman is causing Charlie to slowly lose his mind.\r\nDeemed too valuable by the Ferryman Institute to be let go and too stubborn to just give up in his own right, Charlie’s pretty much abandoned all hope of escaping his grim existence. Or he had, anyway, until he saved Alice Spiegel. To be fair, Charlie never planned on stopping Alice from taking her own life—that sort of thing is strictly forbidden by the Institute—but he never planned on the President secretly giving him the choice to, either. Charlie’s not quite sure what to make of it, but Alice is alive, and it’s the first time he’s felt right in more than two hundred years.\r\nWhen word of the incident reaches Inspector Javrouche, the Ferryman Institute’s resident internal affairs liaison, Charlie finds he’s in a world of trouble. But Charlie’s not about to lose the only living, breathing person he’s ever saved without a fight. He’s ready to protect her from Javrouche and save Alice from herself, and he’s willing to put the entire continued existence of mankind at risk to do it.\r\nWritten in the same vein as bestselling modern classics such as The Eyre Affair by Jasper Fforde and A Dirty Job by Christopher Moore, The Ferryman Institute is a thrilling supernatural adventure packed with wit and humor.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:a52cbc672401922a42e84a21aa3c304e292e76bf","amp;dn":"The+Ferryman+Institute+-+Colin+Gigl+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a52cbc672401922a42e84a21aa3c304e292e76bf","infoHashBuffer":{"type":"Buffer","data":[165,44,188,103,36,1,146,42,66,232,74,33,170,60,48,78,41,46,118,191]},"announce":[],"urlList":[]}}