{"title":"DAZ3D - Poser - Poker Play for G2F G2M and G3F plus Divination","uid":15610656,"size":892372110,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a531088f5393e75541359ddea2fe56185cf20370&amp;dn=DAZ3D+-+Poser+-+Poker+Play+for+G2F+G2M+and+G3F+plus+Divination&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"De4lt","files":22,"time":1471776557,"description":"Resurrecting another of my ups...\r\n\r\nFeralFey's Poker Play\r\n---------------------\r\n \nhttps://cdn.pximg.xyz/5d1f57b39a6d5ffb438ec069ed4364c0.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/22535\r\n\r\nWho doesn't like the occasional sit-down game of poker with friends? Give your 3D models a chance to win some/lose some with this detailed set of cards and poker chips. The card prop is loaded with movement morphs, so your card playing can take on a realistic look of being bent, shuffling the cards, or playing a round of 3 Cards Monty. The card is textured with three hand designed card back colors, and comes with a fully deck's worth of card fronts, including the joker. The five card spread prop comes with a fan morph so you can open and close the spread as needed. The cards in the spread take the same textures as the card prop, but also come with material presets of popular poker hands, including Wild Bill Hickok's fabled last hand, the dead man's hand. The poker chip comes with a quick and easy &quot;stack&quot; morph to convert the single chip into a stack of chips. This is great for when you're low on resources but need to have lots of chips on the table. The chip comes in five different color presets, and includes options to remove the FeralFey logo so you can insert your own. The chip stack takes the same textures as the single chip, and comes with an &quot;untidy&quot; morph so you can have less than perfectly stacked chips at the spin of a dial. There are also material preset options to turn the stack of ten chips into smaller quantities - whatever your scene may require. To make these props more useful, there are wearable presets included for Genesis 2 Males, Genesis 2 Females, and Genesis 3 Females to parent the props to the right or left hand, as you may need. There are 16 Hierarchical Pose Presets for each of the Genesis 2 and 3 models to bring action and realism into your scene. And as a bonus, I have included 8 facial poses that capture some of the possible expressions one would find in a poker game. As always, FeralFey poses are fact checked for gravity, balance, and realism.\r\n\r\n\r\nDivination for Poker Play\r\n-------------------------\r\n \nhttps://cdn.pximg.xyz/7241cb17690b0014003313b72d928f73.jpg\r\n\r\nwww.daz3d.com/catalog/product/view/id/22908\r\n\r\nWho can tell what will come to pass? Perhaps those with the sight, or those who know how to use the tools of prognostication? Give your characters the ability to see into the future with this texture and pose add-on set for FeralFey's Poker Play. With a click you can turn the card into one of 78 cards of the Rider/Waite tarot deck. Or a click and a quick spin of a dial converts the poker chip into one of 24 traditional runes on a wooden disk. Also included are 4 two-person vignette poses each for Genesis 2 Females, Genesis 2 Males, and Genesis 3 Females (a total of 8 poses for each model). They can be mixed and matched for greater variety","torrent":{"xt":"urn:btih:a531088f5393e75541359ddea2fe56185cf20370","amp;dn":"DAZ3D+-+Poser+-+Poker+Play+for+G2F+G2M+and+G3F+plus+Divination","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a531088f5393e75541359ddea2fe56185cf20370","infoHashBuffer":{"type":"Buffer","data":[165,49,8,143,83,147,231,85,65,53,157,222,162,254,86,24,92,242,3,112]},"announce":[],"urlList":[]}}