{"title":"GiliSoft USB Lock v6.1.0","uid":15362751,"size":3787817,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a549884ee73946374859dbe1bb80e606f19d6ed5&amp;dn=GiliSoft+USB+Lock+v6.1.0&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZarkBit","files":1,"time":1469046088,"description":"GiliSoft USB Lock v6.1.0\r\n\r\nExclusive Features of USB Lock\r\n\r\nBlock USB/SD Drives\r\nDisable reading from USB/SD disks or disable writing to USB/SD disks. It doesn’t allow any type of USB/SD drive to access your computer unless you authorize it or it has been in trusted devices White-list.\r\n\r\nCD Lock,Block Media &amp; Blu-ray Discs\r\nDisable reading from DVD/CD discs or making DVD/CD burner read-only. This application also blocks any disc that uses the disk hub, bay, combo or CD/DVD drive and allots a drive letter.\r\n\r\nTrusted Devices White List\r\nYou can create a whitelist to allow 'certain approved' USB pen drives. Then it will block all USB drives except the ones in the white-list. \r\n\r\nReports &amp; Logs\r\nUSB Lock provide full reports and logs: (1) USB Activity - Monitor all file operation (like create delete files ) on all USB disks that connected to your computer. (2) Deny &amp; Allow Access History. (3) Activity White List. \r\n\r\nWebsite Lock\r\nBlock accessing some websites. This utility allows you to block unwanted websites from display in Internet Explorer. If a website is blocked the user is forwarded to a blank page or to a &quot;blocked page&quot; and the contents of the original page are not loaded on your PC. \r\n\r\nDevices Lock\r\nThe program can be used to restrict read or write access to removable media devices such as CD, DVD, floppy, SD Card Readers, flash and USB drives. It also can be used to disable iPhone, Android phone, printer,modem, com lpt ports,infrared, blue-tooth, 1394 ports.\r\n\r\nPrograms Lock\r\nBlock running any programs, including IE, Outlook, AOL, AIM, Dropbox, and more. You can even lock your control panel with one button click.\r\n\r\nPowerful Self-protection Mode\r\nNobody can uninstall this software without password and you can hide this program in Invisible Mode. When someone enters wrong password more than 5 times, it will send alarm notifications to your pre-defined e-mail and the unknown login will be temporarily banned.\r\n\r\nCopy Protection\r\nThe program uses an advanced level of data leak prevention technology that does not permit duplication of your important files and copyright material to any USB drive or other such storage devices without your permission.\r\n\r\nData Leak Prevention\r\nIt prevents your data from getting leaked out to USB drives and other such storage devices by letting you control which device can access your computer while blocking all other unauthorized devices that do not belong to you.\r\n \nhttp://www.gilisoft.com/product-usb-lock.htm","torrent":{"xt":"urn:btih:a549884ee73946374859dbe1bb80e606f19d6ed5","amp;dn":"GiliSoft+USB+Lock+v6.1.0","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a549884ee73946374859dbe1bb80e606f19d6ed5","infoHashBuffer":{"type":"Buffer","data":[165,73,136,78,231,57,70,55,72,89,219,225,187,128,230,6,241,157,110,213]},"announce":[],"urlList":[]}}