{"title":"Isabel Allende - The House of the Spirits (pdf)","uid":10800228,"size":7496312,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a555f25a708e177569b1e035ac726497a9518d3a&amp;dn=Isabel+Allende+-+The+House+of+the+Spirits+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"pharmakate","files":-1,"time":1408337402,"description":"Isabel Allende - The House of the Spirits (Bantam Books, 1985). 433 pages.\n\nImproved version of an older scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to the original scanner.\n\ndescription:\n\nHere, in an astonishing debut by a gifted storyteller, is the magnificent saga of proud and passionate men and women and the turbulent times through which they suffer and triumph. They are the Truebas. And theirs is a world you will not want to leave, and one you will not forget.\n\nEsteban -- The patriarch, a volatile and proud man whose lust for land is legendary and who is haunted by his tyrannical passion for the wife he can never completely possess.\n\nClara -- The matriarch, elusive and mysterious, who foretells family tragedy and shapes the fortunes of the house of the Truebas.\n\nBlanca -- Their daughter, soft-spoken yet rebellious, whose shocking love for the son of her father's foreman fuels Esteban's everlasting contempt... even as it produces the grandchild he adores.\n\nAlba -- The fruit of Blanca's forbidden love, a luminous bearty, a fiery and willful woman... the family's break with the past and link to the future.\n","torrent":{"xt":"urn:btih:a555f25a708e177569b1e035ac726497a9518d3a","amp;dn":"Isabel+Allende+-+The+House+of+the+Spirits+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a555f25a708e177569b1e035ac726497a9518d3a","infoHashBuffer":{"type":"Buffer","data":[165,85,242,90,112,142,23,117,105,177,224,53,172,114,100,151,169,81,141,58]},"announce":[],"urlList":[]}}