{"title":"Learning, Problem Solving, and Mind Tools","uid":8777414,"size":4826856,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5738d5753f69ae72a618cd47ea8e189e41d0dff&amp;dn=Learning%2C+Problem+Solving%2C+and+Mind+Tools&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"livhre","files":-1,"time":1375592246,"description":"\nFormat: ePub\n\nDRM stripped in Calibre.\n\n\n\nLearning, Problem Solving, and Mindtools is inspired by the substantial body of learning research by David H. Jonassen in the areas of mind tools and problem solving.  The focus of the volume is on educational technology, especially with regard to how new technologies have facilitated and supported problem solving and critical thinking. Each chapter focuses on a particular aspect of learning with technology and elaborates the implications for the design and implementation of learning environments and activities aimed at improving the conceptualization of problems, reasoning and higher-order thinking, and solving challenging problems.\n\nThis collection of scholarly essays provides a highly engaging treatment of using tools and technologies to improve problem solving; multiple perspectives on integrating educational technology to support learning in complex and challenging problem solving domains; guidance for the design of instruction to support problem solving; a systemic account of the relationships between mental models, instructional models, and assessment models; and a look into the future of educational technology research and practice.\n\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.","torrent":{"xt":"urn:btih:a5738d5753f69ae72a618cd47ea8e189e41d0dff","amp;dn":"Learning%2C+Problem+Solving%2C+and+Mind+Tools","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5738d5753f69ae72a618cd47ea8e189e41d0dff","infoHashBuffer":{"type":"Buffer","data":[165,115,141,87,83,246,154,231,42,97,140,212,126,168,225,137,228,29,13,255]},"announce":[],"urlList":[]}}