{"title":"Yours Mine and Ours (1968)","uid":5243218,"size":791886257,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a59a4b51544a8831eda4f587c80a3fb4e93fb4db&amp;dn=Yours+Mine+and+Ours+%281968%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"GUIGUNS","files":4,"time":1261865345,"description":"Naval officer Frank Beardsley, a widower with 10 children, takes a shore job so that he can look after his family; but he finds that they miss their mother and resent his attempts at discipline. Then he begins dating nurse Helen North, a widow with 8 children. With the matchmaking assistance of Beardsley's bachelor friend, Darrell Harrison, Helen and Frank eventually decide to marry, despite the unnerving prospect of such a large family. At first the children resent the marriage, and jealousies among the youngsters create numerous problems in the crowded household; but when Helen's son Phillip begins to hero-worship Frank's eldest boy, Mike, family relations improve and hostilities subside. The bond between parents and children is strengthened by the expectation of Frank and Helen's first baby. When she returns home with the family's 19th child, both sets of children view the new offspring as their own; and they ask to be adopted by their respective stepparents in order that they may all share the same name. With Mike going off to war and Helen's daughter Colleen learning that love also brings responsibilities, the union of the two households is complete.","torrent":{"xt":"urn:btih:a59a4b51544a8831eda4f587c80a3fb4e93fb4db","amp;dn":"Yours+Mine+and+Ours+%281968%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a59a4b51544a8831eda4f587c80a3fb4e93fb4db","infoHashBuffer":{"type":"Buffer","data":[165,154,75,81,84,74,136,49,237,164,245,135,200,10,63,180,233,63,180,219]},"announce":[],"urlList":[]}}