{"title":"Kanye West The Best Of Kanye West 2011","uid":6776364,"size":201944919,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a5f66dee9feae621b0a27756ff42fc7b69275a24&amp;dn=Kanye+West+The+Best+Of+Kanye+West+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"speedthunder","files":21,"time":1319745403,"description":"[img]http://image.bayimg.com/dakneaadj.jpg[/img]\n\nKanye West\nThe Best Of\nKanye West (2011)\n\nIn the span of three short years, Kanye West went from hip-hop beatmaker to worldwide hitmaker, as his stellar production work for Jay-Z led to a major-label recording contract and, ultimately, a wildly successful solo career. West paired his beats with tongue-twisting raps and a self-assured, flamboyant personality. His dapper fashion sense set him apart from many of his rap peers, and his confidence often came across as boastful or even egotistical, albeit amusingly so. This flamboyance, of course, made for good press, something that West enjoyed in spades during his sudden rise to celebrity status. He was a media darling, appearing and performing at countless awards shows (and winning at them, too), delivering theatrical videos to MTV, and mouthing off about whatever happened to cross his mind. He frequently spoke out against the rampant homophobia evident in much rap music, posed for the cover of Rolling Stone as Jesus Christ, and even claimed during a televised Hurricane Katrina fundraiser that &quot;George Bush doesn't care about black people.&quot; West courted controversy, no question about it, but his steady presence in the celebrity limelight couldn't eclipse his musical talent. His production abilities seemed boundless during his initial surge of activity, as he not only racked up impressive hits for himself (including &quot;Jesus Walks&quot; and &quot;Gold Digger&quot;), but also collaborated on smash hits with the likes of Jay-Z and Ludacris. As his career progressed throughout the early 21st century, West shattered certain stereotypes about rappers, becoming a superstar on his own terms without adapting his appearance, his rhetoric, or his music to fit any one musical mold\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/tr.gif[/img]\n\n01. All Falls Down (Feat. Syleena Johnson)\n02. Jesus Walks\n03. Through The Wire\n04. Slow Jamz (Feat. Twista &amp; Jamie Foxx)\n05. Heard 'Em Say (Feat. Adam Levine Of Maroon 5)\n06. Touch The Sky (Feat. Lupe Fiasco)\n07. Drive Slow (Feat. Paul Wall And GLC)\n08. Diamonds From Sierra Leone\n09. Good Life (Feat. T-Pain)\n10. Can't Tell Me Nothing\n11. Flashing Lights (Feat. Dwele)\n12. The Glory\n13. Welcome To Heartbreak (Feat. Kid Curi)\n14. Heartless\n15. Love Lockdown\n16. Coldest Winter\n17. Power\n18. All Of The Lights\n19. Monster (Feat. Jay-Z, Rick Ross, Nicki Minaj &amp; Bon Iver)\n20. Devil In A New Dress (Feat. Rick Ross)\n\n[img]http://i896.photobucket.com/albums/ac169/pbf99/ENJOY.gif[/img]\n\n[img]http://www.pix2links.com/images/14826000806886868172.gif[/img] \n\n","torrent":{"xt":"urn:btih:a5f66dee9feae621b0a27756ff42fc7b69275a24","amp;dn":"Kanye+West+The+Best+Of+Kanye+West+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5f66dee9feae621b0a27756ff42fc7b69275a24","infoHashBuffer":{"type":"Buffer","data":[165,246,109,238,159,234,230,33,176,162,119,86,255,66,252,123,105,39,90,36]},"announce":[],"urlList":[]}}