{"title":"No Starch Press The Linux Command Line, A Complete Introduction","uid":8764505,"size":1948176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5fd0c6dd5e72ebfb7d8eb7469ebc1e6a7f56ae9&amp;dn=No+Starch+Press+The+Linux+Command+Line%2C+A+Complete+Introduction+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"IAmsoICan","files":1,"time":1375304335,"description":"The Linux Command Line, A Complete Introduction 2nd (2013) [PDF]\n\nYou've experienced the shiny, point-and-click surface of your Linux computer -- now dive below and explore its depths with the power of the command line.\n\nThe Linux Command Line takes you from your very first terminal keystrokes to writing full programs in Bash, the most popular Linux shell. Along the way you'll learn the timeless skills handed down by generations of gray-bearded, mouse-shunning gurus: file navigation, environment configuration, command chaining, pattern matching with regular expressions, and more.\n\nIn addition to that practical knowledge, author William Shotts reveals the philosophy behind these tools and the rich heritage that your desktop Linux machine has inherited from Unix supercomputers of yore.\n\nAs you make your way through the book's short, easily-digestible chapters, you'll learn how to:\n\n.   Create and delete files, directories, and symlinks\n.   Administer your system, including networking, package installation, and process management\n.   Use standard input and output, redirection, and pipelines\n.   Edit files with Vi, the world's most popular text editor\n.   Write shell scripts to automate common or boring tasks\n.   Slice and dice text files with cut, paste, grep, patch, and sed\n\nOnce you overcome your initial &quot;shell shock,&quot; you'll find that the command line is a natural and expressive way to communicate with your computer. Just don't be surprised if your mouse starts to gather dust.\n\nAuthor: William E. Shotts Jr.\n\nPublisher: No Starch Press; 2nd edition (July 6, 2013)\nLanguage: English\nISBN-10: 1593273894\nISBN-13: 978-1593273897","torrent":{"xt":"urn:btih:a5fd0c6dd5e72ebfb7d8eb7469ebc1e6a7f56ae9","amp;dn":"No+Starch+Press+The+Linux+Command+Line%2C+A+Complete+Introduction+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5fd0c6dd5e72ebfb7d8eb7469ebc1e6a7f56ae9","infoHashBuffer":{"type":"Buffer","data":[165,253,12,109,213,231,46,191,183,216,235,116,105,235,193,230,167,245,106,233]},"announce":[],"urlList":[]}}