{"title":"Allah-Las - Allah-Las [2012] [EAC,log,cue.FLAC]","uid":9266506,"size":274650957,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a65e0d660acbee972149315a11ea0a3fa42628a7&amp;dn=Allah-Las+-+Allah-Las+%5B2012%5D+%5BEAC%2Clog%2Ccue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"dickspic","files":14,"time":1385708391,"description":"Artist: Allah-Las\nRelease: Allah-Las\nReleased: 2012\nLabel: Innovative Leisure\nCatalog#: IL2007\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: rock\n\nimage\n\n\n1. Catamaran\t\n2. Don't You Forget It\t\n3. Busman's Holiday\t\n4. Sacred Sands\t\n5. No Voodoo\t\n6. Sandy\t\n7. Ela Navega\t\n8. Tell Me (What's On Your Mind)\t\n9. Catalina\t\n10. Vis-A-Vis\t\n11. Seven Point Five\t\n12. Long Journey\n\n\nL.A. garage psych revivalists Allah-Las met and formed when three of the four bandmembers were working at Amoeba Records. No doubt they bonded over repeated airings of Pebbles collections and arguments over who was moodier, Love or the Chocolate Watchband, because the sound they conjure up on their self-titled debut album sounds like it came straight out of a Midwestern garage or from the stage of a West Coast teen club. With the help of friend and producer Nick Waterhouse (who expertly re-creates old-school soul music on his own records), the group nails the sometimes overlooked melancholy side of garage rock. Every band worth its Voxx guitars had at least one misty minor-chord ballad in its repertoire to show off the tenderness that lurked below the shouting rockers and pissed-off rants. Allah-Las delve deeply into the murky moods, delivering nothing but low-key, restrained songs that never raise a sweat but creep right into your brain just the same. Part of this can be credited to the sound Waterhouse gets -- perfectly layered guitars (with plenty of chiming 12-string), a chunky but fluid bass pulse, a tinny but tough drum sound, just the right amount of reverb on the vocals -- but the rest has to go to the guys writing the songs. Though they stick to minor chords and middle tempos throughout the album, the songs don't blend together into a hazy mess as the album slowly sulks along, and occasional songs, like &quot;Busman's Holiday,&quot; veer away from the typical girl-done-me-wrong tropes of garage rock and help keep things separated. So do the memorable guitar lines Pedrum Siadatian drapes across every song; the musical hooks, like the surging organ of &quot;Catamaran&quot; or the bongos on &quot;Seven Point Five,&quot; that pop up repeatedly; and the tender snarl of Miles Michaud's vocals. He's clearly taken his Jagger lessons, but never lapses into pure imitation. In the end, what really makes the record a success is the mood the band sure-footedly creates from beginning to end. The record starts under a cloud of grey sadness and it never lets up; even the two instrumentals have a wistful heart. Plenty of bands have done just as good a job at re-creating the sound and feel of '60s psych and garage bands; few have done it with the unceasingly downcast and yet somehow peaceful approach of Allah-Las. It might be nice to hear them amp it up a bit on their next record for a change of pace, but this works just fine as a bummed-out garage trip..","torrent":{"xt":"urn:btih:a65e0d660acbee972149315a11ea0a3fa42628a7","amp;dn":"Allah-Las+-+Allah-Las+%5B2012%5D+%5BEAC%2Clog%2Ccue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65e0d660acbee972149315a11ea0a3fa42628a7","infoHashBuffer":{"type":"Buffer","data":[166,94,13,102,10,203,238,151,33,73,49,90,17,234,10,63,164,38,40,167]},"announce":[],"urlList":[]}}