{"title":"[TROMA] Class Of Nuke 'em High 1, 2 and 3","uid":5642692,"size":2484651544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a7b96ac4ce5d6278e31b5d9e6d276d8c1bd5aba3&amp;dn=%5BTROMA%5D+Class+Of+Nuke+%5C%27em+High+1%2C+2+and+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"show_off","files":5,"time":1277171041,"description":"CLASS OF NUKE 'EM HIGH\n\nClass of Nuke'Em High, the timeless classic of readin', writin' and radiation, is available for the first time ever in this unrated Director's Cut. When first released in theaters in 1986, Class of Nuke'Em High became an instant sensation. Its unique blend of horror and humor was cheered by audiences and celebrated by critics. The film spawned two sequels and legions of fans.\n\nAt Tromaville High School, located a stone's throw from the local Nuclear Power Plant, the students are getting brighter. In fact, they're beginning to develop a Troma-green glow. Innocent students mutate into sex-crazed psychos, the Honor Society's turned into carnivorous, kinky cretins, and the slimy monster stalking the hallways isn't the principal!\n\nThe Director's Cut of Class of Nuke 'Em High has been lovingly restored by co-director Lloyd Kaufman (who developed the film during detention) and the Troma Team. Never-before-seen footage (found in the Tromaville High School's girls' bathroom) has been added. The film includes a special introduction from the Tromaville CafÃƒÂ© featuring Toxie, Sgt. Kabukiman N.Y.P.D, The Tromettes, and Lloyd Kaufman.\n\nEveryone will agree that Class Of Nuke'em High is the best movie about violent monster mutant morons of the decade!!\n\n----------------------------------------------------\n\nCLASS OF NUKE 'EM HIGH 2: SUBHUMANOID MELTDOWN\n\nFirst there was the super successful, now classic, theatrical smash hit and breakthrough blockbuster CLASS OF NUKE 'EM HIGH! Now, there comes the riotous sci-fi, hyper-action, big budget, ambitious sequellian comedy, Troma's CLASS OF NUKE OF NUKE 'EM HIGH PART II: SUBHUMANOID MELTDOWN! Those lovable cretins from CLASS OF NUKE 'EM HIGH! have graduated Summa Cum Weirdly, and the once peaceful town of Tromaville is about to explode with a wave of sci-fi and special effects induced SUBHUMANOID MELTDOWN!\n\nWelcome to the Tromaville Institure of Technology, where a melt-down prone nuclear power-plant creates a hideously deformed but very positive thinking humangous mutant squirrels and abnoxious talking belly buttons with bad attitudes. In this incredibly bold adventure in gene-splicing, anarchy and terror rule the campus of Tromaville Tech as the students join forces with the subhumanoids to overthrow the insidious and hedonistic corporate slime responsible for a wave of malicious mutant meltdowns and massacres. Will peace and environmental hygiene ever be restored to the once-peaceful town of Tromaville? Find out as you enroll for the education of a lifetime in CLASS OF NUKE 'EM HIGH PART II: SUBHUMANOID MELTDOWN!\n\n----------------------------------------------------\n\nCLASS OF NUKE 'EM HIGH 3: THE GOOD, THE BAD AND THE SUBHUMANOID\n\nWelcome back to Tromaville High!!! The only school in the country with a giant nuclear rodent for mascot, detention for melting and a bikini dress code. Wanna Hall Pass? Wanna Bus Pass? Wanna Pass Gas? You won't pass up the mindbending special effects!\n\nThe Tromaville student body is in danger again... and it's not of flunking. Tromaville is under attack from a subhumanoid army led by the evil Dr. Slag and his perfectly proportioned partner Professor Holt (a woman scientist with really big hair, portrayed by Lisa Gaye). On top of that, TROMIE the Nuclear Rodent is raging mad!\n\n3 times the evil of the original! 3 times th mutated monsters of the sequel! With subhumanoid twins battling for Tromaville, more bodacious babes than ever and 3 times the nuclear meltdowns, it's all action and excitement in CLASS OF NUKE 'EM HIGH 3 - The Good, the Bad and the Subhumanoid!","torrent":{"xt":"urn:btih:a7b96ac4ce5d6278e31b5d9e6d276d8c1bd5aba3","amp;dn":"%5BTROMA%5D+Class+Of+Nuke+%5C%27em+High+1%2C+2+and+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7b96ac4ce5d6278e31b5d9e6d276d8c1bd5aba3","infoHashBuffer":{"type":"Buffer","data":[167,185,106,196,206,93,98,120,227,27,93,158,109,39,109,140,27,213,171,163]},"announce":[],"urlList":[]}}