{"title":"Albert Camus - The Fall (pdf)","uid":8604161,"size":1041692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a8e29330738dc4160f7e8f6d5313ea3d5b49b1dc&amp;dn=Albert+Camus+-+The+Fall+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"pharmakate","files":-1,"time":1371959733,"description":"Albert Camus (Justin O'Brien, trans.) - The Fall (Penguin, 1957). 108 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nOther formats for this book, and other books by Camus, are available here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8590574&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8590574&lt;/a&gt;\n\nBut I wasn't satisfied with the formatting of some of them, so I made my own. There's also a djvu file of The Fall floating around on the internet; it's somewhat similar to the one I'm uploading here, but that one is missing at least one page and has some other issues. Which I discovered only after spending an hour trying to turn it into a decent pdf. So the one in this torrent is a completely new scan.\n\n\nwikipedia description:\n\nThe Fall (French: La Chute) is a philosophical novel written by Albert Camus. First published in 1956, it is his last complete work of fiction. Set in Amsterdam, The Fall consists of a series of dramatic monologues by the self-proclaimed &quot;judge-penitent&quot; Jean-Baptiste Clamence, as he reflects upon his life to a stranger. In what amounts to a confession, Clamence tells of his success as a wealthy Parisian defense lawyer who was highly respected by his colleagues; his crisis, and his ultimate &quot;fall&quot; from grace, was meant to invoke, in secular terms, The Fall of Man in the Garden of Eden. The Fall explores themes of innocence, imprisonment, non-existence, and truth.\n\nCamus' style of narration is a type of second-person monologue written in the likeness of Notes from Underground, by Fyodor Dostoevsky. Both authors used their main characters to address their readers directly; however, Camus' narrative was written in the first-person present tense, thus assuming that the reader will join the main character, Clamence, in the novel's imagined sphere of discourse. In a eulogy to Albert Camus, existentialist philosopher Jean-Paul Sartre described the novel as &quot;perhaps the most beautiful and the least understood&quot; of Camus' books.","torrent":{"xt":"urn:btih:a8e29330738dc4160f7e8f6d5313ea3d5b49b1dc","amp;dn":"Albert+Camus+-+The+Fall+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8e29330738dc4160f7e8f6d5313ea3d5b49b1dc","infoHashBuffer":{"type":"Buffer","data":[168,226,147,48,115,141,196,22,15,126,143,109,83,19,234,61,91,73,177,220]},"announce":[],"urlList":[]}}