{"title":"James Vincent McMorrow - Post Tropical (2014) [FLAC]","uid":9490790,"size":237472381,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a92ab94f4b0cc3c55cb8eeceb6c2cfd910aa63b9&amp;dn=James+Vincent+McMorrow+-+Post+Tropical+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"politux","files":-1,"time":1389991157,"description":"\n  James Vincent McMorrow - Post Tropical (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Electronic, Singer/Songwriter\n  Source: WEB\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Cavalier \n  02 The Lakes\n  03 Red Dust\n  04 Gold \n  05 All Points \n  06 Look Out \n  07 Repeating\n  08 Post Tropical \n  09 Glacier \n  10 Outside, Digging \n\n  Irish singer/songwriter James Vincent McMorrow turns expectations upside down on Post Tropical, his sophomore follow-up to Early in the Morning. Though his debut attracted listeners with its quirky meld of soft vocals and acoustic and electric guitars, McMorrow shifts gears entirely here. Recorded in a Texas studio between the Rio Grande and Mexico, its production textures are made up of electronic beats, electric guitars, synths, samplers, and piano and other sundry instruments, mostly played by the artist. At the humid center of it all is McMorrow's tender, quietly passionate and soulful falsetto, hovering, haunting and diving into lyrics that are fraught with longing, desire, hope, passion, and sometimes desperation. Post Tropical is, at heart, a poetic soul record, albeit of the 21st century variety -- there isn't anything remotely retro here. First single and opening track &quot;Cavalier&quot; opens with a skeletal electric piano. McMorrow enters immediately. Guided by his voice, he gradually builds the tune into a breathtaking, lush soundscape. Even the horns and female backing vocals (provided by sleeve designer Emma Doyle) are so tastefully placed, they underscore the romance, haunted ache, and longing in his delivery. &quot;Red Dust&quot; commences with wordless call-and-response vocals, answered by a piano and his proper entrance with the lyrics, crooning into the rhythms as well as above them. \n\n  McMorrow's stacked backing voices add texture to the simple melody while deep beats add dimension, creating a sense of desperation: &quot;...Sometimes my hands/they don't feel like my own/I need someone to love/I need someone to hold....&quot; &quot;Gold&quot; offers Baroque horns, layers of guitars, basses, and snares; they circle around the vocal to create a glorious, soul-infused pop. The title track opens with a lithe keyboard pulse and a subdued horn arrangement, as drums, fat brass, and a throbbing synth bassline create a sonic maelstrom, but the singer, aided by numerous backing vocal layers, rises to meet them. Suddenly it all drops as the sound of a steel guitar playing a melody reminiscent of Nigerian high life enters to create a sharp contrast and it becomes an intimate, sunny groover. &quot;Glacier&quot; opens as a piano ballad but its handclaps, drums, beats, synths, strings, and choral backing transform it into a nearly jaunty pop number. Its well-crafted songwriting, enigmatic production, and arrangements, around McMorrow's gorgeous voice make Post Tropical a stunner start to finish. Fans of James Blake's Overgrown and Bon Iver's self-titled second album should find this appealing, but this stands apart from both those records. It's not only smart, it's honest, emotionally and musically.","torrent":{"xt":"urn:btih:a92ab94f4b0cc3c55cb8eeceb6c2cfd910aa63b9","amp;dn":"James+Vincent+McMorrow+-+Post+Tropical+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a92ab94f4b0cc3c55cb8eeceb6c2cfd910aa63b9","infoHashBuffer":{"type":"Buffer","data":[169,42,185,79,75,12,195,197,92,184,238,206,182,194,207,217,16,170,99,185]},"announce":[],"urlList":[]}}