{"title":"[MissaX / Clips4Sale] Adriana Chechik - Filthy Boy","uid":15814132,"size":737499389,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a9535972f94cad25f3658d257adfe78bd698eeaf&amp;dn=%5BMissaX+%2F+Clips4Sale%5D+Adriana+Chechik+-+Filthy+Boy&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1473657133,"description":"[MissaX / Clips4Sale] Adriana Chechik - Filthy Boy\r\n\r\nScreenshots:\r\n \nhttp://imgsnaps.com/img2-57d61d1f885f8.html\r\n \nhttp://imgsnaps.com/img2-57d61d1f8ce2b.html\r\n\r\n\r\nMs. Chechik is the only single mother in the community and it's easy for the haughty women in the traditional neighborhood to look down on a woman for living alone. She has a mysterious goddess-like beauty to her with her sparkling green eyes, her tanned skin, her raven black hair. It's difficult for an exceptionally beautiful woman to make friends, and it's taken her years to become respected, and more than respected, she has become a pillar of the community.\r\n\r\nRobby is getting older and running around with the poor boys from the West Side of town. Ms. Chechik has forbid him to hang around with those trouble making boys but Robby thinks they're so much more fun than the preppy boys who are only interested in golf and chasing uptight girls with coiffed hair and pearls. Robby has been pushing his mother more and more with his rebellion, bringing them into town, and there's been talk abut drag racing and robberies.\r\n\r\nMs. Chechik went into the city to shop and the ladies were talking behind her back, the raised eyebrows and hushed voices were reminiscent of just 12 years ago when she just moved to Moorehouse. Ms. Chechik stiffened her spine and continued her errands when she saw her good friend Gloria who filled her in on the gossip. The boy has crossed the line with his hooligan friends and now everyone in town knows it. They say that &quot;filth doesn't rub off of the poor,&quot; and they're considering taking her off of the city council and planning board, the position that she worked so hard to earn. Ms. Chechik politely thanked her friend and went home to wait for Robby to return.\r\n\r\nShe has lived her life using her beauty as a tool to get what she wants from men. She started to learn how beauty can persuade men from her father, and throughout her growing years she knows that her exceptional beauty can control men to behave however she'd like them to. She needs her boy to behave. She needs to teach him.\r\n\r\nShe sees him standing there apologizing for his transgressions and she knows it's not sincere. She can control him if she seduces him. She needs to see his eyes below her, lapping up her pussy juices like an obedient boy, a tamed lion, eager to please her next request. Her nipples harden at the power she holds over men, and her son is getting so much older, so masculine and less like the boy she raised. She aches to be filled. She wants her son to cum inside of her. He practices obeying her as she moans, &quot;mmph, deeper, umph, kiss mommy.&quot; She pushes her velvety pink tongue into his mouth as his eyes widen. He knows that this moment will change his life. He will live for her, live to please her, long for the moment he can release inside of her again, to feel her pussy pulsate around his cock as they cum together","torrent":{"xt":"urn:btih:a9535972f94cad25f3658d257adfe78bd698eeaf","amp;dn":"%5BMissaX+%2F+Clips4Sale%5D+Adriana+Chechik+-+Filthy+Boy","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9535972f94cad25f3658d257adfe78bd698eeaf","infoHashBuffer":{"type":"Buffer","data":[169,83,89,114,249,76,173,37,243,101,141,37,122,223,231,139,214,152,238,175]},"announce":[],"urlList":[]}}