{"title":"Syphon Filter 2 [PC Game]","uid":9654420,"size":1884704768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a9898020463d8ef6e409b8b0d6c478c9a515973d&amp;dn=Syphon+Filter+2+%5BPC+Game%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Maks2012","files":-1,"time":1393113878,"description":"Syphon Filter 2 (2000/Ru/1.0/RePack by Ma2012ks) PC Game\n\n\nLanguage: only Russian\n\nVersion: 1.0.0.0\n\n\nDescription:\n\nThe protagonist agent Gabriel Logan with a detachment of special forces flying after the events in the laboratory Romer on the C- 130. Over the Rocky Mountains and the plane shot down terrorists after the jump with a parachute awaits them is not very warm welcome...\nSince aboard were secret materials obtained in the laboratory, the main goal - to find the crash site and pick them up. During this assignment Gabriel realizes that not everything is so simple and here involved not only the U.S. military, but also one of the top management of the Agency decided to develop biological weapons and share them with terrorists. Trusting his partner Lian, he comes into confrontation.\n\nFeatures:\n\n- After the first part of the game (Syphon Filter) was adopted by the players came out sequel, which develops the previous part of the story.\n\n- Syphon Filter 2 - a real encyclopedia of special agent. What do you just not have to deal with: spy, eliminate witnesses and wade through the woods alone.\n\n- Excellent graphics, thoughtful mission, a great variety in the gameplay.\n\n- Take in Russia and America, and restore justice - print villains to clean water.\n\n- Wide arsenal of all kinds of weapons: sniper rifles, M16, shockers, knife, grenades and even a crossbow.\n\n- There is an opportunity to play together against each other.\n\n\nInstallation:\n\n1. Mount the disk image in Daemon Tools or similar supporting mount a virtual drive disk image format iso. \n2. Install the game, following the instructions of the program-setup. \n3. Play! \n","torrent":{"xt":"urn:btih:a9898020463d8ef6e409b8b0d6c478c9a515973d","amp;dn":"Syphon+Filter+2+%5BPC+Game%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9898020463d8ef6e409b8b0d6c478c9a515973d","infoHashBuffer":{"type":"Buffer","data":[169,137,128,32,70,61,142,246,228,9,184,176,214,196,120,201,165,21,151,61]},"announce":[],"urlList":[]}}