{"title":"Garmin City Navigator Europe NT(Unicode) 2014.40 Unlocked","uid":9490370,"size":4276860439,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:a9ec5590450358b4dc540440bfeba1b3645e14ca&amp;dn=Garmin+City+Navigator+Europe+NT%28Unicode%29+2014.40+Unlocked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":-1,"time":1389985733,"description":"Garmin City Navigator Europe NT(Unicode) 2014.40 Unlocked\n\nNavigate the streets with confidence. This product provides detailed road maps and points of interest for your device, so you can navigate with exact, turn-by-turn directions to any address or intersection.\n\n- Includes more than 10.4 million km (6.5 million mi) of roads, including motorways, national and regional thoroughfares and local roads, in Western Europe and many countries in Eastern Europe.\n- Displays more than 6 million points of interest throughout the region, including restaurants, lodging, border crossings, attractions, petrol stations, campsites and shopping.\n- Gives turn-by-turn directions on compatible devices.\n- Enhances pronunciation for compatible devices that speak street names (example: &quot;Turn right on Main Street&quot;).\n- Includes navigational features, such as turn restrictions, roundabout guidance and speed categories.\n- Contains traffic data for compatible devices that use traffic receivers.\n\n\nHOW: \n\n1. copy gmapsupp.img to a Garmin golder on your SD-card\n\n2. if your Garmin supports 3D buildings, copy gmap3d.img to the Garmin folder on your SD-card\n\n\nWHAT IS UNICODE:\n\nUnicode: The &quot;U&quot; in NTU stands for Unicode. This type of mapping supports the display of characters that aren't in the Latin alphabet. This allows the device to display road names in the local language such as Russian, Cyrillic and Greek. Please note that this type of mapping is only used on devices which were preloaded with European maps. \n\nOnly the following devices support this feature: dezl series, nuvi 2200 series, nuvi 2300 series, nuvi 2400 series, nuvi 2405 series, nuvi 2407 series, nuvi 2408 series. nuvi 2505 series, nuvi 2507 series, nuvi 2508 series, nuvi 2707 series, nuvi 2708 series, nuvi 3400 series, nuvi 3500 series, nuvi 3507 series, nuvi 3508 series, nuvi 3700 series, RV 760   ","torrent":{"xt":"urn:btih:a9ec5590450358b4dc540440bfeba1b3645e14ca","amp;dn":"Garmin+City+Navigator+Europe+NT%28Unicode%29+2014.40+Unlocked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9ec5590450358b4dc540440bfeba1b3645e14ca","infoHashBuffer":{"type":"Buffer","data":[169,236,85,144,69,3,88,180,220,84,4,64,191,235,161,179,100,94,20,202]},"announce":[],"urlList":[]}}