{"title":"[Lady Fyre Femdom Clips4Sale] Lady Fyre","uid":13977357,"size":1200826417,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:aa25d06d8705ecc6e4b70944654dd86763ccd50e&amp;dn=%5BLady+Fyre+Femdom+Clips4Sale%5D+Lady+Fyre&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"distinc","files":2,"time":1458658843,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=607433818\r\n \nhttp://imagedisco.net/?g=7333422387\r\n\r\n\r\n\r\nDescription:\r\n\r\nYou come home from work to find your trophy wife in the bathroom fixing her make-up. Someone else is in the shower. &quot;That's my new lover,&quot; she explains. He steps out of the shower &amp; you can feel your cheeks burn with shame. He's build &amp; hung, and you know that he must be pleasing your wife more than you ever have. &quot;This is what I warned you would happen if you didn't start acting like a real man.&quot; And she's right, she did warn you, but you never thought it would actually happen.\r\n\r\nShe tells you they've just finished having sex &amp; are about to go out to dinner. But then they decide they're horny for one another again, and she touches his cock. He slips it inside her wet &amp; willing pussy, and they fuck in various positions right in front of you. At first you think you're still standing there because you're in shock, but then you realize that it must be something else holding you there. Your wife tells you to get on your knees and watch from below. And you do it! You actually get on your knees beneath her.\r\n\r\nThis is the strangest experience staring up at that huge alpha male cock pounding your wife. You feel so many emotions at once. But one thing is for sure, you aren't going anywhere. Your eyes are glued to them, and even as he cums you don't look away. You realize that this is probably just the first of many lovers your wife will take, all because you couldn't man up","torrent":{"xt":"urn:btih:aa25d06d8705ecc6e4b70944654dd86763ccd50e","amp;dn":"%5BLady+Fyre+Femdom+Clips4Sale%5D+Lady+Fyre","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa25d06d8705ecc6e4b70944654dd86763ccd50e","infoHashBuffer":{"type":"Buffer","data":[170,37,208,109,135,5,236,198,228,183,9,68,101,77,216,103,99,204,213,14]},"announce":[],"urlList":[]}}