{"title":"USBLyzer v2.0 Build 25 x86 x64-CrackMyDay","uid":7776766,"size":4049421,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aa506ba10b43b4d465da9127f66a345c0a90237d&amp;dn=USBLyzer+v2.0+Build+25+x86+x64-CrackMyDay&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"alexandre_go","files":3,"time":1351675799,"description":"***** CrackMyDay brings you USBlyzer 2.0 Build 25 x86 &amp; x64 versions *****\n \nUSBlyzer is a featured software-based USB analysis tool that enables you to view USB device descriptors, capture and analyze USB devices activity in real time, save captured data for later protocol analysis. USBlyzer not only shows you a raw hex dump of the data that was sent to or received from a USB device. USBlyzer looks at that data and decodes it into human readable form. This feature greatly speeds up usb analysis efforts. Simple to use, this USB analysis software is the ideal companion for anyone who is developing USB device drivers and software.\n\nExplore USB Tree, Capture USB Drivers Activity, Analyze USB Devices Traffic\n\nThe following are the key USB analysis features of USBlyzer:\n\n    Completely customizable interface with docked windows and user-defined screen sets.\n\n\n    Exploring USB Device Tree\n\n    The USB device tree explorer visualizes USB tree topology. You can browse and explore all connected USB devices (including host controllers and hubs) and view the additional information about them.\n\n    Display all plugged USB devices in a hierarchical auto-refreshed tree-view.\n\n    View and explore the USB Devices and their components.\n\n    View detailed USB-related information about each USB device: Device Descriptor, Configuration, Interfaces, Endpoints, etc.\n\n    Verify the general compliance of all standard USB descriptors with the USB Specification.\n        Click to see all supported USB descriptors \n\n    View detailed PnP-related information about each USB device: Hardware IDs, Instance ID, Software Key, PDO Name, etc.\n\n\n    Capturing IRPs, URBs and IOCTLs\n\n    The real-time capture feature allows you to intercept the IRPs, URBs, IOCTLs and data transferred through any USB device stack.\n\n    Real-Time monitoring at any level in the USB driver stack from USB Host Controller to target USB Device.\n\n    Capture several USB devices simultaneously.\n\n    Separate log records for request issue and completion.\n\n    Capture almost all types of USB Request Block (URB).\n        Click to see all supported URB function's values \n\n    Capture almost all types of USB-related kernel-mode device I/O control requests.\n        Click to see all supported kernel-mode device I/O control code's values \n\n    Capture almost all types of user-mode device I/O control requests to USB Host Controller and USB Hub.\n        Click to see all supported user-mode device I/O control code's values \n\n    Capture all PnP IRPs.\n\n    Automatically capture hot plugged devices. Can be used to monitor device enumeration process.\n\n\n    USB Device Activity Analysis\n\n    Analyze USB devices I/O activity with ease.\n\n    Provide comprehensive USB protocol analysis.\n\n    Display detailed analysis of all USB standard requests such as Set Feature, Get Descriptor etc.\n\n    Includes comprehensive Communications Device Class (CDC), HID Class and Hub Class decoders.\n\n    Display detailed information about IRP, IO_STACK_LOCATION and URB structures associated with each captured request.\n\n    Display the buffer contents, if any, associated with the request in hex format.\n\n    Configurable filtering to exclude non-essential information from the view.\n\n    Search feature to search the capture file for the particular request types.\n\n\n    Saving and Exporting USB Data\n\n    The save and export features are extended functionality of the USB analysis software allowing analyzed data to be saved for later analysis or exported in several formats. The export functionality can be used in conjunction with the filter for maximum versatility.\n\n    Save captured data in binary file for later USB protocol analysis.\n\n    Export Capture List content or any part of it to plain text, CSV, XML or HTML formats.\n\n    Export USB Descriptor hierarchy of any USB Device to HTML formats.\n\n\nAdd USBlyzer to your USB analysis tools arsenal!","torrent":{"xt":"urn:btih:aa506ba10b43b4d465da9127f66a345c0a90237d","amp;dn":"USBLyzer+v2.0+Build+25+x86+x64-CrackMyDay","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa506ba10b43b4d465da9127f66a345c0a90237d","infoHashBuffer":{"type":"Buffer","data":[170,80,107,161,11,67,180,212,101,218,145,39,246,106,52,92,10,144,35,125]},"announce":[],"urlList":[]}}