{"title":"Esteban Sapir - La Antena (2007)","uid":6492272,"size":1381892694,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa603f0949d135da5d11de60ebacd9b53cee5140&amp;dn=Esteban+Sapir+-+La+Antena+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"mfccorrea","files":6,"time":1308930536,"description":"A completely unique take on silent cinema in this fairy-tale like story by Esteban Sapir, beautifully shot in black-and-white and practically without dialog, &quot;La Antena&quot; is a feast for the eye and a must for lovers of German expressionist cinema, with most of the nods to the works of Fritz Lang and Friedrich Murnau.\n\n'The City without a Voice', 'La Ciudad sin Voz', is ruled by Mr. TV. He has taken the inhabitants voices and is in total control of all spoken words and images, forcing everyone to eat his own brand of TV-food. Mr TV is not just a monopolist, he is the personification of evil and totalitarianism, even the swastika appears as a symbol a number of times. He secretly works on a hypnotizing device to control all the citizens minds through his television broadcasts. For this purpose, he kidnaps the only one left with The Voice, a beautiful singer, but a TV repairman witnesses the kidnapping and flees to an old TV antenna in the mountains in order to halt Mr. TV's evil plans.\n\nThe production design is stunning with beautiful sets and imagery. Although shot primarily with the basic language of silent cinema, Esteban Sapir also adds a number of fresh techniques of his own, like a combination of typographic and animation techniques. Everyone talks with each other through text balloons (usually floating near their mouths), the louder they talk, the larger the characters. The texts themselves can be pushed away or crushed. In the opening sequence, we see a book, titled &quot;La Antena&quot;, that opens and a city of paper rises from the pages. There are hardly any references to Argentina. It's constantly snowing, which gives the film a very un-Argeninian feel, while the surreal setting suggests any large city in the Northen hemisphere, with only some of the songs revealing the film's Argentinian background.\n\nThe pace is swift and there is so much happening on screen, it's hard to keep track of the film's surreal narrative. Not only breathtakingly beautiful to look at, we're also given a few messages about media monopolies, corruption and totalitarianism, but they are breezily packaged. One of the most original films I've seen in years. A delight. (From IMDB)\n\nFile Name .........................................: La Antena.avi\nFile Size (in bytes) ............................: 1,381,797,888 bytes\nRuntime ............................................: 1:35:14\n\nVideo Codec ...................................: XviD ISO MPEG-4\nFrame Size ......................................: 624x288 (AR: 2.167)\nFPS .................................................: 25.000\nVideo Bitrate ...................................: 1733 kb/s\nBits per Pixel ...................................: 0.386 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 48000 Hz\nAudio Bitrate ...................................: 192 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0454065/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0454065/&lt;/a&gt;\n\nMostly silent with Spanish intertitles; English, German, Italian and Portuguese subtitles\n\nMy rip\n\nEsteban Sapir - La Antena (2007)","torrent":{"xt":"urn:btih:aa603f0949d135da5d11de60ebacd9b53cee5140","amp;dn":"Esteban+Sapir+-+La+Antena+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa603f0949d135da5d11de60ebacd9b53cee5140","infoHashBuffer":{"type":"Buffer","data":[170,96,63,9,73,209,53,218,93,17,222,96,235,172,217,181,60,238,81,64]},"announce":[],"urlList":[]}}