{"title":"Dark Lotus Discography ( Including Brand New Album)","uid":4127771,"size":367024862,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aac33ed046dc5b9de724138ae9f67fd340185424&amp;dn=Dark+Lotus+Discography+%28+Including+Brand+New+Album%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"twiztiddad","files":61,"time":1207874629,"description":"Description:\n\nTrack listing\n\n  1. &quot;Intro&quot;\n  2. &quot;Ali-Ba-Ba&quot;\n  3. &quot;Something&quot;\n  4. &quot;I Hurt Myself&quot;\n  5. &quot;Call upon Your Gods&quot;\n  6. &quot;And We Danced&quot;\n  7. &quot;cigaM kcalB&quot;\n  8. &quot;Gimme Dat Blood&quot;\n  9. &quot;Headache&quot;\n 10. &quot;Bad Rep&quot;\n 11. &quot;Bitch I&amp;#039;m Sexy&quot;\n 12. &quot;Swarm&quot;\n 13. &quot;I Wanna Die&quot;\n 14. &quot;Black Crows&quot;\n 15. &quot;Juggalo Family&quot;\n 16. &quot;Dot Com&quot;\nTales From The Lotus Pod Revisited or Tales From The Lotus Pod Revised, as it is sometimes called, was released at the 2002 Gathering of the Juggalos on Psychopathic Records. After the dispute between Marz and the rest of the Dark Lotus members, a 2nd Tales from the Lotus Pod was created with Anybody Killa in place of Marz. The album is considered by some to be not as good with &quot;ABK&quot; instead of Marz. Today there is still a split within the juggalo community as to which version is better. Also Violent J says that he no longer listens to the original version and at most shows the ABK version is played in the background\n\nBlack Rain is a Dark Lotus album released in 2004. The members of Dark Lotus who were featured on this album were Violent J, Shaggy 2 Dope, Jamie Madrox, Monoxide Child, Blaze Ya Dead Homie and Anybody Killa. The album was produced by several people.\n\nAs of summer 2006, Jamie Madrox has claimed this is the last Dark Lotus album that will ever be recorded, although Violent J said in a recent interview that there will be more albums from side-projects such as Dark Lotus and Psychopathic Rydas.\nTrack listing\n\n  1. Under the Lotus 2:22\n  2. Black Rain 3:33\n  3. Ka-Boom! 3:44\n  4. That&amp;#039;s Me 3:14\n  5. Consume Your Soul 3:46\n  6. She Was 4:25\n  7. Corrosion 3:24\n  8. My First Time 3:50\n  9. With the Lotus 3:01\n 10. Hell-House 3:39\n 11. Jump Off 4:14\n 12. The Walls 4:31\n 13. Doornail Dorothy 3:36\n 14. Pass the Axe 3:12\n 15. Death Don&amp;#039;t Want You 5:33\n\nThe Opaque Brotherhood is the title of the upcoming Dark Lotus album. The Dark Lotus members will consist of Violent J, Shaggy 2 Dope, Jamie Madrox, Monoxide Child and Blaze Ya Dead Homie.\n\nThis album will mark the official return of Dark Lotus after Jamie Madrox stated in 2006 that their previous album &quot;Black Rain&quot; would be their last. It was confirmed by Violent J in an interview that there will be another Dark Lotus album released on April 15, 2008, as well as an advertisement in the liner-notes of the latest Psychopathic Records compilation album Psychopathics from Outer Space 3, that 2008 will be &quot;the year of the Lotus&quot;, obviously lending hint of a 2008 release. On April 4, 2008, The Opaque Brotherhood came up for pre-sale on Psychopathic Record&amp;#039;s web store, Hatchet Gear for the price of $8.00.\n\nOn April 9,2008 the album was leaked over the internet by &quot;pigofdoom&quot; a regular on juggalonews.com.\n\nThe album cover is an image of the Terracotta Army, literally &quot;soldier and horse funerary statues.&quot; They are the Terracotta Warriors and Horses of Qin Shi Huang the First Emperor of China, dating from 210 BCE. The figures include warriors, chariots, horses, officials, acrobats, strongmen, and musicians. Their purpose was to help rule another empire with Shi Huangdi in the afterlife.\nTrack listing\n\n1. Intro\n2. In Bloom\n3. Follow The Leader\n4. Black Sand\n5. Can You Keep A Secret\n6. Heinous\n7. Backwords\n8. Keep Up\n9. Witch Trapped In This Song\n10. Opaque Brotherhood\n11. Hot Poison\n12. Falling\n13. Trapped Inside\n14. Withered","torrent":{"xt":"urn:btih:aac33ed046dc5b9de724138ae9f67fd340185424","amp;dn":"Dark+Lotus+Discography+%28+Including+Brand+New+Album%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aac33ed046dc5b9de724138ae9f67fd340185424","infoHashBuffer":{"type":"Buffer","data":[170,195,62,208,70,220,91,157,231,36,19,138,233,246,127,211,64,24,84,36]},"announce":[],"urlList":[]}}