{"title":"Stone Temple Pilots - Core 320cbr (Big Papi) 1992","uid":9293472,"size":129340359,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:aae2f235ec67c7e949daa2cc042955e63631cd1c&amp;dn=Stone+Temple+Pilots+-+Core+320cbr+%28Big+Papi%29+1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":7,"uploader":"Big-Papi","files":16,"time":1386125484,"description":"Source:  1992 CD\n \nBy Daniel Maltzman\nIn 1992/93, probably most people would not have expected Stone Temple Pilots to be one of the best bands of the decade. People were really split on STP back in the day. To be sure, they were one of the most popular bands of the decade right off the bat. Over half of the songs on their debut album &quot;Core&quot; were very popular radio staples back in the early 90s and remain popular to this day. Fans bought &quot;Core&quot; in droves upon its release, and it has gone on to sell eight million copies.\n\nMost likely because of the band's almost instant success, they received an enormous amount of condemnation. They were accused of jumping on the grunge bandwagon. The most common complaint thrown at STP was that they were Pearl Jam rip-offs. A few years later, if you were to listen to Pearl Jam's &quot;No Code&quot; and then listen to STP's &quot;Tiny Music,&quot; it would be hard to imagine thinking that STP was a knockoff of PJ. But in the early 90s, however, before STP really got into their own groove with subsequent albums, the comparison and complaints remained.\n\nI think that one of the main differences between these two bands is that Pearl Jam is a college/undergound band at heart, and Stone Temple Pilots was an arena rock band at heart. The fact that STP never lost the knack for writing great hooks throughout their five releases, and that Pearl Jam's music became increasingly less commercial, more arty, confirm that for me (not to say that one band is superior to the other, as they were/are both great in their own right).\n\nIn all honesty, &quot;Core&quot; is not the most groundbreaking influential album of all-time. Stone Temple Pilots were a very talented and eclectic band, and they did have their own sound. In the beginning, however, they did borrow from some of their peers, like Pearl Jam and Nirvana. On the surface, there are some similarities between &quot;Core&quot; era STP, and &quot;Ten&quot; era Pearl Jam. &quot;Plush&quot; is probably the best example. If you listened to &quot;Plush&quot; on the radio, with its grungy guitars and baritone vocals, you might have concluded that this was Pearl Jam you were listening to. &quot;Core&quot; actually sound like a mix of Nirvana, Pearl Jam, and Soundgarden. These songs from &quot;Core&quot;, however, sound like they were meant as anthems and for the arena and massive radio/MTV play. You get the sense by listing to &quot;Core&quot; that it was destined and tailored to be huge, probably one of the reasons it was so unfairly bashed in the first place.\n\nOriginal or not, &quot;Core&quot; remains one of the finest rock albums of the early 90s. Even if they did borrow from the Seattle songbook, these songs remain classics from that era. These songs are so timeless because they all have killer groves, monster solos, and infectious hooks. The radio staples &quot;Dead and Bloated,&quot; &quot;Sex Type Thing,&quot; &quot;Wicked Garden,&quot; &quot;Creep,&quot; &quot;Plush,&quot; and &quot;Crackerman&quot; have all stood the test of time and have weathered as well as anything from &quot;Ten.&quot; The non-radio staples are also mostly quite memorable, so &quot;Core&quot; contains very little filler. &quot;Core&quot; sounds as fresh today as it did back in the early 90s.\n\nI would go as far as to say that Stone Temple Pilots were the Led Zeppelin of the 1990s. The band, Scott Weiland (vocals), Dean DeLeo (Guitars) Robert DeLeo (bass) and Eric Kertz (drums) were an incredible band and they reinvented themselves with each new album, always churning out new music that sounded fresh and had new ideas, never stagnating or losing momentum. &quot;Core,&quot; was an excellent foundation on to which a great band was built. And while the band's debut &quot;Core&quot; took the cue from some of it's peers, it's still a classic album and is a cornerstone to any good 90s rock collection.","torrent":{"xt":"urn:btih:aae2f235ec67c7e949daa2cc042955e63631cd1c","amp;dn":"Stone+Temple+Pilots+-+Core+320cbr+%28Big+Papi%29+1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae2f235ec67c7e949daa2cc042955e63631cd1c","infoHashBuffer":{"type":"Buffer","data":[170,226,242,53,236,103,199,233,73,218,162,204,4,41,85,230,54,49,205,28]},"announce":[],"urlList":[]}}