{"title":"The Aesthetics of Shadow: Lighting and Japanese Cinema","uid":9731457,"size":4578743,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab43b1b6bf195024a912b1994651a07b13a8fcee&amp;dn=The+Aesthetics+of+Shadow%3A+Lighting+and+Japanese+Cinema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"PirateBook","files":1,"time":1394390512,"description":"\nBy Daisuke Miyao \n\nIn this revealing study, Daisuke Miyao explores &quot;the aesthetics of shadow&quot; in Japanese cinema in the first half of the twentieth century. This term, coined by the production designer Yoshino Nobutaka, refers to the perception that shadows add depth and mystery. Miyao analyzes how this notion became naturalized as the representation of beauty in Japanese films, situating Japanese cinema within transnational film history. \n\nHe examines the significant roles lighting played in distinguishing the styles of Japanese film from American and European film and the ways that lighting facilitated the formulation of a coherent new Japanese cultural tradition. Miyao discusses the influence of Hollywood and German cinema alongside Japanese Kabuki theater lighting traditions and the emergence of neon commercial lighting during this period. \n\nHe argues that lighting technology in cinema had been structured by the conflicts of modernity in Japan, including capitalist transitions in the film industry, the articulation of Japanese cultural and national identity, and increased subjectivity for individuals. By focusing on the understudied element of film lighting and treating cinematographers and lighting designers as essential collaborators in moviemaking, Miyao offers a rereading of Japanese film history.\n\nGenre: Non Fiction , Photo / Cinema","torrent":{"xt":"urn:btih:ab43b1b6bf195024a912b1994651a07b13a8fcee","amp;dn":"The+Aesthetics+of+Shadow%3A+Lighting+and+Japanese+Cinema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab43b1b6bf195024a912b1994651a07b13a8fcee","infoHashBuffer":{"type":"Buffer","data":[171,67,177,182,191,25,80,36,169,18,177,153,70,81,160,123,19,168,252,238]},"announce":[],"urlList":[]}}