{"title":"Innocent Man (Korean Drama 2012) [JseitchenC]","uid":13835900,"size":4209030524,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:abe711ad86773f0eb184a5b083788ff8eb6b354e&amp;dn=Innocent+Man+%28Korean+Drama+2012%29+%5BJseitchenC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"xueshen","files":42,"time":1457755965,"description":"The Innocent Man or Nice Guy\r\n\r\nProfile\r\nDrama: The Innocent Man (English title) / The Nice Guy Never Seen Anywhere In The World (literal title)\r\nRevised romanization: Sesang Eodiedo Eobneun Chakhan Namja\r\nHangul: ì„¸ìƒ ì–´ë””ì—ë„ ì—†ëŠ” ì°©í•œë‚¨ìž\r\nDirector: Kim Jin-Won\r\nWriter: Lee Kyoung-Hee\r\nNetwork: KBS2\r\nEpisodes: 20\r\nRelease Date: September 12 - November 15, 2012\r\nRuntime: Wed. &amp; Thu. 21:55\r\nGenre: Melodrama\r\nLanguage: Korean\r\nCountry: South Korea\r\n\r\nPlot\r\nA man is betrayed by the woman he loves. To exact revenge, the man uses another woman who lost her memory ....\r\n\r\n.....\r\n\r\nMa-Roo (Song Joong-Ki) is a promising medical student. He lives with his younger sister Cho-Ko (Lee Yoo-Bi), who suffers from poor health. Meanwhile, Jae-Hee (Park Si-Yeon) is a reporter at HBS broadcasting company. Both Ma-Roo and Jae-Hee come from poor family backgrounds, but try hard to achieve their dreams: Ma-Roo to become a doctor and Jae-Hee to become an anchorwoman.\r\n\r\nOne day, Ma-Roo goes home and finds his sister feverishly sick. While he puts socks on his ill sister, Ma-Roo receives a phone call from Jae-Hee. Jae-Hee sounds completely frantic and asks Ma-Roo to come over to save this man. Even though Ma-Roo's sick sister begs him to not leave her, Ma-Roo rushes over to help Jae-Hee. When he arrives at the motel room, he finds Jae-Hee completely shaken and a dead man laying on the floor near her. Ma-Roo attempts to counsel Jae-Hee to turn herself in to the police. Appearing completely broken in spirit, Jae-Hee begins to call the police, but Ma-Roo hangs up the phone. He kisses Jae-Hee and then goes through the motel room to wipe away Jae-Hee's fingerprints. Ma-Roo then tells Jae-Hee that he will take the blame and turn himself into the police.\r\n\r\nMeanwhile, Eun-Gi (Moon Chae-Won) is the rich heiress a to family that owns the large corporation Taesan. She has been groomed to become the successor to the Taesan corporation and, consequently, shows very little emotions. When she pulls her car over in front of her home, Eun-Gi sees a woman hug her father. The woman hugging her father is Jae-Hee. In tears, Jae-Hee tells Eun-Gi &quot;You have no idea what I did to protect you. What I just did to the man I care the most for in my life.&quot;\r\n\r\n6 years later, after serving a 5 year prison sentence, Ma-Roo travels to Aomori, Japan to retrieve money from a woman who swindled his friend Jae-Gil (Lee Kwang-Soo). Ma-Roo seduces the woman and retrieves the money stolen from his friend. At the same time, Eun-Gi and her now stepmother Jae-Hee are also in Aomori, Japan. Eun-Gi looks down upon her stepmother as nothing but a gold digger.\r\n\r\nOn the flight back to Korea, Ma-Roo waits to use the restroom. When the restroom door opens, Eun-Gi walks out and collapses onto Ma-Roo. Ma-Roo places Eun-Gi on the floor and walks back to his seat. Eun-Gi's condition quickly worsens and the airplane asks if there is a doctor on the flight. Since nobody comes forward, Ma-Roo is compelled to help Eun-Gi. While administering aid to Eun-Gi, he asks for the woman's guardian. At this time, Jae-Hee walks over to the scene and states that she is her mother. Jae-Hee also has a child next to her that is calling her mom.\r\n\r\nNotes\r\nEarly Korean working title was &quot;Chakan Namja&quot; (literally &quot;Nice Guy&quot;) then changed to &quot;Sesang Eodiedo Eobneun Chakan Namja&quot; (literally &quot;The Nice Guy Never Seen Anywhere In The World&quot;).\r\nTakes over the KBS2 Wed. &amp; Thu. 21:55 time slot previously occupied by &quot;Bridal Mask&quot; and will be followed by &quot;Jeon Woo-Chi&quot; on November 21, 2012.\r\nFirst script reading took place in late June, 2012 at KBS Annex Broadcasting Station in Yeouido, South Korea.\r\n\r\nCast\r\n\r\nSong Joong-Ki\tMoon Chae-Won\tPark Si-Yeon","torrent":{"xt":"urn:btih:abe711ad86773f0eb184a5b083788ff8eb6b354e","amp;dn":"Innocent+Man+%28Korean+Drama+2012%29+%5BJseitchenC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abe711ad86773f0eb184a5b083788ff8eb6b354e","infoHashBuffer":{"type":"Buffer","data":[171,231,17,173,134,119,63,14,177,132,165,176,131,120,143,248,235,107,53,78]},"announce":[],"urlList":[]}}