{"title":"Wind Turbine Technology: Fundamental Concepts in Wind Turbine En","uid":6509312,"size":54033158,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abfea655476ac68b01d58328e86503c8984952d3&amp;dn=Wind+Turbine+Technology%3A+Fundamental+Concepts+in+Wind+Turbine+En&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1309558420,"description":"Wind Turbine Technology: Fundamental Concepts in Wind Turbine Engineering, Second Edition by David A. Spera \n\nProduct Description\nA must-have for the wind-power professional! WIND TURBINE TECHNOLOGY is recognized worldwide as the authoritative guide to state-of-the-art wind turbine engineering. If you are an energy planner, engineer, designer, utility project manager, wind power station developer, manufacturer of wind turbine equipment, teacher, or student, WIND TURBINE TECHNOLOGY has all the latest information for you. This text and reference book is ideal for educational settings. Packed with application-oriented advice, detailed graphics, photographs, and numerical examples this revised and expanded 820-page new edition describes past and present wind turbines and provides the reader with detailed mathematical models developed by leaders in the fields of aerodynamics, structural dynamics and fatigue, meteorology, acoustic and electromagnetic emissions, commercial wind power applications, and utility power systems. Economics, costs, the integration of wind power plants into utility systems, and color photographs of current commercial wind turbines are included.\nProduct Details\nHardcover: 832 pages\nPublisher: ASME Press (American Society of Mechanical Engineers); 2nd Revised edition (June 30, 2009)\nLanguage: English\nISBN-10: 0791802604\nISBN-13: 978-0791802601","torrent":{"xt":"urn:btih:abfea655476ac68b01d58328e86503c8984952d3","amp;dn":"Wind+Turbine+Technology%3A+Fundamental+Concepts+in+Wind+Turbine+En","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abfea655476ac68b01d58328e86503c8984952d3","infoHashBuffer":{"type":"Buffer","data":[171,254,166,85,71,106,198,139,1,213,131,40,232,101,3,200,152,73,82,211]},"announce":[],"urlList":[]}}