{"title":"Sylvester The Cat and Tweety Bird Pack (1942-2004)","uid":7877734,"size":6007294333,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac020f57b7a55eeb044d60ef900f7cbfc1bc58c7&amp;dn=Sylvester+The+Cat+and+Tweety+Bird+Pack+%281942-2004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":6,"uploader":"420jamas","files":112,"time":1354391777,"description":"Sylvester J. Pussycat, Sr., Sylvester the Cat or simply Sylvester, or Puddy Tat, is a\nfictional character, a three-time Academy Award-winning anthropomorphic Tuxedo cat in\nthe Looney Tunes and Merrie Melodies repertory, often chasing Tweety Bird,\nSpeedy Gonzales, or Hippety Hopper. The name 'Sylvester' is a play on Felis silvestris,\nthe scientific name for the wild cat species (domestic cats like Sylvester, though,\nare actually Felis catus). The character debuted in Friz Freleng's Life With Feathers\n(1945). Freleng's 1947 cartoon Tweetie Pie was the first pairing of Tweety with Sylvester,\nand the Bob Clampett-directed Kitty Kornered (1946) was Sylvester's first pairing with\nPorky Pig. Sylvester appeared in 103 cartoons in the golden age.\nSylvester was #33 on TV Guide's list of top 50 best cartoon characters, together\nwith Tweety.\n\n\nTweety Bird (also known as Tweety Pie or simply Tweety) is a fictional Yellow Canary\nin the Warner Bros. Looney Tunes and Merrie Melodies series of animated cartoons.\nThe name 'Tweety' is a play on words, as it originally meant 'sweetie', along with\n&quot;tweet&quot; being a typical English onomatopoeia for the sounds of birds.\nHis characteristics are based on Red Skelton famous 'Mean Widdle Kid'.\nTweety appeared in 49 cartoons in the Golden Age.\nDespite the perceptions that people may hold, owing to the long lashes and high\npitched voice of Tweety, Tweety is male. This was established several times in\nthe series 'Sylvester and Tweety Mysteries'. It was also confirmed toward the end\nof Snow Business when Granny exclaimed to Tweety and Sylvester, 'Here I am, boys!'\nOn the other hand, a 1951 episode was entitled 'Ain't She Tweet'. Also, his species\nis ambiguous; although originally and often portrayed as a young canary, he is also\nfrequently called a rare and valuable 'tweety bird' as a plot device, and once called\n'the only living specimen'. Nevertheless, the title song directly states that the\nbird is a canary. His shape more closely suggests that of a baby bird, which in\nfact is what he was during his early appearances (although the 'baby bird' aspect\nhas been used in a few later cartoons as a plot device). The yellow feathers were\nadded but otherwise he retained the baby-bird shape.\n\n\nPLEASE SEED WHEN DONE DOWNLOADING!!!!\n\nMORE TO COME!!!","torrent":{"xt":"urn:btih:ac020f57b7a55eeb044d60ef900f7cbfc1bc58c7","amp;dn":"Sylvester+The+Cat+and+Tweety+Bird+Pack+%281942-2004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac020f57b7a55eeb044d60ef900f7cbfc1bc58c7","infoHashBuffer":{"type":"Buffer","data":[172,2,15,87,183,165,94,235,4,77,96,239,144,15,124,191,193,188,88,199]},"announce":[],"urlList":[]}}