{"title":"Diamond Rio - Greatest Hits Vol 2 [FLAC+MP3](MP3) Country Music","uid":9520572,"size":455923332,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:acd20cd2ffd62ed56f77750ffbedcb6cde3aa6af&amp;dn=Diamond+Rio+-+Greatest+Hits+Vol+2+%5BFLAC%2BMP3%5D%28MP3%29+Country+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1390622568,"description":"Source: CD\n\n\n\nBy DanD VINE VOICE\nDiamond Rio is comprised of six of the most talented musicians working Nashville today (or all time, if you ask me). Jimmy Olander, Dan Truman, Dana Williams, Marty Roe, Brian Prout, and Gene Johnson are all the best at what they do--and their talent comes through in their music, even when the songs themselves lag behind. That is why I can honestly say that Diamond Rio is my favorite country band; from the time I was nine years old, watching their videos on TNN (remember those days?), they have taught me what true musical talent was.\n\nTheir second greatest hits album can teach YOU a thing or two, if you care to give it a listen. Such hits as &quot;Beautiful Mess,&quot; &quot;I Believe,&quot; &quot;One More Day,&quot; and &quot;Unbelievable&quot; helped the band redefine themselves (not that they really needed to). The new tracks continue their musical growth; &quot;God Only Cries&quot; is a touching religious-themed country number; &quot;Over You&quot; is a powerful ballad highlighted by Roe's vocal performance; &quot;Redneck Love Gone Bad&quot; is again lit up by Roe's deadpan delivery of a redneck couple (the tune was penned by country/bluegrass artist Shannon Lawson); &quot;In God We Still Trust&quot; is a bit too political for my tastes, and is on a topic beaten to death by now, but the band's performance carries it above the half-hearted songwriting that went into it.\n\nThe other songs on GREATEST HITS II you may--or may not--know. You've of course heart &quot;Unbelievable,&quot; &quot;You're Gone,&quot; &quot;One More Day,&quot; and others; you might not have heard &quot;Sweet Summer&quot; or &quot;That's What I Get For Loving You&quot; (this latter song was overlooked on their previous greatest hits package), two moderately successful--but still incredibly well-performed--hits. The inclusion of their first hit single (and probably definitive song) &quot;Meet in the Middle&quot; is a bit awkward, especially because their modest-hit &quot;Stuff&quot; isn't present (I'm probably overlooking another song or two as well, sorry 'bout that). However, &quot;Middle&quot; is as much a staple of country radio today as it was back in '91, so we can forgive them for putting it on here.\n\nDiamond Rio's GREATEST HITS II has been long-awaited (they have the nasty habit of going too long between albums), but it was well worth that wait. These six musicians are the most talented out their today; I have been a fan the majority of my life (I'm only twenty, so you can forgive me my youth), and will be a fan long after the band no longer exists. Members of the Grand Old Opry, as well as the number one residents atop my Greatest Bands list, Diamond Rio is still chugging along, turning out songs that are just as good--if not better--than when they started. Check 'em out, if you haven't already; be prepared to become a life-long fan. Again, if you aren't already.\n\n\n---------------------------------------------------------------------\nGreatest Hits, Vol. 2\n---------------------------------------------------------------------\n\nSource...............: CD\nYear.................: 2006 05 09\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.2.1 20070917\nQuality..............: Lossless, (avg. compression: 69 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\n---------------------------------------------------------------------\nTracklisting\n---------------------------------------------------------------------\n\n1. Diamond Rio - God Only Cries [03:56]\n2. Diamond Rio - Beautiful Mess [03:48]\n3. Diamond Rio - One More Day [03:35]\n4. Diamond Rio - Sweet Summer [04:29]\n5. Diamond Rio - Redneck Love Gone Bad [03:46]\n6. Diamond Rio - Over You [03:41]\n7. Diamond Rio - Unbelievable [02:21]\n8. Diamond Rio - You're Gone [03:59]\n9. Diamond Rio - That's What I Get For Loving You [03:17]\n10. Diamond Rio - Wrinkles [03:08]\n11. Diamond Rio - I Believe [03:57]\n12. Diamond Rio - Meet In the Middle [03:20]\n13. Diamond Rio - In God We Still Trust [03:36]","torrent":{"xt":"urn:btih:acd20cd2ffd62ed56f77750ffbedcb6cde3aa6af","amp;dn":"Diamond+Rio+-+Greatest+Hits+Vol+2+%5BFLAC%2BMP3%5D%28MP3%29+Country+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acd20cd2ffd62ed56f77750ffbedcb6cde3aa6af","infoHashBuffer":{"type":"Buffer","data":[172,210,12,210,255,214,46,213,111,119,117,15,251,237,203,108,222,58,166,175]},"announce":[],"urlList":[]}}