{"title":"Ransom - Julie Garwood.epub","uid":9141113,"size":400537,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad1729b10fe3c798cd1a457ce3b79b2f7b60ee5d&amp;dn=Ransom+-+Julie+Garwood.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"420weedman","files":1,"time":1383514357,"description":" Overflowing with all of the majesty and intrigue of medieval glory days, this magnificent New York Times bestseller is a page-turner of passion and loyalty, justice and honor. Beloved storyteller Julie Garwood steps back to the silver-shrouded Highlands of her classic tale The Secret--and hails the return of two unforgettable warriors: Ramsey Sinclair and Brodick Buchanan. In the dark days after the death of Richard the Lionhearted, lives and lands would fall into upheaval at the hands of a power-hungry British ruler and his violent minions. One victim of the scourge is innocent Gillian, who is a mere child when the cruel and ambitious Baron Alford slaughters her father and tears her family apart. Alford, determined to recover a jeweled box for the despotic King John, is furious when the precious treasure slips through his fingers--only to be lost for more than a decade.\nNow a beautiful young woman, Gillian finds the key to resolving her past in handsome Scottish chieftains Ramsey Sinclair and Brodick Buchanan. With the cunning and courage of the daring Scotsmen, and with the friendship of a new ally, Bridgid KirkConnell, Gillian at last fights the unscrupulous Baron Alford, laying claim to her home, her family, and her father's reputation. But in the presence of the mighty warriors, Gillian and Bridgid discover that desire can be a weapon of conquest...betrayal can slay trust in a heartbeat...and the greatest risk of all is surrender--to the deep emotions of unexpected love.\nGenre: Humor Historical Romance","torrent":{"xt":"urn:btih:ad1729b10fe3c798cd1a457ce3b79b2f7b60ee5d","amp;dn":"Ransom+-+Julie+Garwood.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad1729b10fe3c798cd1a457ce3b79b2f7b60ee5d","infoHashBuffer":{"type":"Buffer","data":[173,23,41,177,15,227,199,152,205,26,69,124,227,183,155,47,123,96,238,93]},"announce":[],"urlList":[]}}