{"title":"Oxford Case Histories in Oncology [Epub] [StormRG]","uid":10293786,"size":2164306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae58e1ce7b26c217aacd9c443cc464eca0c07ca6&amp;dn=Oxford+Case+Histories+in+Oncology+%5BEpub%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"0xmovva","files":-1,"time":1401895069,"description":"Author: Thankamma Ajithkumar, Adrian Harnett, Tom Roques\nSeries: Oxford Case Histories\nPaperback: 298 pages\nPublisher: Oxford University Press; 1 edition (April 27, 2014)\nLanguage: English\nISBN-10: 0199664536\nISBN-13: 978-0199664535\nFormat: Retail Epub\nReader Required: Adobe Digital Editions, Calibre, MoonReader for Android\n\nNOTE: no PDF available, if you want it to scroll like a PDF just read it in Calibre.\nThis is the eBook of the printed book and may not include any media, website accesscodes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nOxford Case Histories in Oncology contains 30 well-structured cases from clinical practice, giving a comprehensive coverage of the diagnostic and management dilemmas in oncology. The cases cover a wide spectrum of oncology including rare presentations and clinical problems of common cancers. \n\nEach case comprises a brief clinical history with relevant clinical examination findings. Questions are based on clinical investigations and aspects of management. Detailed answers are based on the best available evidence from the latest research, systematic reviews, meta-analysis and guidelines from national and international academic bodies. The text is complimented by over 50 illustrations, including radiographic images and radiotherapy treatment plans. The format of this book is thought provoking, and it helps to improve critical thinking and interpretative skills. \n\nIt is a perfect self-assessment tool for oncology and palliative medicine trainees and consultants, and will be useful for those preparing for exit examinations in oncology. It will also be of interest to non-specialist readers who wish to improve their skills in the diagnosis and management of a broad range of cancers.\n","torrent":{"xt":"urn:btih:ae58e1ce7b26c217aacd9c443cc464eca0c07ca6","amp;dn":"Oxford+Case+Histories+in+Oncology+%5BEpub%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae58e1ce7b26c217aacd9c443cc464eca0c07ca6","infoHashBuffer":{"type":"Buffer","data":[174,88,225,206,123,38,194,23,170,205,156,68,60,196,100,236,160,192,124,166]},"announce":[],"urlList":[]}}