{"title":"Portraiture - Oxford History of Art (Art Ebook).pdf","uid":9410485,"size":20315317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae66e90deef1d81519962657f265eca04535bdd3&amp;dn=Portraiture+-+Oxford+History+of+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1388274952,"description":"Portraiture (Oxford History of Art) by Shearer West\nPublisher: Oxford University Press, USA | Number Of Pages: 256 | Publication Date: 2004-05-06 | ISBN-10: 0192842587 | PDF | 19 Mb\n\nThis fascinating new addition to the acclaimed Oxford History of Art series explores the world of portraiture from a number of vantage points, and asks key questions about its nature. How has portraiture changed over the centuries? How have portraits represented their subjects, and how have they been interpreted? The book provides a clear, yet thorough overview of the history of portraiture in terms of social, political, economic, and psychological factors over a broad time span. Issues such as identity, modernity, and gender are considered within their cultural and historical contexts. Shearer West uncovers intriguing aspects of portraiture-a genre that has often been seen as purely representational, featuring examples from African tribes to Renaissance princes, and from 'stars' such as David and Victoria Beckham to everyday people. West examines the many meanings and uses of portraits throughout the ages and includes a wide range of artists from Botticelli to Picasso, and Hans Holbein to Frida Kahlo. In the process, she reveals the faces of the past in an exciting new way. Beautifully illustrated throughout, this book is a unique and accessible introduction to the history of portraiture.\n","torrent":{"xt":"urn:btih:ae66e90deef1d81519962657f265eca04535bdd3","amp;dn":"Portraiture+-+Oxford+History+of+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae66e90deef1d81519962657f265eca04535bdd3","infoHashBuffer":{"type":"Buffer","data":[174,102,233,13,238,241,216,21,25,150,38,87,242,101,236,160,69,53,189,211]},"announce":[],"urlList":[]}}