{"title":"Grease (1978) 2.2GB DivX HD 720p (moviesbyrizzo) multisubs","uid":6528281,"size":2389615552,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:aee2bdf6e6eb693070a171fb705eed2c64ef7530&amp;dn=Grease+%281978%29+2.2GB+DivX+HD+720p+%28moviesbyrizzo%29+multisubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1310230127,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0077631/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0077631/&lt;/a&gt;\n\nStars The lovely Ms. Olivia Newton John and the \ngreatly talented Mr. John Travolta equally\n\n1280 X 720p 2600k video bitrate lovely 256k audio DivX HD from bluray file\n\nMultisubtitles offerings - we have included what we found on the net for\nsimilar postings however some other bluray/HD version subtitles postings also\nworked - and in any event there should be many more postings to be found as time\ngoes by as it were. SINNERS version 720p subs we found do also work.\n\nSRTs for Bulgarian, Czech, Danish, Dutch, French, Greek, Norwegian, Polish, \nPortuguese, Romanian, Serbian, Spanish and yes - Swedish\n\nWe had no luck when looking for German Italian or Finnish this time around-\nhope to see them posted soon - and English template is included \n\n\nGrease is one of the best all time musicals in the harvest of great songs\ndone by great stars - Olivia Newton John and John Travolta is also a star!\n\nHow much has this culture changed over the decades? They certainly arent making movies today without a cast the is racially diverse enough so as to appear\nto have plagiarized and hjacked the wrok from what is clearly would have been \ninstead the intent of the original writers work in character depiction and social \ncontextual porrayal of real and probable plot ideas and themes.\n\n\nIn one scene at a school dance, the rules are read out for those assembled.\nThey include:\n\n1) No profanity or obnoxious behaviour\n2) Dance partner teams are to be &quot;Boy and girl&quot; combinations ONLY\n(many girls used to dance with gals back then so they could be safe\nin case they didnt like any of the guys, or while waiting to be asked by one \nthey could accept)\n\n\nIt is true that there is flexibility in the range of experiences that\nthe human genre could be put through as it has these past decade or two.\nThe problem few have recognized is that it isnt a sustainable model - we\nare made as we are - and we can only stretc so far for the sake of others\nwho do not consider the discomfort from trying to make us over &quot;anyways&quot;\nrealizing full well that it is only causing dissonance and resentment -\nis better that all do their best in their own areas of credence.\n\nWhataver happened to the notion of a romantic date, rather\nthan the crude &quot;does she put out&quot; kind of mindsets being inflicted on\na &quot;nice gal&quot; - its a cruel thing to do and movies could set a better example\nfor who are good enough men to come through with better learning instead.\nLearn to truly love and to be fair to your own kind completely and most\nimportantly - bear in mind who it is that deserves what it is you have to give\n- and shun all else that opposes your better spirit.\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n\n","torrent":{"xt":"urn:btih:aee2bdf6e6eb693070a171fb705eed2c64ef7530","amp;dn":"Grease+%281978%29+2.2GB+DivX+HD+720p+%28moviesbyrizzo%29+multisubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aee2bdf6e6eb693070a171fb705eed2c64ef7530","infoHashBuffer":{"type":"Buffer","data":[174,226,189,246,230,235,105,48,112,161,113,251,112,94,237,44,100,239,117,48]},"announce":[],"urlList":[]}}