{"title":"RealtimeBondage--Tasty Part 3  Abigail Dupree High","uid":15606803,"size":2478719864,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:af0d44fdeb8393d417f57db47658b2e63e35df65&amp;dn=RealtimeBondage--Tasty+Part+3++Abigail+Dupree+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"merzedes","files":1,"time":1471734349,"description":"\nTasty Part 3 | Abigail Dupree\r\n\r\nAugust 20, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBald Bitch Water Boarded Until She Breaks \r\n \r\nIn the final segment of her live feed, Abigail Dupree is going to put on a real show for us. We have some pretty specific ideas of what we'd like to have her do, but even after everything she's been through Abigail is still too proud for what we've dreamed up. It looks like we are going to have to break that spirit of hers, and it is going to be rough.\r\n\r\nWe lay Abigail down on the ground and buckle her arms and legs to the ground spread eagle so she is totally helpless, then we start to fill her holes. Our handlers stuff a tampon in each nostril and fill her mouth up. Now that she looks totally ridiculous and can barely breathe it's time to finish the job. We take a water bottle and start slowly pouring it over her mouth. As the water pours, it makes the tampons expand and fill her mouth more. She squirms with the discomfort and terror of being water boarded. Abigail is humiliated and terrified and absolutely ready to do whatever it is we ask of her.\r\n\r\nFor her final task Abigail is going to run the gauntlet of abject humiliation. We hogtie her in rope and set up a little obstacle course for her to wiggle her way through on her elbows and knees. First she has to make her way across a plastic doormat while it scrapes against her tender soft skin. Once she has crossed her first hurdle she has to slog her way across a puddle of mud. If she can't do it fast enough, we've got a neck rope waiting to pull her through whatever trouble she may be having. \r\n \r\nScreens \nhttp://www.realtimebondage.com/live/bondage/trailer.php?y=2016&amp;p=08_20adupree11&amp;u=RealTimeBondage-Abigail-Dupree-Tasty-Part-3\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:af0d44fdeb8393d417f57db47658b2e63e35df65","amp;dn":"RealtimeBondage--Tasty+Part+3++Abigail+Dupree+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af0d44fdeb8393d417f57db47658b2e63e35df65","infoHashBuffer":{"type":"Buffer","data":[175,13,68,253,235,131,147,212,23,245,125,180,118,88,178,230,62,53,223,101]},"announce":[],"urlList":[]}}