{"title":"Willie Nelson - Band Of Brothers (2014) {FLAC} vtwin88cube","uid":10379531,"size":271234113,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:af3d8e4ed464d98a9d86a7181610cab9eb08bafd&amp;dn=Willie+Nelson+-+Band+Of+Brothers+%282014%29+%7BFLAC%7D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"vtwin88cube","files":-1,"time":1403053006,"description":"Willie Nelson\nBand Of Brothers (2014)\n\n\n\n\n\nallmusic.com...\n\n\nWillie Nelson has been a prolific singer and recording artist since the 1970s, but the songwriter who penned hits for Ray Price, Patsy Cline, Billy Walker, and Johnny Cash, among others, hasn't issued an album of predominantly original material since 1996. Band of Brothers ends the drought. Its 14 selections include nine new songs by Nelson (with producer Buddy Cannon) and a handful of fine covers. Opener &quot;Bring It On&quot; is a honky tonk waltz that offers wisdom by someone who has lived through plenty as he looks eternity squarely in the eye. He is in excellent voice as Mickey Raphael's harmonica moans to underscore his lyric. Nelson delivers his first guitar solo on Trigger (his nylon-stringed instrument). His playing, with its unique phrasing, has always been underrated and here it evokes the blues. His love songs have always been highlights in his catalog. &quot;I Thought I Left You&quot; is in 4/4, with a slow processional pace adorned with slippery steel and piano. The lost romance portrayed in the waltz &quot;Send Me a Picture&quot; is another clear standout; a sighing pedal steel and Raphael's mid-register wail echo every sung line. Nelson can still write first-rate, irreverent barroom tunes as well. &quot;Wives and Girlfriends&quot; is a swaggering honky tonker, with wiseass lines and a punchy groove. The title track is a midtempo full-band anthem that celebrates the itinerant musician's life. (It pairs thematically with a righteous cover of Bill Anderson's &quot;The Songwriters.&quot;) The choogling Western swing he employs in &quot;Used to Her&quot; updates not only Bob Wills, but Ray Benson. &quot;The Wall&quot; is a killer confessional, though in its rear-view mirror reflections, fueled by a strolling Rhodes piano, Travis-style guitars, and a two-step bassline, it's also a road song. Nelson covers two tunes by Billy Joe Shaver. &quot;Hard to Be an Outlaw&quot; is a wry, midtempo minor-key spaghetti Western-esque blues with a great guitar break from Willie, while &quot;The Git Go,&quot; another bluesy number, is a slow rocking duet with Jamey Johnson. &quot;Crazy Like Me,&quot; by Shawn Camp and Billy Burnette, is an update of trucker country rockabilly that sets up the closer, the original &quot;I've Got a Lot of Traveling to Do.&quot; It's been 40 years since Nelson gave us &quot;On the Road Again.&quot; This is a companion in a sense, less celebratory, more weathered and ornery, but no less restless. Cannon's production here recalls the memory of Nelson's early to mid-'70s records without being slavishly devoted to sounding retro. Phase-shifted and wide-open electric guitars, clean, whining pedal steel, warm and natural shuffling drums, acoustic pianos, organ, and electric basses paint these songs beautifully. On Band of Brothers, Nelson reminds us that no matter the iconic place he occupies in American popular music as a vocal stylist, he is a classic country singer and songwriter first.\n\n\nGenre................: Country\nSource...............: CD {Sony Legacy 88843019212}\nYear.................: 2014\nQuality..............: Free Lossless Audio Codec (FLAC)\nIncluded.............: Front Cover, Cue, Audiochecker\n\n\n01.Bring It On\n02.Guitar In The Corner\n03.The Wall\n04.Whenever You Come Around\n05.Wives And Girlfriends\n06.I Thought I Left You\n07.Send Me A Picture\n08.Used To Her\n09.The Git Go (With Jamey Johnson)\n10.Band Of Brothers\n11.Hard To Be An Outlaw\n12.Crazy Like Me\n13.The Songwriters\n14.I've Got A Lot Of Traveling To Do\n\n\n\n\n\nSupport The Artists.\nBuy it if you like it!\n\nThanks for Seeding\nCheers...","torrent":{"xt":"urn:btih:af3d8e4ed464d98a9d86a7181610cab9eb08bafd","amp;dn":"Willie+Nelson+-+Band+Of+Brothers+%282014%29+%7BFLAC%7D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af3d8e4ed464d98a9d86a7181610cab9eb08bafd","infoHashBuffer":{"type":"Buffer","data":[175,61,142,78,212,100,217,138,157,134,167,24,22,16,202,185,235,8,186,253]},"announce":[],"urlList":[]}}