{"title":"Noah and the Whale - Discography (2008-2013) [FLAC]","uid":9023974,"size":1316648348,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:afdd30ae9fa1efb4445d26d742051538da471b34&amp;dn=Noah+and+the+Whale+-+Discography+%282008-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":5,"uploader":"politux","files":-1,"time":1381330010,"description":"\n  Noah and the Whale - Discography (2008-2013) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Folk, Singer/Songwriter\n  Source: CD\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2008 Peaceful, the World Lays Me Down\n  2009 The First Days of Spring\n  2011 Last Night on Earth\n  2013 Heart of Nowhere\n\n  Noah and the Whale became a leading light in the British folk scene with the release of 2008's Peaceful, the World Lays Me Down, their popular debut that cracked the U.K. Top Ten and spawned the hit single &quot;5 Years Time.&quot; Formed in the southern suburbs of London, the band also attracted attention by serving as a launching pad for Laura Marling, who left the lineup to 2008 to launch an award-winning solo career. Noah and the Whale forged ahead in her absence, releasing albums that moved away from the band's folky bedrock while still maintaining a good amount of chart success.\n\n  Originally comprised of Charlie Fink (vocals, guitar, harmonica, ukulele), Tom Hobden (fiddle), Matt &quot;Urby Whale&quot; Owens (harmonium, bass), Laura Marling (backing vocals), and Doug Fink (drums), the group began taking shape in 2006 in Twickenham. By early 2008, the bandmates had released several independent singles (including an early version of &quot;5 Years Time&quot;) and attracted attention from Vertigo Records, who signed Noah and the Whale several months later. The band made its major-label debut that September with the summery, pastoral Peaceful, the World Lays Me Down. Released several weeks later in the United States, the album featured a re-recorded version of &quot;5 Years Time,&quot; which peaked at number seven on the U.K. charts and helped expand the band's following at home and abroad. Marling exited the group several months after the album's release, though, and her relationship with Charlie Fink ended shortly thereafter. Both events inspired the group's second album, The First Days of Spring, which dealt heavily with Fink's breakup and gathered praise for its cinematic arrangements.\n\n  Last Night on Earth followed in 2011, signaling a move beyond the folk-rock sound of the band's early material which was instigated by the departure of drummer -- and Charlie Fink's brother -- Doug Fink and the addition of guitarist Fred Abbott. Without a drummer they were forced to experiment with a drum machine, which produced much of the electronic influence found on Last Night on Earth. In the following year they recruited Michael Petulla on drums and toured the country. In 2013, the band announced their fourth record, Heart of Nowhere, which was also accompanied by a short film.","torrent":{"xt":"urn:btih:afdd30ae9fa1efb4445d26d742051538da471b34","amp;dn":"Noah+and+the+Whale+-+Discography+%282008-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afdd30ae9fa1efb4445d26d742051538da471b34","infoHashBuffer":{"type":"Buffer","data":[175,221,48,174,159,161,239,180,68,93,38,215,66,5,21,56,218,71,27,52]},"announce":[],"urlList":[]}}