{"title":"Islamic Art and Architecture 650-1250 (Art Ebook).pdf","uid":10400899,"size":93127960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b07503eb64b38377d4d04c558db7cf3c5c1cf844&amp;dn=Islamic+Art+and+Architecture+650-1250+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"STBGD","files":-1,"time":1403363786,"description":"Pdf / Eng / 2002 / R. Ettinghausen, O. Grabar, M. Jenkins-Madina / 362p / 89 MB\n\nThis richly illustrated book provides an unsurpassed overview of Islamic art and architecture from the seventh to the thirteenth centuries, a time of the formation of a new artistic culture and its first, medieval, flowering in the vast area from the Atlantic to India. Inspired by Ettinghausen and Grabar's original text, this book has been completely rewritten and updated to take into account recent  information and methodological advances.\n   The volume focuses special attention on  the development of numerous regional centres of art in Spain, North Africa, Egypt, Syria, Anatolia, Iraq and Yemen as well as the western and northeastern provinces of Iran. It traces the cultural and artistic evolution of such centres in the seminal early Islamic period and examines the wealth of different ways of creating a beautiful environment.\nThe book approaches the arts with new classifications of architecture and architectural decoration, the art of the object and the art of the book.\n   With many new illustrations, often in colour, this volume broadens the picture of Islamic artistic production and discusses objects in a wide range of media, including textiles, ceramics, metal and wood. The book incorporates extensive accounts of the cultural contexts of the arts and defines the originality of each period. A final  chapter explores the impact of Islamic art on the creativity of non-Muslims within the Islamic realm and in areas surrounding the Muslim world.\n\n","torrent":{"xt":"urn:btih:b07503eb64b38377d4d04c558db7cf3c5c1cf844","amp;dn":"Islamic+Art+and+Architecture+650-1250+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b07503eb64b38377d4d04c558db7cf3c5c1cf844","infoHashBuffer":{"type":"Buffer","data":[176,117,3,235,100,179,131,119,212,208,76,85,141,183,207,60,92,28,248,68]},"announce":[],"urlList":[]}}