{"title":"The story of painting (Sister Wendys DK Art Ebook).pdf","uid":11794440,"size":78925018,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0dbb9ac202a0d53b661975f054bf60428592136&amp;dn=The+story+of+painting+%28Sister+Wendys+DK+Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"STBGD","files":1,"time":1428074549,"description":"Pdf / English / 1994 Dk London / 400 pages / ISBN 10 1564586154 / 75.2 MB\n\n&quot;The story of painting is one that is immensely rich in meaning, yet its value is all too often hidden from us by the complexities of historians. We must forget the densities of 'history' and simply surrender to the wonder of the story.&quot; --Sister Wendy Beckett\nSister Wendy's Story of Painting in 450 masterpieces--reproduced in full color--chronicles the developments and movements in painting over the past 800 years from Gothic to Renaissance, Romanticism to Impressionism, and Post-Impressionism to Modernism. Each movement is introduced by visual timelines that provide an instant overview of the important artists and paintings of that era. As she discusses various schools and movements as well as the work of dozens of individuals artists, Sister Wendy not only tackles the technical topics of perspective, color, and symbolism, she delves into the spiritual, political, and personal aspects of each painting, making art come alive for even the most novice admirer. Sister Wendy analyzes more than 30 of the world's most famous paintings, using enlarged details to explain techniques and reveal symbolism in works that include Botticelli's The Birth of Venus, Rembrandt's The Jewish Bride, Monet's The Waterlily Pond, and Van Gogh's Self-Portrait. Sister Wendy's Story of Painting is an accessible overview of a subject often thought to be overwhelming and complex.\n\n* Amazon review for first US edition","torrent":{"xt":"urn:btih:b0dbb9ac202a0d53b661975f054bf60428592136","amp;dn":"The+story+of+painting+%28Sister+Wendys+DK+Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0dbb9ac202a0d53b661975f054bf60428592136","infoHashBuffer":{"type":"Buffer","data":[176,219,185,172,32,42,13,83,182,97,151,95,5,75,246,4,40,89,33,54]},"announce":[],"urlList":[]}}