{"title":"Kansas - Leftoverture [24 bit FLAC] vinyl","uid":8111654,"size":943989676,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0f61448a7704f2087a538ce9ae41cd058bcbd76&amp;dn=Kansas+-+Leftoverture+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"24.96","files":-1,"time":1360199896,"description":"For any art rock band, the fourth album means it's time for a self-styled masterpiece - if you need proof, look at Selling England by the Pound or Fragile. So, with Kansas, the most determinedly arty of all American art rock bands, they composed and recorded Leftoverture, an impenetrable conundrum of significance that's capped off by nothing less than a five-part suite, appropriately titled &quot;Magnum Opus,&quot; and featuring such promising movement titles as &quot;Father Padilla Meets the Perfect Gnat&quot; and &quot;Release the Beavers.&quot; Of course, there's no telling whether this closing opus relates to the opener, &quot;Carry On Wayward Son,&quot; the greatest single Kansas ever cut - a song that manages to be pompous, powerful, ridiculous, and catchy all at once. That they never manage to rival it anywhere on this record is as much a testament to their crippling ambition as their lack of skills. And it's unfair to say Kansas are unskilled, since they are certainly instrumentally proficient and they can craft songs or, rather, compositions that appear rather ambitious. Except these compositions aren't particularly complex, rhythmically or harmonically, and are in their own way as ambling as boogie rock, which still feels to be their foundation. It's not really fair to attack Kansas for a concept album with an impenetrable concept - it's possible to listen to Lamb Lies Down on Broadway hundreds of times and not know what the hell Rael is up to - but there's neither hooks nor true grandiosity here to make it interesting. That said, this still may be Kansas' most consistent set, outside of Point of Know Return. Take that for what you will.","torrent":{"xt":"urn:btih:b0f61448a7704f2087a538ce9ae41cd058bcbd76","amp;dn":"Kansas+-+Leftoverture+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0f61448a7704f2087a538ce9ae41cd058bcbd76","infoHashBuffer":{"type":"Buffer","data":[176,246,20,72,167,112,79,32,135,165,56,206,154,228,28,208,88,188,189,118]},"announce":[],"urlList":[]}}