{"title":"Lonely Planet Rome (8th Ed) (AZW3,Retail){32Skulls}","uid":10956864,"size":14085352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1462e6e049b7570739bafa15e35376059f5e4b0&amp;dn=Lonely+Planet+Rome+%288th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"32Skulls","files":-1,"time":1409685486,"description":"                       â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nLonely Planet Rome is your passport to all the most relevant and up-to-date advice on what to see, what to skip, and what hidden discoveries await you. Stare in awe at the Sistine Chapel, sip a cappuccino on a cobbled piazza (square) or walk in the footsteps of gladiators at the Colosseum; all with your trusted travel companion. Get to the heart of Rome and begin your journey now!\n\nInside Lonely Planet's Rome Travel Guide:\n\n\nFull-colour maps and images throughout\n\nHighlights and itineraries show you the simplest way to tailor your trip to your own personal needs and interests\n\nInsider tips save you time and money, and help you get around like a local, avoiding crowds and trouble spots\n\nEssential info at your fingertips - including hours of operation, phone numbers, websites, transit tips, and prices\n\nHonest reviews for all budgets - including eating, sleeping, sight-seeing, going out, shopping, and hidden gems that most guidebooks miss\n\nCultural insights give you a richer and more rewarding travel experience - including history, art, architecture, literature, cinema, music, cuisine, wine and the Roman way of life\n\nFree, convenient pull-out Rome map (included in print version), plus over 37 colour maps\n\nUseful features - including Walking Tours, Travel with Children, and Day Trips\n\n\nCovers: Ancient Rome, Centro Storico, Tridente, Trevi, Vatican City, Monti, Esquilino, Trastevere, Gianicolo, Testaccio, Villa Borghese, highlights of Lazio, and more\n\n\n\nBy Lonely Planet, Duncan Garwood, Abigail Blasi\nPublished by Lonely Planet in 2013\nAZW3, Retail, 384 pages, English ","torrent":{"xt":"urn:btih:b1462e6e049b7570739bafa15e35376059f5e4b0","amp;dn":"Lonely+Planet+Rome+%288th+Ed%29+%28AZW3%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1462e6e049b7570739bafa15e35376059f5e4b0","infoHashBuffer":{"type":"Buffer","data":[177,70,46,110,4,155,117,112,115,155,175,161,94,53,55,96,89,245,228,176]},"announce":[],"urlList":[]}}