{"title":"ExploitedCollegeGirls - Desiree (aka Kendall Karson)","uid":11688196,"size":1183172974,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b206ce10a8053c0aa881ecd4545ffcf779796bae&amp;dn=ExploitedCollegeGirls+-+Desiree+%28aka+Kendall+Karson%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"chkm8te","files":1,"time":1423355800,"description":"ExploitedCollegeGirls - Desiree (aka Kendall Karson)\n\nI dare you to not fall in love with Desiree within the first ten minutes of this video. You watch our sweet, self-professed nerd be transformed into a sex goddess, she's happy and talkative, and giddy about what's about to happen, and you wonder why the hell she'd ever want to do the nasty with a stranger on camera. But after a little while you realize our little angel has a strong sexual side that just screams to be unleashed. She literally becomes a different person once her make-up is on and there is a cock she gets to play with. You'll see what I mean. She doesn't mind the attention both of us shower her with, and the more we steer our conversations to sex, the more Desiree gets excited. Every time she shows off her big D's and talks about naughty things, the sexual tension in the room gets thicker. Jay tries to hide his boner as he's exploring Desiree's tits and ass, and I have to admit even I am tempted to just ravage the girl right then and there.\nDesiree has the X-factor. When you are in the room with her your brain practically shuts down and all you want is to 'get with her'. Jay can't even wait until I'm done doing the photo shoot with her, but Desiree doesn't mind his advances and teases. After she picks out her outfit he talks her into blowing him. Still dressed, Desiree drops to her knees and demonstrates her cocksucking skills on him. I practically have to tear him away by his ears so we can keep going. There's still lots to do before he's allowed to fuck her.\nAfter a very sexy photo session we get Desiree on the bed to start the video in earnest. She is a little nervous about it but visibly excited. Jay doesn't waste any time and goes straight for the toy arsenal to see which of them is going to make Desiree cum. He is way too excited to shove his dick into Desiree and forgets all about our usual ritual of getting her undressed first. He lets Desiree enjoy the vibrator for a while, then has our little starlet get naked for some more pussy play. He puts on his best smooth-talker face and, while rubbing and fingering her wet pussy, makes Desiree say out loud how much she wants him to fuck her. Once she properly begs for the cock he &quot;allows her&quot; to suck him off again. She does everything right, lots of eye contact, super hot sucking action, and you can tell she loves getting the cock hard and ready. Once that mission is accomplished it's finally time to fuck. Jay has Desiree get on all fours, her pussy is dripping wet and she squirms in anticipation. We watch her get pounded from behind, her big tits bounce back and forth, and she's lovin' it. And then...OMG. Jay can't restrain himself any longer and cums in her pussy, he pulls out and tries to hold back, then finally unloads the rest of his cum on her ass. With her ass cheeks and back covered in jizz, Jay shoves his cock back inside her and keeps fucking her. One of the cameras is positioned underneath her pussy and you can see more cum get pumped inside her and then shooting back out. The girl practically got inseminated LOL. So this kinda brings the whole thing to an early end (Hey, YOU try to not cum early with a girl like Desiree. Look at her!). But fear not because Desiree WILL be back and this time she gets assfucked (!) and double teamed (!!) and fucked every position we can think of. It's already done, you let me know when you want to see it.\nIn the meantime...man, I swear, if you can't rub out a few dozen to this video I can't help you. SMOKING hot girl with sex appeal plus. Great attitude, down to earth, and she loves the cock. Desiree will end up in your favorites folder, no doubt. - Steve\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8ydu179vrczjknfq8678.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8ydu179vrczjknfq8678.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=k39vdrpuu5nit8z0plhu.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=k39vdrpuu5nit8z0plhu.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b206ce10a8053c0aa881ecd4545ffcf779796bae","amp;dn":"ExploitedCollegeGirls+-+Desiree+%28aka+Kendall+Karson%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b206ce10a8053c0aa881ecd4545ffcf779796bae","infoHashBuffer":{"type":"Buffer","data":[178,6,206,16,168,5,60,10,168,129,236,212,84,95,252,247,121,121,107,174]},"announce":[],"urlList":[]}}