{"title":"The 7 Secrets of the Prolific - Hillary Rettig","uid":10008272,"size":1149907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b314fa3e0c19b565a0d5d20ded4e2dde0f5ef388&amp;dn=The+7+Secrets+of+the+Prolific+-+Hillary+Rettig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1398067730,"description":"You are not lazy, undisciplined, or uncommitted! \n\nProcrastination, perfectionism, and writer's block are habits rooted in scarcity and fear. If you know the seven secrets of the prolific, you can &quot;magically&quot; recover all the energy, discipline, and commitment you thought you had lost. \n\nAuthor, coach and workshop leader Hillary Rettig characterizes, in great detail and depth, the major causes of underproductivity, including: procrastination, perfectionism, resource scarcity, time scarcity, an ineffective writing process, bias, ambivalence, internalized oppression, traumatic rejection, and exploitative career paths. \n\nThen she tells you how to conquer each. The solutions are: \n\n1. Identify and Overcome Perfectionism \n2. Abundantly Resource Yourself \n3. Manage Your Time \n4. Optimize Your Writing Process \n5. Understand and Claim Your Identity as a Writer \n6. Cultivate Resilience in the Face of Rejection and Harsh Criticism, and \n7. Create a Liberated Career. \n\nThose are the 7 Secrets of the Prolific! And whether you write fiction or nonfiction, or poetry, screenplays or something else - or whether you write for business or school - those secrets will help you speed your output, lower your stress, and bring you joy and fulfillment. \n\nSpecial sections include: \n\n*writing on the Internet (and how to withstand the Internet's harsh culture) \n*coping with the many clueless and/or challenging comments and questions people direct to writers (e.g., &quot;When will you get that thing done?&quot;) and, \n*Publishing Without Perishing, a special Appendix just for graduate students and other academic writers. \n\nThe 7 Secrets of the Prolific is published without DRM so that you may enjoy it on any device you own.","torrent":{"xt":"urn:btih:b314fa3e0c19b565a0d5d20ded4e2dde0f5ef388","amp;dn":"The+7+Secrets+of+the+Prolific+-+Hillary+Rettig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b314fa3e0c19b565a0d5d20ded4e2dde0f5ef388","infoHashBuffer":{"type":"Buffer","data":[179,20,250,62,12,25,181,101,160,213,210,13,237,78,45,222,15,94,243,136]},"announce":[],"urlList":[]}}