{"title":"The Voynich manuscript","uid":6625431,"size":776001480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3c331bdd2915160e14b4f5404b5370819fb896c&amp;dn=The+Voynich+manuscript&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"9873.0","files":222,"time":1314146787,"description":"The Voynich manuscript is a handwritten book thought to have been written in the early 15th century and comprising about 240 vellum pages, most with illustrations. Although many possible authors have been proposed, the author, script, and language remain unknown. It has been described as &quot;the world's most mysterious manuscript&quot;.\n\nGenerally presumed to be some kind of ciphertext, the Voynich manuscript has been studied by many professional and amateur cryptographers, including American and British codebreakers from both World War I and World War II. Yet it has defied all decipherment attempts, becoming a historical cryptology cause cÃƒÂ©lÃƒÂ¨bre. The mystery surrounding it has excited the popular imagination, making the manuscript a subject of both fanciful theories and novels.\n\nIn 2009, University of Arizona researchers performed C14 dating on the manuscript's vellum, which they assert (with 95% confidence) was made between 1404 and 1438.[3][4] In addition, the McCrone Research Institute in Chicago found that much of the ink was added not long afterwards, confirming that the manuscript is an authentic medieval document.\n\nThe book is named after the Polish-Lithuanian-American book dealer Wilfrid M. Voynich, who acquired it in 1912. The Voynich manuscript is owned by the Beinecke Rare Book and Manuscript Library of Yale University, and is formally referred to as &quot;Beinecke MS 408&quot;.\n\nFull book scan at 23 megapixel from Beinecke Rare Book and Manuscript Library, Yale University.","torrent":{"xt":"urn:btih:b3c331bdd2915160e14b4f5404b5370819fb896c","amp;dn":"The+Voynich+manuscript","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c331bdd2915160e14b4f5404b5370819fb896c","infoHashBuffer":{"type":"Buffer","data":[179,195,49,189,210,145,81,96,225,75,79,84,4,181,55,8,25,251,137,108]},"announce":[],"urlList":[]}}