{"title":"jQuery Book Pack (43 Books) {BBS}","uid":7293193,"size":436693313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3e1e057c9f13a6496d1068d655697db3c24569c&amp;dn=jQuery+Book+Pack+%2843+Books%29+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1337804041,"description":"\n\n\n\n1)Adobe Dreamweaver CS5.5 Designing and Developing for Mobile with jQuery, HTML5, and CSS3 by David Powers (Adobe Press, 2011)\n\n2)ASP.NET jQuery Cookbook by Sonal Aneel Allana (Packt Pub, 2011)\n\n3)Beginning JavaScript and CSS Development with jQuery  by Richard York (Wrox, 2009)\n\n4)CMS Design Using PHP and jQuery by Kae Verens (Packt Pub, 2010)\n\n5)Developing Websites with jQuery Mobile by Matthew David Focal Press, 2011)\n\n6)Django JavaScript Integration AJAX and jQuery by Jonathan Hayward (Packt Pub, 2011)\n\n7)Dreamweaver CS5.5 Mobile and Web Devel. w. HTML5, CSS3, jQuery - D. Karlins (Packt, 2011)\n\n8)Drupal 6 JavaScript and jQuery by Matt Butcher (Packt Pub, 2009)\n\n9)DZone Refcardz jQuery Selectors (2008)\n\n10)JavaScript &amp; jQuery The Missing Manual by David Sawyer McFarland (OReilly, 2011)\n\n11)Joomla! 1.5 JavaScript jQuery by Jose Argudo Blanco (Packt Pub, 2010)\n\n12)jQuery 1.3 with PHP by Kae Verens (Packt pub, 2009)\n\n13)jQuery 1.4 Animation Techniques Beginners Guide by Dan Wellman (Packt Pub, 2011)\n\n14)jQuery 1.4 Plugin Development Beginner's Guide by Giulio Bai (Packt Pub, 2010)\n\n15)jQuery 1.4 Reference Guide by Jonathan Chaffer and Karl Swedberg(Packt Pub,2010)\n\n16)jQuery Cookbook Solutions &amp; Examples for jQuery Developers (Animal Guide) by Cody Lindley (OReilly, 2009)\n\n17)jQuery For Dummies by Lynn Beighley (Wiley , 2010)\n\n18)jQuery in Action, Second Edition by Bear Bibeault and Yehuda Katz (Manning, 2010)\n\n19)jQuery Mobile by Jon Reid (OReilly, 2011)\n\n20)jQuery Mobile First Look by Giulio Bai (Packt Pub,2011)\n\n21)jQuery Mobile Up and Running by Maximiliano Firtman (OReilly, 2012)\n\n22)jQuery Novice to Ninja by Earle Castledine and Craig Sharkie (SitePoint, 2012)\n\n23)jQuery Pocket Reference by David Flanagan (OReilly, 2011)\n\n24)jQuery Pocket Reference by David Flanagan (OReilly, 2011)\n\n25)jQuery Pocket Reference by David Flanagan (OReilly, 2011)\n\n26)jQuery UI 1.6 The User Interface Library for jQuery by Dan Wellman(Packt Pub,2009)\n\n27)jQuery UI 1.7 The User Interface Library for jQuery by Dan Wellman(Packt Pub,2009)\n\n28)jQuery UI 1.8 The User Interface Library for jQuery by Dan Wellman (Packt Pub,2011)\n\n29)jQuery UI by Eric Sarrion (OReilly, 2012)\n\n30)JQuery UI Themes Beginner's Guide by Adam Boduch(Packt Pub,2011)\n\n31)jQuery Visual QuickStart Guide by Steve Holzner (Peachpit Press, 2009)\n\n32)Learning jQuery 1.3 by Jonathan Chaffer, Karl Swedberg and John Resig(Packt Pub,2009)\n\n33)Learning jQuery, 3rd Ed by Jonathan Chaffer and Karl Swedberg (Packt Pub, 2011)\n\n34)PHP jQuery Cookbook by Vijay Joshi (Packt Pub, 2010)\n\n35)Pro jQuery by Adam Freeman (Apress, 2012)\n\n36)Pro jQuery Mobile - B. Broulik (Apress, 2011)\n\n37)Pro SharePoint with jQuery - P. Duffy (Apress, 2011)\n\n38)Professional jQuery - C. Otero, R. Larsen (Wrox, 2012)\n\n39)Professional XMPP Programming with JavaScript and jQuery (Wrox,2010)\n\n40)Smashing jQuery by Jake Rutter (Wiley, 2011)\n\n41)Supercharged JavaScript Graphics with HTML5 canvas, jQuery, and More by Raffaele Cecco OReilly, 2011)\n\n42)WordPress 3.0 jQuery by Blakeley Silver Tessa (Packt Pub, 2010)\n\n43)Working with jqTouch to Build Websites on Top of jQuery by Matthew David (Focal Press, 2011)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:b3e1e057c9f13a6496d1068d655697db3c24569c","amp;dn":"jQuery+Book+Pack+%2843+Books%29+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3e1e057c9f13a6496d1068d655697db3c24569c","infoHashBuffer":{"type":"Buffer","data":[179,225,224,87,201,241,58,100,150,209,6,141,101,86,151,219,60,36,86,156]},"announce":[],"urlList":[]}}