{"title":"The 7 Habits Of Highly Effective Teens - Sean Covey.epub","uid":8893383,"size":5368958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4a2b80f58a4f4ad0ef7b60ebe67f16448bf5f9f&amp;dn=The+7+Habits+Of+Highly+Effective+Teens+-+Sean+Covey.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1378639886,"description":"Before Joel Manby won the respect of America with his appearance on the CBS reality TV series Undercover Boss, he was a highly successful corporate executive. After the show aired, many of the 18 million viewers wrote to him about the profound impact of his servant leadership. How does a person achieve that level of success without arrogance or pride? In Love Works, Joel Manby introduces us to the power of Christlike love in the workplace. After years of leading thousands of men and women, Manby has proven that leading with love is effective, even in a business environment. Manby challenges leaders to allow integrity and faith to guide leadership decisions, outlining seven time-proven principles that break down the natural walls within corporate cultures, empowering managers and employees, disarming difficulties, and cultivating an atmosphere that builds long-term success. Manby also leverages the undeniable truth that love builds healthy relationships at home---why not use the same behavior to build healthy relationships at work ?","torrent":{"xt":"urn:btih:b4a2b80f58a4f4ad0ef7b60ebe67f16448bf5f9f","amp;dn":"The+7+Habits+Of+Highly+Effective+Teens+-+Sean+Covey.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4a2b80f58a4f4ad0ef7b60ebe67f16448bf5f9f","infoHashBuffer":{"type":"Buffer","data":[180,162,184,15,88,164,244,173,14,247,182,14,190,103,241,100,72,191,95,159]},"announce":[],"urlList":[]}}