{"title":"The Sims 4-RELOADED","uid":11279286,"size":9444019487,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b4ca61412e41238348db05c4128ae202c08f9d06&amp;dn=The+Sims+4-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"SaNRiM","files":2,"time":1414196117,"description":"[img]http://s27.postimg.org/e32b0co0j/cover1.jpg[/img]\n\n\n[b]ABOUT THE GAME\n\nThe Sims 4 is the highly anticipated life simulation game that lets you play with life like never before. Control smarter Sims with unique appearances, personalities, behaviors, and emotions. Experience new levels of creativity when you sculpt Sims with the powerful Create A Sim and design beautiful homes with tactile, room-based Build Mode. Use The Gallery to browse, share, and download new content without ever leaving your game. Control the mind, body, and heart of your Sims and explore your new gameplay possibilities in vibrant neighborhoods that bring your stories to life.\n\nFEATURES\n\nSmarter Sims: Create and control smarter Sims with unique appearances, personalities, and emotions in The Sims 4.\n\nCreate unique Sims and customize their appearance, fashion styles, personality traits, skills, careers, and walk styles. For the first time, Sims both feel and express emotions. Your Sims experience a range of emotional states driven by your actions and influenced by other Sims, events, and objects within the game. Emotions offer you more choices and give you the opportunity to create gameplay moments with even more possibilities. Enjoy how your Sims interact and express their distinct personalities in social settings within the game.\n\nCreate and control the mind, body, and heart of your Sims and bring your stories to life like never before in The Sims 4.\n\nPowerful, Creative Tools: Create A Sim and Build Mode are more powerful, intuitive, and fun than ever before. You have the control to sculpt Sims with tactile precision. Effortlessly construct the home of your dreams with the all new, room-based Build Mode.\n\nVibrant Neighborhoods: Experience new gameplay opportunities brought to life within vibrant and dynamic neighborhoods. Choose among beautiful and diverse lots for your Sims to build their homes and explore activities. Expand your social circle and interact with other Sims in the neighborhood and hang out in community parks and venues.\n\nRich Rewards: Earn new objects, outfits, and traits by completing events, discovering collectables, and unlocking achievements.\n\nShare Your Creations: The Gallery allows you to browse, share, and download new content without ever leaving your game. Get inspired by rich content created by The Sims community and add new experiences to your game.\n\nOS: Windows XP (SP3), Windows Vista (SP2), Windows 7 (SP1), Windows 8, or Windows 8.1\nPROCESSOR: 1.8 GHz Intel Core 2 Duo, AMD Athlon 64 Dual-Core 4000+ or equivalent (For computers using built-in graphics chipsets, the game requires 2.0 GHz Intel Core 2 Duo, 2.0 GHz AMD Turion 64 X2 TL-62 or equivalent)\nMEMORY: At least 2 GB RAM\nHARD DRIVE: At least 9 GB of free space with at least 1 GB additional space for custom content and saved games\nVIDEO CARD: 128 MB of Video RAM and support for Pixel Shader 3.0. Supported Video Cards: NVIDIA GeForce 6600 or better, ATI Radeon X1300 or better, Intel GMA X4500 or better\nSOUND CARD: DirectX 9.0c Compatible\nDIRECTX: DirectX 9.0c compatible\n\n\n\n\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game, select the desired language in the installer\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT[/b]\n\n &lt;a href=&quot;\nhttp://s9.postimg.org/fyf49zmy7/scr1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/fyf49zmy7/scr1.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s9.postimg.org/fx0l2tvqn/scr2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/fx0l2tvqn/scr2.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s9.postimg.org/by3dk073j/scr3.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/by3dk073j/scr3.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://s9.postimg.org/58wu3zlrj/scr4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s9.postimg.org/58wu3zlrj/scr4.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:b4ca61412e41238348db05c4128ae202c08f9d06","amp;dn":"The+Sims+4-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4ca61412e41238348db05c4128ae202c08f9d06","infoHashBuffer":{"type":"Buffer","data":[180,202,97,65,46,65,35,131,72,219,5,196,18,138,226,2,192,143,157,6]},"announce":[],"urlList":[]}}