{"title":"My Dinner with Andre (multisubs and xtras) moviesbyrizzo","uid":6588679,"size":1710844523,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b5fcec1630d17a8f6cc5db601c08dbbd1eaf9548&amp;dn=My+Dinner+with+Andre+%28multisubs+and+xtras%29+moviesbyrizzo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"moviesbyrizzo","files":-1,"time":1312729896,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0082783/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0082783/&lt;/a&gt;\n\nConverted from the Criterion Collection Special edition which provided \n(in this case) better dvd9 source content resolution, and extras which\nyielded two brief clips of interviews with the two main actors of the movie\nwhich are included here for your edification equally.\n\n720 X 480 at nice 1800k video bitrate, 224k audio for those fans of this\nstuff that have made clear they want to fully get the goods on this movie.\n\nSRT subtitles in English (template which may be used to instantl;y translate\nto any other kanguage using the freely available donation supported &quot;Subtitles\nEditor&quot; utility from Denmark's nikse.dk along with the free &quot;Google translate&quot;\nwebsite facility or what have you), along with French Spanish and Portuguese.\n\n\n&quot;My Dinner with Andre&quot; is a movie that strives for profundity while instead \nbordering at all times on the inane. A complete lack of connection to what\nare real human ideas of relating and sharing in beauty that comes form a\nfullness of the emotions free of retarding instincts and insane drives to\nmake thngs somehow weird and strange and alien which gives meaning to those\nthat lack this basis for their own idea of genius.\n\nIt is true that &quot;speaking in a feign&quot; or somehow having to constantly read\nbetween the lines suggests an arrogance towards the audience in thet a mindset that wont revaeal its own agenda for what makes its own existentialism seem\nintolerable by comparison if &quot;brought out into the open&quot;, suffice it to say\nThat &quot;to throw a teddy bear into the air&quot; in order to astound the 140 people\nwatching may seem like the thrill of a lifetime to a small mind, however\nthere is a lack of credibility established on the part of the advocates\nof such a lifestyle of &quot;constantly venting&quot; inane psychosis - to those that\nmust now decide if the experiment has run its course and needs to be declared\na dismal failure in what is human history for better notions that are more\nthan just equal to the sensibly inane.\n\n\n\nMichael Rizzo Chessman\nmoviesbyrizzo\n\n\n  \n\n\n\n\n  ","torrent":{"xt":"urn:btih:b5fcec1630d17a8f6cc5db601c08dbbd1eaf9548","amp;dn":"My+Dinner+with+Andre+%28multisubs+and+xtras%29+moviesbyrizzo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5fcec1630d17a8f6cc5db601c08dbbd1eaf9548","infoHashBuffer":{"type":"Buffer","data":[181,252,236,22,48,209,122,143,108,197,219,96,28,8,219,189,30,175,149,72]},"announce":[],"urlList":[]}}