{"title":"Dolphin Drone - James Grundvig [EN EPUB MOBI] [ebook] [p_s]","uid":15920882,"size":1900753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b6ce477ade6cfbacf82492931ef14064e21d6a1f&amp;dn=Dolphin+Drone+-+James+Grundvig+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"perfect_stan","files":4,"time":1475253194,"description":"Dolphin Drone by James Grundvig\r\nEnglish | 2016 | Military Thriller | 1.6 MB\r\n\r\n\r\nA taught, high-concept thriller that humanizes the men and women behind military espionage.\r\nJames Grundvig’s Dolphin Drone takes us into the complex underworld of global terrorism with razor-sharp plot twists, remarkable characters, and fascinating insight into the technological advancements of the US Navy.\r\nUsing dolphin sonar-tracking technology, Ex-Navy SEAL Merk Toten stumbles of freshly laid Iranian sea mines while conducting surveillance on two US ships that were hijacked by Somali pirates on the Strait of Hormuz. This discovery occurs on the same day that a fake intelligence report draws three US drones away from the Persian Gulf. Toten investigates the parallel events to uncover a new super-terrorist group made up of a network of Somali warlords, Islamic assailants, Yemen-based terrorists, and ISIS sympathizers.\r\nWhen Merk Toten and the beautiful CIA Operative Jenny Myung King discover a plot by this new terrorist organization to bomb New York Harbor, the duo must race against the clock to stop the devastating attack.\r\nDolphin Drone is a tense thriller that combines cutting-edge marine technology, high-stakes undercover operations, and complex and frightening political underpinnings.\r\nSkyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fiction—novels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:b6ce477ade6cfbacf82492931ef14064e21d6a1f","amp;dn":"Dolphin+Drone+-+James+Grundvig+%5BEN+EPUB+MOBI%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6ce477ade6cfbacf82492931ef14064e21d6a1f","infoHashBuffer":{"type":"Buffer","data":[182,206,71,122,222,108,251,172,248,36,146,147,30,241,64,100,226,29,106,31]},"announce":[],"urlList":[]}}