{"title":"Handbook of Adhesives and Sealants - Edward M. Petrie","uid":15375049,"size":5045949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b715f4ea2247f926cd5ce8e2c374a8ecdbb93aae&amp;dn=Handbook+of+Adhesives+and+Sealants+-+Edward+M.+Petrie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1469183032,"description":"Handbook of Adhesives and Sealants - Edward M. Petrie (McGraw-Hill, 2000).pdf\r\n\r\nThe first book ever to diffuse information available through technical literature, vendors and users. Adhesives and Sealants are used in the home as well as the factory floor. They are all around us and the glue that holds everything together. This handbook will cover polymeric adhesives and sealants for joining or bonding a wide range of material including metals, plastics, composites, and elastomers. The book include many real-life examples to illustrate the &quot;do's and don'ts&quot; of using adhesives and sealants. The goal is to develop this work so that it is an extensive yet easy of the technology. Handbook of Adhesives and Sealants covers all most of the various types of adhesives materials that are commonly used such as: epoxies, silicone, and neoprene. The first book of its kind to provide a background on how to successfully use adhesives and sealants from design to use. It provides detailed data on the performance of the adhesive/sealant with respect to harsh service environment and explain why adhesives and sealants are used and their advantages and disadvantages to other joining methods. Standard and special test methods are also available, providing the reader with a wide range of information","torrent":{"xt":"urn:btih:b715f4ea2247f926cd5ce8e2c374a8ecdbb93aae","amp;dn":"Handbook+of+Adhesives+and+Sealants+-+Edward+M.+Petrie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b715f4ea2247f926cd5ce8e2c374a8ecdbb93aae","infoHashBuffer":{"type":"Buffer","data":[183,21,244,234,34,71,249,38,205,92,232,226,195,116,168,236,219,185,58,174]},"announce":[],"urlList":[]}}