{"title":"Relax, You're Already Home - Everyday Taoist Habits for a Richer","uid":8073026,"size":17196548,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b799a5382a34bb4a88789a917f2c9562e7ded016&amp;dn=Relax%2C+You%27re+Already+Home+-+Everyday+Taoist+Habits+for+a+Richer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"imarion","files":-1,"time":1359317082,"description":"Relax, You're Already Home: Everyday Taoist Habits for a Richer Life by Raymond Barnett\n2004 | ISBN: 1585423661 | English | 208 Pages | PDF | 16.40 MB\n\n\nSimple ways to a fuller and more vibrant existence, drawn from the Taoist tradition and shaped to fit our modern lives.\n\nRelax, You're Already Home explores how we can enrich our lives in modern America by incorporating simple habits discovered in the Taoist tradition. We don't have to dramatically reshape our lives or perform time-consuming rituals like meditation, kung fu, or breathing practices. Dr. Raymond Barnett instead shows how we can focus on basic daily Taoist habits through activities like going to the park, gardening, or enjoying a cup of tea. He even helps us create our own rituals around holidays, saints, historical figures or events, or anything else that resonates with us.\n\nThis warm and accessible book is ideal for anyone whose life seems too fast and complicated, as well as for those who are interested in Eastern religions but don't have the time or inclination to take up esoteric practices. Complete with &quot;interactives&quot; that suggest exercises and probing questions, Relax, You're Already Home is a perfect primer for Taoism and a philosophy in its own right. ","torrent":{"xt":"urn:btih:b799a5382a34bb4a88789a917f2c9562e7ded016","amp;dn":"Relax%2C+You%27re+Already+Home+-+Everyday+Taoist+Habits+for+a+Richer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b799a5382a34bb4a88789a917f2c9562e7ded016","infoHashBuffer":{"type":"Buffer","data":[183,153,165,56,42,52,187,74,136,120,154,145,127,44,149,98,231,222,208,22]},"announce":[],"urlList":[]}}