{"title":"Applied Regression Analysis (Draper and Smith, Wiley)","uid":8951617,"size":36970787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b83c5a30931ac8784e0ec9bfc9a2d9b4d92c618d&amp;dn=Applied+Regression+Analysis+%28Draper+and+Smith%2C+Wiley%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Piratfreddy","files":-1,"time":1379899528,"description":"Publication Date: April 23, 1998 | ISBN-10: 0471170828 | ISBN-13: 978-0471170822 | Edition: Third\n\nAn outstanding introduction to the fundamentals of regression analysis-updated and expanded The methods of regression analysis are the most widely used statistical tools for discovering the relationships among variables. This classic text, with its emphasis on clear, thorough presentation of concepts and applications, offers a complete, easily accessible introduction to the fundamentals of regression analysis. Assuming only a basic knowledge of elementary statistics, Applied Regression Analysis, Third Edition focuses on the fitting and checking of both linear and nonlinear regression models, using small and large data sets, with pocket calculators or computers. This Third Edition features separate chapters on multicollinearity, generalized linear models, mixture ingredients, geometry of regression, robust regression, and resampling procedures. Extensive support materials include sets of carefully designed exercises with full or partial solutions and a series of true/false questions with answers. All data sets used in both the text and the exercises can be found on the companion disk at the back of the book. For analysts, researchers, and students in university, industrial, and government courses on regression, this text is an excellent introduction to the subject and an efficient means of learning how to use a valuable analytical tool. It will also prove an invaluable reference resource for applied scientists and statisticians.\n\nPDF file","torrent":{"xt":"urn:btih:b83c5a30931ac8784e0ec9bfc9a2d9b4d92c618d","amp;dn":"Applied+Regression+Analysis+%28Draper+and+Smith%2C+Wiley%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b83c5a30931ac8784e0ec9bfc9a2d9b4d92c618d","infoHashBuffer":{"type":"Buffer","data":[184,60,90,48,147,26,200,120,78,14,201,191,201,162,217,180,217,44,97,141]},"announce":[],"urlList":[]}}