{"title":"Call of Duty - Finest Hour - PS2 NTSC 2004","uid":5537399,"size":1532006242,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:b88ccb7f93391ea226f53590bb4e833ce164c045&amp;dn=Call+of+Duty+-+Finest+Hour+-+PS2+NTSC+2004&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"UR-Djavu","files":-1,"time":1273116512,"description":"Call of Duty: Finest Hour\n\nPS2 NTSC 2004\n\nCall of Duty: Finest Hour is a competent shooter on most counts. Finest Hour's single-player component actually consists of three small campaigns told from the perspective of the Russian, British, and American armies. While some may find this type of campaign disjointed from a story perspective, it allows for a good variety of settings. As the Russians, you'll begin by crossing the Volga River in an attempt to push the German army out of the besieged city of Stalingrad. The British campaign is set in the deserts of North Africa, while the American missions have you starting the push into Western Germany with the capture of Aachen. Throughout the game, you'll be accompanied by AI-controlled comrades who will fight by your side and help you advance through the missions. These teammates can and will die, but they're often replaced by more fodder as you proceed through the missions. \n\nExperienced shooter fans will find several familiar mission types in Finest Hour. There are a couple of tank-driving missions, a turret-style mission on the back of a jeep, and a shooting-gallery sequence with a sniper rifle. You'll also participate in some house-to-house fighting, kicking down doors and ferreting out entrenched Germans.\n\nYou do have an array of real-life weapons at your disposal, such as Thompson and PPSH submachine guns, and Kar98 rifles. And like in the original Call of Duty, you can aim down the iron sight of your weapons for additional accuracy and a partial zoom. You're allowed to carry two weapons at any given time, along with grenades and other types of explosives. \n\nFinest Hour's graphics engine is adequate to the task, offering detailed weapon and vehicle models. On the audio front, Finest Hour's sound effects are decent. Overall, Call of Duty: Finest Hour is still a competent shooter, and those who enjoy World War II-based games will still have a good time with it. \n\nSeed people - this was made especially to keep it alive - hard to find nowadays.\n\nTested on fat with softmod MC and esr - using Fujifilm at 4x speed with Imgburn.\n\n","torrent":{"xt":"urn:btih:b88ccb7f93391ea226f53590bb4e833ce164c045","amp;dn":"Call+of+Duty+-+Finest+Hour+-+PS2+NTSC+2004","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b88ccb7f93391ea226f53590bb4e833ce164c045","infoHashBuffer":{"type":"Buffer","data":[184,140,203,127,147,57,30,162,38,245,53,144,187,78,131,60,225,100,192,69]},"announce":[],"urlList":[]}}