{"title":"Poltergeist I [HDrip][Spanish]","uid":6822108,"size":2092093440,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b95d3c345142f524dc96923f56c66bb7306808a0&amp;dn=Poltergeist+I+%5BHDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"virana","files":-1,"time":1321440516,"description":"Poltergeist\n\nPoltergeist es la primera y mÃƒÂ¡s exitosa pelÃƒÂ­cula de la saga Poltergeist, estrenada el 4 de junio de 1982 y nominada para tres Oscar. La pelÃƒÂ­cula fue dirigida por Tobe Hooper y fue coproducida y coescrita por Steven Spielberg, junto con Michael Grais y Mark Victor, su primer gran ÃƒÂ©xito como productor. La trama gira en torno a la inquietante casa familiar de un suburbio en la que se sospecha el fenÃƒÂ³meno de poltergeist.\n\nLa pelÃƒÂ­cula es a menudo citada como maldecida por el asesinato de Dominique Dunne y temprana muerte de Heather O'Rourke, asÃƒÂ­ como el hecho de que la actriz JoBeth Williams ha seÃƒÂ±alado en entrevistas de televisiÃƒÂ³n que los esqueletos utilizados en la bien conocida escena de la piscina en la primera pelÃƒÂ­cula Poltergeist eran reales. Este ha sido el centro de la conocida MaldiciÃƒÂ³n Poltergeist.\n\nArgumento\nLa familia Freelings vive en un suburbio de California (EEUU) en una casa, aparentemente, normal. Pero todo cambia cuando Carol Anne (Heather O'Rourke), la pequeÃƒÂ±a de la familia, sea la primera en contactar con los espÃƒÂ­ritus que hay en la casa a travÃƒÂ©s de la televisiÃƒÂ³n. Convencidos de que necesitan ayuda, los Freelings llamarÃƒÂ¡n a un grupo de parapsicÃƒÂ³logos e, incluso, a una medium espiritual para poder acabar con los poltergeist...\n\nMaldiciÃƒÂ³n Poltergeist\nAlgunos creen que se trata de una pelÃƒÂ­cula maldita. Esta leyenda urbana se basa en los siguientes hechos:\n++ Heather O'Rourke, Carol Anne en la saga, falleciÃƒÂ³ con 12 aÃƒÂ±os de una obstrucciÃƒÂ³n intestinal.\n++ Dominique Dunne, Dana (la hermana mayor), muriÃƒÂ³ al ser estrangulada por su pareja.\n++ Julian Beck, el reverendo Kane en la segunda parte, muriÃƒÂ³ en 1985 por un cÃƒÂ¡ncer de estÃƒÂ³mago, poco despuÃƒÂ©s de terminar el rodaje.\n++ Will Sampson, que interpretÃƒÂ³ a un brujo llamado Taylor, y que afirmaba ser chaman en la vida real, muriÃƒÂ³ en 1987 por complicaciones en un transplante de corazÃƒÂ³n y pulmÃƒÂ³n.\nEn total murieron cuatro protagonistas en las tres partes.\n\nCuriosidades\n++ Se dice que varias escenas fueron bajadas de tono por Spielberg para no ser tan sangrientas o impactantes como originalmente querÃƒÂ­a el director Tobe Hooper de las cuales algunas son:\n--Cuando aparece la mano que sale del televisor, originalmente saldrÃƒÂ­a una cara llena de sangre y escupiendo a Carol Anne.\n--En la escena en que aparecÃƒÂ­a el &quot;payaso malÃƒÂ©volo&quot; este presentaba un aspecto mÃƒÂ¡s macabro y horroroso.\n--Cuando Diane rescataba a Carol Anne del mÃƒÂ¡s allÃƒÂ¡, originalmente regresaban todas llenas de sangre, araÃƒÂ±adas, golpeadas y con el rostro lleno de partes humanas.\n\n++ Tobe Hooper entablÃƒÂ³ una demanda a Steven Spielberg por que su nombre aparecÃƒÂ­a mÃƒÂ¡s pequeÃƒÂ±o que el de Spielberg en los posters promocionales, pero finalmente la perdiÃƒÂ³ y nunca volviÃƒÂ³ a trabajar en una pelÃƒÂ­cula de gran presupuesto.\n++ Para el papel de la niÃƒÂ±a Carol Anne primero se pensÃƒÂ³ en Drew Barrymore, pero al final fue interpretado por Heather O'Rourke. \n","torrent":{"xt":"urn:btih:b95d3c345142f524dc96923f56c66bb7306808a0","amp;dn":"Poltergeist+I+%5BHDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b95d3c345142f524dc96923f56c66bb7306808a0","infoHashBuffer":{"type":"Buffer","data":[185,93,60,52,81,66,245,36,220,150,146,63,86,198,107,183,48,104,8,160]},"announce":[],"urlList":[]}}