{"title":"The Almost Nearly Perfect People: Nordic Miracle (2014)","uid":10058042,"size":1204727,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba0c40d0444d63f5fa7e55ed74e197b0358e3eb7&amp;dn=The+Almost+Nearly+Perfect+People%3A+Nordic+Miracle+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"bookzilla","files":2,"time":1398690043,"description":"The Almost Nearly Perfect People - truth about the Nordic miracle\n\nepub and mobi\n\n\nThe whole world wants to learn the secrets of Nordic exceptionalism: why are the Danes the happiest people in the world, despite having the highest taxes? If the Finns really have the best education system, how come they still think all Swedish men are gay? Are the Icelanders really feral? How are the Norwegians spending their fantastical oil wealth? And why do all of them hate the Swedes?\n\n Michael Booth has lived among the Scandinavians, on and off, for over ten years, perplexed by their many strange paradoxes and character traits and equally bemused by the unquestioning enthusiasm for all things Nordic that has engulfed the rest of the world, whether it be for their food, television, social systems or chunky knitwear. \n\n In this timely book he leaves his adopted home of Denmark and embarks on a journey through all five of the Nordic countries to discover who these curious tribes are, the secrets of their success and, most intriguing of all, what they think of each other. Along the way a more nuanced, often darker picture emerges of a region plagued by taboos, characterised by suffocating parochialism and populated by extremists of various shades.\n\n They may very well be almost nearly perfect, but it isn't easy being Scandinavian. ","torrent":{"xt":"urn:btih:ba0c40d0444d63f5fa7e55ed74e197b0358e3eb7","amp;dn":"The+Almost+Nearly+Perfect+People%3A+Nordic+Miracle+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba0c40d0444d63f5fa7e55ed74e197b0358e3eb7","infoHashBuffer":{"type":"Buffer","data":[186,12,64,208,68,77,99,245,250,126,85,237,116,225,151,176,53,142,62,183]},"announce":[],"urlList":[]}}