{"title":"Mogwai - Music Industry 3. Fitness Industry 1. (2014) [FLAC]","uid":11602294,"size":184836702,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba578f18886ea1aa8098699b7778fcd7307dc2cc&amp;dn=Mogwai+-+Music+Industry+3.+Fitness+Industry+1.+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"politux","files":-1,"time":1417369664,"description":"\n  Mogwai - Music Industry 3. Fitness Industry 1. (2014) [FLAC]\n\n  Genre: Rock\n  Style: Post-Rock\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 900 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Teenage Exorcists \n  02 History Day \n  03 HMP Shaun William Ryder\n  04 Re-Remurdered (Blanck Mass Remix) \n  05 No Medicine For Regret (Pye Corner Audio Remix) \n  06 The Lord Is Out of Control (Nils Frahm Remix) \n\n  \nThe cosmic post-rock band Mogwai were formed in Glasgow, Scotland, in 1996 by guitarist/vocalist Stuart Braithwaite, guitarist Dominic Aitchison, and drummer Martin Bulloch, longtime friends with the goal of creating &quot;serious guitar music.&quot; Toward that end they added another guitarist, John Cummings, before debuting in March 1996 with the single &quot;Tuner,&quot; a rarity in the Mogwai discography for its prominent vocals; the follow-up, a split single with Dweeb titled &quot;Angels vs. Aliens,&quot; landed in the Top Ten on the British indie charts. Following appearances on a series of compilations, Mogwai returned later in the year with the 7&quot; &quot;Summer&quot;; after another early-1997 single, &quot;New Paths to Helicon,&quot; they issued Ten Rapid, a collection of their earliest material.\n\n  Mr. Beast, which was released in 2006, found the band going in a softer, more reflective direction. Late that year, the band's collaboration with Clint Mansell on the soundtrack to The Fountain arrived; Mogwai also crafted the score for Douglas Gordon's Zidane: A 21st Century Portrait, which was released in the U.K. in 2006 and in the U.S. the following spring. The Batcat EP, which featured a collaboration with garage-psych legend Roky Erickson, arrived in late summer 2008, heralding the release of The Hawk Is Howling -- which reunited the band with producer Andy Miller for the first time in a decade -- that fall. In 2010, Mogwai released their first live album, Special Moves, as a package with the Vincent Moon-directed concert film Burning.\n\n  For 2011's Hardcore Will Never Die, But You Will, the band reunited with Young Team producer Paul Savage for a more streamlined set of songs. Later that year, Mogwai followed up with an EP of unreleased material from the Hardcore sessions, Earth Division, released on Sub Pop. Late in 2012, the band issued A Wrenched Virile Lore, a collection of Hardcore Will Never Die, But You Will remixes. Early the following year, the first taste of their score to the French zombie TV series Les Revenants (which was based on the 2004 film of the same name) arrived as a four-song EP; in February 2013, the full-length album appeared. The band filled the rest of the year with recording their eighth proper album Rave Tapes at their Castle of Doom studio, live performances of their Zidane: A 21st Century Portrait score in Glasgow, Manchester, and London and other live performances. Rave Tapes, which boasted a more streamlined and electronic direction than Mogwai's recent albums, was released in early 2014","torrent":{"xt":"urn:btih:ba578f18886ea1aa8098699b7778fcd7307dc2cc","amp;dn":"Mogwai+-+Music+Industry+3.+Fitness+Industry+1.+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba578f18886ea1aa8098699b7778fcd7307dc2cc","infoHashBuffer":{"type":"Buffer","data":[186,87,143,24,136,110,161,170,128,152,105,155,119,120,252,215,48,125,194,204]},"announce":[],"urlList":[]}}