{"title":"Thermodynamics - Enrico Fermi","uid":15529667,"size":14023277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ba5f979f3b7e3f4e50e72ac66a4a829733111be3&amp;dn=Thermodynamics+-+Enrico+Fermi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1470816522,"description":"Thermodynamics - Enrico Fermi (PH, 1937).djvu\r\n\r\nIndisputably, this is a modern classic of science. Based on a course of lectures delivered by the author at Columbia University, the text is elementary in treatment and remarkable for its clarity and organization. Although it is assumed that the reader is familiar with the fundamental facts of thermometry and calorimetry, no advanced mathematics beyond calculus is assumed.\r\nPartial contents: thermodynamic systems, the first law of thermodynamics (application, adiabatic transformations), the second law of thermodynamics (Carnot cycle, absolute thermodynamic temperature, thermal engines), the entropy (properties of cycles, entropy of a system whose states can be represented on a (V, p) diagram, Clapeyron and Van der Waals equations), thermodynamic potentials (free energy, thermodynamic potential at constant pressure, the phase rule, thermodynamics of the reversible electric cell), gaseous reactions (chemical equilibria in gases, Van't Hoff reaction box, another proof of the equation of gaseous equilibria, principle of Le Chatelier), the thermodynamics of dilute solutions (osmotic pressure, chemical equilibria in solutions, the distribution of a solute between 2 phases vapor pressure, boiling and freezing points), the entropy constant (Nernst's theorem, thermal ionization of a gas, thermionic effect, etc.)","torrent":{"xt":"urn:btih:ba5f979f3b7e3f4e50e72ac66a4a829733111be3","amp;dn":"Thermodynamics+-+Enrico+Fermi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba5f979f3b7e3f4e50e72ac66a4a829733111be3","infoHashBuffer":{"type":"Buffer","data":[186,95,151,159,59,126,63,78,80,231,42,198,106,74,130,151,51,17,27,227]},"announce":[],"urlList":[]}}