{"title":"Porky's the Ultimate Collection (1983) [H264 - Eng Ita Aac - Mul","uid":8960847,"size":4466685494,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bae7469cdcd8c29e8e1b8b372281e181a3cc5999&amp;dn=Porky%27s+the+Ultimate+Collection+%281983%29+%5BH264+-+Eng+Ita+Aac+-+Mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gemini9669","files":-1,"time":1380108863,"description":"Porky's \nReviled by critics and embraced by the public during its initial run (1981), Porky's is interesting to watch after all these years. What holds up about this horny coming-of-age tale is remarkable. Writer/director Bob Clark has little more than sex and practical joking on his mind, and his high school seniors from Angel Beach, Florida, rapidly move from one to the other. Clark displays a sense of timing and, perhaps rarer still, a sense of male friendship--its brutalities and its bonds--that feels right, not artificial. Surprisingly, the showcase practical jokes are still funny: the Everglades encounter with Cherry Forever, the hole in the girls' shower, and Beulah Balbricker, the humongous gym teacher. The comedic set-ups and payoffs surprisingly still work. Clark's insistence on a subplot about anti-Semitism, however, still sticks out as A MESSAGE. Kim Cattrall really got her start here (although almost no one else did) as Ms. Honeywell, a.k.a. &quot;Lassie.&quot; Clark later distanced himself from the irritating Porky's sequels and went on to make the wonderful Christmas Story, the tale of a little boy who wants a BB gun for Christmas. --Keith Simanton\n\nPorky's II: The Next Day \nThe inevitable sequel to the surprise hit movie marks a noticeable change in tone, as the horny kids from the first film fight religious fanatics in order to put on a stage show. Though the gang is still as mischievous as they were the night before, most of the raunchy humor from the first film has been dropped. In its place are some surprisingly effective passages dealing bluntly with sex, love, anti-Semitism, and religious tolerance in the repressed South of the 1950s. It's this turn that makes the sequel a surprise and something distinctive from its predecessor. --Robert Lane\n\nPorky's Revenge \nBare breasts, practical jokes, greaser hairdos, and cars with big fins--it must be another Porky's movie! Porky's Revenge continues to fuse sexploitation and 1950s nostalgia, though by this point the adolescent hijinks feel a bit rote. On the verge of graduation, Pee Wee, Meat, and the other three interchangeable guys (winnowed down from the larger gang of the first two movies) try to help their basketball coach out of a jam by revealing to the authorities that fat, foul-tempered Porky has rebuilt his illegal casino/whorehouse--but when they get caught, they promise Porky they'll throw the state championship to save their lives. This flimsy plot is intertwined with other disconnected bits about Pee Wee having the hots for a foreign exchange student (Playboy Playmate Kim Evenson), Meat being forced to marry Porky's daughter, a contraband stag film, a biology teacher with a sideline as a dominatrix, and of course the eternal presence of women's coach Beulah Balbricker (Nancy Parsons), that towering mixture of prudery and repressed lust. Writer/director Bob Clark had nothing to do with this sequel, so it's unsurprising that the genuine fondness he brought to the characters is long gone; now they're just generic horndog teenagers. Still, most fans of the series rate this one higher than Porky's II: The Next Day. --Bret Fetzer\n\nProduct Description\nGet ready for some intense underage action in this brand-new, balls-to-the-wall collection of the Porky's saga! The granddaddy franchise of guy comedies, these three uproariously unwholesome films changed the face of cinema to red as audiences across the world couldn't get enough of this young group of boys questing to become men, and taking no prisoners along the way. Porky's: One Size Fits All Edition Porky's is a sleazy strip club where a group of underage boys hope to find some action. But when the owner catches them and dumps them in the bay, the boys shift their goal from getting in... to getting revenge. Porky's 2: The Next Day The gang is back in another quest for vengeance! When Ms. Balbricker, aided by Reverend Bubba Flavel, pressures the school to shut down the teen troupe's Shakespearean production for being too &quot;obscene,&quot; the boys don't just get mad, they get even! Porky's Revenge When Meat picks up a buxom babe, the gang discovers that Porky's is back in business - and that the babe is Porky's daughter. But When Porky kidnaps Meat to force him into a shotgun wedding, the boys set out to save their friend and shut down Porky's for good.","torrent":{"xt":"urn:btih:bae7469cdcd8c29e8e1b8b372281e181a3cc5999","amp;dn":"Porky%27s+the+Ultimate+Collection+%281983%29+%5BH264+-+Eng+Ita+Aac+-+Mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bae7469cdcd8c29e8e1b8b372281e181a3cc5999","infoHashBuffer":{"type":"Buffer","data":[186,231,70,156,220,216,194,158,142,27,139,55,34,129,225,129,163,204,89,153]},"announce":[],"urlList":[]}}