{"title":"The Color of Pomegranates (1968) NTSC DVD5 ISO","uid":6302060,"size":4682907648,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:bb119144084866c17e4335f7078fbdb916ccac91&amp;dn=The+Color+of+Pomegranates+%281968%29+NTSC+DVD5+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"minOdroL","files":-1,"time":1302187361,"description":"IMDB............: http://www.imdb.com/title/tt0063555/\nRATiNG..........: 7.6/10 (494 votes)\nGENRE...........: Arthouse/Experimental\nRUNTiME.........: 73 min\nAUDiO...........: Mono\nSUBTiTLES.......: English, Spanish &amp; Italian ***CUSTOM SUBS***\nASPECT RATiO....: 1.33:1 Original Aspect Ratio\nDVD Source......: R2 Japan DVD\nDVD Format......: DVD5 (single-sided/single-layered)\nDVD Distribution: http://www.cdjapan.co.jp/detailview.html?KEY=COBM-5271\n\n\nThe work of painter, musician, mystic and filmmaker Sergei Paradjanov (1924-1990) constantly defies categorisation. His films are notable for their lyrical inspiration and great aesthetic beauty, but riled the Soviet authorities to such an extent that Paradjanov faced constant harrassment throughout his life. Like his earlier film, Shadows of Our Forgotten Ancestors (1965), The Colour of Pomegranates was banned...\nOstensibly a biopic of rebellious 18th century Armenian poet Sayat Nova, The Colour of Pomegranates follows the poet's path from his childhood wool-dying days to his role as a courtier and finally his life as a monk. But Armenian director Sergei Paradjanov warns us from the start that this is no ordinary biopic: &quot;This is not a true biography,&quot; he has his narrator state during the opening credits.\nIndeed it is not. With barely any dialogue, The Colour of Pomegranates depicts the poet's story through a series of extraordinary lyrical tableux set to his work - read by the narrator at the start of each new chapter of Sayat Nova's life. It's akin to visual choreography, with esoteric, intriguing and often unforgettable imagery...\nVivid and iconographic, the images interweave landscapes, costumes and music to form a metaphorical history of the Armenian nation and a tangible expression of its spirit, free from any Soviet ideological constraints of the time of its making.\n\n\nMenus..........: [x] Untouched, intact.\n\nVideo..........: [x] Untouched, intact.\n\nDVD-extras.....: [x] None.\n\nDVD-Audio......: [x] Untouched, intact.\n\n\nComments about the movie versions:\n\nThis rip has been made from the Japanese DVD, which offers tremendous advantages over the American Kino Video release in terms of image quality. The caveat, however, is that the version of the movie presented here may be not quite as close to Paradjanov's personal vision.\nIt is well known that Paradjanov was creating his art under unfavorable political and social circumstances of the totalitarian communism in Soviet Union. His affiliations with ethnic traditions and the religious motives of his works were sharply at odds with the unitarism and aggressive atheism of the government. This conflict has caused the existence of several distinct variants of the movie.\nThe version presented in the Kino Video release (which boasts to be the &quot;director's cut&quot;, even though it appears to be debatable) is the one that has been screened in Armenia and has not been approved for a country-wide distribution by the authorities. The movie has been re-edited in an attempt to make it more suitable to the Moscow's official tastes (even though I doubt it has been widely shown even after that), and it is this re-edited version that has made it to the Japanese DVD. The better preservation of the print is probably correlated with the degree of governmental approval.\n\nUseful links:\n &lt;a href=&quot;\nhttp://www.parajanov.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.parajanov.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.kamera.co.uk/reviews_extra/pomegran.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.kamera.co.uk/reviews_extra/pomegran.php&lt;/a&gt; &lt;a href=&quot;\nhttp://columbia.jp/dvd/titles/zakuro/story.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://columbia.jp/dvd/titles/zakuro/story.html&lt;/a&gt;\n\nThis release was requested by narb, and it wholeheartedly goes out to Helge79, for his dedication to the movie and for providing the source DVD, and to my friend Paolo (Devill) who handled the subs authoring.\n\n\nmany thanks to mikeattacks\n","torrent":{"xt":"urn:btih:bb119144084866c17e4335f7078fbdb916ccac91","amp;dn":"The+Color+of+Pomegranates+%281968%29+NTSC+DVD5+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb119144084866c17e4335f7078fbdb916ccac91","infoHashBuffer":{"type":"Buffer","data":[187,17,145,68,8,72,102,193,126,67,53,247,7,143,189,185,22,204,172,145]},"announce":[],"urlList":[]}}