{"title":"Pen and Parchment - Drawing in the Middle Ages (Art History Eboo","uid":10469750,"size":167308899,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb4acbd2ebcd61452466b0339f646118466be58a&amp;dn=Pen+and+Parchment+-+Drawing+in+the+Middle+Ages+%28Art+History+Eboo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1404243616,"description":"Melanie Holcomb, &quot;Pen and Parchment: Drawing in the Middle Ages&quot;\n2009 | English | PDF | 200 pages | 159.56 Mb\n\nThe subject is explored in text that will enlighten the general reader and scholar alike. Melanie Holcomb's essay is devoted to the history, aesthetics, and uses of medieval drawings, subjects developed further by Dr. Holcomb and thirteen other experts in forty-nine entries that treat the works in the exhibition. The essay takes a chronological tour through the Western Middle Ages, examining drawings made in settings as diverse as ninth-century monastic scriptoria and the fourteenth-century French court. The authors discuss the pervasive and persistent taste for drawing in the Middle Ages, focusing on several areas at moments when drawing was a particularly favored medium, such as Carolingian Europe, Anglo-Saxon England, and twelfth-century Regensburg and Salzburg.\n\nThe draftsmen responsible for these drawings were primarily anonymous, yet a surprising number of medieval artists are known by name. Among them the authors consider Saint Dunstan, the tenth-century abbot and archbishop of Canterbury as well as an artist; Matthew Paris, who contributed both texts and page after page of illustrations to the Chronica Majora during the thirteenth century; the strange fourteenth-century cleric Opicinis, who, upon recovering from a grave and mysterious illness, began to draw the visions he believed were sent by God.","torrent":{"xt":"urn:btih:bb4acbd2ebcd61452466b0339f646118466be58a","amp;dn":"Pen+and+Parchment+-+Drawing+in+the+Middle+Ages+%28Art+History+Eboo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb4acbd2ebcd61452466b0339f646118466be58a","infoHashBuffer":{"type":"Buffer","data":[187,74,203,210,235,205,97,69,36,102,176,51,159,100,97,24,70,107,229,138]},"announce":[],"urlList":[]}}