{"title":"Rebuild 3 Beta","uid":10166724,"size":61001710,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bb6f590d16b1a2e9dcd8ac28763fcdda15b9edbe&amp;dn=Rebuild+3+Beta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Rafeweisz","files":1,"time":1400349229,"description":"Rebuild 3 is a flash game where you have to take the role of the human leader and help our race survive the zombie infestation. Do you have what it takes to give orders and keep everyone alive?\n\nFirst, you will have to place the right people in the right places and hope that the night will be uneventful. After that, you will need to start taking over the city piece by piece, but this means that you will have to fight against zombies. You might be lucky enough to encounter other survivors, but if you don't, you will have to make sure that your people stay alive. Move from spot to spot and try to rely on your management skills if you want to rebuild the city with a minimum number of causalities Rebuild 3 is not an easy game and the hordes of zombies will be ruthless. The only way to stay safe is by protecting your parts of the city and by gathering enough resources along the way. You can relocate people during the day and when you're ready, you can wait for the night to pass and see how many people will be left when the sun rises.\n\nRebuild 3 is a very complex and realistic strategy game. It will show you exactly what are your chances of survival in the case of a zombie apocalypse, so try your best to see if you will manage to kill the infected and take back your town once and for all.\n","torrent":{"xt":"urn:btih:bb6f590d16b1a2e9dcd8ac28763fcdda15b9edbe","amp;dn":"Rebuild+3+Beta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb6f590d16b1a2e9dcd8ac28763fcdda15b9edbe","infoHashBuffer":{"type":"Buffer","data":[187,111,89,13,22,177,162,233,220,216,172,40,118,63,205,218,21,185,237,190]},"announce":[],"urlList":[]}}