{"title":"Mavis Beacon Teaches Typing Platinum 20","uid":5432433,"size":101469073,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bb861921847cef91073502e4997c427e2180e26c&amp;dn=Mavis+Beacon+Teaches+Typing+Platinum+20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"nightstalker666","files":1,"time":1268476692,"description":"Mavis Beacon Teaches Typing Platinum 20\n\n    * Minimum Requirements\n    * Windows Vista and XP SP2\n    * 128 MB RAM / 512MB RAM (Vista)\n    * Pentium III 700 MHz or higher\n    * 300 MB free hard disk space\n    * 32 MB graphics card\n    * 24-bit colour monitor, 1024x768 resolution\n    * CD/DVD-ROM drive\n    * Windows compatible sound card\n    * Windows compatible mouse\n    * Mac System Requirements:\n    * OS 10.4 and later\n    * 256 MB RAM\n    * PowerPC G4, G5 and Intel 800 MHz or faster\n    * 300 MB free hard disk space\n    * 32 MB graphics card\n    * 24-bit colour monitor, 1024x768 resolution\n    * CD/DVD-ROM drive\n    * Main Specification:\n    * Adaptive Response Technology - maximise improvements in the shortest time possible\n    * Practice Area. Select from hundreds of subjects including literary classics, history &amp; poetry\n    * Custom Lesson Designer. Create Standard Lessons, Speed Tests or even Games using the text of your choice\n    * Typing Games, designed to improve your typing speed, accuracy and/or rhythm\n    * Progress Tracking &amp; Reporting - view reports so you can understand and review your progress\n    * Features for Kids and Teens -16 fun &amp; challenging games to keep kids motivated\n    * This information is based on specifications supplied by manufacturers and should be used for guidance only.\n\nDescription\t\n\n \n\nType Better - Email Faster - Work Smarter!\n\nWith a complete re-design, Mavis Beacon Tea0ches Typing Platinum 20 may not look familiar, but we promise that Mavis Beacon continues to deliver the same level of excellence when it comes to typing instruction and practice.\n\nMavis Beacon's unrivalled training program is guaranteed to improve your typing in no time at all, making it the ideal solution for:\n\nProfessionals\nHome users\nStudents ages 8 &amp; up\nEmployment Agencies\nSmall Businesses and Corporations\nAnyone else hoping to improve their typing skills\n\nMavis Beacon Teaches Typing Platinum 20 is all new!\nWith an all-new user interface and re-designed features and functionality, we've done what we didn't think was possible - we've made Mavis Beacon Teaches Typing even better!\n\nHere are just some of the improvements we've made to the leading typing instruction program available\n\nCore Curriculum Improvements\nWhile the core curriculum within Mavis Beacon remains as effective as ever, we've introduced a Curriculum Map to make it easier for users to see where they are in the overall training program.\n\nNew Games\nMavis Beacon's 2 brand new games and 14 re-designed games will all contribute to your typing experience, providing you with fun challenges while you practice.\n\nEnhanced Language Options\nMavis Beacon Teaches Typing Platinum 20 offers enhanced language options. With a Spanish mode, both Spanish- and English-language learners can get more out of Mavis Beacon's award-winning curriculum.\n\nKey Features:\n\nDynamic Personal Instruction - Leverage Mavis Beacon's renowned Adaptive Response Technology to run through the core training curriculum and maximise your improvements in the shortest time possible. Mavis Beacon will automatically place you in the lessons based on your current skill level and adjust your path as you progress through the training program.\n\nPractice Area - Mavis Beacon lets you choose what you use to practice your typing. Select from hundreds of articles &amp; passages covering a wide variety of topics and subjects including literary classics, history, autobiographies &amp; poetry. There is plenty of relevant content for all ages, including passages that are great for kids, but Mavis Beacon gives users infinite possibilities with the Import Your Own Text function.\n\nCustom Lesson Designer - Use your own imported text or leverage Mavis Beacon's library to build your own Custom Lessons. Create Standard Lessons, Speed Tests or even Games using the text of your choice and set up each lesson's limits and goals.\n\nTyping Games - With a total of 16 challenging games designed to improve your typing speed, accuracy and/or rhythm, the Typing Games are sure to help you improve and you'll have fun while you're doing it.\n\nProgress Tracking &amp; Reporting - Mavis Beacon tracks your performance over time and provides a series of reports so that you can understand and review your progress.\n\na) The Summary report gives a snapshot of the users' cumulative performance.\n\nb) Keyboard Proficiencies show detailed performance by individual key, allowing users to see on which keys they need improvement.\n\nc) The &quot;Curriculum Map&quot; provides users with a view of where they are within the Mavis Beacon Training Program.\n\nd) &quot;Progress Over Time&quot; charts users' performance on milestone lessons over an extended period, giving users a view of how much they have improved.\n\nSpanish Mode - In Spanish Mode, Mavis Beacon Teaches Typing presents help, reports and more in Spanish.\n\nPractice Lessons in French &amp; Spanish - In the Practice Area, users can elect to practice their typing skills using French or Spanish content. With excerpts from classic stories and literature, language learners can brush up on their language skills while improving their typing\n\nDisconnect from the internet install then follow on screen instructions \n\nScanned clean with trend micro 2010 malwarebytes and zone alarm\n\nI take no credit for creating this just reupping it as i thought it may be of use to someone.\n\nIf you dont trust DONT download and always scan downloaded files with your antivirus\n\nPlease SEED and enjoy","torrent":{"xt":"urn:btih:bb861921847cef91073502e4997c427e2180e26c","amp;dn":"Mavis+Beacon+Teaches+Typing+Platinum+20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb861921847cef91073502e4997c427e2180e26c","infoHashBuffer":{"type":"Buffer","data":[187,134,25,33,132,124,239,145,7,53,2,228,153,124,66,126,33,128,226,108]},"announce":[],"urlList":[]}}