{"title":"What We Talk About When We Talk About Clon (2016) Gooner","uid":15803644,"size":22638960,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bba36e8f312e9b28d57769bd206ae2a385318eb4&amp;dn=What+We+Talk+About+When+We+Talk+About+Clon+%282016%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1473543602,"description":"What We Talk About When We Talk About Clone Club (2016) (Pdf) Gooner\r\n\r\nPublisher: Smart Pop (14 April 2016)\r\nLanguage: English\r\nISBN-10: 1942952341\r\nISBN-13: 978-1942952343\r\n\r\nWhat is the real-world history and science of human cloning, and does Orphan Black get it right? Can you &quot;own&quot; a person--even a cloned one? How can Sarah Manning be straight, Cosima gay, and Tony trans? Cult hit sci-fi show Orphan Black doesn't just entertain--it also raises fascinating questions about human cloning, its ethics, and its impact on personal identity. In What We Talk About When We Talk About Clone Club: Bioethics and Philosophy in Orphan Black, prominent bioethicist Gregory E. Pence violates Clone Club's first rule to take us deeper into the show and its connections to the real world, including: Widespread myths about human clones (and Orphan Black's rejection of them) Our ugly history of eugenics The ethics of human experimentation, by way of Projects Castor and Leda What we can learn about clones and identity from twin studies and tensions among Orphan Black's clone &quot;sisters&quot; Kendall Malone and other genetic anomalies The brave new world of genetic enhancement and clonal dynasties, and how Helena and Kira Manning fit in In the process, What We Talk About When We Talk About Clone Club reveals why Orphan Black is some of today's most engaging and thought-provoking television","torrent":{"xt":"urn:btih:bba36e8f312e9b28d57769bd206ae2a385318eb4","amp;dn":"What+We+Talk+About+When+We+Talk+About+Clon+%282016%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bba36e8f312e9b28d57769bd206ae2a385318eb4","infoHashBuffer":{"type":"Buffer","data":[187,163,110,143,49,46,155,40,213,119,105,189,32,106,226,163,133,49,142,180]},"announce":[],"urlList":[]}}