{"title":"HTML5 and CSS3 Pragmatic (2013)","uid":9203993,"size":14903154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bd0bbe8013a71d7ce881ac920edec06450bd1eb7&amp;dn=HTML5+and+CSS3+Pragmatic+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1384649499,"description":"HTML5 and CSS3: Level Up with Today's Web Technologies \n\nBook Details:\n\nPages: 300 \nPublisher: Pragmatic Bookshelf; 2nd Edition (October 2013)\nLanguage: English\nISBN-10: 1937785599\nISBN-13: 978-1937785598\nFormat: PDF, EPUB\n\nBook Description:\n\nHTML5 and CSS3 power todays web applications, with semantic markup, better forms, native multimedia, animations, and powerful APIs. You will get hands-on with all the new features with practical example projects, and find what you need quickly with this books modular structure. -Falling Back- sections show you how to create solutions for older browsers, and -The Future- sections at the end of each chapter get you excited about the possibilities when features mature.\n\nThis revised second edition walks you through new features such as IndexedDB, CSS Animations, SVG, and more, along with updated fallback solutions. You will use HTML5s new markup to create better structure for your content and better interfaces for your forms. You will work with new form controls and validations, and build interfaces that are accessible to assistive technology and mobile devices. You will draw with the Canvas and SVG, do simple animations with pure CSS, work with advanced CSS selectors, and make audio and video play natively.\n\nYou will bring your web apps to the next level as you use Web Storage and IndexedDB to save data on the client and make applications available offline. And you will discover how to use web sockets, geolocation, cross-document messaging, and the History API to create even more interactive applications.\n\nToday, you have the flexibility that used to be only available through large JavaScript libraries or proprietary plugins. Get ready for todays web.\n\nWhat you need:\n\nYou will need the latest versions of Google Chrome, Firefox, Opera, and Internet Explorer, along with a text editor with good support for HTML5 and CSS3 syntax. Instructions for testing on older versions of Internet Explorer are included in the book.\n\nTable of Contents:\n\nChapter 1. An Overview of HTML5 and CSS3\n\nPart I: Improving User Interfaces\nChapter 2. New Structural Tags and Attributes\nChapter 3. Creating User-Friendly Web Forms\nChapter 4. Styling Content and Interfaces\nChapter 5. Making Accessible Interfaces\n\nPart II: New Sights and Sounds\nChapter 6. Drawing in the Browser\nChapter 7. Embedding Audio and Video\nChapter 8. Eye Candy\n\nPart III: Beyond Markup\nChapter 9. Saving Data on the Client\nChapter 10. Creating Interactive Web Applications\nChapter 11. Where to Go Next\n\nAppendix A1. Features Quick Reference\nAppendix A2. jQuery Primer\nAppendix A3. Encoding Audio and Video for the Web\nAppendix A4. Resources\n","torrent":{"xt":"urn:btih:bd0bbe8013a71d7ce881ac920edec06450bd1eb7","amp;dn":"HTML5+and+CSS3+Pragmatic+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd0bbe8013a71d7ce881ac920edec06450bd1eb7","infoHashBuffer":{"type":"Buffer","data":[189,11,190,128,19,167,29,124,232,129,172,146,14,222,192,100,80,189,30,183]},"announce":[],"urlList":[]}}