{"title":"Basic Principles of Drug Discovery and Development [PDF][StormRG","uid":11890315,"size":7716089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be369a8c450e2075ea5e08e508f13a8e24e0cfe0&amp;dn=Basic+Principles+of+Drug+Discovery+and+Development+%5BPDF%5D%5BStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"0xmovva","files":2,"time":1430977705,"description":"TITLE/EDITION Basic Principles of Drug Discovery and Development \nBy: Benjamin Blass\nPaperback: 580 pages\nPublisher: Academic Press; 1 edition (May 11, 2015)\nLanguage: English\nISBN-10: 012411508X\nISBN-13: 978-0124115088\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nBasic Principles of Drug Discovery and Development presents the multifaceted process of identifying a new drug in the modern era, providing comprehensive explanations of enabling technologies such as high throughput screening, structure based drug design, molecular modeling, pharmaceutical profiling, and translational medicine, all areas that have become critical steps in the successful development of marketable therapeutics.\n\nThe text introduces the fundamental principles of drug discovery and development, also discussing important drug targets by class, in vitro screening methods, medicinal chemistry strategies in drug design, principles in pharmacokinetics and pharmacodynamics, animal models of disease states, clinical trial basics, and selected business aspects of the drug discovery process. It is designed to enable new scientists to rapidly understand the key fundamentals of drug discovery, including pharmacokinetics, toxicology, and intellectual property.&quot;\n\nProvides a clear explanation of how the pharmaceutical industry works\nExplains the complete drug discovery process, from obtaining a lead, to testing the bioactivity, to producing the drug, and protecting the intellectual propertyIdeal for anyone interested in learning about the drug discovery process and those contemplating careers in the industry\nExplains the transition process from academia or other industries","torrent":{"xt":"urn:btih:be369a8c450e2075ea5e08e508f13a8e24e0cfe0","amp;dn":"Basic+Principles+of+Drug+Discovery+and+Development+%5BPDF%5D%5BStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be369a8c450e2075ea5e08e508f13a8e24e0cfe0","infoHashBuffer":{"type":"Buffer","data":[190,54,154,140,69,14,32,117,234,94,8,229,8,241,58,142,36,224,207,224]},"announce":[],"urlList":[]}}