{"title":"[MomsTeachSebilesNetwork] Alexis Fawx, Brittany Shae (Stepmo","uid":15733552,"size":524407235,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:be5187d46276ba972e977d6b842df41ef19f456c&amp;dn=%5BMomsTeachSebilesNetwork%5D+Alexis+Fawx%2C+Brittany+Shae+%28Stepmo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"distinc","files":3,"time":1472813946,"description":"[MomsTeachSex NubilesNetwork] Alexis Fawx, Brittany Shae (Stepmom Squirts On Horny Teen) (2016)\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=4627297367\r\n \nhttp://imagedisco.net/?g=6746727535\r\n\r\nAlexis Fawx, Brittany Shae\r\n\r\nTags:\r\n\r\nBig Boobs, Brunette, Blonde, Long hair, Hardcore, Lesbian, Milf, Girl-Girl-Boy, Blowjob, Facesitting, Pussy Licking, Cowgirl, Reverse cowgirl, Missionary, Doggystyle, Squirting \r\n\r\nChad White is hanging out with Brittany Shae, his girlfriend's stepdaughter, who is coming on strong even though he's not terribly interested. Alexis Fawx catches Brittany in the act and decides to teach Brittany a lesson by having Chad fuck her. Brittany isn't thrilled with the idea of her stepmom watching, but she soon warms to it as she gets to strokes and suck Chad's hard cock.\r\n\r\nAlexis is excellent at ordering her stepdaughter around, but things really heat up as she starts to lose her clothes and get in on the action as well. Spanking Brittany is foreplay for the blonde milf as she urges Chad to fuck Brittany hard and fast. Bending Brittany's head back, Alexis positions her landing strip fuck hole so that her stepdaughter can go to town feasting on her pussy.\r\n\r\nAlexis gets all of Chad's attention next as she enjoys a doggy style pounding that's so hard it makes her huge tits sway. After watching Brittany ride her boyfriend with a critical eye, Alexis shows her stepdaughter how it's done riding his dick until she covers her two lovers in pussy juices from her squirting climax. Chad isn't far behind, filling Alexis's snatch with a creampie of cum that Brittany happily licks clean","torrent":{"xt":"urn:btih:be5187d46276ba972e977d6b842df41ef19f456c","amp;dn":"%5BMomsTeachSebilesNetwork%5D+Alexis+Fawx%2C+Brittany+Shae+%28Stepmo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be5187d46276ba972e977d6b842df41ef19f456c","infoHashBuffer":{"type":"Buffer","data":[190,81,135,212,98,118,186,151,46,151,125,107,132,45,244,30,241,159,69,108]},"announce":[],"urlList":[]}}