{"title":"The Sims 4 RELOADED update ver 1.4.83.1010 + DLC's Mr DJ","uid":11699872,"size":1290999160,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:be7342203fb8fe64465cf944b0e14a0a9caf4061&amp;dn=The+Sims+4+RELOADED+update+ver+1.4.83.1010+%2B+DLC%27s+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"rock840","files":4,"time":1423897316,"description":"The Sims 4 RELOADED update version 1.4.83.1010 + ALL DLC's...\n\nThis is meant for those who have my &quot;The Sims 4 repack Mr DJ&quot; and &quot;Sims 4 update version 1.0.732.2 &quot;: &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/11022192/The_Sims_4_glitch_free_dlc_s_unlocked[Origin]_Multi17_repack_Mr_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/11022192/The_Sims_4_glitch_free_dlc_s_unlocked[Origin]_Multi17_repack_Mr_&lt;/a&gt;\nand &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/11255083/The_Sims_4_RELOADED_update_4___NO_ORIGIN_crack__Mr_DJ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/11255083/The_Sims_4_RELOADED_update_4___NO_ORIGIN_crack__Mr_DJ&lt;/a&gt;\nOR\nIf u have The Sims 4 RELOADED\nOR\nIf u have any other release apart from RELOADED, just make sure it's atleast or above update version 1.0.732.20 (1.0.797.20 or 1.2.16.10 OR 1.3.32.1010)......\n\nRead 'Change Log' textfile to read the change log ....\n\nLatest update with DLC included. We included the free Holiday Celebration Pack as well as\nThe Outdoors DLC this time\n\nExplore the Outdoors\nNew surprises await your Sims out in the wilderness. Explore the all-new\ndestination of Granite Falls, where your Sims can go camping, sing songs or\ntell ghost stories around the campfire, and enjoy all sorts of new activities\n\nExplore the All-new Destination of Granite Falls\nYour Sims can escape from their everyday lives into the pine-filled air of\nGranite Falls. Lay back for a night of stargazing and let your Sims\nimaginations run wild, or join a game of horseshoes to unwind with some\nfriendly competition. Alternatively, find out what adventure awaits within\nthe nearby bramble patch. There are tons of things to do in Granite Falls\n\nSet Up the Perfect Camp\nNo camping trip is complete without the proper supplies. Be sure to outfit\nyour Sims with a tent and new hiking gear. Treat your Sims to some roasted\nmarshmallows and share fireside stories of adventure, wonder\nand fright with the gang\n\nCreate Exotic Potions as an Herbalist\nBuild your Sims herbalism skill to create a variety of useful potions,\nranging from insect repellent to a concoction that can help soothe a tense\nSim. This new skill will be useful to help Sims identify which wild plants\nare edible or poisonous\n\nUpdate v1.4.83.1010\n\nGenealogy is here Explore the lineage of your Sims, their names, faces, and\nrelationships Remember who they are to one another\n\nIn addition to traveling through the lineage of your Sims, with this update\nyou can now dress up Grandma Betty in some new Valentines clothing, or just\nhang around with a gnome and a bear\n\n\nINSTALL INSTRUCTIONS:\n\n 1. DISABLE YOUR ANTIVIRUS BEFORE RUNNING 'Setup' ....\n 2. INSTALL IT TO THE SAME LOCATION WHERE YOU HAVE INSTALLED THE SIMS 4 (REMOVE THE DEFAULT DIRECTORY THAT IS SPECIFIED IN THE INSTALLER , CLICK ON BROWSE AND SPECIFY THE DIRECTORY WHERE U HAVE INSTALLED YOUR SIMS 4) ...\n 3. ADD THE SIMS 4 GAME FOLDER TO THE EXCLUSION/EXCEPTION LIST OF YOUR ANTIVIRUS OTHERWISE YOUR ANTIVIRUS WILL CHANGE THE 'TS4.exe' FILE INTO A TEMPORARY FILE OR JUST DELETE IT WHICH WON'T LET THE GAME TO RUN, AFTER THIS STEP, U CAN ENABLE YOUR ANTIVIRUS....\n\nIF U HAVE ALREADY CREATED AN EXCEPTION FOR IT THEN IGNORE STEP 3...\n\n TIPS: \n\n -IF AFTER UPDATE , U DON'T FIND 'TS4.exe' , THEN IT MEANS YOUR ANTIVIRUS HAS BLOCKED IT, RESTORE IT FROM ANTIVIRUS QUARANTINE ZONE OR REINSTALL UPDATE WITH ANTIVIRUS DISABLED. (WINDOWS DEFENDER IS THE DEFAULT ANTIVIRUS)....\n\n -MAKE SURE BOTH VISUAL C++ ARE INSTALLED TO AVOID ANY MVS.dll ERROR OR rld.dll ERROR....\n\n -IF U GET AN ERROR MESSAGE STATING THAT THE GAME DATA IS MISSING, THEN IT MEANS U HAVE INSTALLED THE UPDATE IN THE WRONG LOCATION ...\n\n -IF U GET AN INITIALISATION FAILED ERROR, THEN IT MEANS U R MISSING NECESSARY PREVIOUS UPDATE AS ALREADY STATED , ATLEAST OR ABOVE UPDATE VERSION 1.0.732.20 IS REQUIRED.....\n\n -IF SOME DLC'S ARE MISSING , COMPLETELY EXIT ORIGIN AND THEN PLAY THE GAME ....\n\nJUST DO EVERYTHING LIKE U DID FOR THE PREVIOUS UPDATE :) , OPEN THE GAME FROM 'TS4.exe' FROM GAME DIRECTORY OR THE DESKTOP SHORTCUT ...\n\nALWAYS OPEN THE GAME USING 'Run as administrator' TO AVOID ANY CRASH....\n\nALL CREDIT GOES TO RELOADED FOR THE HARD WORK....\n\nIF U R STILL UNABLE TO GET IT WORKING, INBOX ME AT KICKASS OR ON MY FACEBOOK PAGE ....\n\nCheck out my Official facebook page for any help &quot;Mr DJ repacks&quot; \nLike it guys to support and get updates on upcoming repacks, gaming tips and requests","torrent":{"xt":"urn:btih:be7342203fb8fe64465cf944b0e14a0a9caf4061","amp;dn":"The+Sims+4+RELOADED+update+ver+1.4.83.1010+%2B+DLC%27s+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be7342203fb8fe64465cf944b0e14a0a9caf4061","infoHashBuffer":{"type":"Buffer","data":[190,115,66,32,63,184,254,100,70,92,249,68,176,225,74,10,156,175,64,97]},"announce":[],"urlList":[]}}