{"title":"King Vidor - The Crowd [1928]","uid":5249416,"size":1291704032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bea4bbb6162f538b2b83208aa59f941521e60112&amp;dn=King+Vidor+-+The+Crowd+%5B1928%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"mfccorrea","files":3,"time":1262270650,"description":"As was the case with every film project that he cared deeply about, filmmaker King Vidor had to fight long and hard with his studio bosses to get The Crowd produced. Though Vidor's parent studio MGM was certain that this simple story of everyday people would take a bath at the box-office, the film earned back twice its cost. The story concentrates on John Sims, brilliantly played by James Murray, an extra boosted to stardom by Vidor. Born on the fourth of July in the year 1900, John convinced that he's destined to be a man of importance. 27 years later, however, Sims is merely one of the faceless crowd, an underpaid clerk in a huge New York office building. On a blind date, John meets Mary (Eleanor Boardman), a likeable if not overly attractive young lady (Boardman, the wife of director Vidor, balked at the notion of departing from her usual glamorous roles; Vidor prevailed, and as a result the actress delivered what is now considered her finest performance). John and Mary are eventually married, raising two children in their tiny New York tenement (complete with a balky toilet-the first time that this particular bathroom fixture ever appeared in an American film). As John's dreams of glory go unfulfilled, he becomes bitter and argumentative, while Mary grows old before her time. Just when John wins $500 in a slogan contest, tragedy strikes unexpectedly when the Sims' youngest child is killed in a traffic accident. Haunted by the memory of his child, John is unable to function properly at his job, and is soon fired. In despair, Sims contemplates suicide, only to be shaken back to reality by his son, who, oblivious to John's grief and disillusionment, declares proudly that he wants to be just like his daddy when he grows up. By chance, John gets a job as a street huckster for a local department store. Though both John and Mary know that this &quot;triumph&quot; is transitory, at least the family is together again, and at least they're reasonably happy. As the camera pulls back, back, back in a packed movie theatre, we leave John Sims just where we found him-one of The Crowd. At the behest of MGM, Vidor reluctantly filmed an idiotic alternate ending, wherein the Sims family, having inherited a fortune, are seen living in the lap of luxury. This finale was hooted off the screen wherever it was shown; thus, current prints of the film contain Vidor's original, ambivalent ending. A deceptively &quot;small&quot; film, The Crowd was assembled on as large a budget and with as much production polish as any &quot;big&quot; MGM picture. In 1934, Vidor produced a sequel with his own funds, Our Daily Bread. Alas, James Murray, the actor catapulted to the Big Time in The Crowd, was not a part of the project. A headstrong, irresponsible man, Murray had squandered the chance offered him by Vidor, and had descended into drunken dereliction. Unlike the hero in The Crowd, there was no one to pull James Murray back when, in 1936, he fell off a pier and drowned. \n\n   General\n      Complete name : The Crowd.avi\n      Format : AVI\n      Format/Info : Audio Video Interleave\n      File size : 1.20 GiB\n      Duration : 1h 43mn\n      Overall bit rate : 1 667 Kbps\n      Writing application : FairUse Wizard - http://fairusewizard.com\n      Writing library : The best and REALLY easy backup tool\n   Video #0\n      ID : 0\n      Format : MPEG-4 Visual\n      Format profile : AdvancedSimple@L5\n      Format settings, BVOP : Yes\n      Format settings, QPel : No\n      Format settings, GMC : No warppoints\n      Format settings, Matrix : Default (MPEG)\n      Muxing mode : Packed bitstream\n      Codec ID : XVID\n      Codec ID/Hint : XviD\n      Duration : 1h 43mn\n      Bit rate : 1 527 Kbps\n      Width : 608 pixels\n      Height : 448 pixels\n      Display aspect ratio : 4:3\n      Frame rate : 29.970 fps\n      Resolution : 24 bits\n      Colorimetry : 4:2:0\n      Scan type : Progressive\n      Bits/(Pixel*Frame) : 0.187\n      Stream size : 1.10 GiB (92%)\n      Writing library : XviD 1.2.0.dev47 (UTC 2006-11-01)\n   Audio #1\n      ID : 1\n      Format : MPEG Audio\n      Format version : Version 1\n      Format profile : Layer 3\n      Codec ID : 55\n      Codec ID/Hint : MP3\n      Duration : 1h 43mn\n      Bit rate mode : Constant\n      Bit rate : 128 Kbps\n      Channel(s) : 2 channels\n      Sampling rate : 48.0 KHz\n      Resolution : 16 bits\n      Stream size : 94.6 MiB (8%)\n      Alignment : Aligned on interleaves\n      Interleave, duration : 33 ms (1.00 video frame)\n      Interleave, preload duration : 504 ms\n      Writing library : LAME3.97 \n      Encoding settings : -m j -V 4 -q 2 -lowpass 17 -b 128\n\nIMDB: tt0018806\n\nSilent with English intertitles; Spanish and Portuguese subtitles\n\nMy rip of a Chinese DVD","torrent":{"xt":"urn:btih:bea4bbb6162f538b2b83208aa59f941521e60112","amp;dn":"King+Vidor+-+The+Crowd+%5B1928%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bea4bbb6162f538b2b83208aa59f941521e60112","infoHashBuffer":{"type":"Buffer","data":[190,164,187,182,22,47,83,139,43,131,32,138,165,159,148,21,33,230,1,18]},"announce":[],"urlList":[]}}