{"title":"Cocaine Politics - Peter Dale Scott","uid":11717628,"size":7707176,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:beb7b8594e8195e1dcce49bc833171ff2e35fc3c&amp;dn=Cocaine+Politics+-+Peter+Dale+Scott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"starxteel","files":1,"time":1424660069,"description":"\n\nWhen the San Jose Mercury News ran a controversial series of stories in 1996 on the relationship between the CIA, the Contras, and crack, they reignited the issue of the intelligence agency's connections to drug trafficking, initially brought to light during the Vietnam War and then again by the Iran-Contra affair. Broad in scope and extensively documented, Cocaine Politics shows that under the cover of national security and covert operations, the U.S. government has repeatedly collaborated with and protected major international drug traffickers. A new preface discusses developments of the last six years, including the Mercury News stories and the public reaction they provoked.\n\n\nAbout the author:\nPeter Dale Scott is Professor of English Emeritus at the University of California, Berkeley, and the author of Deep Politics and the Death of JFK (California, 1993). Scott is also a poet: in 2002, his &quot;Seculum&quot; trilogy won a Lannan Literary Award. Jonathan Marshall is the Economics Editor of the San Francisco Chronicle and the author of To Have and Have Not: Southeast Asian Raw Materials and the Origins of the Pacific War (California, 1995)","torrent":{"xt":"urn:btih:beb7b8594e8195e1dcce49bc833171ff2e35fc3c","amp;dn":"Cocaine+Politics+-+Peter+Dale+Scott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beb7b8594e8195e1dcce49bc833171ff2e35fc3c","infoHashBuffer":{"type":"Buffer","data":[190,183,184,89,78,129,149,225,220,206,73,188,131,49,113,255,46,53,252,60]},"announce":[],"urlList":[]}}