{"title":"Black Sabbath - The Best of... 80 - 90  2015 320ak","uid":12183540,"size":235981555,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bee4f6725109e5f425e26fb6298e4567fb45e87b&amp;dn=Black+Sabbath+-+The+Best+of...+80+-+90++2015+320ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":1,"uploader":"analogkid6103","files":20,"time":1438505662,"description":"Black Sabbath - Best Of 1980 - 1990\n2015 \t\n\nMetal Heavy\n\nCD Compilation\n\nDeluxe Edition\n1979-80: Tony Iommi / Bill Ward / Geezer Butler / Ronnie James Dio\n \nAfter spending an extended period fruitlessly trying to come up with ideas for their next record, the band parted ways with Osbourne, hiring new vocalist Ronnie James Dio for what would become the 'Heaven and Hell' sessions. But while Osbourne's inability to function due to substance abuse had been a factor in his termination, he was far from the only member of Sabbath who'd lost touch with his muse; in fact, bassist Geezer Butler missed a major portion of the recording sessions and was nearly replaced with Geoff Nicholls (who ultimately became the band's longtime keyboard player) and/or former Rainbow bassist Craig Gruber. Still, in spite of all the behind-the-scenes turmoil, 'Heaven and Hell' proved a commercial comeback for the band, breaking the Top 40 and quickly going gold.\n\n1980-82: Tony Iommi / Geezer Butler / Ronnie James Dio / Vinny Appice\n  \n\nFollowing the release of 'Heaven and Hell,' Ward was the next to go, quitting during the subsequent promotional tour. He was replaced by drummer Vinny Appice, who stuck around long enough to contribute to the group's tenth album, 1981's 'Mob Rules,' and the live LP spun off from the tour, 'Live Evil.' But by the time 'Evil' came out in December of 1982, Dio had already quit over personal conflicts with Iommi and Butler, taking Appice with him to start his own band.\n\n1982-83: Tony Iommi / Geezer Butler / Bill Ward / Ian Gillan\n \n \nWith Ward getting sober and Dio and Appice out of the lineup, Iommi and Butler decided to forge ahead with a new singer and a new band name -- although ultimately, label pressure to continue under the Black Sabbath banner meant they only managed to get as far as finding a new vocalist: former Deep Purple frontman Ian Gillan, who joined the group for the sessions that produced 1983's 'Born Again' album. The latest change was too much for some critics and fans, but the record was enough of a hit to break the American Top 40 and spawn a worldwide tour -- although Ward left before the band hit the road, replaced by ex-ELO drummer Bev Bevan, and by the time the tour was over, Gillan quit to rejoin Deep Purple, leaving Sabbath at loose ends once more.\n\n\n1984: Tony Iommi / Geezer Butler / David Donato\n \n \nFollowing Gillan's exit, Iommi and Butler recruited unknown singer David Donato to front the next incarnation of Sabbath, and spent most of 1984 writing and recording -- but by the end of the year, Butler quit too, and Iommi decided to put the band on hiatus to pursue a solo career.\n\n1986: Tony Iommi / Glenn Hughes / Dave Spitz / Eric Singer / Geoff Nicholls\n \n \nBlack Sabbath re-emerged in 1986 with the 'Seventh Star' album, which boasted a slicker, more radio-friendly sound that didn't have much in common with the Sabbath fans remembered -- and for good reason, as it was originally intended to mark Iommi's solo debut. Pressured by the label to revive the Sabbath brand, Iommi credited 'Seventh Star' to 'Black Sabbath featuring Tony Iommi,' but that didn't help soothe annoyed fans -- or keep new vocalist Glenn Hughes from leaving the band on the eve of the tour, forcing Iommi to find a last-minute replacement with yet another new vocalist, Ray Gillen. Needless to say, all the turbulence didn't help record or ticket sales.\n\n1986-87: Tony Iommi / Eric Singer / Bob Daisley / Geoff Nicholls / Tony Martin\n\nThe Eternal Idol' obviously didn't capture Sabbath at a creative peak, but it's at least noteworthy for marking the first appearance of Martin, who'd bring some much-needed stability to Sabbath's lead singer position over the following decade.\n\n1988-89: Tony Iommi / Geoff Nicholls / Tony Martin / Cozy Powell / Laurence Cottle\n\nThe end result, 1989's 'Headless Cross' LP, was another poor seller for the band -- a situation not helped by distribution problems with their new label, IRS Records -- and the promotional tour, featuring new bassist Neil Murray, had to be canceled after only a handful of dates.\n\n1990: Tony Iommi / Geoff Nicholls / Tony Martin / Cozy Powell / Neil Murray\n \n \n\nIn a rare display of consistency for this era of Sabbath, the lineup that toured behind 'Headless Cross' stayed intact for the follow-up, 1990's 'Tyr.' In spite of the relative harmony behind the scenes -- and the inclusion of the power ballad single 'Feels Good to Me' -- 'Tyr' didn't spark an upswing in the band's commercial fortunes, failing to crack the Billboard Top 200 albums chart and moving a relative handful of units in Europe. After Sabbath were forced to cut another tour short due to poor ticket sales, it was obvious something needed to change.\n\n\n\n    Neon Knights\n    Heaven And Hell\n    The Mob Rules\n    The Sign Of The Southern Cross\n    Digital Bitch\n    Born Again\n    In For The Kill\n    Turn To Stone\n    Danger Zone\n    Heart Like A Wheel\n    Hard Life To Live\n    Born To Lose\n    Lost Forever\n    The Eternal Idol\n    Headless Cross\n    The Law Maker\n    Heaven in Black\n    The Sabbath Stones\n    Feels Good To Me\n\nSomehow they were able to survive and even made a few decent songs\n\n\nNow, if you like the music go to the shows and buy the merch,Want the CD buy it from the bands webpage (NOT wal-mart) that money goes to the artists not to anyone else","torrent":{"xt":"urn:btih:bee4f6725109e5f425e26fb6298e4567fb45e87b","amp;dn":"Black+Sabbath+-+The+Best+of...+80+-+90++2015+320ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bee4f6725109e5f425e26fb6298e4567fb45e87b","infoHashBuffer":{"type":"Buffer","data":[190,228,246,114,81,9,229,244,37,226,111,182,41,142,69,103,251,69,232,123]},"announce":[],"urlList":[]}}