{"title":"The Flight of the Phoenix 1965 DVDRip Xvid AC3-BR(No Rars)","uid":4478810,"size":1549556157,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bf077e0f0a780d32e6171eed9f88cc65e91c5dfa&amp;dn=The+Flight+of+the+Phoenix+1965+DVDRip+Xvid+AC3-BR%28No+Rars%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"cgaurav007","files":-1,"time":1225468777,"description":"The Flight of the Phoenix 1965\n\nCountry: USA\nYear: 1965\nGenre: Adventure, Drama  \nFormat: .avi\nVideo: XviD 1.1.2 Fina. ; 704 x 384 ; 25 fps ; 1316 kbps\nAudio: English AC3 2.0 192 kbps CBR 48000 Hz\nSubtitles: Bulgarian\nSize: 1.45 GB\nRuntime: 136 min.\nDirector: Robert Aldrich\nCast: James Stewart, Richard Attenborough, Peter Finch, Hardy KrÃƒÂ¼ger, Ernest Borgnine.\n\nSummary: After a cargo plane crashes in a sandstorm in the Sahara, the surviving crew must fight starvation and their own fears in order to escape from the harsh desert before their meager supplies of food and water run out. The Flight of the Phoenix is a gripping tale of courage, determination, and triumph of the human spirit against seemingly insurmountable obstacles. Frank Towns (James Stewart) pilots a cargo plane carrying passengers over the Arabian Desert with his navigator, Lew Moran (Richard Attenborough), when a fierce sandstorm approaches. Proceeding on gut instinct, Towns decides to fly through the storm, which leads to engine failure and the crash of the plane. Two die in the crash and one is severely wounded, leaving a handful of people to try to brave the harsh Arabian Desert with only ten days of water and little food. A pecking order emerges among the men, with the more learned exerting control over the manual workers. As the situation becomes increasingly bleak, one event exemplifies the many mental and physical trials and tribulations that the stranded group undergoes: Captain Harris (Peter Finch) decides to head to the nearest oasis when Sgt. Watson (Ronald Fraser), who does not want to go, fakes a sprained ankle to get out of the trip. After Captain Harris leaves with another passenger, Trucker Cobb (Ernest Borgnine) follows after the pair out of desperation and fear-induced derangement. Frank Towns, guilty over the crash and his culpability, goes after Cobb to save him from inevitable death, but fails. At a point when the situation looks irreconcilably bleak, Heinrich Dorfmann (Hardy Kruger) comes up with a plan to build a smaller plane from the wreckage of the first. But can his idea work, or are they doomed to slow dehydration and madness?","torrent":{"xt":"urn:btih:bf077e0f0a780d32e6171eed9f88cc65e91c5dfa","amp;dn":"The+Flight+of+the+Phoenix+1965+DVDRip+Xvid+AC3-BR%28No+Rars%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf077e0f0a780d32e6171eed9f88cc65e91c5dfa","infoHashBuffer":{"type":"Buffer","data":[191,7,126,15,10,120,13,50,230,23,30,237,159,136,204,101,233,28,93,250]},"announce":[],"urlList":[]}}