{"title":"[SexuallyBroken] Newbie Katrina Jade with natural DDD breasts on","uid":10150445,"size":310256180,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bf7b66128456515b4e087f9ffe3b224cbadff2f3&amp;dn=%5BSexuallyBroken%5D+Newbie+Katrina+Jade+with+natural+DDD+breasts+on&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"2.No.2","files":1,"time":1400097865,"description":"[SexuallyBroken] Newbie Katrina Jade with natural DDD breasts on her 1st bondage shoot is facefucked epic deepthroat! / May 12, 2014)\n\nIn keep thing with our tradition of combining both experienced sexual superstars and completely new talent, today we introduce a brand-new face to Sexuallybroken. Katrina Jade is freshly in the industry, and she brings her all natural triple D breasts and classic beauty to her first bondage shoot. How will this newbie handle the Sexuallybroken experience? Can she keep pace with the sexual athletes that we have grace our stage?\nBound out and crucified against a metal frame, Katrina is at the perfect height for facefucking. Rope keeps her arms out and neck immobilized. When they can not move their head to shift away from the dick and must simply endure the drilling down for as long as we wish to give it, we call it throatboarding. Katrina is about to get throatboarded until she can not get her eyes uncrossed.\nWe start off with cutting away her dress to expose those perfect natural breasts. After some quick thrusts down the back of her tender throat with a massive BBC to establish her place, we unbind and splay out her legs. Tying her legs open wide, we add in a vibrator and screw it in place. Now we get to assess her multi-tasking skills. Can she handle being throatboarded by cock while cumming her brains out?\nWe wear her down and it is a beautiful sight to see. This newbie gets to see what it takes to hang out here at Sexuallybroken. The relentless cock has reshaped her throatmeat. She has cum over and over. Drool dangles off her chin. Her eyes are misted over and gazing in a far off space. When we have had our fill of her facepussy, we walk off, leaving her bound and still cumming. Katrina will not be forgetting today anytime soon...\n\nBDSM, Bondage, Domination, Hardcore\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=m5fn4bssm9gz.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=m5fn4bssm9gz.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=2cqj52napjr0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=2cqj52napjr0.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bf7b66128456515b4e087f9ffe3b224cbadff2f3","amp;dn":"%5BSexuallyBroken%5D+Newbie+Katrina+Jade+with+natural+DDD+breasts+on","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf7b66128456515b4e087f9ffe3b224cbadff2f3","infoHashBuffer":{"type":"Buffer","data":[191,123,102,18,132,86,81,91,78,8,127,159,254,59,34,76,186,223,242,243]},"announce":[],"urlList":[]}}