{"title":"Pro Evolution Soccer 2015+LANGUAGE PACKS-RELOADED","uid":11492670,"size":6588590490,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bf840305a0b51934ceeb3a67fa0d0073ad8c241a&amp;dn=Pro+Evolution+Soccer+2015%2BLANGUAGE+PACKS-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":3,"time":1416269791,"description":"[img]http://share-image.org/upload/small/2014/11/17/546a7e8f3bad6.jpg[/img]\n\nABOUT THE GAME\n\nPES 2015 elevates on-field realism with the aim of recreating the drama and tension associated with vital matches. PES 2015 marks a concerted return to core PES values of total control, utterly responsive controls and unrestricted gameplay, where the user has complete control over how they play. Evert pass, shot or run is finely balanced to give maximum player satisfaction within PES 2015Â’s on-field action.\n\nFEATURES\n\nIncredible Response Times: Lightning fast controls allows users to instinctively react to every movement when the ball is in play\nOn The Ball Abilities : Take on defenders using each playerÂ’s bespoke dribbling skills, as opposed to relying on Â‘trickÂ’ moves. New skills include Close control, responsive sprint and incorporating a much wider range of pace Â– from walking to sprinting\nCase for Defence: Users have complete control over when to close down, tackle, or hold up play. Successful defending is based entirely on the decisions the user makes\nBehavioural Patterns: PES 2015 now boasts a huge array of players that both look and play like their real-life counterparts. KONAMI has faithfully recreated over 1000 players this year, with bespoke animations and playing styles across its extensive player roster. Teams automatically adopt their real-life game plan, whether it is counter-attacking, out wide, or defensively minded. They run like they should, play the way they do in real life, and react emotionally as they would to fouls, goals or referee decisions Â– with their frame of mind actually affecting how they play!\nPoetry in Motion: The individuality of the players is further enhanced with seamless animations. No sacrifice to animation has been made in the pursuit of fast response, yet the movements flow effortlessly calculated in real-time and dependent on the playerÂ’s position in relation to the ball and its speed. Player models themselves are also carefully enhanced.\nBring the Noise: PES 2015 mirrors the atmosphere of a top-flight match. The crowd animations have been hugely enhanced, and the ebb and flow of a match is met with context-sensitive crowd effects and movements.\n\nTitle: Pro Evolution Soccer 2015\nGenre: Sports\nPublisher: Konami\nDeveloper: Winning Eleven Productions\n\n\nPES 2015 Minimum System Requirements For PC are :\n\n- Windows 7 SP1 / Vista SP2\n- Inter Core 2 Duo @1.8 GZ (AMD Athlon II X2 240 or equivalent processor)\n- 1 GB RAM\n- nVIdia GeForce7800 / ATI Radeon x1300 / Intel HD Graphics 2000\n- Direct X 9.0c Compatible Video card with 512MB\n- 8GB free GDD space\n\nPES 2015 Recommended System Requirements For PC are :\n\n- Windows 7 SP1 / Vista SP2\n- Inter Core i3 530 (AMD Phenom II X4 925 or equivalent processor)\n- 2 GB RAM\n- nVIdia GeForce7950 / ATI Radeon HD 2400 / Intel HD Graphics 3000\n- Direct X 9.0c Compatible Video card with 1024MB\n- 8GB free GDD space\n\n\n1. Burn or mount the image\n2. Install the game.\n3. Copy over the cracked content from the /Crack directory to\nyour game install directory\n4. Play the game\n5. Support the software developers. If you like this game, BUY IT","torrent":{"xt":"urn:btih:bf840305a0b51934ceeb3a67fa0d0073ad8c241a","amp;dn":"Pro+Evolution+Soccer+2015%2BLANGUAGE+PACKS-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf840305a0b51934ceeb3a67fa0d0073ad8c241a","infoHashBuffer":{"type":"Buffer","data":[191,132,3,5,160,181,25,52,206,235,58,103,250,13,0,115,173,140,36,26]},"announce":[],"urlList":[]}}