{"title":"Camera FV-5 v1.71(AnDrOid).apk","uid":10112682,"size":3833713,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:bfe67561b5ccf7d19d475df7bf0a6d685c0d5a60&amp;dn=Camera+FV-5+v1.71%28AnDrOid%29.apk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"Evil_Amdis","files":1,"time":1399545129,"description":"Camera FV-5 Pro\n\n\n\nRELEASED DATE: May 6, 2014\n\nTailored to enthusiast and professional photographers, with this camera application you can capture the best raw photographs so that you can post-process them later and get stunning results. The only limit is your imagination and creativity!\n\nFeatures\n\n- All photographic parameters are adjustable and always at hand: exposure compensation, ISO, light metering mode, focus mode, white balance and program mode.\n- DSLR-like viewfinder display: see exposure time, aperture and stops display with EV and bracketing settings.\n- Full fledged exposure bracketing: from 3 to 7 frames, unlimited stops spacing, plus custom EV shifting.\n- Built-in intervalometer: make stunning timelapses (even bracketed/HDR timelapses) and time-controlled picture series.\n- Program and Speed-priority modes.\n- Long exposure support: take beautiful night photos and light trails with long exposure times up to 60 seconds*.\n- JPEG as well as RAW (PNG) image formats for lossless photo capturing, perfect for post-processing.\n- EXIF and XMP sidecar metadata support.\n- Self timer for delayed shooting.\n- Autofocus, macro, touch-to-focus** and infinity focus modes, plus a focus lock switch (AF-L).\n- In background photo developing and processing allows a smooth, uninterrupted camera operation.\n- This camera application completely avoids scene modes, instead you get full manual control over all photographic parameters, just like you do with a reflex camera, so you can ultimately control every aspect of the picture, and leave the post-processing to the computer. So after your DSLR, you will never miss a photo opportunity again, being able to capture it with the closer sensation to your DSLR as possible.\n\nWhat's in this version\n\nNew: Camera FV-5 now supports the inverse landscape UI orientation.\nNew: now it is possible to switch to video mode. The brand-new Cinema FV-5 app is detected and launched if available. Otherwise, it is possible to use any third-party video recording application or use the stock videocamera app.\nNew: when using Cinema FV-5, all key photographic parameters are transferred to it.\nNew: call accept/media play buttons on headsets and remotes can now be used to activate the shutter.\n\n\n ","torrent":{"xt":"urn:btih:bfe67561b5ccf7d19d475df7bf0a6d685c0d5a60","amp;dn":"Camera+FV-5+v1.71%28AnDrOid%29.apk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfe67561b5ccf7d19d475df7bf0a6d685c0d5a60","infoHashBuffer":{"type":"Buffer","data":[191,230,117,97,181,204,247,209,157,71,93,247,191,10,109,104,92,13,90,96]},"announce":[],"urlList":[]}}