{"title":"On the Road - Jack Kerouac","uid":4161808,"size":73366871,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bffed9c21b64f6f887699ac7859f776e81d76b53&amp;dn=On+the+Road+-+Jack+Kerouac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"fervor","files":4,"time":1209410377,"description":"This book is crucial to any study of, or nostalgic look at the &quot;Beat Generation.&quot;  The pointlessness, the lack of both materialism and spirituality, the alcohol, the drugs, the misogyny, the restlessness, the hopelessness and, yes, the jazz.  It&amp;#039;s all here.  Kerouac allegedly coined the term &amp;#039;beat generation&amp;#039; to describe the young literati of the 1950&amp;#039;s as people without goals, without dreams, without hope, and without faith, and thus, beaten.  At the same time, he told us that &amp;#039;beat&amp;#039; was also a reference to the word, beatitude, indicating that he found a beauty in this beaten condition.  His life of depression and his death by alcohol suggests the former meaning was closer to his real experience.\n\nThis is not your typical novel or travelogue.  The stream-of-consciousness writing may lose some listeners.  Try to hang in there.  It&amp;#039;s part of the whole beat thing.  You&amp;#039;ll learn more about the muse of a generation of writers in this book than in any other.  Neal Cassady (Dean Moriarity) seems to be a manic, fairly non-literate, hedonistic, self-centered, jerk that everyone loves, at least for a time.\n\nYou will look a bit foolish discussing the beat generation without first reading this book.  If you&amp;#039;re still interested, move on to Allen Ginsberg&amp;#039;s poem, &quot;Howl,&quot; Kerouac&amp;#039;s &quot;Dharma Bums,&quot; William Burrough&amp;#039;s &quot;Naked Lunch,&quot; and Thom Wolfe&amp;#039;s &quot;Electric Koolaid Acid Test.&quot;  Alas, many of the players in this &amp;#039;beat&amp;#039; game came to a bad end with depression, alcohol, and drugs. Wolfe was a chronicler not a player.  \n\nThis, of course, leads us to Hunter S. Thompson&amp;#039;s &amp;#039;gonzo journalism&amp;#039; whose style is clearly influenced by the beats. ","torrent":{"xt":"urn:btih:bffed9c21b64f6f887699ac7859f776e81d76b53","amp;dn":"On+the+Road+-+Jack+Kerouac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bffed9c21b64f6f887699ac7859f776e81d76b53","infoHashBuffer":{"type":"Buffer","data":[191,254,217,194,27,100,246,248,135,105,154,199,133,159,119,110,129,215,107,83]},"announce":[],"urlList":[]}}