{"title":"The Te of Piglet by Benjamin Hoff (1992|Dutton Books) [EPUB]","uid":10016122,"size":3103905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0670a76e85fcb49f257712fa8a0adaedf99d333&amp;dn=The+Te+of+Piglet+by+Benjamin+Hoff+%281992%7CDutton+Books%29+%5BEPUB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1398147253,"description":"Title: The Te of Piglet\nAuthor: Benjamin Hoff\nCategory: Non-Fiction\nPaperback: 272 pages\nPublisher: Penguin Books (November 1, 1993)\nLanguage: English\nISBN-10: 0140230165\nISBN-13: 978-0140230161\n\nFor more information on this book, please see the wikilink here: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Te_of_Piglet&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Te_of_Piglet&lt;/a&gt;\n\nIn this clear, concise and wonderful take on Eastern Philosophy, author Benjamin Hoff uses the simple and elegant principles from A.A. Milne's Winnie The Pooh stories to illustrate the basic principles of Taoism, in this case the concepts of power and virtue of the small. It is an easy read and not at all difficult to follow and is one of the best introductions to Eastern Philosophy available to the western world. The book was a runaway best-seller and was preceded by a companion book, The Tao of Pooh. \n\nPromotional info/Publisher's summary - &quot;The Te of Piglet . . . in which a good deal of Taoist wisdom is revealed through the character and actions of A. A. Milne's Piglet. Piglet? Yes, Piglet. For the better than impulsive Tigger? or the gloomy Eeyore? or the intellectual Owl? or even the lovable Pooh? Piglet herein demonstrates a very important principle of Taoism: The Te--a Chinese word meaning Virtue--of the Small.&quot;\n\nFrom Kirkus Reviews:\n&quot;Ten years later, a sequel to the runaway bestseller The Tao of Pooh. If you like marshmallow laced with arsenic, it was worth the wait. In the original, as you may recall, Hoff had an Idea: that Winnie-the-Pooh could be used to explain Taoism, the ancient Chinese way of balance. Now, as luck would have it, Pooh's buddy Piglet turns out to be the perfect embodiment of Te, the Taoist term for virtue, which is attained through sensitivity, modesty, and smallness. Piglet, you see, is a ``Very Small Animal'' (for all his talk about smallness, Hoff, like A.A. Milne, who must be groaning in his grave, likes capital letters Very Much), and the diminutive porker's adventures are the perfect means to preach, Very Lightly, about being positive and ecological and upright. The trick is to ``observe, deduce, apply''; once done, the millennial ``Day of Piglet'' will arrive and human beings will once again achieve ``the state of paradise that existed before the Great Separation occurred.'' Watch out, though: All is not summer in the 100-Acre Wood. Beneath the goofy grin one finds bared teeth, as Hoff snaps away peevishly at Confucianism (``authoritarian, No- Nonsense attitude toward life''), Christianity, feminism (``behind their antimasculine words, it's Overmasculinity as Usual''), Republicans, critics, computers--whatever raises his Taoist hackles. All in a Good Cause, of course. No doubt, The Ching of Eeyore comes next. Then what? Well, by then the Day of Piglet will have come, and the whole world will be a Trillion-Acre Wood...so empty your pockets while you can, and watch Piglet bring home the bacon. (Illustrated with 51 line drawings from the original Pooh books. However did they dare?)&quot;\n\nAdditional info from the New York Times article about these books:\n&quot;When he approached Dutton with the &quot;Piglet&quot; idea, they told him, in an Eeyore-like fashion, &quot;don't expect too much.&quot; he said. He didn't. Up until five years ago, Mr. Hoff, who has an elastic mime-like face and body and eggplant purple lips , was not earning enough in royalties to support himself as a writer (for rights to quote the Pooh books and use the drawings Mr. Hoff pays 33.3 percent of the hardcover and 40 percent of the paperback profits to the A.A. Milne estate).\n\nStill, he has been, as he remarks wryly in &quot;Piglet,&quot; a Remarkable Success, a Tigger (zealous Tiggers can only climb upwards, otherwise their tails get in the way). But Remarkable Success lies in part in The Perception of Situations: in other words, It All Depends. In an age of chain-store philosophers and advice for the spirit-lorn, the Taoist authors' profile is so low that even his editor hasn't met him.&quot;\n\nThe torrent contains the PDF and EPUB versions of the book, as well as both published covers. \n*NOTE- the PDF version used here is a from-scratch, searchable and browseable version created by The Pirate Bay uploader pharmakate. Full credit to that user for their excellent work; you can find their uploads here. The EPUB is not from the same source material but is the revised and updated edition. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:c0670a76e85fcb49f257712fa8a0adaedf99d333","amp;dn":"The+Te+of+Piglet+by+Benjamin+Hoff+%281992%7CDutton+Books%29+%5BEPUB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0670a76e85fcb49f257712fa8a0adaedf99d333","infoHashBuffer":{"type":"Buffer","data":[192,103,10,118,232,95,203,73,242,87,113,47,168,160,173,174,223,153,211,51]},"announce":[],"urlList":[]}}