{"title":"Francaix - Les Demoiselles de la nuit - Ulster Orch [Philidor]","uid":15929216,"size":121612659,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c075bc91444203515a064d46daeac6a83d8ac624&amp;dn=Francaix+-+Les+Demoiselles+de+la+nuit+-+Ulster+Orch+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Philidor","files":21,"time":1475342308,"description":"From the liner notes:\r\n\r\n&quot;Whereas Le roi nu is a cheerful burlesque, Les demoiselles de la nuit (‘The ladies of the night’) – described as a ‘cat-ballet in one act’ – is an altogether moodier, though eventually quite as witty, affair. This work was written to a scenario by Jean Anouilh and choreographed by Roland Petit, who staged the first performance with his own company, Les Ballets de Paris de Roland Petit, with elaborate designs and costumes by the leading woman surrealist Leonor Fini, at the Théâtre Marigny on 21 May 1948. A leading member of the company was the young Margot Fonteyn, who danced the part of the white kitten, Agathe. She at first refused to wear a cat mask on the grounds that she would never do such a thing at Covent Garden. In retaliation, Fini threatened to set the theatre on fire, and Petit finally persuaded Fonteyn to wear the mask because, he claimed, Fini was capable of anything! In the event the ballet was a resounding success, and was subsequently staged in London and New York.\r\n\r\nHere the action is set among a decadent society of cats, whose activities &quot;underground seem a mirror for the human life in the city above. The alpha male, called Baron de Grotius, intends to wed the frivolous and gorgeous white kitten, Agathe; but she falls in love with a human violinist who has lost himself in the cellars. Through the love of a human, she becomes human herself, and they flee the wedding celebrations and make their home above ground in a poor garret, where they have difficulty paying the rent. Agathe finds herself falling back into her feline nature – she kills a caged bird, and when the Baron traces her she leaves her sleeping lover and follows the other cats. The violinist tries to chase them over the rooftops but falls to his death; Agathe returns, finds his body and curls up beneath it ‘in animal devotion and human love’.&quot;\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nA bio is enclosed. You can find all my classical uploads by searching on Philidor, or just looking in this regularly updated thread:\r\n \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:c075bc91444203515a064d46daeac6a83d8ac624","amp;dn":"Francaix+-+Les+Demoiselles+de+la+nuit+-+Ulster+Orch+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c075bc91444203515a064d46daeac6a83d8ac624","infoHashBuffer":{"type":"Buffer","data":[192,117,188,145,68,66,3,81,90,6,77,70,218,234,198,168,61,138,198,36]},"announce":[],"urlList":[]}}