{"title":"Sony Vegas Pro 13.0 build 428 (64 bit) (patch KHG) [joshfoun]","uid":11734383,"size":412223310,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0dc9afa58ba02075b4d5fe9758e0473c0472b8b&amp;dn=Sony+Vegas+Pro+13.0+build+428+%2864+bit%29+%28patch+KHG%29+%5Bjoshfoun%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"joshfoun","files":7,"time":1425507809,"description":"Hello, joshfoun here revising this version from 373 to 428. This torrent was originally found via (ChingLiu) but he hasn't updated the versions so I'm gonna do it. He had version 310 and though that is great, a newer build came out. \n\nTo be honest, I did this because I was bored and plan on using this for my editing. \n\nNot looking to get a trusted skull green or pink, I just wanna help others.\n\nAlso if you are fascinated with learning Windows tech, check out FlippinWindows on YouTube and he has all sorts of tutorials on Windows and also customization ideas. I do not have any association with that person:\n\n\n\n\n\nThanks, joshfoun\n\nDesigned for complete creative control\nVegasâ„¢ Pro 13 is a contemporary NLE designed for complete creative control. New features include advanced archival tools, sophisticated audio metering, and the Vegas Pro Connect mobile iPad companion app. Vegasâ„¢ Pro 13 comes complete with DVD Architectâ„¢ Pro 6, DolbyÂ® Digital Professional Encoder, and plug-in collections from FXHOME, NewBlueFX, and iZotopeÂ®.\n\nInnovative editing tools\nEdit SD, HD, 2K, and 4K material in 2D or stereoscopic 3D, with drag-and-drop functionality or traditional 3-point and 4-point editing modes. The Vegas Pro 13 interface provides an impressive array of innovative tools and thoughtful touches, with a fully customizable workspace for accomplishing a wide range of production tasks. Nest Vegas Pro projects within the timeline, customize and save keyboard commands, and use application scripting to automate repetitive tasks.\n\nPowerful effects and compositing engines\nCombine up to 32 high-quality, keyframeable effects per effects chain and apply them at the event, track, media, or project level. Vegas Pro 13 uses an advanced plug-in architecture based on the OpenFX standard to assure compatibility with hundreds of cutting-edge effects designed by leading video effects VFX developers. Parent/child tracks and 2D and 3D modes provide a powerful, flexible, and sophisticated compositing environment. Shape Masking tools and FX Masking make panning, cropping, and targeted effects treatments easy. The Color Match plug-in along with a wide range of other color-correction tools enable you to quickly match color characteristics from one clip to another.\n\nProject interchange\nImport and export a wide range of project files to and from Vegas Pro 13. Project Interchange can convert between native .veg files and AAF for AvidÂ® ProToolsÂ®, XML for AppleÂ® Final Cut ProÂ® 7, Final Cut Pro X (export only), DaVinci Resolve 10, and .prproj for AdobeÂ® PremiereÂ® Pro CC and After EffectsÂ® CC.\n\nNew features in version 13.0 (Build 290)\n\nVideo\n-Added support for rendering Video for Windows (.avi), QuickTime (.mov), and Windows Media Video (.wmv) with frame sizes up to 4096x4096.\n-Added a QFHD 24p template to the Project Properties dialog to allow you to create projects with a frame size of 3840x2160 and a frame rate of 23.976 fps.\n-Audio: Added loudness meters and logging.\n\nWorkflow\n-Improved project archiving.\n-Added a proxy-first workflow for efficient mobile editing when using CBK-WA100/CBK-WA101 wireless adapters: upload video proxies to the cloud or other server, start editing your project using proxy media, and relink to full-resolution media when you're ready to finalize your project.\n-Streamlined the main toolbar and added timeline-editing controls to the Transport and Timeline toolbar below the timeline.\n-Added Vegas Pro Connect.â—¦When you're working with Vegas Pro, you can use Vegas Pro Connect to remotely control the Vegas transport functions, seek and scrub the timeline, and add markers.\n-A new Allow floating windows to dock setting on the Preferences &gt; Display tab allows you to choose whether windows float or dock when moving them.\n-A new Automatically create video proxies for Ultra HD media setting on the Preferences &gt; Video tab allows you to choose whether automatically create video proxy files when adding 4K video to your project.\n\nFormats\n-Added support for reading metadata (including timecode) in XAVC S files.\n-Added support for no-recompress rendering (smart rendering) of XAVC Intra MXF video.\n\nNotable fixes/changes in version 13.0 (Build 310)\n\n-Fixed a bug that caused a crash during startup when loading some older third-party plug-ins (including CineForm CFHD, NewBlue Titler 1 &amp; 2, and Camtasia).\n-Fixed a bug that prevented some third-party application extensions based on older .NET frameworks from loading correctly.\n-Fixed a bug that could cause an exception error when exiting Vegas.\n-Fixed a bug that could cause an error when importing projects using File &gt; Import. \n-Fixed a bug that caused an error when using File &gt; Import to import a DaVinci Resolve project if metadata was missing. \n-Fixed a bug that prevented Vegas Pro from starting when using the Register Later method during installation. \n-Fixed a bug that incorrectly offered a choice of English, French, German, Japanese, and Spanish languages during installation and exposed incomplete translations in the Vegas interface. Installing this update will revert existing localized Vegas Pro 13 installations to English.\n\n* At this time, English is the only supported language for Vegas Pro 13. Vegas Pro 13 localization is in progress and will be released when available.\n\nSystem Requirements\n\n-WindowsÂ® 7, 8, or 8.1 operating system (64-bit)\n-2 GHz processor (multicore or multiprocessor CPU recommended for HD or stereoscopic 3D; 8 cores recommended for 4K)\n-1 GB drive space for program installation\n-SSD or high-speed multi-disk RAID for 4K media\n-4 GB RAM (8 GB recommended; 16 GB recommended for 4K)\n-OHCI-compatible IEEE-1394DV card (for DV and HDV capture and print-to-tape)\n-USB 2.0 connection (for importing from AVCHD, XDCAM EX, NXCAM, or DVD camcorders)\n-Windows-compatible sound card\n-DVD-ROM drive (for installation from a DVD only)\n-Supported CD-recordable drive (for CD burning only)\n-Supported DVD-recordable drive (for DVD burning only)\n-Supported BD-R/-RE drive (for Blu-ray Discâ„¢ burning only)\n-GPU-accelerated video processing and rendering requires an OpenCLâ„¢-supported NVIDIAÂ®, AMD/ATIâ„¢, or IntelÂ® GPU with 512MB memory; 1GB for 4K.\n-Microsoft .NET Framework 4.0\n-AppleÂ® QuickTimeÂ® 7.1.6 or later for reading and writing QuickTime files\n-Internet Connection (for Gracenote MusicID Service)\n\nLanguages : English\n\nHomepage :   &lt;a href=&quot;\nhttp://www.sonycreativesoftware.com/vegaspro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sonycreativesoftware.com/vegaspro&lt;/a&gt;","torrent":{"xt":"urn:btih:c0dc9afa58ba02075b4d5fe9758e0473c0472b8b","amp;dn":"Sony+Vegas+Pro+13.0+build+428+%2864+bit%29+%28patch+KHG%29+%5Bjoshfoun%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0dc9afa58ba02075b4d5fe9758e0473c0472b8b","infoHashBuffer":{"type":"Buffer","data":[192,220,154,250,88,186,2,7,91,77,95,233,117,142,4,115,192,71,43,139]},"announce":[],"urlList":[]}}