{"title":"John Ralston Saul - Voltaire's Bastards (1992)","uid":8852380,"size":3593239,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0fd27c2254290cc36541f8cb8b3531ad711b0c5&amp;dn=John+Ralston+Saul+-+Voltaire%27s+Bastards+%281992%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1377566919,"description":"John Ralston Saul - Voltaire's Bastards: The Dictatorship of Reason in the West (Free Press, 1992 / reprint edn. 2013).\n\nISBN: 9781476718965 | 656 pages | EPUB\n\n\nAn instant bestseller when it was first published in 1992, and now with a new introduction, Voltaire's Bastards astutely dissects the political, economic and social origins of Western civilization to reveal a culture cripplingly enslaved to crude notions of rationality and expertise.\n\nThe Western world is full of paradoxes. We talk endlessly of individual freedom, yet we've never been under more pressure to conform. Our business leaders describe themselves as capitalists, yet most are corporate employees and financial speculators. We call our governments democracies, yet few of us participate in politics. We complain about invasive government, yet our legal, educational, financial, social, cultural and legislative systems are deteriorating. Â Â \n\nAll these problems, John Ralston Saul argues, are largely the result of our blind faith in the value of reason. Over the past 400 years, our &quot;rational elites&quot; have turned the modern West into a vast, incomprehensible, directionless machine, run by process-minded experts -- &quot;Voltaire's bastards&quot; -- whose cult of scientific management is empty of both sense and morality. Whether in politics, art, business, the military, entertainÂ­ment, science, finance, academia or journalism, these experts share the same outlook and methods. The result, Saul maintains, is a civilization of immense technological power whose ordinary citizens are increasingly excluded from the decision-making process. Â Â \n\nIn this wide-ranging anatomy of modern society and its origins, Saul presents a shattering critique of the political, economic and cultural estabÂ­lishments of the West.\n\n\nReviews\n\n&quot;An ambitious meditation on modern culture. . . a rich, rewarding, highly original book that casts a fresh perspective on all aspects of our public life. . . [Its] pages explode with insight, style and intellectual rigor.&quot; -- Camille Paglia\n\n&quot;[An] erudite and brilliantly readable book.&quot; -- The Observer, London\n","torrent":{"xt":"urn:btih:c0fd27c2254290cc36541f8cb8b3531ad711b0c5","amp;dn":"John+Ralston+Saul+-+Voltaire%27s+Bastards+%281992%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0fd27c2254290cc36541f8cb8b3531ad711b0c5","infoHashBuffer":{"type":"Buffer","data":[192,253,39,194,37,66,144,204,54,84,31,140,184,179,83,26,215,17,176,197]},"announce":[],"urlList":[]}}