{"title":"Minus The Bear - Discography (2001-2013) [FLAC]","uid":8868350,"size":2964208866,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c142447efc3c0c82eac559ded18c007247a42c4f&amp;dn=Minus+The+Bear+-+Discography+%282001-2013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"politux","files":-1,"time":1377987173,"description":"\n  Minus the Bear - Discography (2001-2013) [FLAC]\n \n  Genre: Pop/Rock\n  Styles: Indie Rock, Alternative\n  Source: CD \n  Codec: FLAC\n  Bit Rates: ~ 800 - 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  2001 This Is What I Know About Being Gigantic EP\n  2002 Highly Refined Pirates\n  2002 Bands Like It When You Yell &quot;YAR!&quot; At Them EP\n  2004 They Make Beer Commercials Like This (P\n  2005 Menos El Oso \n  2007 Interpretaciones Del Oso \n  2007 Planet Of Ice \n  2008 Acoustics EP\n  2010 Omni\n  2012 Infinity Overhead \n  2013 Acoustics II EP\n\n  With catchy song titles like &quot;Hey, Wanna Throw Up? Get Me Naked,&quot; &quot;Monkey!!! Knife!!! Fight!!!,&quot; and &quot;Lemurs, Man, Lemurs,&quot; it's hard not to be at least a little bit curious about this Seattle-based quintet. Featuring members of Botch, Kill Sadie, and Sharks Keep Moving, Minus the Bear emerged on Seattle's music scene in 2001 with the release of their six-song EP This Is What I Know About Being Gigantic. The band comprised guitarist Dave Knudson, vocalist/ guitarist Jake Snider, drummer Erin Tate, and bassist Cory Murchy. Though the band entered the studio before they ever played a show, they toured aggressively in support of the EP, then returned to the studio to record 2002's Highly Refined Pirates, their first full-length album. Both the EP and LP were released by Seattle-based Suicide Squeeze Records.\n\n  Though the song titles may lead one to believe that they're a novelty act, Minus the Bear provides polished, shrewdly arranged songs. Finger-tapped guitar riffs mixed with catchy melodies and unexpected time changes keep listeners interested and entertained. Minus the Bear issued two EPs in 2004: Bands Like It When You Yell &quot;Yar!&quot; at Them on Suicide Squeeze and They Make Beer Commericals Like This on Arena Rock. Their next full-length, the self-produced Menos el Oso (Spanish for Minus the Bear), appeared in August 2005; the remix album Interpretaciones del Oso followed in early 2007. The band released the full-length Planet of Ice later that year. In 2009 the band went into the studio with My Morning Jacket producer Joe Chiccarelli, and the following year released the album Omni through Dangerbird Records. Their fifth album, Infinity Overhead, followed on the label in 2012.","torrent":{"xt":"urn:btih:c142447efc3c0c82eac559ded18c007247a42c4f","amp;dn":"Minus+The+Bear+-+Discography+%282001-2013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c142447efc3c0c82eac559ded18c007247a42c4f","infoHashBuffer":{"type":"Buffer","data":[193,66,68,126,252,60,12,130,234,197,89,222,209,140,0,114,71,164,44,79]},"announce":[],"urlList":[]}}