{"title":"Wolverine v1 01-04 (1982|Digital|Zone-Empire)","uid":9689021,"size":95973900,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c1f0f91b8d71d28571d63ce47a7b3e79f442d334&amp;dn=Wolverine+v1+01-04+%281982%7CDigital%7CZone-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1393829989,"description":"Wolverine's first solo series adventures get off to a rollicking start with this excellent limited series that partially inspired &quot;The Wolverine&quot;. Written and drawn by the incredible and legendary Chris Claremont and Frank Miller, this story depicts tragedy for Logan in the land of the Rising Sun. Plot summary - &quot;Wolverine's vacation from the X-Men is interrupted when he discovers that his beloved, Mariko Yashida, has been married off by her criminal father Lord Shingen! When Shingen humiliates Wolverine in front of Mariko, the hero loses heart, drowning his sorrows in beer, bar fights - and the arms of wild assassin Yukio. But when ninjas attack and betrayal strikes from a most unexpected source, can Wolverine reclaim his honor, and rescue Mariko and himself from the trap Shingen has drawn around them both?&quot; An intense script with some of Miller's finest art for Marvel = massive success and several more (unending) solo series to follow. This is definitely a classic worth checking out.\n\nThere is a Digital TPB edition that collects this arc along with two relevant Uncanny X-Men issues, but the individual issues are higher resolution so I just used those. Awesome digital copies by the wonderful folks at Zone-Empire, thanks to them for their work and please seed - enjoy! :-)","torrent":{"xt":"urn:btih:c1f0f91b8d71d28571d63ce47a7b3e79f442d334","amp;dn":"Wolverine+v1+01-04+%281982%7CDigital%7CZone-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1f0f91b8d71d28571d63ce47a7b3e79f442d334","infoHashBuffer":{"type":"Buffer","data":[193,240,249,27,141,113,210,133,113,214,60,228,122,123,62,121,244,66,211,52]},"announce":[],"urlList":[]}}