{"title":"Ireland's Greatest Hits - 1996 Celtic Irish Folk","uid":9484789,"size":165270995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c2d63dc96eb4794dc0591fa5d92b8bd6c02306d1&amp;dn=Ireland%27s+Greatest+Hits+-+1996+Celtic+Irish+Folk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"Big-Papi","files":25,"time":1389866135,"description":"Ireland's Greatest Hits 320cbr (Big Papi) 1996 Celtic Irish Folk \n\n\n\nSource: 1996 CD\nDang this is $29 for a new copy - Big Papi\n\n\n\n\nBy C. Sivula\nI have just received this CD this afternoon and am playing it for the second time straight through already! I had been looking for the title &quot;A Little Bit of Heaven&quot; and was pleasantly surprised to find it on this CD and performed by one of my favorite artists, John Gary. This CD includes so many of the Irish favorites, many of which are no longer being recorded or found in stores. If you are Irish (even just for a day) you will be sure to enjoy this entire CD. There are the standards: Mother Machree, When Irish Eyes are Smiling, Galway Bay, Danny Boy, My Wild Irish Rose, Clancy Lowers the Boom, I'll Take You Home Again Kathleen, How Are Things in Glocca Morra?, Cockles and Mussels, That's An Irish Lullabye, Kathleen Mavourneen, Macushla, Believe Me If All Those Endearing Young Charms, and many others. I know I haven't found a CD with as many of the irish songs on it as this one does. Danny Boy and A Little Bit of Heaven are the ones that I play the most, but don't miss the lyrics on &quot;Birthday of St. Patrick&quot;, it is a darling, typically &quot;Irish&quot; explanation for something that can't be explained!! The performances by John Gary, Dennis Day, and Leo McCaffrey make this a CD that no self-respecting Irishman would want to omit from his collection.","torrent":{"xt":"urn:btih:c2d63dc96eb4794dc0591fa5d92b8bd6c02306d1","amp;dn":"Ireland%27s+Greatest+Hits+-+1996+Celtic+Irish+Folk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2d63dc96eb4794dc0591fa5d92b8bd6c02306d1","infoHashBuffer":{"type":"Buffer","data":[194,214,61,201,110,180,121,77,192,89,31,165,217,43,139,214,192,35,6,209]},"announce":[],"urlList":[]}}