{"title":"John King Fairbank - China. A New History [2006][A]","uid":10131004,"size":3499676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2ff0cc5fbd590c055d9ad21c2d4df952c2a200f&amp;dn=John+King+Fairbank+-+China.+A+New+History+%5B2006%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1399882198,"description":"Description\nProduct Details\nBook Title: China: A New History, Second Enlarged Edition\t\nBook Author: John King Fairbank, Merle Goldman\nPaperback: 640 pages\nPublisher: Belknap Press; 2nd Revised &amp; enlarged edition (May 30, 2006)\nLanguage: English\nISBN-10: 0674018281\nISBN-13: 978-0674018280\n\n===================================================================================\nBook Description\nRelease date: May 30, 2006 | ISBN-10: 0674018281 | ISBN-13: 978-0674018280 | Edition: 2nd Revised &amp; enlarged\nJohn King Fairbank was the West's doyen on China, and this book is the full and final expression of his lifelong engagement with this vast ancient civilization. It remains a masterwork without parallel. The distinguished historian Merle Goldman brings the book up to date, covering reforms in the post-Mao period through the early years of the twenty-first century, including the leadership of Hu Jintao. She also provides an epilogue discussing the changes in contemporary China that will shape the nation in the years to come.\n\n===================================================================================\nEditorial Reviews\nFrom Library Journal\nNo American scholar of China was better known to the public and academia alike than Fairbank. This history of China, completed two days before his death in 1991, is a fitting final work. In covering the breadth of the country's history, from the earliest archaeological records to the present, the author is occasionally short on details, but lay readers and undergraduate students will appreciate the perceptive analysis and explanation throughout, leading to a better understanding of this complex nation, its people, and its importance in the world. Furthermore, Fairbank's command of recent research, along with an excellent bibliography, will appeal to the scholarly audience. Highly recommended. History Book Club selection.\n- Kenneth W. Berger, Duke Univ. Lib., Durham, N.C.\nCopyright 1992 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nReviews\nManages to tell its sprawling, turbulent, 4,000-year story in a single volume without either losing clarity or oversimplifying its subject...Rich and fascinating. (Arnold R. Isaacs San Francisco Chronicle)\n\nWill serve for decades to come as a standard reference and textbook. (Robert L. Worden Washington Post Book World)\n\nThis new edition is superb. The interpretative themes structuring Goldman's concluding chapter are strong and convincing. Illuminating comparisons are drawn between the Deng Xiaoping and earlier eras. Although not soft-pedaling the insistently authoritarian character of China's leadership in the political realm, Goldman takes due note of the impressive gains in personal freedom that marked the Deng years. A compelling history. Authoritative, cogent, and skillful.\n--Paul A. Cohen, Wellesley College --This text refers to an out of print or unavailable edition of this title.\n\n===================================================================================\nAbout the Author\nJohn King Fairbank was Francis Lee Higginson Professor of History and Director of the East Asian Research Center at Harvard University.\nMerle Goldman is Professor of History, Emerita, at Boston University and Associate of the John K. Fairbank Center for East Asian Research, Harvard University.\n===================================================================================","torrent":{"xt":"urn:btih:c2ff0cc5fbd590c055d9ad21c2d4df952c2a200f","amp;dn":"John+King+Fairbank+-+China.+A+New+History+%5B2006%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2ff0cc5fbd590c055d9ad21c2d4df952c2a200f","infoHashBuffer":{"type":"Buffer","data":[194,255,12,197,251,213,144,192,85,217,173,33,194,212,223,149,44,42,32,15]},"announce":[],"urlList":[]}}