{"title":"John Cassavetes - Gloria (1980)","uid":4319981,"size":1051912500,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c372a9013accaa76863bd86a75d79f9357ad3a93&amp;dn=John+Cassavetes+-+Gloria+%281980%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"cinemarx","files":1,"time":1217375503,"description":"Runtime:  2:01:33 (218548 frames) \nSize:  1,051,912,500 bytes\nVideo Codec: DivX 4\nVideo Bitrate: 1012 kb/s\nResolution: 640x360\nQf: 0.147 bits/pixel\nFPS: 29.970\nAudio Specs: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate: 128 kb/s \nAudio Sample rate: 48000 Hz\n\n********************************************************************************\n\n&quot;John Cassavetes clearly set out to make a commercial film, but, intransigent personality that he was, he turned in a slice of pure avant-garde.&quot;  \n\n--Dave Kehr, Chicago Reader\n\n********************************************************************************\n\nSynopsis (Rotten Tomatoes):  Writer-director John Cassavetes presents one of his most touching motion pictures with this story of the unlikely bond between a cynical New Yorker and a young boy. Gloria (Gena Rowlands), the quintessential &quot;tough-talkin&amp;#039; dame&quot;--complete with time in prison and ties to the mob--has put those days behind her, now living a quiet, solitary life. That changes when the Mafia marks her neighbors for death and Gloria is asked to care for their young son, Phil (John Adames). She reluctantly agrees, but because the boy knows incriminating information, they must immediately go into hiding, which takes them on a journey through New York City and ends up sparking a mother-son bond that neither could have ever expected. Cassavetes creates an empowering female role with Gloria, and Rowlands (his real-life wife) runs with it, making her transformation from bitter ex-criminal to overprotective, yet still tough, mother figure seem honest and believable. It is this budding maternal relationship that gives the film a sweetness even amid the gun smoke.\n\n********************************* FREAKYFLICKS**********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing\ncinematic art in the digital era. Our goal is to disseminate such works of art\nto the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us\nat the forum to announce your release.\n\n\n\t\t &lt;a href=&quot;\thttp://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://freakyflicks.proboards54.com/&lt;/a&gt;\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:c372a9013accaa76863bd86a75d79f9357ad3a93","amp;dn":"John+Cassavetes+-+Gloria+%281980%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c372a9013accaa76863bd86a75d79f9357ad3a93","infoHashBuffer":{"type":"Buffer","data":[195,114,169,1,58,204,170,118,134,59,216,106,117,215,159,147,87,173,58,147]},"announce":[],"urlList":[]}}