{"title":"From Hell - Alan Moore &amp; Eddie Campbell","uid":15399534,"size":200422474,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c3d4443269276f7e04b49479ad3a77b2debb31a7&amp;dn=From+Hell+-+Alan+Moore+%26amp%3B+Eddie+Campbell&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"sever29","files":2,"time":1469440273,"description":"From Hell is a graphic novel by writer Alan Moore and artist Eddie Campbell, originally published in serial form from 1989 to 1996 and collected in 1999, speculating upon the identity and motives of Jack the Ripper. The title is taken from the first words of the &quot;From Hell&quot; letter, which some authorities believe was an authentic message sent from the killer in 1888. The collected edition is 572 pages long. The 2000 and later editions are the most common prints. The comic was loosely adapted into a film of the same title, released in 2001.\r\n\r\nFrom Hell was originally serialized as one of several features in Taboo, an anthology comic book published by Steve Bissette's Spiderbaby Grafix. After running in Taboo #2–7 (1989–1992), Moore and Campbell moved the project to its own series, published first by Tundra Publishing, then by Kitchen Sink Press. The series was published in ten volumes between 1991 and 1996, and an appendix, From Hell: The Dance of the Gull-catchers, was published in 1998. The entire series was collected in a trade paperback and published by Eddie Campbell Comics in 1999; trade paperback and hardcover versions are now published by Top Shelf Productions in the USA and Knockabout Comics in the UK.\r\n\r\nFrom Hell takes as its premise Stephen Knight's theory that the Jack the Ripper murders were part of a conspiracy to conceal the birth of an illegitimate royal baby fathered by Prince Albert Victor, Duke of Clarence, slightly modified: the involvement of Walter Sickert is reduced, and Knight's allegation that the child's mother was a Catholic has been dropped. Knight's theories have been described as &quot;a good fictional read&quot; whose &quot;conclusions have been disproved numerous times&quot;.[1] In an appendix added to the collected From Hell, Moore writes that he did not accept Knight's theory at face value (and he echoed the then-growing consensus that such claims were likely hoaxes), but considered it an interesting starting point for his own fictional examination of the Ripper murders, their era and impact. However, in the serialised publication of Dance of the Gull-Catchers Moore included an &quot;author's statement&quot; which consisted of a blown-up panel from the prologue, depicting the psychic Robert James Lees confessing that although his visions were fraudulent, they were accurate: &quot;I made it all up, and it all came true anyway. That's the funny part.&quot;\r\n\r\nMoore and Campbell conducted significant research to ensure plausibility and verisimilitude. The collected From Hell features over forty pages of page-by-page notes and references, indicating which scenes are based wholly on Moore's own imagination and which are based upon specific named sources. Moore's opinions on the reliability of those references are also listed. The annotations are followed by an epilogue in comics format, The Dance of the Gull-Catchers, in which Moore and Campbell expand on the various theories of the Ripper crimes and the likelihood—or rather, the near-impossibility—of the true identity of the culprit ever being established","torrent":{"xt":"urn:btih:c3d4443269276f7e04b49479ad3a77b2debb31a7","amp;dn":"From+Hell+-+Alan+Moore+%26amp%3B+Eddie+Campbell","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3d4443269276f7e04b49479ad3a77b2debb31a7","infoHashBuffer":{"type":"Buffer","data":[195,212,68,50,105,39,111,126,4,180,148,121,173,58,119,178,222,187,49,167]},"announce":[],"urlList":[]}}