{"title":"32 Lectures in Human Anatomy - Understanding the Human Body","uid":4604540,"size":8511274656,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c3f3f78c35e154abac4be90f6a250c1fcbf41c08&amp;dn=32+Lectures+in+Human+Anatomy+-+Understanding+the+Human+Body&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"eddie1969","files":38,"time":1230412475,"description":"Understanding the Human Body: An Introduction to Anatomy and Physiology\n(32 lectures, 45 minutes/lecture)\n\nTaught by Anthony Goodman\nMontana State University\nM.D., Cornell Medical College\n\n&quot;Come hither and view this body.&quot; \nWilliam Shakespeare\n\nYou live with it 24 hours a day. But how well do you really know it? These 32 lectures are your owner's manual to a remarkably complex, resilient, and endlessly fascinating structure: the human body.\n\nYour guide is Dr. Anthony Goodman - surgeon, professor, and writer - who takes you step by step through the major systems of the body, explaining exactly how things work and why they sometimes don't.\n\nUsing detailed color illustrations, life-sized models, and in one lecture, a video shot during surgery, Dr. Goodman gives clear descriptions of structure (anatomy) and function (physiology) aimed at the level of the interested layperson.\n\n\n\n\nA Systems Approach\n\nDr. Goodman's approach differs from anatomy lab in medical school, with which he has extensive teaching experience. By necessity, medical students dissecting cadavers must study all of the organs in one area before moving on to the next. They simply cannot dissect the entire nervous system; then go back and dissect the vascular system; then, the gastrointestinal system; and so on.\n\nBy contrast, this course introduces anatomy by systems and depends on illustrations, not cadavers. Dr. Goodman correlates the findings in anatomy with the functioning of the normal human body, its physiology. \n\n\n\n&quot;A Gripping Page-Turner&quot;\n\n&quot;The study of anatomy alone, without reference to both the normal and abnormal function of the human body, has little meaning,&quot; says Dr. Goodman. &quot;However, when studied in the context of the exquisite and intricate relationships of anatomy to those normal processes that keep us alive and allow us to reproduce and evolve, the subject becomes a gripping page-turner.&quot;\n\nEach lecture concentrates on a particular organ or organ system, for example, the heart. The following lecture then examines the physiology of the system, looking, for example, at a normally functioning heart. Finally, to make the connections even more meaningful, Dr. Goodman discusses the more common clinical problems that occur when something goes wrong, the pathology of the organ or system. These clinical correlations make the course particularly valuable, since in real life not everything goes as planned.\n\n\n\nWhat You Learn\n\nCardiovascular System: The course opens with the cardiovascular system, focusing on the heart in Lectures 1 and 2. You examine its different parts, their responsibilities, and how the processes can break down. Lectures 3 and 4 complete the cardiovascular system with descriptions of the anatomy and physiology of the great vessels of the body, including arteries, veins, and their relationships. \n\nRespiratory System: Tied directly to the structure and function of the heart and great vessels is the respiratory system - covered in Lectures 5 and 6, which address the anatomy and physiology of the lungs. \n\nNervous System: The lectures continue with a look at the very reason for the existence of all the other organ systems: the nervous system. Lectures 7 and 8 explore the structure and function of the brain itself. Lecture 9 covers the anatomy and physiology of the spinal cord and the spinal nerves. Lecture 10 addresses the unconscious workings of the autonomic nervous system and all-important cranial nerves. In Lecture 11, you learn about the wonders of sight and the eye. In Lecture 12, you study the ears, hearing, and balance. Lecture 13 ends the discussion of the nervous system by examining memory, brain pathology, anesthesia, and pain. \n\nDigestive System: Lectures 14 and 15 examine the anatomy and physiology of the upper portion of the gastrointestinal tract - the mouth, esophagus, and stomach - continuing in Lectures 16 and 17 with the pancreas, liver, and the biliary tree. In Lectures 18 and 19 you learn about the anatomy and physiology of the small intestine, colon, and rectum. \n\nEndocrine System: Dr. Goodman devotes three lectures to the endocrine system. In Lecture 20, you study the anatomy and physiology of the pituitary gland and the adrenal glands, then move on to cover the anatomy and physiology of the endocrine pancreas in Lecture 21. In Lecture 22, Dr. Goodman completes the analysis of the endocrine system with a look at the anatomy and physiology of the thyroid gland and the parathyroid glands. \n\nUrinary System: Lectures 23 and 24 focus on the kidneys, ureters, and bladder. \n\nReproductive System: In Lectures 25 and 26, Dr. Goodman discusses the anatomy and physiology of the male and female reproductive systems. Lecture 27 covers genetic inheritance and its potential problems. \n\nMusculoskeletal System: The next topic is the musculoskeletal system. Lecture 28 looks at the physiology and physics of the muscles. In Lecture 29, you examine the anatomy of specific muscle groups. Lecture 30 focuses on the anatomy and physiology of the skeleton. \n\nImmune System: Lecture 31 addresses the structure and function of the body's major defense mechanism, the immune system. \n\nCancer: The course ends with a lecture on the biology of human cancer. \n\n\nDr. Goodman's teaching style is clear but comprehensive, objective but humane, learned but lighthearted. He received his undergraduate degree from Harvard University and his M.D. from Cornell Medical College. After a surgical internship and residency at the University of Michigan Medical Center, he completed his surgical training and chief residency at the Harvard Surgical Service of Boston City Hospital, New England Deaconess Hospital, Lahey Clinic, and Cambridge City Hospital. \n\nDr. Goodman is a Fellow of the American College of Surgeons and a Diplomate of the American Board of Surgery. Currently, he teaches gross anatomy at Montana State University in the W.W.A.M.I. Medical Sciences Program. His historical novel, The Shadow of God, a tale of the siege of Rhodes in the 16th century, was published in 2002.\n\n&quot;While it is certain that this course will NOT prepare you for performing emergency tracheotomy, a wilderness appendectomy, or an informal diagnosis of your neighbor's child's illness,&quot; says Dr. Goodman, &quot;I hope it will excite and inflame an interest in your own body, its processes, and 'the ills that flesh is heir to.'&quot;\n","torrent":{"xt":"urn:btih:c3f3f78c35e154abac4be90f6a250c1fcbf41c08","amp;dn":"32+Lectures+in+Human+Anatomy+-+Understanding+the+Human+Body","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f3f78c35e154abac4be90f6a250c1fcbf41c08","infoHashBuffer":{"type":"Buffer","data":[195,243,247,140,53,225,84,171,172,75,233,15,106,37,12,31,203,244,28,8]},"announce":[],"urlList":[]}}