{"title":"Police.Force-FASiSO-[SD)","uid":7004137,"size":1044927776,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c41d5cd4044070c1297a2ffd47356e11b0153193&amp;dn=Police.Force-FASiSO-%5BSD%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Pirat47","files":4,"time":1328203142,"description":"Description:\nPolice Force offers the opportunity to experience law enforcement like never before! Battle on the front line of crime as you take command of the policing for a thriving German city. Emergency calls come thick and fast, dynamically generated to put your organisational skills to the test. Perform uniform patrols to keep the city safe, in a huge open world, complete with night and day scenarios and changing weather.\n\nFeatures:\n\n    Deal with serious accidents, set up radar speed traps, or hunt for car thieves whilst the routine of city life continues. Experience dealing with everything from bank robberies, to a hostage crisis, to murder!\n    As in any large city, public order is of paramount importance and you will be called to deal with outbreaks of disorder where your decision making skills are critical to keeping the peace as you hold the thin blue line!\n    Your police team is fully equipped with the latest in modern equipment, including handcuffs, high speed response vehicles, radios and firearms.\n    Your successes will be rewarded with promotion as you climb the career ladder and strive to receive special honours in a career mode where only the finest officers will make the grade!","torrent":{"xt":"urn:btih:c41d5cd4044070c1297a2ffd47356e11b0153193","amp;dn":"Police.Force-FASiSO-%5BSD%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c41d5cd4044070c1297a2ffd47356e11b0153193","infoHashBuffer":{"type":"Buffer","data":[196,29,92,212,4,64,112,193,41,122,47,253,71,53,110,17,176,21,49,147]},"announce":[],"urlList":[]}}