{"title":"Squareface-SKIDROW","uid":15816489,"size":1486547111,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c43366c6b40086342048ac0d9003a01e73fb045c&amp;dn=Squareface-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"dauphong","files":5,"time":1473691585,"description":"S K I D R O W\r\nthe leading force\r\n\r\nproudly presents\r\nSquareface\r\n(c) VAN CUBO\r\n\r\n12-09-2016......Release Date &lt;-&gt; Protection.................Steam\r\nAction.............Game Type &lt;-&gt; Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nIn a universe that makes everything look and feel huge, comes a paper\r\ncharacter set to prove itself. Lifestyle being very important, the\r\npersona can be very customizable. The way your character looks gives\r\nyou two main features: pocket size for all the cash and, of course\r\ncoolness as a skill. What your character does is entirely up to your\r\nimagination\r\n\r\nSmall crafted or living creatures can be the user's companions in the\r\npaper adventure in which they will never leave the character's side\r\nThey have some characteristics: pocket size, damage and speed. They\r\ncan receive an attack order and will carry the extra money the user\r\nwill be making. The pets can find shelter in the Barracks\r\n\r\nPaper and cardboard can be surprising and they have never offered so\r\nmuch choice until now via the customization options. The player's\r\ncharacter is adjustable to any preference. It takes you back to your\r\nearly childhood. One can choose the gender, the weapons, the clothes\r\nfor every part of its body, most of them independent of the previous\r\ngender selection, and various backpacks. One can dress or equip to be\r\nable to, technically, go to any world event, festival or war. All the\r\ncostumes will be available as unlocks, giving the user the extra\r\nchoice to actually print their own blueprints and craft them manually\r\nThe real life models can then be used as tokens for the Squareface:\r\nBoard Game\r\n\r\nMake an everlasting souvenir aka trophy-like paper toy exactly as your\r\nfavourite character. Among the many costumes the game offers, you can\r\nchoose to print one or more, that are already available in-game. Bring\r\nyour character to life and it will be with you for the rest of your\r\nlife, or until you drop it in the water. Here's an example blueprint\r\nto play with:\r\n\r\nThe user can choose from melee, primary and secondary weapons, lots\r\nof grenades and mines. It's simply fun to choose the method one's\r\nenemies die\r\n\r\nBuild your own base of operations by learning how to craft paper\r\nstructures that will offer you protection, expanded carrying capacity\r\ntroops recruiting, vehicles management and more\r\n\r\nVehicles provide transportation and safety. Depending on the garage the\r\nuser has, he or she can significantly upgrade the car, truck, etc. One\r\ncan, of course, race\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!\r\n\r\nGREETINGS\r\n\r\nTo all friends of the family and honorable rival groups!\r\n\r\nascii art by the\r\ngodlike &amp; terrific duo\r\nmalodix + irokos\r\ntitan artdivision","torrent":{"xt":"urn:btih:c43366c6b40086342048ac0d9003a01e73fb045c","amp;dn":"Squareface-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c43366c6b40086342048ac0d9003a01e73fb045c","infoHashBuffer":{"type":"Buffer","data":[196,51,102,198,180,0,134,52,32,72,172,13,144,3,160,30,115,251,4,92]},"announce":[],"urlList":[]}}