{"title":"Hormones, Brain and Behavior 2nd ed - Donald W. Pfaff et al.","uid":15571259,"size":145715784,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c436feb23f24e0ba387713741095164d919bd6cf&amp;dn=Hormones%2C+Brain+and+Behavior+2nd+ed+-+Donald+W.+Pfaff+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"clouderone","files":1,"time":1471263085,"description":"Hormones, Brain and Behavior 2nd ed - Donald W. Pfaff et al. (AP, 2009).pdf\r\n\r\nHormones, Brain, and Behavior Second Edition is a comprehensive work discussing the effect of hormones on the brain and, subsequently, behavior. This major reference work has 109 chapters covering a broad range of topics with an extensive discussion of the effects of hormones on insects, fish, amphibians, birds, rodents, and humans. To truly understand all aspects of our behavior, we must take every influence (including the hormonal influences) into consideration. Donald Pfaff and a number of well-qualified editors examine and discuss how we are influenced by hormonal factors, offering insight, and information on the lives of a variety of species.\r\n\r\nHormones, Brain, and Behavior offers the reader comprehensive coverage of growing field of research, with a state-of-the-art overview of hormonally-mediated behaviors. This reference provides unique treatment of all major vertebrate and invertebrate model systems with excellent opportunities for relating behavior to molecular genetics. The topics cover an unusual breadth (from molecules to ecophysiology), ranging from basic science to clinical research, making this reference of interest to a broad range of scientists in a variety of fields.\r\n\r\nAvailable online exclusively via ScienceDirect. A limited edition print version is also available.\r\n\r\nComprehensive coverage of a growing field of research\r\nUnique treatment of all major vertebrate and invertebrate model systems with excellent opportunites for relating behavior to molecular genetics\r\nCovers an unusual breadth ranging from molecules to ecophysiology, and from basic science to clinical research","torrent":{"xt":"urn:btih:c436feb23f24e0ba387713741095164d919bd6cf","amp;dn":"Hormones%2C+Brain+and+Behavior+2nd+ed+-+Donald+W.+Pfaff+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c436feb23f24e0ba387713741095164d919bd6cf","infoHashBuffer":{"type":"Buffer","data":[196,54,254,178,63,36,224,186,56,119,19,116,16,149,22,77,145,155,214,207]},"announce":[],"urlList":[]}}