{"title":"Saunders Nursing Drug Handbook 2014 [PDF]~StormRG~","uid":9651497,"size":28437764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c43c7d98b2a863b03adfc5a93ccdbef2892fa432&amp;dn=Saunders+Nursing+Drug+Handbook+2014+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":-1,"time":1393082562,"description":"Authors: Barbara B. Hodgson , Robert J. Kizior\nSeries: Saunders Nursing Drug Handbook\nPaperback: 1552 pages\nPublisher: Saunders; 1 edition (June 21, 2013)\nLanguage: English\nISBN-10: 1455707392\nISBN-13: 978-1455707393\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nWritten by two expert nursing and pharmacy clinicians and organized alphabetically by generic drug name, Saunders Nursing Drug Handbook 2014 provides essential information for over 1,000 generic name and 4,000 trade name drugs in one quick, convenient source. With comprehensive coverage of IV drug administration as well as guidance through clinical priorities in the practice setting, this resource offers the precautionary information you need to provide safer patient care.\n\nOver 1,000 generic name drugs (encompassing over 4,000 trade name drugs) organized alphabetically with A to Z tabs to make accessing important information quick and easy.\n\nDetailed drug information distinguishing side effects and adverse reactions helps you identify which are most likely to occur.\nSpecial text treatment for &quot;High Alert&quot; drugs that pose the greatest risk for patient harm promotes safe drug administration.\n\nUNIQUE! ( for ebook only) Frequently-used herb monographs as well as additional herb information keep you informed of commonly encountered herbs.\nTop 200 Drugs helps you identify the most frequently administered drugs.\n\nLifespan and disorder-related dosage variations content equips you with special considerations for specific patient populations.\n\nTherapeutic and toxic blood level information shows you patient implications for drug administration.\n\nComprehensive IV Compatibility Chart foldout arms you with compatibility information for 65 intravenous drugs.\n\nNEW! Drug monographs for approximately 28 newly approved drugs by the FDA provide you with the most current drug information.\n\nNEW! Updated monographs with new interactions, precautions, alerts and patient teaching instructions boost your confidence in accuracy and help prevent medication dispensing errors.\n\nNEW! Nearly 300 Black Box Alerts highlight drugs found to carry a significant risk of serious or even life-threatening adverse effects.","torrent":{"xt":"urn:btih:c43c7d98b2a863b03adfc5a93ccdbef2892fa432","amp;dn":"Saunders+Nursing+Drug+Handbook+2014+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c43c7d98b2a863b03adfc5a93ccdbef2892fa432","infoHashBuffer":{"type":"Buffer","data":[196,60,125,152,178,168,99,176,58,223,197,169,60,205,190,242,137,47,164,50]},"announce":[],"urlList":[]}}