{"title":"Peggy Lee - Black Coffee (1956) [24 bit FLAC] vinyl","uid":9602335,"size":390912832,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c44691f1fae478e378922cf3fa5af680a21ac9ea&amp;dn=Peggy+Lee+-+Black+Coffee+%281956%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1392142043,"description":"\n  Peggy Lee - Black Coffee (1956) [24 bit FLAC] vinyl\n\n  Genre: Jazz\n  Styles: Vocal Jazz, Standards\n  Source: Ace of Hearts AH 5 (Mono pressing 1961)\n  Codec: FLAC\n  Bitrate: ~ 1,500 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  A1 Black Coffee \n  A2 I've Got You Under My Skin \n  A3 Easy Living \n  A4 My Heart Belongs to Daddy \n  A5 It Ain't Necessarily So \n  A6 Gee Baby, Ain't I Good to You \n \n  B1 A Woman Alone With the Blues \n  B2 I Didn't Know What Time It Was\n  B3 (Ah, the Apple Trees) When the World Was Young \n  B4 Love Me or Leave Me \n  B5 You're My Thrill \n  B6 There's a Small Hotel \n\n  Rip Info (not my rip)\n\n  Cleaned with Spin Clean Record Washer MKII \n  with distilled water and Spin Clean fluid\n  Technics SL-J2 Linear Tracking TT\n  Grado Prestige Red Cartridge\n  Creative Sound Blaster X-Fi HD USB Audio System \n  Integrated phono preamp\n  Goldwave 5.68, Audacity 2.02, ClickRepair 3.8.4\n  Scans: Mustek ScanExpress Pro USB 2400, Photoshop 9\n\n  Review\n\n  Peggy Lee left Capitol in 1952 for, among several other reasons, the label's refusal to let her record and release an exotic, tumultuous version of &quot;Lover.&quot; Lee was certainly no Mitch Miller songbird, content to loosen her gorgeous pipes on any piece of tripe foisted upon her; she was a superb songwriter with a knowledge of production and arrangement gained from work in big bands and from her husband, Dave Barbour (although the two weren't together at the time). The more open-minded Decca acquiesced to her demand, and watched its investment pay off quickly when the single became her biggest hit in years. Black Coffee was Lee's next major project. Encouraged by longtime Decca A&amp;R Milt Gabler, she hired a small group including trumpeter Pete Candoli and pianist Jimmy Rowles (two of her favorite sidemen) to record an after-hours jazz project similar in intent and execution to Lee Wiley's &quot;Manhattan project&quot; of 1950, Night in Manhattan. While the title-track opener of Black Coffee soon separated itself from the LP -- to be taught forever after during the first period of any Torch Song 101 class -- the album doesn't keep to its concept very long; Lee is soon enough in a bouncy mood for &quot;I've Got You Under My Skin&quot; and very affectionate on &quot;Easy Living.&quot; (If there's a concept at work here, it's the vagaries of love.) Listeners should look instead to &quot;It Ain't Necessarily So&quot; or &quot;Gee, Baby, Ain't I Good to You?&quot; for more examples of Lee's quintessentially slow-burn sultriness. Aside from occasionally straying off-concept, however, Black Coffee is an excellent record, spotlighting Lee's ability to shine with every type of group and in any context. [When originally recorded and released in 1953, Black Coffee was an eight-song catalog of 78s. Three years later, Decca commissioned an LP expansion of the record, for which Lee recorded several more songs. ","torrent":{"xt":"urn:btih:c44691f1fae478e378922cf3fa5af680a21ac9ea","amp;dn":"Peggy+Lee+-+Black+Coffee+%281956%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44691f1fae478e378922cf3fa5af680a21ac9ea","infoHashBuffer":{"type":"Buffer","data":[196,70,145,241,250,228,120,227,120,146,44,243,250,90,246,128,162,26,201,234]},"announce":[],"urlList":[]}}