{"title":"The.Great.British.Bake.Off-S06E03-Bread--360p","uid":12251437,"size":351493665,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c4d0c01d00ba8a2361ee873c442066779bd7ac27&amp;dn=The.Great.British.Bake.Off-S06E03-Bread--360p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"uggauga","files":2,"time":1440023832,"description":"The Great British Bake Off, Series 6 Episode 3 of 11\n\nBread\n\nThe ten remaining bakers face bread week.\n\nStarting with the signature challenge, the bakers must tackle a Bake Off first and make quick breads - with no proving necessary, the bakers have an hour and a half to get creative with their flavours. Ranging from sweet chocolate loaves to manchego and prosciutto stuffed bread, the finished loaves are a delight, and one even earns a handshake from Paul.\n\nIn another Bake Off first, Paul sets baguettes as the technical challenge. A seemingly simple recipe, everyone knows what a baguette looks like... or do they? The pressure of the tent gets to a few of the bakers, and the finished baguettes result in one of Paul's most brutal judgings.\n\nFor their show-stopper, the bakers must make edible 3-D bread sculptures. As one baker says, 'it's doughverload', with another making enough bread to start up his own bakery. Mary and Paul have to work their way through a bicycle, a snake, an array of flowers, a lion and even the Brighton Pavilion, all made of bread. The results are impressive - so much so that one baker renders Paul speechless by making the best bread sculpture he's ever seen.\n\n------------------------------\n\nIncludes subtitles\n\nEnjoy !!!","torrent":{"xt":"urn:btih:c4d0c01d00ba8a2361ee873c442066779bd7ac27","amp;dn":"The.Great.British.Bake.Off-S06E03-Bread--360p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d0c01d00ba8a2361ee873c442066779bd7ac27","infoHashBuffer":{"type":"Buffer","data":[196,208,192,29,0,186,138,35,97,238,135,60,68,32,102,119,155,215,172,39]},"announce":[],"urlList":[]}}