{"title":"Kenny Dorham - Afro Cuban 1955 - 320Kbps - Latin Jazz # DrBn","uid":9407158,"size":110979448,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c4f36d4288581e3cb9ccf259c3546c0da72c67f4&amp;dn=Kenny+Dorham+-+Afro+Cuban+1955+-+320Kbps+-+Latin+Jazz+%23+DrBn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Drebben","files":11,"time":1388191207,"description":"An ageless recording of true historical import in all matters Latin and Jazz,  \nand - it still kicks ass . . .\n\nKenny Dorham had a deeply moving, pure tone on trumpet; his sound was clear, sharp, and piercing, especially during ballads. He could spin out phrases and lines, but when he slowly and sweetly played the melody it was an evocative event.\n\nHe joined Charlie Parker's group in 1948, staying there until 1949. He did sessions in New York during the early and mid-'50s, making his recording debut as a leader on Charles Mingus and Max Roach's Debut label in 1953.\n \nDorham was a founding member of Art Blakey's Jazz Messengers in 1954.\n\nHe then cut Afro-Cuban for Blue Note with Art Blakey, J.J. Johnson, Cecil Payne, Hank Mobley, and Horace Silver in 1955.\n\nConsidered Kenny Dorham's finest recording of his all-too-short career, this re-reissue has been newly remastered and presumably now includes all of the takes from these nonet and sextet sessions of 1955. Considering the time period, this date remains way ahead of the Latin-tinged and hard bop music that would follow. It would be difficult to assess the sextet being a step below the larger group effort, but only because it is much less Afro-Cuban. Nonetheless the unmistakable drumming of Art Blakey powers the combo through the blisteringly swinging &quot;La Villa&quot; with unison horns (Hank Mobley, tenor sax; Cecil Payne, baritone sax). The other easy swinging pieces &quot;K.D.'s Motion,&quot; &quot;Venita's Dance,&quot; and &quot;Echo of Spring/K.D.'s Car Ride&quot; display great group empathy and seem effortless, though they're not.\n\nIt's the Latin-based music that really differentiates this band from all others of this era, save Dizzy Gillespie's. Payne's robust baritone ignites the hip call-and-response motif of &quot;Afrodisia,&quot; while his horn in tandem with pianist Horace Silver backs the up-front horns, supplemented by trombonist J.J. Johnson, for the heated mambo-ish hard bopper &quot;Basheer's Dream.&quot; Two takes of &quot;Minor's Holiday&quot; are, curiously enough, exactly the same time at 4:24, both super cooking with Dorham's clear-as-a-bell trumpet leading the other horns, which practically act as backup singers. Percussionist Carlos &quot;Patato&quot; Valdes is the perfect spice added to this dish. The lone ballad, &quot;Lotus Flower,&quot; is remarkable in that its marked tender restraint feels on the brink of wanting to cut loose, but never does.\n\nA first-rate recording for the under-appreciated Dorham, this one should be in every collection of all true music lovers.\n\n\nKENNY DORHAM\n\nAfro Blue     1955\n\n\n- CD\n- Remasrered\n- Bonus Tracks\n- 320Kbps\n\n\nTracklist:\n1 Afrodisia \t\t\n2 Lotus Flower \t\t\n3 Minor's Holiday \t\t\n4 Basheer's Dream \t\t\n5 K.D.'s Motion \t\t\n6 La Villa \t\t\n7 Venita's Dance \t\t\n8 Echo Of Spring (AKA K.D.'s Cab Ride) \t\t\n9 Minor's Holiday (Alternate Take) \t\t\n\n\nTracks 1 to 4 originally issued in 1955 as Blue Note BLP 5065\nTracks 5 to 7 originally issued in 1957 on Blue Note BLP 1535\nTrack 8 originally issued on box 2 of &quot;40 Years Of Jazz: The History Of Blue Note&quot; (Blue Note 1A158-83385/8) in Holland \nTrack 9 originally issued in 1987 on the first CD edition of this album\n\n\n\nMusicians:\nKenny Dorham, trumpet\nJ. J. Johnson, trombone (tracks 1-4 and 9)\nHank Mobley, tenor saxophone\nCecil Payne, baritone saxophone\nHorace Silver, piano\nPercy Heath (tracks 5-8), Oscar Pettiford (tracks 1-4 and 9), bass\nArt Blakey, drums\nCarlos &quot;Patato&quot; Valdes, conga (tracks 1-4 and 9)\nRichie Goldberg, cowbell (tracks 1-4 and 9)\n\n\nOriginally recorded on March 29 (tracks 1 to 4, 9) and January 30 (tracks 5 to 8), 1955 at the Van Gelder Studio, Hackensack, New Jersey\n\n\n \n\n\n\n","torrent":{"xt":"urn:btih:c4f36d4288581e3cb9ccf259c3546c0da72c67f4","amp;dn":"Kenny+Dorham+-+Afro+Cuban+1955+-+320Kbps+-+Latin+Jazz+%23+DrBn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f36d4288581e3cb9ccf259c3546c0da72c67f4","infoHashBuffer":{"type":"Buffer","data":[196,243,109,66,136,88,30,60,185,204,242,89,195,84,108,13,167,44,103,244]},"announce":[],"urlList":[]}}