{"title":"False Economy - A Surprising Economic History Of The World (2009","uid":7870079,"size":4874732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5a2bf0c456893781d035ef0d7b60d5c7bbf522a&amp;dn=False+Economy+-+A+Surprising+Economic+History+Of+The+World+%282009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"KatQwerty80","files":3,"time":1354180661,"description":"Overview\nWhy do some economies crash and burn, while others are buffeted by the storms of history and are able to recover? Can we analyze the fates of countries in a way that will help us analyze the fault lines and successes that can make or break a city, a culture, or a civilization?\n\nIn False Economy, Alan Beattie weaves together elements of history, economics, politics, and human stories, revealing the ways in which governments and countries make concrete choices that determine their destinies. Using extraordinary stories of economic triumph and disaster, he explains how some countries have gone wrong while others have gone right, and why it's so difficult to change course once you're on the path to ruin. Beattie opens up larger questions about the decisions countries make, why they make them, and what these, choices can mean for the future of our global economy as we go forward into uncharted territory.\n\nAlong the way, you'll discover why Africa doesn't produce cocaine, why our asparagus comes from Peru, why your keyboard spells QWERTY, and why giant pandas are living on borrowed time.","torrent":{"xt":"urn:btih:c5a2bf0c456893781d035ef0d7b60d5c7bbf522a","amp;dn":"False+Economy+-+A+Surprising+Economic+History+Of+The+World+%282009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5a2bf0c456893781d035ef0d7b60d5c7bbf522a","infoHashBuffer":{"type":"Buffer","data":[197,162,191,12,69,104,147,120,29,3,94,240,215,182,13,92,123,191,82,42]},"announce":[],"urlList":[]}}