{"title":"How to Run a Country: An Ancient Guide for Modern Leaders ","uid":12110203,"size":37568955,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c6ffc1eae6c4f23bc1d5a068b7d89e4416e7eea1&amp;dn=How+to+Run+a+Country%3A+An+Ancient+Guide+for+Modern+Leaders+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Horisarte","files":3,"time":1436550966,"description":"How to Run a Country: An Ancient Guide for Modern Leaders by Marcus Tullius Cicero\n &lt;a href=&quot;\nhttp://i.imgur.com/VbVufzU.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/VbVufzU.jpg&lt;/a&gt;\n\nMarcus Cicero, Rome's greatest statesman and orator, was elected to the Roman Republic's highest office at a time when his beloved country was threatened by power-hungry politicians, dire economic troubles, foreign turmoil, and political parties that refused to work together. Sound familiar? Cicero's letters, speeches, and other writings are filled with timeless wisdom and practical insight about how to solve these and other problems of leadership and politics. How to Run a Country collects the best of these writings to provide an entertaining, common-sense guide for modern leaders and citizens. This brief book, a sequel to How to Win an Election, gathers Cicero's most perceptive thoughts on topics such as leadership, corruption, the balance of power, taxes, war, immigration, and the importance of compromise. These writings have influenced great leaders - including America's Founding Fathers - for 2,000 years, and they are just as instructive today as when they were first written. \n\nOrganized by topic and featuring lively new translations, the book also includes an introduction, headnotes, a glossary, suggestions for further reading, and an appendix containing the original Latin texts. The result is an enlightening introduction to some of the most enduring political wisdom of all time.\n\n\nWritten by: Marcus Tullius Cicero\nNarrated by: James Adams\nLength: 1 hr and 17 mins\nUnabridged Audiobook\nRelease Date:05-10-13\nPublisher: Audible Studios\nTranslated by Philip Freeman","torrent":{"xt":"urn:btih:c6ffc1eae6c4f23bc1d5a068b7d89e4416e7eea1","amp;dn":"How+to+Run+a+Country%3A+An+Ancient+Guide+for+Modern+Leaders+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6ffc1eae6c4f23bc1d5a068b7d89e4416e7eea1","infoHashBuffer":{"type":"Buffer","data":[198,255,193,234,230,196,242,59,193,213,160,104,183,216,158,68,22,231,238,161]},"announce":[],"urlList":[]}}