{"title":"Frank Frazetta Image Comics Collection [ADULT]","uid":5554051,"size":358542936,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c7152dee96c075325935655a791518ead78d6852&amp;dn=Frank+Frazetta+Image+Comics+Collection+%5BADULT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"brodahisou","files":-1,"time":1273630294,"description":"Between 2007 and 2010 Image Comics published a number of comic series and one-shots inspired by Frank Frazetta's most famous works.  Each issue featured a cover by Frazetta.\n\n\nCreatures\nAn untold adventure of Teddy Roosevelt, Rough Rider, President of the United States as he uncovers a plot concocted by a band of nefarious aliens in cahoots with a malevolent ancient Mayan demon to eradicate humanity and claim Earth for their own purposes. \nWritten by Rick Remender (Fear Agent) and illustrated by Peter Bergting (Strange Girl).\n\n\nDark Kingdom\nFrom amid the clash of steel and decks stained red comes legendary sea raider Red Morden, battling his way through an ocean of horror to save the family he holds dear. For love and vengeance, he will face his greatest fears, both real and imagined as he stands alone against a kingdom of darkness. \nWritten by Mark Kidwell (Bump), and illustrated by Tim Vigil (Gothic Knights) and colored by Jay Fotos ('68).\n\n\nDeath Dealer\nIn an ancient land two warring nations are fighting an epic war and then the Death Dealer appears on the field of battle.\nWritten by Joshua Ortega (The Necromancer, Star Wars) with pencils and inks by Nat Jones (Spawn: The Dark Ages), and colors by Jay Fotos (Spawn).  Also included is the earlier Death Dealer series published by Verotik which was written by Glenn Danzig (Satanika) and illustrated by Simon Bisley (Hulk/Wolverine: 6 Hours).\n\n\nDracula Meets the Wolf-Man\nIn the wake of the legendary Count Dracula's &quot;final&quot; excursion to England, the bloodthirsty count finds himself on the hunt for a beautiful peasant woman in a village living in the shadows of Dracula's castle. Unfortunately for the seductive Count, someone else has eyes for the beauty, and that someone else just happens to be the fear-inspiring Wolf-Man! Prepare yourself for the battle of the year as vampire faces lycanthrope in a battle to the death!\nWritten by Steve Niles (30 Days of Night) and illustrated by Nat Jones (30 Days of Night: Spreading the Disease).\n\n\nFreedom\nIn the fall of 1876, three months after the murder of Wild Bill Hickock, another legend rode into Deadwood, South Dakota. The dime novels said he was fast with a six-gun and faster with the ladies - said he'd killed more men than he could count. They called him the Freedom Kid. Sometimes, the pen is indeed mightier than the sword... and a legend is a hard thing to live up to.\nWritten by Mark Kidwell (Bump), with art by John Cboins.\n\n\nMoon Maid\nOn the dead moon of Kyra, a sheltered young Maid is torn between good and evil. As she comes of age and the equinox draws closer, the Maid learns her true identity and what purpose she has in the universe. \nWritten by Jay Fotos (Sam and Twitch), with art by Tim Vigil (Cuda).\n\n\nNeanderthal\nBeyond the usual threats from warring tribe and Sabertooth tigers, a tribe of Neanderthals runs up against a threat they couldn't possibly imagine... and can't possibly survive. \nWritten by Chris Ryall and illustrated by Tim Vigil (Faust) and Jay Fotos (Locke &amp; Key).\n\n\nSorcerer \n900 years before the epic &quot;Shadows of Mirahan&quot; storyline from Frank Frazetta's Death Dealer, the demons of Iparsia begin planning the fall of the Druids, aided by the dark mystic Uja Daja. \nWritten by Joshua Ortega (Queen Sonja), with art by Josh Medors (Fused) and Nat Jones (The Nail).\n\n\nSwamp Demon\nSet in the Land of Iparsia, 500 years before the epic &quot;Shadows of Mirahan&quot; storyline from Frank Frazetta's Death Dealer, comes this dark fantasy of druids, demons, and the mysterious and beautiful witch-goddess known as Kallista. \nWritten by Joshua Ortega (Gears of War) and pencilled by Josh Medors (G.I. Joe: America's Elite).\n\nDue to mature content this torrent comes with an ADULT rating.\n\n\nReleased on &lt;a href=&quot; http://ComicPirates.info&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://ComicPirates.info&lt;/a&gt;","torrent":{"xt":"urn:btih:c7152dee96c075325935655a791518ead78d6852","amp;dn":"Frank+Frazetta+Image+Comics+Collection+%5BADULT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7152dee96c075325935655a791518ead78d6852","infoHashBuffer":{"type":"Buffer","data":[199,21,45,238,150,192,117,50,89,53,101,90,121,21,24,234,215,141,104,82]},"announce":[],"urlList":[]}}