{"title":"Beyond Photoshop - Advanced Techniques","uid":9173793,"size":59918966,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7a2f9eb421352f7514110d185ff970d15c3ac9a&amp;dn=Beyond+Photoshop+-+Advanced+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"svdinesh","files":1,"time":1384114613,"description":"In his best-selling book Creative Photoshop, award-winning artist Derek Lea previously revealed to the digital art world his secrets for creating stunning, sophisticated works of art using Photoshop. Now, he goes one step further in this all-new book to demonstrate his unique methods for using Photoshop in conjunction with other software packages. Derek's compelling images will inspire you to think creatively about the ways in which you can use Photoshop alongside other popular programs such as Illustrator, Poser, Painter, Cinema4D, and ZBrush to take your own art to the next level. Whether you are a digital artist, illustrator, cartoonist, graphic artist, designer, 3D enthusiast, or serious hobbyist working for print or the web, this fantastic new book will open your eyes to a whole new world of digital art that's never before been uncovered. Challenge yourself and discover the more artistic aspects of these programs with one of the world's best teachers by your side.\n\nThe only book available that shows how to use Photoshop in conjunction with Illustrator, Poser, Painter, Cinema4D, and ZBrush to create sophisticated, high quality digital art * Packed with stunning full color images from one of the world's most talented digital artists to inspire you to push your own creativity further than you ever thought possible * Showcased projects cover techniques using vector graphics, digital painting, and 3D.\n\nBeyond Photoshop - July 16, 2010\nBook Language: English \nPages: 355\nFile Type: Pdf\nFile Size: 57.14 MB\n\nISBN-10: 0240811909\nISBN-13: 978-0240811901\n &lt;a href=&quot;\nhttp://i.imgur.com/PBPuSYq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/PBPuSYq.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:c7a2f9eb421352f7514110d185ff970d15c3ac9a","amp;dn":"Beyond+Photoshop+-+Advanced+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7a2f9eb421352f7514110d185ff970d15c3ac9a","infoHashBuffer":{"type":"Buffer","data":[199,162,249,235,66,19,82,247,81,65,16,209,133,255,151,13,21,195,172,154]},"announce":[],"urlList":[]}}