{"title":"Henri F. Ellenberger - The Discovery of the Unconscious (1970)","uid":10632696,"size":34074650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7ee7013b656c6bad9a851f3144cc42b8a6555ac&amp;dn=Henri+F.+Ellenberger+-+The+Discovery+of+the+Unconscious+%281970%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"workerbee","files":-1,"time":1406341960,"description":"\n* Henri F. Ellenberger - The Discovery of the Unconscious: The History and Evolution of Dynamic Psychiatry (Basic Books, 1970 / Fontana, 1994).  976 pp. -- PDF\n\n\nThis classic work is an encyclopedic, integrated view of the search for an understanding of the inner reaches of the mind.  In an account that is both exhaustive and exciting, the distinguished Swiss psychiatrist and medical historian Henri F. Ellenberger (1905-1993) demonstrates the long chain of development -- through the exorcists, magnetists, and hypnotists -- that led to the fruition of dynamic psychiatry in the psychological systems of Janet, Freud, Adler, and Jung.\n\nIt is, to my mind anyway, the most comprehensive single-volume history of the origins of psychoanalysis and psychotherapy, and was widely acclaimed for its clear presentation of the ideas of the great twentieth-century figures in their socio-historical contexts.  It has been credited by literary critic Frederick Crews with demolishing the myth of Freud's originality and encouraging subsequent scholars to question the scientific validity of psychoanalysis.\n\nThis PDF is an improved and smaller version of an older scan in which the page images have been completely reprocessed with contents in bookmarks and accurate pagination.\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n                                                   &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:c7ee7013b656c6bad9a851f3144cc42b8a6555ac","amp;dn":"Henri+F.+Ellenberger+-+The+Discovery+of+the+Unconscious+%281970%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ee7013b656c6bad9a851f3144cc42b8a6555ac","infoHashBuffer":{"type":"Buffer","data":[199,238,112,19,182,86,198,186,217,168,81,243,20,76,196,43,138,101,85,172]},"announce":[],"urlList":[]}}