{"title":"Pink Floyd Video Anthology Vol. 2","uid":15145133,"size":4540410975,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c81de06a46e28e73d48aa460479dc98e58973fbe&amp;dn=Pink+Floyd+Video+Anthology+Vol.+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"GRNS3","files":20,"time":1467221281,"description":"Here is part two of 5. Check my account for more classic bootlegs.\r\n\r\nPlease enjoy, share with friends and please seed :)\r\n\r\nPink Floyd Video Anthology (RevA)\r\nVolume 2 (1968)\r\nHRV DVD 005B\r\n\r\nVideo: NTSC (4:3)\r\nAudio: PCM 2.0 Stereo/Mono\r\nRunning Time: Approx 1 hour 28 mins\r\n\r\nPromo Films with David Gilmour\r\nParc de Laeken and RTB TV Studios, Brussels, Belgium\r\n18-19 February, 1968\r\nMimed performances of Astronomy Domine, Scarecrow, Corporal Clegg, Paintbox, Set the Controls for the Heart of the Sun, See Emily Play and a photo montage of Bike were broadcast in a dedicated Pink Floyd TV special, as part of the Tienerklanken pop music show.\r\nBroadcast on BRT TV on 31 March, 1968.\r\n\r\nA mimed performance of Apples and Oranges was broadcast on the RTB pop music program\r\nVibrato on 27 February, 1968.\r\n\r\nBouton Rouge, ORTF Studios, Buttes Chaumont, Paris\r\n20 February, 1968\r\nLive performances of Astronomy Domine, Flaming, Set the Controls for the Heart of the Sun, and Let There Be More Light.\r\nBroadcast on ORTF2 on 25 February, 1968.\r\n\r\nDiscorama, ORTF Studios, Buttes Chaumont, Paris\r\n21 February, 1968\r\nA mimed performance of Paintbox appeared on the French TV show Discorama.\r\nBroadcast on ORTF2 on 3 March, 1968.\r\n\r\nThe Sound of Change, BBC Lime Grove Studios, Shepherds Bush, London\r\n26 March, 1968\r\nAn untitled instrumental was performed live for the magazine program Late Night Line Up subtitled The Sound of Change.\r\nBroadcast on BBC2 TV on 10 September, 1968.\r\n\r\nAll My Loving, Abbey Mills Pumping Station, East Stratford, London\r\n28 March, 1968\r\nSet the Controls for the Heart of the Sun was performed live for the BBC Omnibus TV special subtitled All My Loving. This clip features the single-camera dailies which were edited together from various takes creating a full performance of the piece. \r\nOriginally broadcast on BBC1 TV on 3 November, 1968 in black and white.\r\nRebroadcast on BBC2 TV on 18 May, 1969 in color.\r\n\r\nRome Goes Pop, Piper Club, Rome\r\n18 or 19 April, 1968\r\nAn abbreviated mimed performance of It Would Be So Nice appeared as part of the Rome Goes Pop TV special.\r\nBroadcast on BBC2 TV on 18 May, 1968.\r\n\r\n1st European International Pop Festival, Palazzo Dello Sport, Rome\r\n6 May, 1968\r\nA live performance of Interstellar Overdrive.\r\nBroadcast on German ARD TV. Program and broadcast date are unknown.\r\n\r\nKastival 1968, Kastival 68 Festival, Kasterlee, Belgium\r\n31 August, 1968\r\nAn interview with Roger Waters and a live performance of Astronomy Domine were filmed by BRT TV, Belgium and broadcast as part of a 30-minute Kastival 1968 TV special on the Tienerklanken pop music show.\r\nBroadcast on 8 October, 1968.\r\n\r\nSamedi et Compagnie, ORTF Studios, Buttes Chaumont, Paris\r\n6 September, 1968\r\nMimed performances of Let There Be More Light and Remember a Day were featured on the music program Samedi et Compagnie.\r\nBroadcast on ORTF1 on 21 September, 1968.\r\n\r\nSurprise Partie, Le Bilboquet, St. Germain des Pres, Paris\r\n7 September, 1968\r\nA live performance of Let There Be More Light was included on the 4-hour TV special Surprise Partie.\r\nBroadcast on ORTF2 on 31 December, 1968.\r\n\r\nTous en Scene, LAntenne du Chapiteau du Kremlin-Bicetre, Paris\r\n31 October, 1968\r\nLet There Be More Light and Flaming were performed live for the music program Tous en Scene.\r\nBroadcast on ORTF2 on 26 November, 1968.\r\n\r\nPoint Me at the Sky, Promo Film\r\nNovember, 1968\r\nThis promotional film of Point Me at the Sky featured David Gilmour and Nick Mason piloting Gypsy Moth biplanes flying over the English countryside. Publicity photos of the band members wearing aviator clothing were taken at Biggin Hill Aerodome in November and it is assumed that this promotion film was made around this time.\r\n\r\nBonus Clip\r\nLet There Be More Light, Promo Film\r\nSeptember, 1968\r\nA video of the band on a London Tube train accompanied an abbreviated version of Let There Be More Light on the French TV show A Laffiche du Monde.\r\nBroadcast on ORTF2 on 12 October, 1968.\r\n\r\nEnjoy!\r\nTeam HRV (2011)","torrent":{"xt":"urn:btih:c81de06a46e28e73d48aa460479dc98e58973fbe","amp;dn":"Pink+Floyd+Video+Anthology+Vol.+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81de06a46e28e73d48aa460479dc98e58973fbe","infoHashBuffer":{"type":"Buffer","data":[200,29,224,106,70,226,142,115,212,138,164,96,71,157,201,142,88,151,63,190]},"announce":[],"urlList":[]}}