{"title":"Sexually Broken--Hot Latino Jynx Maze suffers Rope Bondage  Matt","uid":8674225,"size":1176422841,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c84689e2f4ee6aba7222d31779c29f4a1e7b2253&amp;dn=Sexually+Broken--Hot+Latino+Jynx+Maze+suffers+Rope+Bondage++Matt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"merzedes","files":-1,"time":1373554411,"description":"\nHot Latino Jynx Maze suffers Rope Bondage is Deep Throated &amp; Roughly Fucked Hogtied &amp; Made to Cum | Jynx Maze | Matt Williams\n\nJuly 10, 2013 \n \n\nMP4 only.\n \n \nWe are pleased to welcome one of the hottest Latino porn stars in the world to the pages of Sexually Broken. Jynx Maze has perfect natural breast, an amazing ass, and is simply one of the most beautiful persons on the planet.\n\nThis is the &quot;Meet and Greet&quot;, all the bondage is done on camera. It is the most realistic bondage scene you can find on the internet today. No idea, no plan, it just flows. She starts all smiles with pretty make up, she ends a cummed out mess. Bound, helpless, throated, and pussy fucked, with liquid dripping out of every hole. We simply destroy the girl with cock and orgasms.\n\nWe start with a tight elbow and wrist tie. Jynk's finds herself bound and completely helpless in seconds. We make her pull the hard cock out of our pants, then knock her to her knees and skull fuck the shit out of our tiny Latino's cute face hole. Deep throating at it's best, rough face fucking while completely bound and helpless. We make her worship the cock with her mouth. Over and over we push it farther into her throat, she struggles for air, we show no mercy.\n\nDeep in subspace now, we make her take off her tight booty shorts. We make her lie down and stick out that amazing ass of hers. Our cock, pre-lubed with her throat spit, slides deep into her wet pussy. We fuck her to several brutal orgasms on the dirty floor. We tie off her legs into a brutal hogtie with her neck bound to her feet. Now she must use all her strength, and keep that arch, or she will slowly choke her self out. We fuck her throat one good last time and let her suffer in the extreme bondage. Jynx just got run over by the cock train, and is wondering what the hell just happen... \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_10jmaze/SexuallyBroken-Jynx-Maze-Matt-Williams-Hot-Latino-Jynx-Maze-suffers-Rope-Bondage-is-Deep-Throated--Roughly-Fucked-Hogtied--Made-to-Cum.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/07_10jmaze/SexuallyBroken-Jynx-Maze-Matt-Williams-Hot-Latino-Jynx-Maze-suffers-Rope-Bondage-is-Deep-Throated--Roughly-Fucked-Hogtied--Made-to-Cum.php&lt;/a&gt;\n\n11 000 uploads and counting, 12k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:c84689e2f4ee6aba7222d31779c29f4a1e7b2253","amp;dn":"Sexually+Broken--Hot+Latino+Jynx+Maze+suffers+Rope+Bondage++Matt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c84689e2f4ee6aba7222d31779c29f4a1e7b2253","infoHashBuffer":{"type":"Buffer","data":[200,70,137,226,244,238,106,186,114,34,211,23,121,194,159,74,30,123,34,83]},"announce":[],"urlList":[]}}