{"title":"Ancient Rome - An Illustrated History (History Ebook).pdf","uid":8645289,"size":35443307,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8a0dff1c43d71b5735fc531dbd449aefe2d9d42&amp;dn=Ancient+Rome+-+An+Illustrated+History+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"STBGD","files":-1,"time":1372969081,"description":"Marshall Cavendish Corporation, &quot;Ancient Rome: An Illustrated History&quot; \nEnglish | 2011 | ISBN: 0761499563, 0761479333 | 168 pages | PDF | 33.8 MB\n\nAncient Rome: An Illustrated History tracks the progress from the legendary founding of Rome by Romulus in 753 BCE, to the heights of the Roman Empire around 117 CE, and on to the death of Theodosius (the last man to rule over a unified Roman Empire) in 395 CE.\n\nReview:\nIn 98 AD, Rome became the greatest empire of its time. This book takes the reader from Rome's beginning to the rise of its empire through its transformation to Christianity and the empire's decline. It begins with a look at early Rome with its seven kings and then a republic governed by assemblies and elected officials. When the republic came to an end and after many civil wars, men like Julius Caesar and Mark Antony ruled. Emperors highlighted in the book include Caesar Augustus as the first Roman emperor and Tiberius, Caligula, Claudius and Nero. Beyond history, the book focuses on Roman civilization, social life and customs.\n\nReaders will learn about the Roman religion, including Vestal Virgins (the six priestesses who kept the eternal flame alight in the shrine to Vesta) and the Lares (the protective spirits watching over travelers and family). Everyday life is featured in the book as well, including the bread and circuses, the trade guilds, the blood games, chariot races, the baths, theatre, poetry and education. Maps, timelines, insets, and photos of archaeological digs and their finds are interspersed throughout the text. Readers of this book will learn more about known topics as well as be introduced to totally new subject areas. The appendices include a glossary and a listing of major historical figures. Lynn O'Connell","torrent":{"xt":"urn:btih:c8a0dff1c43d71b5735fc531dbd449aefe2d9d42","amp;dn":"Ancient+Rome+-+An+Illustrated+History+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8a0dff1c43d71b5735fc531dbd449aefe2d9d42","infoHashBuffer":{"type":"Buffer","data":[200,160,223,241,196,61,113,181,115,95,197,49,219,212,73,174,254,45,157,66]},"announce":[],"urlList":[]}}