{"title":"Endgame 1 &amp; 2 - Derrick Jensen books Resistance","uid":7007627,"size":5207310,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8c5328f0c6ccee46723fa70fe793a23ab445d0c&amp;dn=Endgame+1+%26amp%3B+2+-+Derrick+Jensen+books+Resistance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"f1ghtf1ght","files":-1,"time":1328329696,"description":"Endgame, Vol. 1: The Problem of Civilization \nThe long-awaited companion piece to Derrick Jensen's immensely popular and highly acclaimed works A Language Older Than Words and The Culture of Make Believe. Accepting the increasingly widespread fact that industrialized culture inevitably erodes the natural world, Endgame sets out to explore how this relationship impels us towards a revolutionary and as-yet undiscovered shift in strategy. Building on a series of simple but increasingly provocative premises, Jensen leaves us hoping for what may be inevitable: a return to the natural life via the disintegration of civilization itself.\n\nEndgame, Vol. 2: Resistance\nWhereas Volume 1 of Endgame presents the problem of civilization, Volume 2 of this pivotal work illustrates our means of resistance. Incensed and hopeful, impassioned and lucid, Endgame leapfrogs the environmental movement's deadlock over our willingness to change our conduct, focusing instead on our ability to adapt to the impending ecological revolution.\n\nAbout the Author\nActivist, philosopher, teacher, and leading voice of uncompromising dissent, DERRICK JENSEN holds degrees in creative writing and mineral engineering physics. In 2008, he was named one of the Utne Reader's &quot;50 Visionaries Who Are Changing Your World,&quot; and in 2006 he was named Press Action's Person of the Year for his work on the book Endgame. He lives in California. ","torrent":{"xt":"urn:btih:c8c5328f0c6ccee46723fa70fe793a23ab445d0c","amp;dn":"Endgame+1+%26amp%3B+2+-+Derrick+Jensen+books+Resistance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c5328f0c6ccee46723fa70fe793a23ab445d0c","infoHashBuffer":{"type":"Buffer","data":[200,197,50,143,12,108,206,228,103,35,250,112,254,121,58,35,171,68,93,12]},"announce":[],"urlList":[]}}