{"title":"Carlos Vives.(Discografia).","uid":4464971,"size":772127778,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c8c5fa28b0130383d1ab7f2a78e2a2d31a9ff3d0&amp;dn=Carlos+Vives.%28Discografia%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":5,"uploader":"cholo24","files":155,"time":1224874129,"description":"Carlos Vives\n\nCarlos Vives naciÃƒÂ³ el 7 de agosto de 1961 en Santa Marta, Departamento del Magdalena, Colombia, donde se graduÃƒÂ³ de publicista. DebutÃƒÂ³ como actor de telenovelas en 1982, interviniendo en un total de siete producciones antes de lanzar su carrera de cantante en 1988, cuando saca su primer disco.\n\n    Mientras continuaba su actividad como actor en Puerto Rico y en su paÃƒÂ­s, durante 1989 protagonizÃƒÂ³ dos series musicales. Un aÃƒÂ±o mÃƒÂ¡s tarde, gracias a la grabaciÃƒÂ³n de la serie &quot;Escalona&quot; participÃƒÂ³ en la banda sonora del que serÃƒÂ­a el disco mÃƒÂ¡s vendido en la historia de Colombia hasta el momento. \n\n    En 1991 decidiÃƒÂ³ organizar su banda La Provincia y a partir de entonces se ha fortalecido su prestigio como artista que elabora su mÃƒÂºsica inspirÃƒÂ¡ndose en el costumbrismo y en la rica tradiciÃƒÂ³n de su pueblo, tal como sigue haciendo ahora al lanzar &quot;Tengo FÃƒÂ©&quot;, que es su sÃƒÂ©ptima realizaciÃƒÂ³n discogrÃƒÂ¡fica.\n\n    Durante su carrera musical de sÃƒÂ³lo 9 aÃƒÂ±os, Carlos Vives ha ganado mÃƒÂ¡s de treinta reconocimientos, incluyendo, Discos de Oro, de Platino y de Diamante.\n\nEn 1996 tambiÃƒÂ©n formÃƒÂ³ parte del elenco estelar que grabÃƒÂ³ para EMI Latin la canciÃƒÂ³n &quot;Puedes Llegar&quot;, incluida en &quot;Voces Unidas&quot;, el album oficial de los  Juegos OlÃƒÂ­mpicos de Atlanta.\n\n    En lo personal, Carlos Vives dirige el sello Gaira MÃƒÂºsica Local, que se formÃƒÂ³ a partir del fenÃƒÂ³meno generado por su grupo La Provincia. &quot;Tengo FÃƒÂ©&quot; es una realizaciÃƒÂ³n de esta compaÃƒÂ±ÃƒÂ­a. Las bases fueron grabadas en Sonolux Recording Studios de BogotÃƒÂ¡, Colombia; y las voces en The Hit Factory de Nueva York. \n\n    Con una nueva imagen y ahora como artista de EMI Latin, rescatando los valores mÃƒÂ¡s representativos de la provincia, su tierra ancestral, Carlos Vives vuelve al mundo del disco y trae un album, titulado &quot;Tengo FÃƒÂ©&quot;, que asombra por la alegre profundidad de su contenido.\n\n    Fiel a su exitoso y colorido formato musical, a ritmo de autÃƒÂ©ntico vallenato y acompaÃƒÂ±ado del acordeÃƒÂ³n mÃƒÂ¡s famoso del continente, la caja, la guacharaca y la tambora, la gaita y el chicote, los instrumentos tÃƒÂ­picos que le han dado un sello tan caracterÃƒÂ­stico a sus interpretaciones, el sobresaliente artista colombiano realiza una exploraciÃƒÂ³n que lo lleva a esos buenos tiempos de un pasado reciente que se actualiza en sus versos y adquiere tanta vida que lo convierte en un retrato captado donde quisiera vivir y volver a nacer.\n\n    &quot;Tengo FÃƒÂ©&quot;, el positivo nombre del album, es, en sus propias palabras, algo asÃƒÂ­ como un grito, &quot;una plegaria que nace de adentro&quot; y pide &quot;por los buenos tiempos&quot;, recorriendo el cuento &quot;de un dolor que no es eterno&quot;.\n\n    El primer sencillo de este album se llama &quot;QuÃƒÂ© Diera&quot;. Es una canciÃƒÂ³n donde en tono intimista Carlos habla de la esperanza y de un frustrado encuentro con Gabriel GarcÃƒÂ­a MÃƒÂ¡rquez, el premio NÃƒÂ³bel de Literatura, &quot;Un Hombre Importante pa&amp;#039;la Humanidad&quot;, uno de sus escritores favoritos. \n\n    Nueve de los diez temas que se incluyen en este album son composiciones del propio Carlos Vives, quien como productor sigue utilizando el talento de su famoso acordeonista Egidio Cuadrado. El dÃƒÂ©cimo corte, &quot;Caballito&quot;, es un juego para niÃƒÂ±os del folklore del bajo Magdalena, en una adaptaciÃƒÂ³n musical de Gilberto MartÃƒÂ­nez.\n\n    A su manera Vives tambiÃƒÂ©n juega con la mÃƒÂºsica y se sitÃƒÂºa directa y deliberadamente como protagonista cuando escribe de la casa de sus abuelos o de los aÃƒÂ±os de su infancia, de un hÃƒÂ©roe deportivo o de la diosa de la sierra: el agua, con su antigua nobleza. Incluso se retrata a sÃƒÂ­ mismo, a propÃƒÂ³sito de malas lenguas que hablan de sus pantalones cortos y de su rebelde pelo largo.\n\n    Este ultimo detalle de su aspecto fÃƒÂ­sico pertenece al pasado, por que ahora el artista luce una imagen muy distinta y renovada.\n\t\n\n","torrent":{"xt":"urn:btih:c8c5fa28b0130383d1ab7f2a78e2a2d31a9ff3d0","amp;dn":"Carlos+Vives.%28Discografia%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c5fa28b0130383d1ab7f2a78e2a2d31a9ff3d0","infoHashBuffer":{"type":"Buffer","data":[200,197,250,40,176,19,3,131,209,171,127,42,120,226,162,211,26,159,243,208]},"announce":[],"urlList":[]}}