{"title":"Tex Willer N. 001-040 [Cbr - Ita] Fumetti Bonelli [TNTVillage]","uid":6138980,"size":1127915030,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c908496f2ce98e697e7ecc42d29b1fba9e09fb23&amp;dn=Tex+Willer+N.+001-040+%5BCbr+-+Ita%5D+Fumetti+Bonelli+%5BTNTVillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Cer8one","files":40,"time":1296421164,"description":"info: http://forum.tntvillage.scambioetico.org/tntforum/index.php?showtopic=237188\n\nTex Willer N. 001-040\n\nTex ÃƒÂ¨ in primo luogo un rappresentante della legge in quanto Ranger del Texas, in realtÃƒÂ  la sua non ÃƒÂ¨ un'attivitÃƒÂ  continuativa, non essendo inquadrato formalmente, ma nel corso delle missioni che svolge, sia su richiesta esplicita del Comando che spontaneamente, si qualifica frequentemente come tale esibendo, se occorre, la stella simbolo del corpo. Ma Tex ÃƒÂ¨ anche il capo supremo di tutte le tribÃƒÂ¹ Navajos, da questi ultimi chiamato Aquila della Notte; inoltre assume su di sÃƒÂ¨ anche l'incarico governativo di agente indiano della stessa nazione pellerossa. ÃƒË† spesso accompagnato nelle sue avventure dai suoi tre pards: Kit Carson, ranger al pari dell'amico; Kit Willer, figlio di Tex; Tiger Jack, guerriero Navajo e fratello di sangue dell'eroe.\nInsieme viaggiano per le praterie a protezione degli onesti cittadini, qualsiasi sia il colore della loro pelle, contro gli assalti dei fuorilegge: secondo la loro opinione Tex e la sua banda sono puro veleno, dei veri satanassi e dei tizzoni d'inferno con la morte che li accompagna.\nClassico esempio di eroe positivo senza macchia e senza paura, pur di far trionfare la giustizia ÃƒÂ¨ disposto anche a violare la legge. Anche i suoi rapporti con i tutori dell'ordine e le autoritÃƒÂ  costituite sono tutt'altro che idilliaci. Tex ha dalla sua una caratteristica precipua: nervi d'acciaio che gli consentono in ogni circostanza e in ogni pericolo di valutare la situazione e trovare una via di uscita. Questa particolare capacitÃƒÂ  gli permette in diverse situazioni di mettere in inferioritÃƒÂ  psicologica l'avversario di turno tanto da indurlo a sbagliare mira o, a volte, ad abbandonare la partita.\n\n\n\nAutori: - Gian Luigi Bonelli - Aurelio Galleppini\nTesti: - Gian Luigi Bonelli - Claudio Nizzi\nDisegni : - Autori Vari\nEditore : Sergio Bonelli Editore\n1Ã‚Âª edizione : 1948\nPeriodicitÃƒÂ  : mensile\nAlbi : 001-040\nScan And Edit a cura di Aquila della notte/DCP-ITALIA\nQualita Scan: 1400 x XXXX, 600 DPI 32 bit. File Cbr.","torrent":{"xt":"urn:btih:c908496f2ce98e697e7ecc42d29b1fba9e09fb23","amp;dn":"Tex+Willer+N.+001-040+%5BCbr+-+Ita%5D+Fumetti+Bonelli+%5BTNTVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c908496f2ce98e697e7ecc42d29b1fba9e09fb23","infoHashBuffer":{"type":"Buffer","data":[201,8,73,111,44,233,142,105,126,126,204,66,210,155,31,186,158,9,251,35]},"announce":[],"urlList":[]}}