{"title":"Homeland - Season 3","uid":9570243,"size":9026778995,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c934d90346305607d5caa9926b99737534b5b8be&amp;dn=Homeland+-+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":10,"uploader":"POtHS11","files":-1,"time":1391617550,"description":"\n\nSeason 3 (2013)\n\nThe beginning of season 3 presents the aftermath of a terrorist attack committed by Abu Nazir's people. Carrie is blamed for the CIA's failings as Senator Lockhart grills Saul, now Acting Director of the CIA, in front of the Senate Committee. However, it turned out to be part of a bigger plot, as Saul had Carrie seemingly disavowed by the CIA to lure a senior Iranian intelligence officer Majid Javadi (who financed the Langley bombing) into becoming a CIA asset. He later relayed the information to Carrie that the main perpetrator of the bombing was still in the U.S., and the CIA acted to bring the real bomber and the officer's lawyers in for questioning. As the Brody family struggles to live within their means amidst Brody's terrorist status, Brody himself is in hiding in Caracas, Venezuela, effectively being held prisoner by his captors until Saul's arrival. Following a gunshot wound to the torso, Brody becomes addicted to the heroin given to him as a painkiller. Saul eventually rescues him, detoxifies him, and recruits him for a mission: to go to Iran and use his notoriety as the &quot;Langley Bomber&quot; to get close to the current head of the Revolutionary Guard, Danesh Akbari, to assassinate him. During the initial assassination attempt, Brody publicly declares that he is seeking asylum in Iran, but is unable to get close enough to Akbari to assassinate him. Assuming that Brody will never have another opportunity to complete his mission, senior CIA officers order his assassination. However, with help from Carrie, Brody escapes and is able to arrange a meeting with Akbari, claiming to possess sensitive information about Javadi. During the meeting, Brody strikes Akbari and suffocates him to death. Carrie takes him to a safehouse, but Lockhart, with a direct order from the President, gives up their location to the Revolutionary Guard in order to increase Javadi's chances of being promoted. Brody is then publicly hanged as Carrie watches in the crowd. Four months later, Lockhart (now CIA Director) offers Carrie (now eight months pregnant) the job of station chief of CIA's Turkey operations (after a maternity leave). Carrie accepts the position but her request to place a star on the memorial wall to commemorate Brody is refused. In the final scene, Carrie is seen discreetly drawing a star on the memorial wall herself.","torrent":{"xt":"urn:btih:c934d90346305607d5caa9926b99737534b5b8be","amp;dn":"Homeland+-+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c934d90346305607d5caa9926b99737534b5b8be","infoHashBuffer":{"type":"Buffer","data":[201,52,217,3,70,48,86,7,213,202,169,146,107,153,115,117,52,181,184,190]},"announce":[],"urlList":[]}}