{"title":"The Walking Dead Season 1 Complete HDTV + Extras (Behind The Sce","uid":6098249,"size":2554265797,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c94641544805627e9416f9e58912fd5bf57ce824&amp;dn=The+Walking+Dead+Season+1+Complete+HDTV+%2B+Extras+%28Behind+The+Sce&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"TSV","files":-1,"time":1294861006,"description":"The Walking Dead is centered on Rick Grimes, a small-town police officer from Cynthiana, Kentucky, his family, and a number of other survivors who have banded together in order to survive after the world is overrun with zombies. As the series progresses, the characters become more developed, and their personalities shift under the stress of a zombie apocalypse, most notably Rick's.\n\nIn the beginning of the series, Rick and partner Shane are in a gunfight and Rick is shot and enters a coma. Upon waking in a hospital, he discovers the undead are in the building and town. Rick returns home and shortly decides to go to Atlanta, where the survivors were told to await help, to find his wife Lori and son Carl. He discovers the city is crowded with zombies and bumps into Glenn, a scavenger for a band of survivors. Following Glenn, Rick discovers Lori and Carl are okay along with Shane. However Shane is less than happy that his former partner has returned, having made romantic advances on Lori in Rick's absence.\n\nThe group searches for a place to call home, settling in a couple of temporary camps, including a prison, which comes to the attention of an insane man calling himself the Governor. The Governor runs his local city, Woodbury, Georgia, like a dictator and tortures Rick (including cutting off one of his hands) and other members of his group, culminating in an all-out assault on the prison. Several of the main characters die in the battle, including Lori, her new baby Judith (possibly fathered by Shane) and the Governor himself. After the prison is made insecure by the attack, Rick and the surviving members leave with others to Washington, D.C.\n\nOn the way to the capital, they find out that the man leading them, claiming to be in contact with DC scientists, is lying and find that DC is just as badly off as the other major cities. They are eventually recruited to stay in a secluded and secure township on the outskirts of Washington DC, called Alexandria Safe-Zone. Each person tries to find a semblance of real life, but Grimes doesn't trust the leader of the town, a former US Congressman. He becomes the Constable, attempting to keep the peace in the town, but eventually kills a man that was hurting his own wife. The town gets in danger, as a skirmish with a group of bandits attracts a horde of zombies from DC. The zombies surround the place and Rick is named the new leader of Alexandria and starts a new relationship, with Jessie (the ex-wife of the man Rick killed).\n","torrent":{"xt":"urn:btih:c94641544805627e9416f9e58912fd5bf57ce824","amp;dn":"The+Walking+Dead+Season+1+Complete+HDTV+%2B+Extras+%28Behind+The+Sce","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94641544805627e9416f9e58912fd5bf57ce824","infoHashBuffer":{"type":"Buffer","data":[201,70,65,84,72,5,98,126,148,22,249,229,137,18,253,91,245,124,232,36]},"announce":[],"urlList":[]}}