{"title":"Inside British Intelligence: 100 Years of MI5 and MI6","uid":10639618,"size":4076990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c94b3b225c04078679deceec25f85e568f7b54b5&amp;dn=Inside+British+Intelligence%3A+100+Years+of+MI5+and+MI6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":1,"time":1406434986,"description":"Gordon Thomas, &quot;Inside British Intelligence: 100 Years of MI5 and MI6&quot;\nISBN: 1906779104, 190753203X | 2009 | EPUB | 320 pages | 4 MB\n\n100 years old in August 2009, this is a complete and up-to-date account of the two oldest and still the most powerful, secretive intelligence services in the world: MI5, the security service, and MI6, the secret intelligence service. This is a story of spectacular triumphs, treachery, their frigid relationship, their untold work with the CIA, Mossad and the spy services of Europe and their part in the fight against terror. It is also the story of two agencies led by men who are enigmatic, eccentric and controversial and who ruthlessly control their spies. From the unique partnership between Mossad and MI6, how MI5 and MI6 became a breeding ground for Soviet spies post-war, their exploitation of the collapse of the Soviet Union and their role in biological warfare, and including how both services monitor the spies of every nation based in London, it reads like fiction. But it's not. Based on prodigious research and interviews with significant players Inside British Intelligence is packed with new and startling information. Gordon Thomas is a bestselling author of 40 books published worldwide, a number dealing with the intelligence world, including Gideon's Spies and Secrets and Lies (both JR Books). His awards include the Citizens Commission for Human Rights Lifetime Achievement Award for Investigative Journalism, the Mark Twain Society Award for Reporting Excellence, and an Edgar Allan Poe Award for Investigation. He lives in Ireland.","torrent":{"xt":"urn:btih:c94b3b225c04078679deceec25f85e568f7b54b5","amp;dn":"Inside+British+Intelligence%3A+100+Years+of+MI5+and+MI6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c94b3b225c04078679deceec25f85e568f7b54b5","infoHashBuffer":{"type":"Buffer","data":[201,75,59,34,92,4,7,134,121,222,206,236,37,248,94,86,143,123,84,181]},"announce":[],"urlList":[]}}