{"title":"Supertramp - Breakfast In America (1979) 2013 SHM-SACD-DFF","uid":10990811,"size":1963910207,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c953dc5033f9b2734654c6e0b4361eea64c1995b&amp;dn=Supertramp+-+Breakfast+In+America+%281979%29+2013+SHM-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"hal4000","files":-1,"time":1409963608,"description":"Supertramp are an English rock band formed in 1969 under the name Daddy before renaming themselves in early 1970. Though their music was initially categorised as progressive rock, they have since incorporated a combination of traditional rock, pop and art rock into their music. The band's work is marked by the songwriting of Rick Davies and Roger Hodgson and the use of Wurlitzer electric piano and saxophone in their songs.\n\nWhile the band's early work was mainstream progressive rock, they would enjoy greater critical and commercial success when they incorporated more conventional and radio-friendly elements into their work in the mid-1970s, going on to sell more than 60 million albums. They reached their peak of commercial success with 1979's Breakfast in America, which has sold more than 20 million copies.\n\nWith Breakfast in America, Supertramp had a genuine blockbuster hit, topping the charts for four weeks in the U.S. and selling millions of copies worldwide; by the 1990s, the album had sold over 18 million units across the world. Although their previous records had some popular success, they never even hinted at the massive sales of Breakfast in America. Then again, Supertramp's earlier records weren't as pop-oriented as Breakfast. The majority of the album consisted of tightly written, catchy, well-constructed pop songs, like the hits &quot;The Logical Song,&quot; &quot;Take the Long Way Home,&quot; and &quot;Goodbye Stranger.&quot; Supertramp still had a tendency to indulge themselves occasionally, but Breakfast in America had very few weak moments. It was clearly their high-water mark.\n\nDff files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2013 SHM-SACD.\n\n","torrent":{"xt":"urn:btih:c953dc5033f9b2734654c6e0b4361eea64c1995b","amp;dn":"Supertramp+-+Breakfast+In+America+%281979%29+2013+SHM-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c953dc5033f9b2734654c6e0b4361eea64c1995b","infoHashBuffer":{"type":"Buffer","data":[201,83,220,80,51,249,178,115,70,84,198,224,180,54,30,234,100,193,153,91]},"announce":[],"urlList":[]}}