{"title":"tommy wright III .. memphis rap 1993 - 2001","uid":4148382,"size":619470874,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c95e94a20afa6a369041fc4840400aafe5ab6d48&amp;dn=tommy+wright+III+..+memphis+rap+1993+-+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"nikeagogo","files":8,"time":1208826272,"description":"included:\n\nmemphis massacre - 1993\nashes 2 ashes, dust 2 dust - 1994\nrunnin' n gunnin' - 1994\non the run - 1996\nfeel me before they kill me - 1998\ngenesis - 2000\nbehind closed doors - 2001\n\nabout:\n\nTommy Wright III (born May 6, 1976) is a underground gangsta rapper from Memphis, Tennessee that began his career during the early 90s. Also referring to himself as The 1 Man Gang, Tommy Wright III is known for his fast paced rap style, distinguishing voice, brutal lyrics, and his instantly recognizable original backbeats. He is also the head of many Memphis rap groups including the Manson Family and Ten Wanted Men (composed of Jesse James, La Chat, 2-Face, K-Rock (rapper), C-Roc, Lil' Ramsey, Mac T-Dogg, Project Pimp and Princess Loko).\n\nTommy Wright III was born in South Memphis to Tommy Wright Jr. &amp; Erma Lewis. He moved to Whitehaven as a child after his mother witnessed the murder of his aunt; in Whitehaven, he became involved in the local gangs of the area, immersing himself in the criminal lifestyle (It is rumored that Tommy Wright is still associated with gangs, but he adamantly denies these accusations). Tommy's charges range from simple misdemeanors to possession of weapons &amp; drugs. In Tommy Wright III 2006 album, Ashes II Ashes, Dust II Dust, he said that he was arrested thirteen times before he even turned 18. Due to his constant law breaking, Tommy was taken from his mother &amp; became property of the state of Tennessee, but even that could not stop him. Tommy Wright III has attended two different elementary schools, three different middle schools, five different high schools, &amp; a boot camp. During his high school years, Tommy's teachers noticed his writing ability and encouraged him to become more involved and expand his creativity. His writing ability got Tommy active in the drama club, student council, &amp; marching band.\n\nTommy Wright began writing lyrics to let out his frustration during the early 90's. In 1993, Tommy put together his own rap group named Ten Wanted Men. Tommy's very first single was produced by Blackhaven's own DJ Paul (the future producer of Three 6 Mafia). Tommy Wright III eventually signed with Street Smart Records around 1994. A year later, Select-O-Hits bought Street Smart Records after the label's underground sound became big around Memphis. In 2000, Tommy was again sent to prison with a sentence of five years. Having spent five years in prison, Tommy Wright III was released in 2005 &amp; released Ashes II Ashes, Dust II Dust on November 28, 2006.","torrent":{"xt":"urn:btih:c95e94a20afa6a369041fc4840400aafe5ab6d48","amp;dn":"tommy+wright+III+..+memphis+rap+1993+-+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c95e94a20afa6a369041fc4840400aafe5ab6d48","infoHashBuffer":{"type":"Buffer","data":[201,94,148,162,10,250,106,54,144,65,252,72,64,64,10,175,229,171,109,72]},"announce":[],"urlList":[]}}