{"title":"Epic Survival (2015) (Epub) Gooner","uid":16024430,"size":40594318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c977ca34974d0d5f2f176ef54b1468c5549b6c05&amp;dn=Epic+Survival+%282015%29+%28Epub%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"GoonerTPB","files":2,"time":1476368039,"description":"Epic Survival - Extreme Adventure, Stone Age Wisdom and Lessons in Living From a Modern Hunter-Gatherer (2015) (Epub) Gooner\r\n\r\nPublisher: Gallery Books (16 July 2015)\r\nLanguage: English\r\nISBN-10: 1476794650\r\nISBN-13: 978-1476794655\r\n\r\nEarly on in his life, Matt craved a return to nature. When he became an adult, he took the plunge to set aside his comfortable urban life and live entirely off the land to learn from the smallest and grandest of all things. In his riveting narrative that brings together epic adventure and spiritual quest, he shows us what extraordinary things the human body is capable of doing when pushed to its limits. \r\n\r\nEpic Survival, written with Josh Young, co-author of five New York Timesbest sellers, will relay the captivating stories from Matt's life. He will describe his time learning the secrets of running from the Tarahumara Indians that led to him running the 1,600 mile Pacific Crest Trail in just 58 days and enduring temperature swings of 100 degrees. He will take us with him as he treks into the wilderness to live alone for a half a year, armed with nothing but a loin cloth, a pair of sandals, a stone knife and chia seeds. He'll recount near-death experiences as he hikes alone through the snow drifts at the bottom of the Grand Canyon, and tell us about the time he entered a three-day horse race on foot -- and finished third. Above all, Epic Survivalis a book about growing closer to the land that nurtures us. No matter how far our modern society takes us from the wilderness, the call remains. Matt's story will be both inspiration and invigoration, teaching even the most urbane among us important and breath-taking lessons","torrent":{"xt":"urn:btih:c977ca34974d0d5f2f176ef54b1468c5549b6c05","amp;dn":"Epic+Survival+%282015%29+%28Epub%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c977ca34974d0d5f2f176ef54b1468c5549b6c05","infoHashBuffer":{"type":"Buffer","data":[201,119,202,52,151,77,13,95,47,23,110,245,75,20,104,197,84,155,108,5]},"announce":[],"urlList":[]}}