{"title":"Responsive Web Design by Example - Beginner's Guide (gnv64)","uid":8864123,"size":27085560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c981f167c1df813353e79805035b5954a20b3090&amp;dn=Responsive+Web+Design+by+Example+-+Beginner%27s+Guide+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"gnv65","files":-1,"time":1377853912,"description":"Responsive Web Design by Example - Beginner's Guide\nby Thoriq Firdaus\nPackt Publishing | March 2013 | ISBN-10: 1849695423 | ePUB/PDF | 338 pages | 21.4/4.42 mb &lt;a href=&quot;\nhttp://www.amazon.com/Responsive-Design-Example-Thoriq-Firdaus/dp/1849695423&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Responsive-Design-Example-Thoriq-Firdaus/dp/1849695423&lt;/a&gt;\n\nDiscover how you can easily create engaging, responsive websites with minimum hassle!\n\nOverview\n- Rapidly develop and prototype responsive websites by utilizing powerful open source frameworks\n- Focus less on the theory and more on results, with clear step-by-step instructions, previews, and examples to help you along the way.\n- Learn how you can utilize three of the most powerful responsive frameworks available today: Bootstrap, Skeleton, and Zurb Foundation.\n\nIn Detail\nResponsive web design is an explosive area of growth in modern web development due to the huge volume of different device sizes and resolutions that are now commercially available. You can now create your very own responsive website quickly and efficiently, allowing you to showcase your content in a format that will work on any device with an Internet browser.\nBy following our detailed step-by-step instructions in this structured reference guide, you will learn how you can build engaging responsive websites. With coverage of Bootstrap, Skeleton, and Zurb Foundation you'll learn about three of the most powerful responsive frameworks available today.\nLeading you through by practical example, you'll find that this essential reference develops your understanding by actually helping you create beautiful websites step by step in front of your very eyes. After going over the basics, you'll be able to choose between creating your own responsive portfolio page with Skeleton, building a stunning product page with Bootstrap, or setting up your own professional business website with Zurb Foundation. Ultimately you'll learn how to decide which framework is right for you, and how you can deploy and customize it to your exact specifications!\n\nWhat you will learn from this book\n- Learn how to decide which responsive framework is right for you.\n- Harness the flexibility of Skeleton to create a truly unique portfolio.\n- Use Bootstrap to almost effortlessly create a stunning product launch page.\n- Create an online presence for your business that will work on any device with Zurb Foundation.\n- Discover how you can leverage CSS to its full potential for refining your responsive websites.\n\nApproach\nWritten as a concise yet practical guide with an explicit focus on showing beginners how to get their very own responsive websites up and running, this essential reference includes coverage of tried-and-tested responsive frameworks in a project-based format that simultaneously provides visible results whilst developing core understanding.\n\nWho this book is written for\nIdeal for anybody who wants their online presence to be compatible with devices and resolutions of any size, &quot;Responsive Web Design by Example&quot; shows you how to select the right framework for your own project requirements and then guides you through the process of installation, configuration, and customization. With three highly structured and meticulously designed projects to choose from, it is the ideal reference for both new and existing web developers who want to be able to augment their skills and showcase their content in a truly professional manner.\n\nAbout the Author\nThoriq Firdaus is a graphic and web designer living in Indonesia. He has been working in web designing projects with several clients from startup to notable companies and organizations worldwide for over five years. He is very passionate on HTML5 and CSS3 and writes on these subjects regularly at http://www.hongkiat.com/ and at his own blog http://creatiface.com/. Occasionally, he also gives presentations on web design at some local colleges and institutions.Outside of work, he enjoys watching movies with his family and trying out some good food in a new cafe or restaurant nearby.","torrent":{"xt":"urn:btih:c981f167c1df813353e79805035b5954a20b3090","amp;dn":"Responsive+Web+Design+by+Example+-+Beginner%27s+Guide+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c981f167c1df813353e79805035b5954a20b3090","infoHashBuffer":{"type":"Buffer","data":[201,129,241,103,193,223,129,51,83,231,152,5,3,91,89,84,162,11,48,144]},"announce":[],"urlList":[]}}