{"title":"Richard Hell &amp; The Voidoids-Blank Generation","uid":3321248,"size":63807492,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9f3ef8fcfdc7cf25f1675e5c0d597c6d0f5afcc&amp;dn=Richard+Hell+%26+The+Voidoids-Blank+Generation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"hotcha","files":13,"time":1114392874,"description":"\nReview\tby Mark Deming\n\nRichard Hell was one of the first men on the scene when punk rock first began to emerge in New York City as an early member of both Television and the Heartbreakers (he left both groups before they could record), but his own version of punk wasn't much like anyone else's, and while Hell's debut album, Blank Generation, remains one of the most powerful to come from punk's first wave, anyone expecting a Ramones/Dead Boys-style frontal assault from this set had better readjust their expectations. &amp;quot;Love Comes in Spurts&amp;quot; and &amp;quot;Liar's Beware&amp;quot; proved the Voidoids could play fast and loud when they wanted to, but for the most part this group's formula was much more complicated than that; guitarists Robert Quine and Ivan Julian bounced sharp, edgy patterns off each other that were more about psychological tension than brute force (though Quine's solos suggest a fragile grace beneath the surface of their neo-Beefheart chaos), and while most punk nihilism was of the simplistic &amp;quot;Everything Sucks&amp;quot; variety, Hell was (with the exception of Patti Smith) the most literate and consciously poetic figure in the New York punk scene. While there's little on the album that's friendly or life-affirming, there's a crackling intelligence to songs like &amp;quot;New Pleasure,&amp;quot; &amp;quot;Betrayal Takes Two,&amp;quot; and &amp;quot;Another World&amp;quot; that confirmed Hell has a truly unique lyrical voice, at once supremely self-confident and dismissive of nearly everything around him (sometimes including himself). Brittle and troubling, but brimming with ideas and musical intelligence, Blank Generation was groundbreaking punk rock that followed no one's template, and today it sounds just as fresh -- and nearly as abrasive -- as it did when it first hit the racks.","torrent":{"xt":"urn:btih:c9f3ef8fcfdc7cf25f1675e5c0d597c6d0f5afcc","amp;dn":"Richard+Hell+%26+The+Voidoids-Blank+Generation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f3ef8fcfdc7cf25f1675e5c0d597c6d0f5afcc","infoHashBuffer":{"type":"Buffer","data":[201,243,239,143,207,220,124,242,95,22,117,229,192,213,151,198,208,245,175,204]},"announce":[],"urlList":[]}}