{"title":"Indian Herbal Remedies: Rational Western Therapy, Ayurvedic ","uid":8345527,"size":150221224,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca015f663ee066ed25f843754eb59a7f0526d6ad&amp;dn=Indian+Herbal+Remedies%3A+Rational+Western+Therapy%2C+Ayurvedic+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365192044,"description":"\nIndian Herbal Remedies: Rational Western Therapy, Ayurvedic and Other Traditional Usage, Botany By C.P. Khare\n2004 | 533 Pages | ISBN: 3540010262 , 3642622291 | PDF | 150 MB\n\n\n\nThis superbly illustrated A-Z guide to modern and traditional Indian herbal remedies brings together information from numerous authoritative sources in the form of a highly structured and well-written reference work. Entries for each medicinal plant describe classical Ayurvedic and Unani uses, compare modern findings and applications, together with their pharmacology and therapeutic principles in an evidence-based approach. Information sources include: German Commission E, US Pharmacopoeia/National Formulary, and the WHO. The resulting work highlights the potential of Indian herbs for Western medicine by placing findings on a scientific platform. Over 200 full-colour photographs and 50 drawings illustrate the plants. Includes ayurvedic herbal drugs More than 150 general and more than 500 plant species are covered Easy-to-use and highly structured entries Detailed information on traditional use and modern evidence-based medical application","torrent":{"xt":"urn:btih:ca015f663ee066ed25f843754eb59a7f0526d6ad","amp;dn":"Indian+Herbal+Remedies%3A+Rational+Western+Therapy%2C+Ayurvedic+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca015f663ee066ed25f843754eb59a7f0526d6ad","infoHashBuffer":{"type":"Buffer","data":[202,1,95,102,62,224,102,237,37,248,67,117,78,181,154,127,5,38,214,173]},"announce":[],"urlList":[]}}