{"title":"Sebastian Fitzek - De gijzeling NL-luisterboek 2Lions-Team","uid":5656902,"size":339352805,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ca1b8d6cdc338d9fb038c9ba0c316fe66f6cf498&amp;dn=Sebastian+Fitzek+-+De+gijzeling+NL-luisterboek+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"zwemvlies","files":121,"time":1277838942,"description":"Sebastian Fitzek - De gijzeling\n2009 - luistertijd: 11 uur en 44 minuten\nPsychologische thriller\n\n\nVandaag is haar laatste dag... De gerenommeerde forensisch psychologe Ira Samin heeft haar zelfmoord zorgvuldig voorbereid. De dood van haar oudste dochter kan ze onmogelijk verwerken. Maar op het allerlaatste moment wordt Ira naar een gijzeling bij een radiozender geroepen. \n\nEen psychopaat houdt in de studio een groepje mensen onder schot en speelt een macaber spel: tijdens een uitzending belt hij willekeurig mensen op. Als ze opnemen met een specifieke zin, laat hij een gijzelaar vrij. Doen ze dat niet, dan schiet hij er een dood. De man dreigt net zolang door te spelen tot zijn verloofde bij hem in de studio wordt gebracht. Zij is echter maanden geleden omgekomen bij een ernstig auto-ongeluk, maar de gijzelnemer is er heilig van overtuigd dat ze nog leeft en dat er een samenzwering van de overheid in het spel is. \n\nIra begint aan de schier uitzichtloze onderhandelingen, in de wetenschap dat er miljoenen mensen met haar meeluisteren. Sebastian Fitzek (Berlijn, 1971) is de auteur van De therapie en De gijzeling, waarvan in Duitsland meer dan een half miljoen exemplaren over de toonbank gingen. Ook in Nederland en BelgiÃƒÂ« heeft Fitzek inmiddels een grote schare liefhebbers. \n\n'Dit is reclame voor het spannende boek!' Crimezone, vier sterren 'Toonde Fitzek bij zijn debuut De therapie al dat hij een auteur is om te onthouden, na het lezen van De gijzeling ontkom je er niet aan. Werkelijk een boek met een geniaal verhaal en een prachtig en onvoorspelbaar einde.'\n\nHAAK NIET AF NA HET DOWNLOADEN, LAAT ANDEREN MEE GENIETEN EN SEED 2X OF MEER\nAL VAST BEDANKT\n\nDON'T SHUTOFF AFER DOWNLOADING, BUT SEEDING 2X OR MORE\nMANY THANKS\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n     &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n\n******************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de bestanden binnen zijn.\nBlijf seeden!\n\nDon`t quit after you finished the download, but keep seeding.\n\n\n******************************************************\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE \nposten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n***************************************************** \t\t\n\nEnjoy \n2Lions-Team\n","torrent":{"xt":"urn:btih:ca1b8d6cdc338d9fb038c9ba0c316fe66f6cf498","amp;dn":"Sebastian+Fitzek+-+De+gijzeling+NL-luisterboek+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1b8d6cdc338d9fb038c9ba0c316fe66f6cf498","infoHashBuffer":{"type":"Buffer","data":[202,27,141,108,220,51,141,159,176,56,201,186,12,49,111,230,111,108,244,152]},"announce":[],"urlList":[]}}