{"title":"Murdoch Mysteries - Season 03 (2010) - 13 Episodes","uid":10671558,"size":4594942191,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca1c613c57b74a729fb302e72328c742e631f872&amp;dn=Murdoch+Mysteries+-+Season+03+%282010%29+-+13+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"bnaron","files":-1,"time":1406880777,"description":"Murdoch Mysteries - Season 03 (2010) - 13 Episodes\n\n\nSeries Description Courtesy:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/Murdoch_Mysteries\n\nMurdoch Mysteries is a Canadian drama television series aired on both City and CBC Television, featuring Yannick Bisson as William Murdoch, a police detective working in Toronto, Ontario, around the turn of the twentieth century. The television series is based on the series of novels by Maureen Jennings.\n\nThe series takes place in Toronto starting in 1895 and follows Detective William Murdoch (Yannick Bisson) of the Toronto Constabulary, who solves many of his cases using methods of detection that were unusual at the time. These methods include fingerprinting (referred to as &quot;finger marks&quot; in the series), blood testing, surveillance, and trace evidence.\n\nSome episodes feature anachronistic technology whereby Murdoch sometimes uses the existing technology of his time to improvise a crude prototype of a technology that would be more readily recognizable to the show's 21st-century audience. In one episode, for instance, he creates a primitive version of sonar to locate a sunken ship in Lake Ontario. In another, he effectively invents wire-tapping. In still another, a foreign police officer has a photograph which Murdoch needs as evidence, so Murdoch asks the other officer to overlay the photograph with a grid which is numerically coded for the colour in each square, and then to transmit the numerical data to Murdoch via telegraph, with the end result that the foreign officer has essentially sent Murdoch a bitmap image they call a &quot;facsimile&quot;, a telefax.\n\nThe season three premiere was partially filmed in Bristol, England. As part of the production deal, season three premiered exclusively on Alibi in the UK.\n\n\nSynopses courtesy of:\n\nThe On-line TV Database\nAn Open Database for Television Fans\nwww.thetvdb.com\n\n\n2010-02-16 - The Murdoch Identity (Video: 624x352, 1030kbps, 24fps - Audio: 44.1kHz, 104kbps)\n\nMurdoch finds himself with amnesia and running for his life on the streets of Bristol, England, very far from home, if he knew where his home was. Taking refuge in a pub, he gains the assistance of a vivacious barmaid who helps him reconstruct his memories, escape his pursuers, and foil an assassination plot.\n\n\n2010-02-23 - The Great Wall (Video: 625x352, 1030kbps, 24fps - Audio: 44.1kHz, 106kbps)\n\nMurdoch is called to Station House Five when a decorated constable is murdered and the local detective is ill. Murdoch finds that everyone is ready to blame an elderly Chinaman named Fong Choy because of something to do with his granddaughter, but she is nowhere to be found and Fong Choy won't talk.\n\n\n2010-03-02 - Victor, Victorian (Video: 608x352, 1030kbps, 24fps - Audio: 44.1kHz, 104kbps)\n\nInspector Brackenreid and Constable Crabtree are present when a man undergoing the candlelit initiation ceremony in a Masonic Temple is murdered. Murdoch's investigation uncovers another even-more-secret society.\n\n\n2010-03-09 - Rich Boy, Poor Boy (Video: 592x336, 1037kbps, 24fps - Audio: 44.1kHz, 108kbps)\n\nTragedy strikes close to home when Brackenreid's son Bobby suddenly disappears while playing with a friend on a sunny afternoon in bustling Allen Gardens.\n\n\n2010-03-15 - Me, Myself and Murdoch (Video: 624x352, 1032kbps, 24fps - Audio: 44.1kHz, 105kbps)\n\nA family celebration of Alexander Reynolds' 60th birthday is dampened when he's found with a knife plunged into his chest. Murdoch is called in and soon discovers the victim was universally despised by his kin. Reynolds' family instantly falls under suspicion but the field of suspects narrows considerably when daughter Charlotte Reynolds appears in a blood soaked dress and confesses to killing her father.\n\n\n2010-03-23 - This One Goes to Eleven (Video: 624x352, 1039kbps, 24fps - Audio: 44.1kHz, 110kbps)\n\nJames Pendrick, owner of the Pendrick Building, proudly shows off his extensive art collection to a group of admirers. The highlight of the tour is a magnificent Rembrandt that Pendrick purchased on a recent trip to France. The constabulary is hired to guard the painting's return to the Pendrick mansion and is daringly stolen from the elevator, leaving a dead security guard in the car.\n\n\n2010-03-30 - Blood and Circuses (Video: 624x352, 1038kbps, 24fps - Audio: 44.1kHz, 108kbps)\n\nThere's pandemonium at Police Station Four. Something has gone terribly wrong at Barnett's Travelling Royal Circus. Lulu, the white Siberian tiger went berserk and partially devoured its trainer before escaping into the streets. Lulu has since been shot and killed but rumors have started circulating that this wasn't simply a case of 'tiger gone bad'.\n\n\n2010-04-06 - Future Imperfect (Video: 624x352, 1036kbps, 24fps - Audio: 44.1kHz, 107kbps)\n\nMurdoch is invited to attend a mysterious meeting in High Park. With Ogden to accompany him they find themselves mixing with some of city's greatest minds at a meeting of the Toronto Society for The Advancement of Eugenics, lead by James Pendrick. Murdoch discovers that Sally Pendrick invited him. The guest speaker is none other than the great science fiction writer HG Wells, and beside him stands Ruby Ogden, Julia's younger sister.\n\n2010-04-14 - Love and Human Remains (Video: 624x352, 1034kbps, 24fps - Audio: 44.1kHz, 108kbps)\n\nWorkers laboring to build a bridge across the Don River make a grisly discovery, entombed in the swamplands bordering the river are the well-preserved bodies of a man and a woman. Called to the scene, Murdoch and Ogden quickly determine that the couple was murdered. When a third body is then discovered, Murdoch has to re-evaluate the nature of the crime.\n\n\n2010-04-20 - The Curse of Beaton Manor (Video: 624x352, 1034kbps, 24fps - Audio: 44.1kHz, 104kbps)\n\nIt is a dark and stormy night. A lonely light burns in the tower of stately Beaton Hall. Suddenly, lightening flashes across the sky and a bloodcurdling scream is heard. Chauncey Beaton runs down the halls of the mansion from an unseen pursuer. He comes to a Juliet balcony and realizes he has nowhere else to go. Murdoch arrives at the scene, where Chauncey's body lies crumpled on the paving stones. He obviously fell from the balcony but did he jump or was he pushed?\n\n\n2010-04-27 - Hangman (Video: 720x416, 1026kbps, 24fps - Audio: 44.1kHz, 102kbps)\n\nCecil Fox, a hateful reprobate convicted of killing Justice Horace Mead, is led to the gallows at the Toronto Court House. Murdoch, there on witness duty, winces as Pleasant pulls the trap door handle and sends Fox to his maker. When she carries out the post mortem, Ogden notices a curious puncture wound in the throat. Puzzled, she leans in for a better look and Fox's eyes open! Before Ogden can react, Fox knocks her unconscious and runs out.\n\n\n2010-05-04 - In the Altogether (Video: 624x352, 1034kbps, 24fps - Audio: 44.1kHz, 104kbps)\n\nMurdoch is drawn into the naughty world of Victorian erotica and blackmail when he investigates the murder of Abigail Tunstall, a young woman who had been posing for salacious photographs. Interviews with Abigail's friends and family and the discovery of one of her erotic photos help Murdoch zero in on the location where the pictures were taken, a studio owned by a photographer named Marcus Evans. When Murdoch searches through photo collections for clues to Abigail's murder he makes a startling discovery, one of McHugh's erotic models is none other than Sally Pendrick, the vivacious and beautiful wife of Murdoch's nemesis, the rich and powerful industrialist James Pendrick.\n\n\n2010-05-11 - The Tesla Effect (Video: 720x416, 1031kbps, 24fps - Audio: 44.1kHz, 106kbps)\n\nMurdoch is called upon to investigate an exceedingly strange murder. The deceased was found inside a room locked from within with no other entrance. But there's more to the case than that, the victim appears to have exploded and burned, yet there is no trace of an explosion or fire. Before Murdoch can proceed with his investigation, the case takes a bizarre turn when old friend and world-renowned inventor Nikola Tesla appears, announcing cryptically that he is &quot;too late.&quot;\n","torrent":{"xt":"urn:btih:ca1c613c57b74a729fb302e72328c742e631f872","amp;dn":"Murdoch+Mysteries+-+Season+03+%282010%29+-+13+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca1c613c57b74a729fb302e72328c742e631f872","infoHashBuffer":{"type":"Buffer","data":[202,28,97,60,87,183,74,114,159,179,2,231,35,40,199,66,230,49,248,114]},"announce":[],"urlList":[]}}