{"title":"Esbjorn Svensson Trio - When Everyone Has Gone (1993) [EAC-","uid":14603031,"size":426112190,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca414573fe88d4be9e8aa57c1c9f007ea783a2e7&amp;dn=Esbjorn+Svensson+Trio+-+When+Everyone+Has+Gone+%281993%29+%5BEAC-&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"pucholoco","files":24,"time":1463062244,"description":"Esbjorn Svensson Trio - When Everyone Has Gone (1993)\r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 384 Mb\r\n                     Full Artwork 300 dpi (png) -&gt; 43 Mb\r\n\r\n\r\nClearly it's difficult to listen to any jazz recording without making comparisons with other great artists who have gone before them. In the last couple of decades, the position occupied by Keith Jarrett's Standards Trio has almost demanded that such comparisons should be made with them, and those who are fans of Jarrett will not be disappointed here.\r\n\r\nBut this 1993 (and also pre-ACT) recording in the wide-ranging catalogue of the Esbjorn Svensson Trio not only establishes them as artists who march to the beat of their own orignal drum, but offers the listener a signpost to how the trio would emerge over the next decade or so.\r\n\r\nAlready present in Svensson's piano playing are the funky and driving rhythmic foundations which provide him with a basis for his lightning melodic runs, as well as the almost telepathic interplay between all three members of EST. For it must never be forgotten that without Dan Berglund's underpinning bass, and Magnus Öström's skitterish and vibrant drumming, EST would never have achieved the greatness that they rightly deserved.\r\n\r\nIf there are two tracks that display the wide spectrum of what EST were capable of, they are the achingly beautiful Waltz For The Lonely Ones (also recorded later with vocals by the long-time associate of Svensson, Viktoria Tolstoy) and the simply joyous Tough Tough which displays Berglund and Öström at their supportive best.\r\n\r\nFortunate enough to have not only seen EST on a number of occasions, but also to meet the band and talk about their music after much appreciated concerts (and what humble, generous, and humourous guys they all were!) the loss that the jazz world suffered when Svensson died in a tragic scuba diving accident in June 2008 continues to be felt, and will do for many years to come\r\n\r\nThis is a great album in itself, and and also a signpost to the future splendours that EST would achieve.\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01 - When Everyone Has Gone\r\n02 - Fingertrip\r\n03 - Free Four\r\n04 - Stella by Starlight\r\n05 - 4 am\r\n06 - Mohammed Goes to New York, Part I\r\n07 - Mohammed Goes to New York, Part II\r\n08 - Waltz for the Lonely Ones\r\n09 - Silly Walk\r\n10 - Tough Tough\r\n11 - Hands Off\r\n\r\n*© 2004 Dragon Records / diskUnion | DIW-480\r\n\r\n\r\nPersonnel:\r\nEsbjörn Svensson – Grand Piano, Fender Rhodes, Roland D 50, Oberheim\r\nDaniel Berglund – Double Bass\r\nMagnus Öström – Percussion, Drums, Vocal (arabic style)\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:ca414573fe88d4be9e8aa57c1c9f007ea783a2e7","amp;dn":"Esbjorn+Svensson+Trio+-+When+Everyone+Has+Gone+%281993%29+%5BEAC-","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca414573fe88d4be9e8aa57c1c9f007ea783a2e7","infoHashBuffer":{"type":"Buffer","data":[202,65,69,115,254,136,212,190,158,138,165,124,28,159,0,126,167,131,162,231]},"announce":[],"urlList":[]}}