{"title":"The Power of Myth","uid":3748062,"size":2154097196,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:cb4499d0866f8ae477601318019be4d0130343fa&amp;dn=The+Power+of+Myth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ionquest123","files":6,"time":1184976755,"description":"The Power Of Myth\n\nThe Power of Myth is a book and six part television documentary first broadcast on PBS in 1988 as Joseph Campbell and the Power of Myth. The documentary comprises six one-hour conversations between mythologist Joseph Campbell and journalist Bill Moyers.\n\nThe interviews were filmed at George Lucas&amp;#039;s Skywalker Ranch during the final two summers of Campbell&amp;#039;s life (the series was broadcast on television a year after his death). In these discussions, Campbell presents his ideas about comparative mythology and the ongoing role of myth in human society. These talks include excerpts from Campbell&amp;#039;s seminal work The Hero with a Thousand Faces.\n\n\nThe documentary, Joseph Campbell and the Power of Myth has six episodes:\n\n    * Episode 1: The Hero&amp;#039;s Adventure (first aired 6/21/1988 on PBS)\n\nAbout Campbell, hero types, hero deeds, Jesus Christ, the Buddha, movie heroes, Star Wars as a metaphor, an Iroquois story: the refusal of suitors, dragons, dreams and Jungian psychology, ?follow your bliss,? consciousness in plants, Gaia, Chartres cathedral, spirituality vs. economics, emerging myths, ?Earthrise? as a symbol\n\n    * Episode 2: The Message of the Myth (first aired 6/22/1988 on PBS)\n\nCreation myths, transcending duality, pairs of opposites, God vs. Nature, sin, morality, participation in sorrow, the Gospel of Thomas, Old Time Religion, computers, religion as ?software,? the story of Indra: ?What a great boy am I!,? participation in society\n\n    * Episode 3: The First Storytellers (first aired 6/23/1988 on PBS)\n\nAnimal memories, harmonization with body and life-cycle, consciousness vs. its vehicle, killing for food, story: ?The Buffalo&amp;#039;s Wife,? buffalo massacre, initiation ritual, rituals diminishing, crime increasing, artists, the Shaman, the center of the world\n\n    * Episode 4: Sacrifice and Bliss (first aired 6/24/1988 on PBS)\n\nChief Seattle, the sacred Earth, agricultural renewal, human sacrifice, sacrifice of the Mass, transcendence of death, story: ?The Green Knight,? societal dictates vs. following bliss, ?hidden hands? guiding life&amp;#039;s work\n\n    * Episode 5: Love and the Goddess (first aired 6/25/1988 on PBS)\n\nThe Troubadours, Eros, romantic love, Tristan, libido vs. credo, separation from love, Satan, loving your enemy, the Crucifixion as atonement, the Goddess, the Earth-mother, virgin birth, the story of Isis, Osiris and Horus, the Madonna, the Big Bang\n\n    * Episode 6: Masks of Eternity (first aired 6/26/1988 on PBS)\n\nIdentifying with the infinite, the circle as a symbol, clowns and masks, epiphanies and James Joyce, artistic arrest, the monstrous as sublime, the dance of Shiva, that which is beyond words\n\n","torrent":{"xt":"urn:btih:cb4499d0866f8ae477601318019be4d0130343fa","amp;dn":"The+Power+of+Myth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb4499d0866f8ae477601318019be4d0130343fa","infoHashBuffer":{"type":"Buffer","data":[203,68,153,208,134,111,138,228,119,96,19,24,1,155,228,208,19,3,67,250]},"announce":[],"urlList":[]}}