{"title":"Surveying: Problem Solving with Theory and Objective Type Questi","uid":6543471,"size":3343656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb8631020176a8f7c29e79561fef848f6e5af0b8&amp;dn=Surveying%3A+Problem+Solving+with+Theory+and+Objective+Type+Questi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1310772988,"description":"Surveying: Problem Solving with Theory and Objective Type Questions by A. M. Chandra\n\nProduct Description\nThe Book Provides A Lucid And Step-By-Step Treatment Of The Various Principles And Methods For Solving Problems In Land Surveying. Each Chapter Starts With Basic Concepts And Definitions, Then Solution Of Typical Field Problems And Ends With Objective Type Questions.The Book Explains Errors In Survey Measurements And Their Propagation. Survey Measurements Are Detailed Next. These Include Horizontal And Vertical Distance, Slope, Elevation, Angle, And Direction. Measurement Using Stadia Tacheometry And Edm Are Then Highlighted, Fallowed By Various Types Of Levelling Problems. Traversing Is Then Explained, Followed By A Detailed Discussion On Adjustment Of Survey Observations And Then Triangulation And Trilateration.A Detailed Discussion On Various Types Of Curves And Their Setting Out Is Followed By Calculation Of Areas And Volumes. The Last Chapter Includes Point Location And Setting Out Works In Civil Engineering Projects. Suitable Illustrations And Worked Out Examples Are Included Throughout The Book. Selected Practice Problems Are Given At The End Of The Book.The Book Would Serve As An Excellent Text For Degree And Diploma Students Of Civil Engineering. Amie CandidatesAnd Practicing Engineers Would Also Find This Book Extremely Useful.\n\nProduct Details\nHardcover: 338 pages\nPublisher: New Age International (2005)\nLanguage: English\nISBN-10: 8122416292\n","torrent":{"xt":"urn:btih:cb8631020176a8f7c29e79561fef848f6e5af0b8","amp;dn":"Surveying%3A+Problem+Solving+with+Theory+and+Objective+Type+Questi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb8631020176a8f7c29e79561fef848f6e5af0b8","infoHashBuffer":{"type":"Buffer","data":[203,134,49,2,1,118,168,247,194,158,121,86,31,239,132,143,110,90,240,184]},"announce":[],"urlList":[]}}