{"title":"J. A. Jance-Remains of Innocence","uid":15444410,"size":354879657,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cba3ab06057c1ca6fcc1783d5f088cc031a3fbe4&amp;dn=J.+A.+Jance-Remains+of+Innocence&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"twocows","files":15,"time":1469860066,"description":"\n\r\nAn old woman, both a hermit and a hoarder, is dying in Great Barrington, Massachusetts. While cleaning out her dilapidated house, her estranged daughter, Liza Machett, discovers a fortune in hundred-dollar bills. For Liza, the money seems like a blessing—until an elderly man she's never met appears at her mother's funeral, warning that she's in danger. Suddenly, Liza's quiet life is turned upside down. Terrified, Liza sets off on a perilous cross-country journey that will lead her to Cochise County, Arizona, where Sheriff Joanna Brady is embroiled in a personal mystery of her own.\r\n\r\nJunior Dowdle, a developmentally disabled man in his sixties, is found dead in a limestone cavern near Bisbee. Inside the cave, the police also discover a badly injured kitten, as well as the remains of other mutilated pets. Though he'd always been kind and sweet, with the onset of dementia, he had begun having violent episodes. Could he have hurt those animals? Was his death an accident? Or is he a victim as well? Joanna and her modest staff have their hands full as another case rocks the department—a shocking murder involving Liza and the money. The undaunted sheriff must solve these two disturbing cases fast, before more innocent blood can be shed","torrent":{"xt":"urn:btih:cba3ab06057c1ca6fcc1783d5f088cc031a3fbe4","amp;dn":"J.+A.+Jance-Remains+of+Innocence","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cba3ab06057c1ca6fcc1783d5f088cc031a3fbe4","infoHashBuffer":{"type":"Buffer","data":[203,163,171,6,5,124,28,166,252,193,120,61,95,8,140,192,49,163,251,228]},"announce":[],"urlList":[]}}