{"title":"Engaging Minds in Social Studies Classrooms - Opitz, Michael F e","uid":11645452,"size":825865,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc4de6048e061033e4faecc08568e1772162eb07&amp;dn=Engaging+Minds+in+Social+Studies+Classrooms+-+Opitz%2C+Michael+F+e&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"krystine","files":-1,"time":1417818927,"description":"Engaging Minds in Social Studies Classrooms: The Surprising Power of Joy\nAuthor: James A. Erekson\nPublished: 2014\nPublisher: Association for Supervision &amp; Curriculum Development\nISBN: 9781416617273\nFormat: Retail PDF\n\n\nPolitical intrigue. Environmental issues. Ethical dilemmas. Critical thinking. Problem solving. Social studies content is directly connected to real life and is filled with built-in hooks to transform tuned-out students into engaged and enthusiastic learners. Experiencing schoolwide elections, researching a cause, and participating in mock court cases are just a few ways to build the joyful self-efficacy and knowledge that students need for college, careers, and civic-minded adulthood.\nSpringing from the insights and research in Engaging Minds in the Classroom: The Surprising Power of Joy, Erekson explains how to integrate the joyful learning approach with social studies standards, including the Common Core, the National Curriculum Standards for Social Studies, and the College, Career, and Civic Life framework. In addition to discussing how to create a student-centered classroom and develop activities that generate authentic products and meaningful outcomes, Erekson provides specific strategies that will enhance your own joy of teaching and learning. \nThis volume completes the set of Engaging Minds, and is a welcome addition to every teacher's reference collection.\nJames A. Erekson is a former elementary teacher and has collaborated with K 12 teachers on reading, writing, and oral language. He has successfully used social studies content to help students develop into stronger readers and writers and is an associate professor of reading at University of Northern Colorado","torrent":{"xt":"urn:btih:cc4de6048e061033e4faecc08568e1772162eb07","amp;dn":"Engaging+Minds+in+Social+Studies+Classrooms+-+Opitz%2C+Michael+F+e","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc4de6048e061033e4faecc08568e1772162eb07","infoHashBuffer":{"type":"Buffer","data":[204,77,230,4,142,6,16,51,228,250,236,192,133,104,225,119,33,98,235,7]},"announce":[],"urlList":[]}}