{"title":"Eat and Run: My Unlikely Journey to Ultramarathon Greatness (Aud","uid":8581295,"size":181726312,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:cc777f1a67d141cc9525b9122a18607c07335c6e&amp;dn=Eat+and+Run%3A+My+Unlikely+Journey+to+Ultramarathon+Greatness+%28Aud&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"bobpocket","files":26,"time":1371419541,"description":"Eat and Run: My Unlikely Journey to Ultramarathon Greatness (Audiobook) By Scott Jurek, Steve Friedman, read by Quincy Dunn-Baker\nUnabridged edition 2013 | 8 hours and 24 mins | ISBN: n/a , ASIN: B008I506CG | MP3 48 kbps | 182 MB\n\n\nFor nearly two decades, Scott Jurek has been a dominant force-and darling-in the grueling and growing sport of ultrarunning. In 1999, as a complete unknown, he took the lead of the Western States Endurance Run, a 100-mile traverse over the old Gold Rush trails of the California Sierra Nevada. He won that race seven years in a row, setting a course record along the way. Twice he won the Badwater Ultramarathon, a 135-mile &quot;jaunt&quot; through Death Valley. Recently he set an American record of 165.7 miles in 24 hours-6 1/2 marathons in one day. And he was one of the elite runners who traveled to Mexico to run with the Tarahumara Indians, as profiled in the bestseller Born to Run. His accomplishments are nothing short of extraordinary, but that he has achieved all of this on a plant-based diet makes his story all the more so.\n\nIn Eat and Run, Scott Jurek opens up about his life and career-as an elite athlete and a vegan-and inspires runners at every level. From his Midwestern childhood hunting, fishing, and cooking for his meat-and-potatoes family, to his early beginnings in running (he hated it), to his slow transition to ultrarunning and veganism, to his world-spanning, record-breaking races, Scott's story shows the power of an iron will and blows apart all the stereotypes of what athletes should eat to fuel optimal performance. Chock-full of incredible, on-the-brink stories of endurance and competition, fascinating science, and accessible practical advice-including his own favorite plant-based recipes-Eat and Run will motivate everyone to &quot;go the distance,&quot; whether that means getting out for that first run, expanding your food horizons, or simply exploring the limits of your own potential. ","torrent":{"xt":"urn:btih:cc777f1a67d141cc9525b9122a18607c07335c6e","amp;dn":"Eat+and+Run%3A+My+Unlikely+Journey+to+Ultramarathon+Greatness+%28Aud","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc777f1a67d141cc9525b9122a18607c07335c6e","infoHashBuffer":{"type":"Buffer","data":[204,119,127,26,103,209,65,204,149,37,185,18,42,24,96,124,7,51,92,110]},"announce":[],"urlList":[]}}