{"title":"Faker's Guide to the Classics: Everything You Need To Know","uid":11813828,"size":17383289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cc8a06eb072874da28b29145a383fd7fa6247adb&amp;dn=Faker%27s+Guide+to+the+Classics%3A+Everything+You+Need+To+Know&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":1,"time":1429002668,"description":"Michelle Witte, &quot;Faker's Guide to the Classics: Everything You Need To Know About The Books You Should Have Read (But Didn'T)&quot;\n\nISBN: 0762785403 | 2013 | EPUB | 288 pages | 17 MB\n\nFrom Anna Karenina and Beowulf to Ulysses and Wuthering Heights, The Faker's Guide to the Classics condenses the great (but long and complicated) novels, plays, and poems of world lit into bite-size nuggets, cutting out the bloated analysis and nauseating debate of other reading guides. Each of the 100 books profiled is a classic that everyone knows but only hardcore lit majors have actually read. Now you, too, can: Blather about books you were supposed to read for class but didn't; fudge literary discussions at fancy parties; impress a date with your knowledge and wit; and slice through the ivory tower to read like a ninja. Each entry contains: a quick and dirty narrative description of plot, including twists and surprise endings, told with humorous brevity; famous quotes accompanied by smartass responses; and the original cover or an illustration conveying the work's tone (or lack thereof). Brief author bios--including misdeeds and scandals--add illuminating and occasionally disgusting background to each work. All of the text appears in simple, contemporary English, so it's easy to understand and short enough to tweet. With this must-have guide, never worry again whether a reference to Miss Havisham is an insult or wonder what happened to Moby-Dick. Not reading the classics has never been easier!","torrent":{"xt":"urn:btih:cc8a06eb072874da28b29145a383fd7fa6247adb","amp;dn":"Faker%27s+Guide+to+the+Classics%3A+Everything+You+Need+To+Know","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc8a06eb072874da28b29145a383fd7fa6247adb","infoHashBuffer":{"type":"Buffer","data":[204,138,6,235,7,40,116,218,40,178,145,69,163,131,253,127,166,36,122,219]},"announce":[],"urlList":[]}}