{"title":"Pavel CHUKHRAI - Vor (The Thief, 1997)","uid":4173097,"size":1473144235,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ccb5b277f0a838095377c8eeb81eda3dab6aeb31&amp;dn=Pavel+CHUKHRAI+-+Vor+%28The+Thief%2C+1997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"zeinabqureshi","files":8,"time":1209978213,"description":"Vor (The Thief, 1997)\n(Rip #9)\n\n---=imdb=--------------------------------------\nlink: http://www.imdb.com/title/tt0124207/\nUser rating: 7.5/10\n\n---=Movie Info (Wikipedia)=--------------------\nThe Thief (Russian: Vor) is a 1997 film written and directed by Pavel Chukhrai. It was nominated for the Academy Award for Best Foreign Language Film and won the Nika Award for Best Picture and Best Directing. Also winner of the International Youth Jury's prize, the President of the Italian Senate's Gold Medal, and the UNICEF Award at the 1997 Venice Film Festival.\n\nThe film is about a young woman, Katya (Yekaterina Rednikova) and her son Sanya (Misha Philipchuk) who in 1946 meet a veteran Soviet soldier named Tolyan (Vladimir Mashkov). Katya falls in love with Tolyan, who turns out to be a thief, but who also becomes a father figure to Sanya.\n\n---=Info (Wikipedia)=--------------------------\nA boy and his mother try to get by in the Soviet Union of the 1950s. The boy's father is a soldier who died in the war before his birth. Jump to 1952: Katya and her son Sanya are poor and desperate. On a train, they meet a handsome, rakish soldier, Tolyan, who makes a play for Katya. She accepts. Tolyan pretends to be Katya's husband and uses his credentials as a war veteran to get an apartment without paying money in advance and becomes everyone's favorite through his good looks and generosity. He turns out to be a brutal and abusive man. He teaches Sanya his ruthless code of manhood while rolling razor blades in his mouth with his tongue. Tolyan also brags to the boy that he is a secret son of Stalin. After several weeks of mooching off and seducing the other tenants, Tolyan buys them all dinner and tickets to a circus. During the performance he sneaks back to the building and robs everyone. Katya is suspicious that he is carrying on with a female tenant he has been flirting with, and she returns to catch him in his burglary. He tells her she can escape with him or stay behind, but she has no skills and no prospect of work, so she takes Sanya and follows him. Katya becomes a part of his con game as they move from city to city, working the same schemes.\n\n---=Audio=-------------------------------------\n\t0x2000 (Dolby AC3) AC3\n\t48000Hz  192 kb/s tot , stereo (2/0)\n\tInterleave: 96 ms\n\n---=Video=-------------------------------------\n\t720 x 416 @ 23.976 fps\n\t(CD1)\n\t51:50.541, 74,579 frames\n\tQf 0.234/1683 kbps\n\n\t(CD2)\n\t41:54.492, 60,288 frames\n\tQf 0.298/2139 kbps\n\n---=Size=--------------------------------------\n\t731,940,864 (74,579 frames) (CD1)\n\t734,562,304 (60,288 frames) (CD2)\n\n---=Subtitles=---------------------------------\nMultisubs in IDX/SUB in English, Espanol, French\n\n---=Notes=-------------------------------------\nThis is one of those films which never became famous. It deserves to be famous. What Wikipedia doesn't say - the things which happen towards the end of the movie - are quite heart-rending. The master thief is finally apprehended, in quite an unlikely fashion, and the life of the boy, who is narrating the story, will never be the same again...\n\nIt is a moving film which deserves to be better known. For your information, Pavel Chukhrai is the son of the celebrated Soviet filmmaker Grigory Chukhrai (The Ballad of a Soldier).\n\nSeed and enjoy!\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:ccb5b277f0a838095377c8eeb81eda3dab6aeb31","amp;dn":"Pavel+CHUKHRAI+-+Vor+%28The+Thief%2C+1997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccb5b277f0a838095377c8eeb81eda3dab6aeb31","infoHashBuffer":{"type":"Buffer","data":[204,181,178,119,240,168,56,9,83,119,200,238,184,30,218,61,171,106,235,49]},"announce":[],"urlList":[]}}