{"title":"Disciples II Gold Edition [English] [4CD]","uid":3288553,"size":3038874345,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ccc55c088dbfca8783205299878b575cd5eb3eb2&amp;dn=Disciples+II+Gold+Edition+%5BEnglish%5D+%5B4CD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"pctorrent","files":11,"time":1108128966,"description":"Disciples II Gold (c) Strategy First\n\nDisciples II has been awarded countless honours for its unique gameplay\nand challenging scenarios including game of the year and many editor's\nchoice awards.\nDisciples II Gold is a must for any Disciples fan and a great value for anyone \nwho has never played Disciples before. All of the Disciples II campaigns \nand hundreds of hours of gameplay in one adventure-packed box.\n\n* 5 New Bonus Quests \n\n* Dark Prophecy - A decade has past since the first Great War of the original Disciples game.\n  The final prophecy continues to unfold. Deep in the crevices of the Sacred Lands,\n  the Chosen One has emerged, fated to bring salvation to some and destruction to others. \n  Playing as one of four races, gamers must take up the sword and fight for the glory of their God. \n\n* Servants of the Dark - Servants allows gamers to play the two 'evil' races while the \n  Disciples story continues to unfold. \n  Play as either the Legions of the Damned Â­spreading Brethrezen's plague \n  across the land while sensing a greater threat in the Elven god, or the Undead Hordes\n  seeking revenge against Gallean, one that will scar his people for eternity. \n\n* Guardians of the Light - Continuing the story that began in Dark Prophecy, Guardians allows \n  gamers to play either the Empire trying to gain control of the now vacant throne while a \n  cruel inquisition sweeps their lands, or the Mountain Clans trying to reunite their tribes\n  after their near-destruction by the Chosen One. \n\n* Rise of the Elves - For the first time in Disciples' five year history,\n  a new playable race has emerged. Continuing the storyline that began in the companion packs\n  Guardians and Servants, gamers can now play the Elven Alliance as they struggle to unite \n  their race and reclaim their forests. \n\n enjoy :)","torrent":{"xt":"urn:btih:ccc55c088dbfca8783205299878b575cd5eb3eb2","amp;dn":"Disciples+II+Gold+Edition+%5BEnglish%5D+%5B4CD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccc55c088dbfca8783205299878b575cd5eb3eb2","infoHashBuffer":{"type":"Buffer","data":[204,197,92,8,141,191,202,135,131,32,82,153,135,139,87,92,213,235,62,178]},"announce":[],"urlList":[]}}