{"title":"A Todo Gas 2 (Spanish) BluRay RIP Xvid-Ac3 5.1","uid":4827900,"size":1466742784,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ccd570643e3e43ca8f44cfa1490cc75bc4346785&amp;dn=A+Todo+Gas+2+%28Spanish%29+BluRay+RIP+Xvid-Ac3+5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"mdq1","files":-1,"time":1238976914,"description":"DirecciÃƒÂ³n: John Singleton.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2003.\nDuraciÃƒÂ³n: 108 min.\nInterpretaciÃƒÂ³n: Paul Walker (Brian O'Conner), Tyrese (Roman Pearce), Eva Mendes (MÃƒÂ³nica Clemente), Devon Aoki (Suki), Chris 'Ludacris' Bridges (Tej), Cole Hauser (Carter Verone), James Remar (Agente Markham), Thom Barry (Agente Bilkins), Mark Boone Junior (Detective Whitworth).\nGuiÃƒÂ³n: Michael Brandt y Derek Haas; basado en un argumento de Gary Scott Thompson.\nProducciÃƒÂ³n: Neal H. Moritz.\nMÃƒÂºsica: David Arnold.\nFotografÃƒÂ­a: Matthew F. Leonetti.\nMontaje: Bruce Cannon y Dallas Puett.\nDiseÃƒÂ±o de producciÃƒÂ³n: Keith Brian Burns.\nDirecciÃƒÂ³n artÃƒÂ­stica: Lawrence A. Hubbs.\nVestuario: Sanja Milkovic Hays.\nEstreno en USA: 6 Junio 2003.\nEstreno en EspaÃƒÂ±a: 20 Junio 2003.\n\n\nSINOPSIS: Brian O'Conner (Paul Walker), un policÃƒÂ­a caÃƒÂ­do en desgracia, fue un adicto a la velocidad... y ahora estÃƒÂ¡ pagando un precio por ello. Tal y como lo ven sus antiguos jefes y los altos mandos del FBI, este agente de incÃƒÂ³gnito les echÃƒÂ³ a perder una de las investigaciones mÃƒÂ¡s importantes que ha-bÃƒÂ­an emprendido. Ahora ha pasado el tiempo, O'Conner estÃƒÂ¡ en otra ciudad y tiene una ÃƒÂºltima oportunidad. A los federales de Mia-mi les estÃƒÂ¡ costando mucho enchironar a Carter Verone (Cole Hau-ser), un empresario que utiliza su negocio de importaciÃƒÂ³n y expor-taciÃƒÂ³n como tapadera para un cartel internacional de blanqueo de dinero. Aduanas lleva un aÃƒÂ±o sometiendo a Verone a una estricta vigilancia y lo ÃƒÂºnico que han podido establecer es su relaciÃƒÂ³n con las carreras callejeras ilegales. El tiempo se acaba y los agentes deciden llamar a O'Conner para que haga lo que sabe hacer mejor que nadie: volver a infiltrarse entre los conductores. Pero este hom-bre individualista poco amigo de los reglamentos pone algunas con-diciones para aceptar la misiÃƒÂ³n que puede permitirle recuperar su insignia. No le gusta nada la lista de posibles compaÃƒÂ±eros que le ofrecen para la misiÃƒÂ³n e insiste en trabajar con su amigo de infan-cia y antiguo delincuente Roman Pearce (Tyrese Gibson), otro en-fermo de la velocidad. El jefe de los federales que se ocupan del caso, el agente Markham (James Remar), le plantea un trato a Pearce: si trabaja con O'Conner, su extenso historial delictivo que-darÃƒÂ¡ limpio. Para el ex policÃƒÂ­a y el ex delincuente su ÃƒÂºltima ocasiÃƒÂ³n de redimirse pasa por atrapar a Verone. Pero las lealtades de O'Conner vuelven a entrar en conflicto con la apariciÃƒÂ³n de la agente de incÃƒÂ³gnito MÃƒÂ³nica Fuentes (Eva Mendes): ella es la clave para acceder a Verone pero puede que sea tambiÃƒÂ©n su amante. En las calientes calles de Miami confluyen asesinos, pistoleros, policÃƒÂ­as corruptos y ruedas veloces. Con ellos va a medirse un ex policÃƒÂ­a adicto a la velocidad y que no tiene nada que perder.\n\n\nwww.CentralDivx.com\n\nwww.Central-Torrent.com\n\nwww.Estrenos-Sub.com","torrent":{"xt":"urn:btih:ccd570643e3e43ca8f44cfa1490cc75bc4346785","amp;dn":"A+Todo+Gas+2+%28Spanish%29+BluRay+RIP+Xvid-Ac3+5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccd570643e3e43ca8f44cfa1490cc75bc4346785","infoHashBuffer":{"type":"Buffer","data":[204,213,112,100,62,62,67,202,143,68,207,161,73,12,199,91,196,52,103,133]},"announce":[],"urlList":[]}}