{"title":"Shiva Rea - Yoga Shakti","uid":4305255,"size":3149967126,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd0d02ccb9a32e0641b245855c65fdc660831669&amp;dn=Shiva+Rea+-+Yoga+Shakti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"MasterKush","files":38,"time":1216510558,"description":"Video = XviD 608x432 ~1700 kb/s\nAudio = MP3 48000Hz, 128 kb/s, Joint Stereo\n\nFour complete practices are presented, in this rip, accessible by playlist files, Ranging in length from 42 to 85 minutes and including Basic Flow (for beginners), two more vigorous Solar Flow sequences, and a Lunar Flow sequence falling somewhere in the middle in terms of degree of difficulty; familiar poses like sun salutations, forward bends, lunges, twists, and inversions are featured, although Rea adds many of her own touches (such as the four &quot;dancing warrior&quot; sections, sun salutation variations designed for intermediate users and focusing on hips, backbends, and so on), and there are also sections devoted to pranayama (breathing exercises) and meditation.\n\nProduct Description\nBest of Fitness Award 2006?Health Magazine (Video/DVD Category)\n\nInternationally acclaimed vinyasa flow yoga teacher Shiva Rea revolutionizes the instructional yoga video genre with Yoga Shakti?the first user-personalized practice DVD designed to immerse practitioners in the free flow of shakti, the dynamic, creative fire of the universe.\n\nFilmed on location in India and the Maldive Islands on stunning digital video, Yoga Shakti integrates tradition and modern innovation in a powerful new learning system that evolves with the student. Viewers simply select their favorite practices from a simple-to-use ?yoga menu??filled with a rich variety of moving postures, meditations, and shavasana relaxations?and then press ?play? to enjoy. To help them get started, Shiva Rea includes a complete list of suggested sequences, ranging from five-minute ?tune-up sessions? to extended hour-long yoga immersions. All on one in-depth DVD, Yoga Shakti guides viewers through:\n\n? Core techniques and progressive practices of vinyasa flow yoga, creating a foundation of strength and fluidity\n\n? Six ?Alignment Focus? tutorials for maximizing energy flow in yoga postures\n\n? Four complete hour-long sequences including Foundation, Solar Flows I and II, and Lunar Flow I\n\n? Short, inspirational films combining spoken word and evocative image-scapes from India\n\n? A rich soundtrack featuring traditional Indian musicians as well as contemporary ambient and underground under\n\nWith Yoga Shakti, yoga lovers of all levels are invited to infuse their home practice with joy, vitality, and spontaneity?and to release shakti, the energetic essence within.\n &lt;a href=&quot;\nhttp://www.amazon.com/Shiva-Rea-Shakti-Marc-Caro/dp/B0001611DS/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Shiva-Rea-Shakti-Marc-Caro/dp/B0001611DS/&lt;/a&gt;","torrent":{"xt":"urn:btih:cd0d02ccb9a32e0641b245855c65fdc660831669","amp;dn":"Shiva+Rea+-+Yoga+Shakti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd0d02ccb9a32e0641b245855c65fdc660831669","infoHashBuffer":{"type":"Buffer","data":[205,13,2,204,185,163,46,6,65,178,69,133,92,101,253,198,96,131,22,105]},"announce":[],"urlList":[]}}