{"title":"The Cinematic Orchestra (1999) - Motion (@128)","uid":3762171,"size":49485235,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cd846307c982e1357146d2e03d2a9ac9e75871b6&amp;dn=The+Cinematic+Orchestra+%281999%29+-+Motion+%28%40128%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"paiac","files":9,"time":1186195888,"description":"////////////////////////////////////////////////////////\n\nJust~Good~Music by paiac\n\n////////////////////////////////////////////////////////\n\nFile name\tBitrate\tPlay time\n01 - Cinematic Orchestra - Durian (Vocal).mp3\t128\t07:02\n02 - Cinematic Orchestra - Ode To The Big Sea.mp3\t128\t05:44\n03 - Cinematic Orchestra - Night Of The Iguana.mp3\t128\t13:23\n04 - Cinematic Orchestra - Channel 1 Suite.mp3\t128\t05:52\n05 - Cinematic Orchestra - Bluebirds.mp3\t128\t05:08\n06 - Cinematic Orchestra - And Relax!.mp3\t128\t04:57\n07 - Cinematic Orchestra - Diabolus.mp3\t128\t09:15\n\n////////////////////////////////////////////////////////\n &lt;a href=&quot;\nhttp://www.ninjatune.net/ninja/release.php?id=150&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ninjatune.net/ninja/release.php?id=150&lt;/a&gt;\n\n//////////////////////////////////////////////////////////\n\nWhether to categorize Motion as a jazz or electronica album is an intriguing conundrum, because it truly turns out to be a combination of both musical forms, and it is an unequivocally brilliant combination, at that. British arranger/programmer J. Swinscoe -- who virtually is the Cinematic Orchestra -- gathered samples of drum grooves, basslines, and melodies from various recordings and artists that have inspired and influenced him (spaghetti-western composer Ennio Morricone and Roy Budd\\&amp;#039;s spy film scores, \\&amp;#039;60s and \\&amp;#039;70s jazz and soundtrack scores from musicians such as Elvin Jones, Eric Dolphy, Andre Previn, David Rose, and John (Morris). He then presented the samples that he had collected to a group of musicians, the core of which consisted of Tom Chant (soprano sax, electric and acoustic piano), Jamie Coleman (trumpet, flugelhorn), Phil France (bass), and T. Daniel Howard (drums), to learn and then improvise. Those tracks, in turn, were sampled and rearranged by Swinscoe on computer to create the tracks that make up this first Cinematic Orchestra album. The album bears all of the atmospheric hallmarks of ambient electronica, as well as Swinscoe\\&amp;#039;s soundtrack inspirations and all the improvisational energy of jazz. Most of the songs are built with wave upon wave of repeated loops and instrumental phrases that work into a groove. Yet it feels at any moment as if the music is about to explode, like a steam whistle boiling to its screaming point. On \\&quot;One to the Big Sea,\\&quot; for example, the same four-note bassline plays over and over with the same ride cymbal rhythm, but instead of seeming rote or mechanical, the riff just seems to continually bubble up and throb, slowly building anticipation and pressure. When a looped piano riff and horn charts enter the music, the juxtaposition seems almost jarring; yet, as they continue to repeat, in turn, atop the bass and cymbals, you can\\&amp;#039;t help but feel that you\\&amp;#039;re waiting for another dramatic leap, which eventually comes by way of the song\\&amp;#039;s cornerstone: a thrilling drum solo. Each song is just as accomplished in its own way, so expertly arranged by Swinscoe that the impression of both structure and improvisation is created, while never sounding for a moment anything less than organic. The music is constructed piece by piece until it is a seamless whole that lives and breathes on its own merits, much like the soundscapes of DJ Shadow. Regardless of how they were made, though, the songs on Motion are by turns eerie, lush, edgy, expansive, gritty, intensely powerful, and gorgeous. Sometimes an album comes along that forces you to reconfigure and re-evaluate all of the assumptions you had previously made about music in order to realize how vast and endless the possibilities are; this is one of those albums.\n\n(http://www.allmusic.com/cg/amg.dll?p=amg&amp;token=&amp;sql=10:wzfqxqlkldke)\n\n//////////////////////////////////////////////////////////\n\nPlease Seed!","torrent":{"xt":"urn:btih:cd846307c982e1357146d2e03d2a9ac9e75871b6","amp;dn":"The+Cinematic+Orchestra+%281999%29+-+Motion+%28%40128%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd846307c982e1357146d2e03d2a9ac9e75871b6","infoHashBuffer":{"type":"Buffer","data":[205,132,99,7,201,130,225,53,113,70,210,224,61,42,154,201,231,88,113,182]},"announce":[],"urlList":[]}}