{"title":"Marc Dorcel: Ballerine le jour, escorte la nuit (Ballerina by da","uid":10514033,"size":946755789,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cd9a935a7d84d95030ba5f20aec58c1292e5a49b&amp;dn=Marc+Dorcel%3A+Ballerine+le+jour%2C+escorte+la+nuit+%28Ballerina+by+da&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":10,"uploader":"chkm8te","files":1,"time":1404884785,"description":"Marc Dorcel: Ballerine le jour, escorte la nuit (Ballerina by day, escort by night) (NEW 2014) [DVDRip]\n\nAleska Diamond, Ava Courcelles, Dorothy Black, Gina Gerson, Shalina Devine, Mike Angelo, Bruno SX\n\nThese beautiful hot dancers offer you their perfect bodies and nothing is off-limits. Come and enjoy!\nDuring the day, these young ballerinas work very hard in their dance school. But at night, they put away their tutus and their pointe shoes and put on sexy lingerie and high heels to go dancing in a strip club for the delight of men. The double night life of these beautiful dancers has some mouthwatering surprises in store for you...\nFor young Gina, everything seemed perfect: she had just joined a prestigious dance school and she had a boyfriend who passionately made love to her every morning. Yet everything will change with the start of the auditions to become a principal dancer...\nFrom day one, the sublime Ava makes a pass at one of the members of the judging panel. After giving him an amazing blowjob, she lets him do what he wants with her arsehole and so he fucks her wildly in the ass and finishes by cumming in her mouth.\nThe next day, Gina's boyfriend visits her at the dance school. But Aleska and her girlfriend seduce him in the blink of an eye. There then begins a lustful threesome which ends in front of Gina. Disappointed and desperate, she throws herself into the arms of the owner of a very special club where the most perverted men in the city gather.\nGina is on the verge of a most unexpected experience...\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=qx8ty7ezdgxj0dcjk1dm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=qx8ty7ezdgxj0dcjk1dm.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=mjh3lx1lc8lf8yc1bmq2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=mjh3lx1lc8lf8yc1bmq2.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:cd9a935a7d84d95030ba5f20aec58c1292e5a49b","amp;dn":"Marc+Dorcel%3A+Ballerine+le+jour%2C+escorte+la+nuit+%28Ballerina+by+da","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd9a935a7d84d95030ba5f20aec58c1292e5a49b","infoHashBuffer":{"type":"Buffer","data":[205,154,147,90,125,132,217,80,48,186,95,32,174,197,140,18,146,229,164,155]},"announce":[],"urlList":[]}}