{"title":"Radiohead - A Moon Shaped Pool (2016) [24.48 FLAC] vinyl","uid":14983580,"size":601234002,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ce5686ee3e8d137e361ed20ede31024f89097a13&amp;dn=Radiohead+-+A+Moon+Shaped+Pool+%282016%29+%5B24.48+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"politux","files":12,"time":1466288499,"description":"Radiohead - A Moon Shaped Pool (2016) [24.48 FLAC] vinyl\r\n\r\n  Genre: Electronic\r\n  Style: Experimental\r\n  Source: XL Recordings XLLP790 White Vinyl\r\n  Codec: FLAC\r\n  Bit rate: 1,500 kbps\r\n  Bit depth: 24\r\n  Sample rate: 48 kHz\r\n\r\n  01 Burn The Witch \r\n  02 Daydreaming \r\n  03 Decks Dark \r\n  04 Desert Island Disk \r\n  05 Ful Stop \r\n  06 Glass Eyes \r\n  07 Identikit \r\n  08 The Numbers \r\n  09 Present Tense \r\n  10 Tinker Tailor Soldier Sailor Rich Man Poor Man Beggar Man Thief\r\n  11 True Love Waits \r\n\r\n  Rip info (Not my rip)\r\n\r\n  First Spin (Except for part of Burn the Witch)!\r\n  24/48 Rip\r\n  Vinyl Dry Brushed with Concept Record Brush\r\n  Technics SL-D2\r\n  Ortofon 2M Blue\r\n  Marantz PM 5005\r\n  Pyle-Pro PPRCJ05 Dual Professional Audio Link Cable \r\n  1/4-Inch Male to RCA Male\r\n  Line 6 UX2\r\n  Gear Box\r\n  Reaper\r\n\r\n  Clicks removed manually with Izotope on the vinyl preset with sensitivity varying per click.\r\n\r\n  Tracks split, then normalized to -0.1db with Reaper\r\n  Converted to FLAC Level 8 with Foobar2000\r\n\r\n  Review \r\n\r\n  A cursory glance at A Moon Shaped Pool may suggest a certain measure of indifference on the part of Radiohead. Its 11 songs are sequenced in alphabetical order -- a stunt befitting a Pixies concert or perhaps a Frank Black box set, not a proper album -- and many of these tunes are of an older vintage: the group began work on the opening &quot;Burn the Witch&quot; at the turn of the century, while the closing &quot;True Love Waits&quot; first appeared in concerts way back in 1995. These are the elements of a clearinghouse, but with Radiohead appearances are always deceiving. A Moon Shaped Pool doesn't play like an ill-considered collection of leftovers; it unfurls with understated ease, each silvery song shimmering into the next. The pulse rarely quickens and the arrangements seldom agitate, yet the album never quite feels monochromatic. Sly, dissonant strings grace some cuts, acoustic guitars provide a pastoral counterpoint to an electronic pulse, Thom Yorke's voice floats through the music, often functioning as nothing more than an element of a mix; what he's saying matters not as much as how he murmurs. \r\n\r\n  Such subtle, shifting textures emphasize Radiohead's musicianship, a point underscored when this version of &quot;True Love Waits&quot; is compared to its 2001 incarnation. There, Yorke accompanied himself with a simple acoustic guitar and he seemed earnest and yearning, but here, supported by piano and strings, he sounds weary and weathered, a man who has lost his innocence. What he and Radiohead have gained, however, is some measure of maturity, and with this, their music has deepened. Certainly, sections of A Moon Shaped Pool contain an eerie, disconcerting glimmer, usually attained through power kept in reserve -- nothing stabs as hard as the sawing fanfare of &quot;Burn the Witch,&quot; while the winding, intersecting guitars that conclude &quot;Identikit&quot; provide the noisiest element -- yet the album as a whole doesn't feel unsettling. Instead, there's a melancholic comfort to its ebb and flow, a gentle rocking motion that feels comforting; it's a tonic to the cloistered, scattered King of Limbs and even the sleek alienation of Kid A. Radiohead are recognizably the same band that made that pioneering piece of electronica-rock but they're older and wiser on A Moon Shaped Pool, deciding not to push at the borders of their sound but rather settle into the territory they've marked as their own. This may not result in a radical shift in sound but rather a welcome change in tone: for the first time Radiohead feel comfortable in their own skin","torrent":{"xt":"urn:btih:ce5686ee3e8d137e361ed20ede31024f89097a13","amp;dn":"Radiohead+-+A+Moon+Shaped+Pool+%282016%29+%5B24.48+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce5686ee3e8d137e361ed20ede31024f89097a13","infoHashBuffer":{"type":"Buffer","data":[206,86,134,238,62,141,19,126,54,30,210,14,222,49,2,79,137,9,122,19]},"announce":[],"urlList":[]}}