{"title":"Rainer Maria Rilke - Poetry, Prose, Letters, Diaries (46 books)","uid":14734339,"size":128082700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce5ce613cbebe3fee0968a5a9a0a75ca8fb954d0&amp;dn=Rainer+Maria+Rilke+-+Poetry%2C+Prose%2C+Letters%2C+Diaries+%2846+books%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"workerbee","files":92,"time":1464621673,"description":"RAINER MARIA RILKE (1875-1926) was an Austro-German poet and novelist, widely recognized as one of the most lyrically intense German-language poets.  Writing in both verse and highly lyrical prose, Rilke's work invokes haunting images that focus on the difficulty of communion with the ineffable in an age of disbelief, solitude, and profound anxiety.  These deeply existential themes tend to position him as a transitional figure between the traditional and the modernist writers.\n\nAmong his best-known works are the intensely religious, mystical poems of the DUINO ELEGIES (1922) that weigh beauty and existential suffering; the SONNETS TO ORPHEUS (1922), an astonishing set of richly metaphorical and philosophical variations on the Orpheus myth, conceived in what the poet called a &quot;savage creative storm&quot;; the semi-autobiographical novel NOTEBOOKS OF MALTE LAURIDS BRIGGE (1910), with its profound probing of the quest for individuality, the significance of death, and reflections on the experience of time as death approaches; and LETTERS TO A YOUNG POET (1929), a collection of correspondence published after his death that offer insight into the ideas and themes that appear in Rilke's poetry and his working process.\n\n&quot;Nobody can advise you and help you, nobody,&quot; Rilke advises the aspiring poet.  &quot;There is only one way.  Go into yourself.&quot;\n\n\nThe following books are in PDF and/or ePUB formats as indicated\n\n                                 == POETRY ==\n\n\n* Ahead of All Parting: The Selected Poetry and Prose of Rainer Maria Rilke (Modern Library, 1995).  Edited and translated by Stephen Mitchell. -- ePUB\n\n* Book of Images, The (North Point, 2014).  Revised, bilingual edition.  Translated by Edward Snow. -- ePUB\n\n* Duino Elegies (Norton, 1963).  Bilingual edition.  Translated by J. B. Leishman and Stephen Spender. -- PDF\n\n* Duino Elegies (California, 1961).  Bilingual edition.  Translated by C. F. MacIntyre. -- PDF\n\n* Duino Elegies (Hogarth Press, 1931).  Bilingual edition.  Translated by Vita and Edward Sackville-West. -- PDF\n\n* Duino Elegies (North Point, 2014).  Bilingual edition.  Translated by Edward Snow. -- ePUB\n\n* Duino Elegies (Norton, 2006).  Bilingual edition.  Translated by David Young. -- ePUB\n\n* Duino Elegies / The Sonnets to Orpheus (Vintage, 2009).  Bilingual edition.  Translated by Stephen Mitchell. -- ePUB\n\n* Duino Elegies / The Sonnets to Orpheus (Houghton Mifflin, 1977). Bilingual edition. Translated by A. Poulin, Jr. -- PDF\n\n* Essential Rilke, The (Ecco, 2000).  Bilingual edition.  Translated by Galway Kinnell and Hannah Liebmann. -- PDF\n\n* New Poems [1907] (North Point, 2014).  Bilingual edition.  Translated by Edward Snow. -- ePUB\n\n* New Poems [1908]: The Other Part (North Point, 2014).  Bilingual edition.  Translated by Edward Snow. -- ePUB\n\n* Poems 1906-1926 (New Directions, 1957).  Translated by J. B. Leishman. -- PDF\n\n* Poems from &quot;The Book of Hours&quot; (Vision, 1949).  Bilingual edition.  Translated by Babette Deutsch. -- PDF\n\n* Poetry of Rainer Maria Rilke, The (North Point, 2014).  Bilingual edition.  Translated by Edward Snow. -- ePUB\n\n* Possibility of Being: A Selection of Poems by Rainer Maria Rilke (New Directions, 1977).  Translated by J. B. Leishman. -- ePUB\n\n* Rilke's &quot;Book of Hours&quot;: Love Poems to God (Riverhead, 1996 / 2005).  Translated and edited by Anita Barrows and Joanna Macy. -- PDF + ePUB\n\n* Selected Poems (California, 1971). Bilingual edition. Translated by C. F. MacIntyre. -- PDF\n\n* Selected Poems (Oxford World's Classics, 2011).  Bilingual edition. Translated by Susan Ranson and Marielle Sutherland. -- PDF\n\n* Selected Poems of Rainer Maria Rilke (Harper &amp; Row, 1981).  Bilingual edition. Translated by Robert Bly. -- PDF\n\n* Selected Poetry of Rainer Maria Rilke (Vintage, 1989). Bilingual edition. Translated and edited by Stephen Mitchell. -- ePUB\n\n* Sonnets to Orpheus (California, 1960).  Bilingual edition. Translated by Stephen Mitchell. -- PDF\n\n* Sonnets to Orpheus (Norton, 1970).  Bilingual edition. Translated by M. D. Herder Norton. -- ePUB\n\n* Sonnets to Orpheus (North Point, 2014).  Bilingual edition. Translated by Edward Snow. -- ePUB\n\n* Translations from the Poetry of Rainer Maria Rilke (Norton, 1993).  Bilingual edition.  Translated by M. D. Herder Norton. -- ePUB\n\n* Uncollected Poems (North Point, 2014).  Bilingual edition. Translated by Edward Snow. -- ePUB\n\n* Year with Rilke, A: Daily Readings from the Best of Rainer Maria Rilke (HarperCollins, 2009).  Translated and edited by Joanna Macy and Anita Barrows. -- ePUB\n\n\n                                   == PROSE ==\n\n* Auguste Rodin (Parkstone, 2011).  Translated by Daniel Slager.  [Contains Rilke's &quot;Tribute to the Great Sculptor,&quot; an essay written in 1902 at the start of the poet's association with Rodin, and &quot;The Walking Man,&quot; a speech he delivered in honor of Rodin in 1907.] -- PDF\n\n* Diaries of a Young Poet (Norton, 1998).  Translated by Edward Snow and Michael Winkler. -- ePUB\n\n* Journal of My Other Self (Norton, 1930).  Translated by John Linton.  [The first English translation of The Notebooks of Malte Laurids Brigge.] -- PDF\n\n* Notebooks of Malte Laurids Brigge, The (Penguin Classics, 2009). Translated and edited by Michael Hulse. -- ePUB\n\n* Notebooks of Malte Laurids Brigge, The (Vintage, 1985). Translated by Stephen Mitchell. -- PDF\n\n* On Love and Other Difficulties (W. W. Norton, 1975 / 2004). Translated by John J. L. Mood. -- PDF + ePUB\n\n* Poet's Guide To Life, The: The Wisdom of Rilke (Modern Library, 2005). Edited and translated by Ulrich Baer. -- ePUB\n\n* Stories of God (Norton, 1992).  Translated by H. D. Herder Norton. -- ePUB\n\n* Where Silence Reigns: Selected Prose (New Directions, 1978).  Translated by G. Craig Houston. -- ePUB\n\n                                  == LETTERS ==\n\n* Letters to Benvenuta (Philosophical Library, 1951).  Translated by Heinz Norden. -- PDF\n\n* Letters of Rainer Maria Rilke, Vol. 1: 1892-1910 (Norton, 1969).  Translated by Jane Bannard Greene and M. D. Herder Norton. -- ePUB\n\n* Letters of Rainer Maria Rilke, Vol. 2: 1910-1926 (Norton, 1969).  Translated by Jane Bannard Greene and M. D. Herder Norton. -- ePUB\n\n* Letters to a Young Poet (New World Library, 2000).  Translated by John Burnham. -- ePUB\n\n* Letters to a Young Poet (Penguin Classics, 2011). Translated by Charlie Louth. -- ePUB\n\n* Letters to a Young Poet (Vintage, 1987). Translated by Stephen Mitchell. -- ePUB\n\n* Letters to a Young Poet (Norton, 2004). Translated by M. D. Herder Norton. -- PDF\n\n* Rilke and Andreas-Salomé: A Love Story in Letters (Norton, 2008).  Translated by Edward Snow and Michael Winkler. -- ePUB\n\n* Selected Letters of Rainer Maria Rilke, 1902-1922 (Macmillan, 1947).  Translated by  R. F. C. Hull. -- PDF\n\n* Wartime Letters of Rainer Maria Rilke, 1914-1921 (Norton, 1964).  Translated by M. D. Herder Norton. -- ePUB\n\n_____________________________________________________________________________\n\n\nCONTACT ME: You can reach me with comments, suggestions, requests, error reports, etc., at TPB's forum, SuprBay (you will need to register an account):\n                              \nhttps://pirates-forum.org/User-workerbee  \n\nPLEASE HELP TO SEED!  If you like these books and want others to have access to them, please help to seed for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be for me to upload new content.  Thank you!","torrent":{"xt":"urn:btih:ce5ce613cbebe3fee0968a5a9a0a75ca8fb954d0","amp;dn":"Rainer+Maria+Rilke+-+Poetry%2C+Prose%2C+Letters%2C+Diaries+%2846+books%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce5ce613cbebe3fee0968a5a9a0a75ca8fb954d0","infoHashBuffer":{"type":"Buffer","data":[206,92,230,19,203,235,227,254,224,150,138,90,154,10,117,202,143,185,84,208]},"announce":[],"urlList":[]}}