{"title":"The Nixon Defense: What He Knew and When - John Dean - Audiobook","uid":10706709,"size":751418238,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ce6bc528b97c1b843df2946dc5b4a76631d1ffe4&amp;dn=The+Nixon+Defense%3A+What+He+Knew+and+When+-+John+Dean+-+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1407301347,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Nixon Defense: What He Knew and When He Knew It\n\nWritten by: John W. Dean\nNarrated by: Joe Barrett\nLength: 25 hrs and 59 mins\nFormat: Unabridged\nRelease Date:07-29-14\n\nBased on Nixon's previously overlooked secret recordings, a revelatory new look at Watergate by one of its key figures.\n\nWatergate forever changed American politics, and in light of the revelations about the NSA's wideÂ­spread surveillance program, the scandal has taken on new significance. Yet remarkably, four decades after he was forced to resign, no one has told the full story of Nixon's involvement in Watergate.\n\nIn The Nixon Defense, former White House Counsel John Dean, one of the last major surviving figures of Watergate, draws on his own transcripts of almost a thousand conversations, a wealth of Nixon's secretly recorded information, and more than 150,000 pages of documents in the National Archives and the Nixon Library to provide the definitive answer to the question: What did President Nixon know and when did he know it?\n\nThrough narrative and contemporaneous dialogue, Dean connects dots that have never been connected, including revealing how and why the Watergate break-in occurred, what was on the mysterious 18.5 minute gap in Nixon's recorded conversations, and more.\n\nIn what will stand as the most authoritative account of one of America's worst political scandals, The Nixon Defense shows how the disastrous mistakes of Watergate could have been avoided and offers a cautionary tale for our own time. ","torrent":{"xt":"urn:btih:ce6bc528b97c1b843df2946dc5b4a76631d1ffe4","amp;dn":"The+Nixon+Defense%3A+What+He+Knew+and+When+-+John+Dean+-+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6bc528b97c1b843df2946dc5b4a76631d1ffe4","infoHashBuffer":{"type":"Buffer","data":[206,107,197,40,185,124,27,132,61,242,148,109,197,180,167,102,49,209,255,228]},"announce":[],"urlList":[]}}