{"title":"The Family Plot by Cherie Priest","uid":15878838,"size":466890,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce840aed6a51c1a84e9a69638995da33777e0efe&amp;dn=The+Family+Plot+by+Cherie+Priest&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"gokul1078","files":1,"time":1474565404,"description":"The author of the enormously successful Boneshaker returns to Tor with her unique take on the classic haunted house book\r\n\r\nChuck Dutton built Music City Salvage with patience and expertise, stripping historic properties and reselling their bones. Inventory is running low, so he's thrilled when Augusta Withrow appears in his office offering salvage rights to her entire property. This could be a gold mine, so he assigns his daughter Dahlia to personally oversee the project.\r\n\r\nThe crew finds a handful of surprises right away. Firstly, the place is in unexpectedly good shape. And then there's the cemetery, about thirty fallen and overgrown graves dating to the early 1900s, Augusta insists that the cemetery is just a fake, a Halloween prank, so the city gives the go-ahead, the bulldozer revs up, and it turns up human remains. Augusta says she doesn't know whose body it is or how many others might be present and refuses to answer any more questions. Then she stops answering the phone.\r\n\r\nBut Dahlia's concerns about the corpse and Augusta's disappearance are overshadowed when she begins to realize that she and her crew are not alone, and they're not welcome at the Withrow estate. They have no idea how much danger they're in, but they're starting to get an idea. On the crew's third night in the house, a storm shuts down the only road to the property. The power goes out. Cell signals are iffy. There's nowhere to go and no one Dahlia can call for help, even if anyone would believe that she and her crew are being stalked by a murderous phantom. Something at the Withrow mansion is angry and lost, and this is its last chance to raise hell before the house is gone forever. And it seems to be seeking permanent company.\r\n\r\nThe Family Plot is a haunted house story for the ages-atmospheric, scary, and strange, with a modern gothic sensibility to keep it fresh and interesting-from Cherie Priest, a modern master of supernatural fiction","torrent":{"xt":"urn:btih:ce840aed6a51c1a84e9a69638995da33777e0efe","amp;dn":"The+Family+Plot+by+Cherie+Priest","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce840aed6a51c1a84e9a69638995da33777e0efe","infoHashBuffer":{"type":"Buffer","data":[206,132,10,237,106,81,193,168,78,154,105,99,137,149,218,51,119,126,14,254]},"announce":[],"urlList":[]}}