{"title":"10 X 10 - 100 Architects 10 Critics by Zaha Hadid, Toshiko Mori ","uid":10388966,"size":86613571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ce8786df19bf3d97ceec48c98906830e6fa964f8&amp;dn=10+X+10+-+100+Architects+10+Critics+by+Zaha+Hadid%2C+Toshiko+Mori+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"STBGD","files":-1,"time":1403176311,"description":"10 X 10: 100 Architects 10 Critics by Zaha Hadid, Toshiko Mori\nEnglish | 2005 | ISBN-10: 0714844411 | 468 pages | Pdf | 82 MB\n\nSince the release of the critically acclaimed 10x10 five years ago, the world of architecture has evolved: Advances in technology and research continue to produce increasingly sophisticated forms; advances in communication have resulted in decentralized, multicity architecture offices; and an impressive crop of young architects is emerging from countries with comparatively little previous recognition in the field, such as Slovenia, South Korea, and China. Many of the architects featured in 10x10-- including Asymptote, Shigeru Ban, and MVRDV--have become established fixtures on the international scene, opening the way to a new generation of talent. With the expertise of a highly knowledgeable and high-powered group of curators, 10x10_2 picks up where its predecessor left off. 10x10_2 is a comprehensive and global view of new architecture, presenting the work of 100 up-and-coming architects in 28 countries, selected by 10 of the world's best-informed architectural critics. Organized in A-Z order, the book introduces each architect or studio on four pages that include photographs, drawings, and accompanying text written by the critics. Although some of the architects are beginning to gain worldwide recognition, others have achieved acclaim in their own countries for their work over the past five years. The selection in this volume features more than 250 buildings and projects, including recently built work as well as those currently under construction and due for completion. The effects of the global economy and political shifts are also evident in the book's selection, which includes several architecture studios in Slovenia, South Korea, and China. Also notable is a widespread move toward multi-location architecture collectives such as Servo, Ocean North, and n-o-m-a-d, which take advantage of a network of contacts in key cities around the world. 10x10 _2 also includes 10 original essays written by the critics that express their views on current architectural issues. In addition, each critic has chosen 10 cultural references--from designed objects to film, theory, and literature--that exemplify the range of influences on today's rapidly changing design environment. The complete list of these references as well as one reading from each critic is reproduced in the book, which concludes with complete biographical information on each critic and architect/firm, as well as an index.","torrent":{"xt":"urn:btih:ce8786df19bf3d97ceec48c98906830e6fa964f8","amp;dn":"10+X+10+-+100+Architects+10+Critics+by+Zaha+Hadid%2C+Toshiko+Mori+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce8786df19bf3d97ceec48c98906830e6fa964f8","infoHashBuffer":{"type":"Buffer","data":[206,135,134,223,25,191,61,151,206,236,72,201,137,6,131,14,111,169,100,248]},"announce":[],"urlList":[]}}