{"title":"Hack with your Android! dSploit 1.0.31 APK","uid":8112167,"size":6691804,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:ce94491ca19ac30fae07e9153cff31adca9bf9a2&amp;dn=Hack+with+your+Android%21+dSploit+1.0.31+APK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Doubzstep","files":-1,"time":1360216927,"description":"Introducing dSploit\n\ndSploit is an Android network analysis and penetration suite which aims to offer to IT security experts/geeks the most complete and advanced professional toolkit to perform network security assesments on a mobile device. Once dSploit is started, you will be able to easily map your network, fingerprint alive hosts operating systems and running services, search for known vulnerabilities, crack logon procedures of many tcp protocols, perform man in the middle attacks such as password sniffing ( with common protocols dissection ), real time traffic manipulation, etc, etc . This application is still in beta stage, a stable release will be available as soon as possible, but expect some crash or strange behaviour until then, in any case, feel free to submit an issue on GitHub. \n\n*******************************************************\n\n\nFeatures\n\nWiFi Cracking\n    The WiFi scanner will show in green access points with known default key generation algorithms, clicking on them allows you to easily crack the key, supported models: Thomson, DLink, Pirelli Discus, Eircom, Verizon FiOS, Alice AGPF, FASTWEB Pirelli and Telsey, Huawei, Wlan_XXXX, Jazztel_XXXX, Wlan_XX, Ono ( P1XXXXXX0000X ), WlanXXXXXX, YacomXXXXXX, WifiXXXXXX, Sky V1, Clubinternet.box v1 and v2, InfostradaWifi.\nRouterPWN\n    Launch the http://routerpwn.com/ service to pwn your router.\nTrace\n    Perform a traceroute on target.\nPort Scanner\n    A syn port scanner to find quickly open ports on a single target.\nInspector\n    Performs target operating system and services deep detection, slower than syn port scanner but more accurate.\nVulnerability Finder\n    Search for known vulnerabilities for target running services upon National Vulnerability Database.\nLogin Cracker\n    A very fast network logon cracker which supports many different services.\nPacket Forger\n    Craft and send a custom TCP or UDP packet to the target, such as Wake On LAN packets.\nMITM\n    A set of man-in-the-midtle tools to command&amp;conquer the whole network.\n\nSimple Sniff\n    Redirect target's traffic through this device and show some stats while dumping it to a pcap file.\nPassword Sniffer\n    Sniff passwords of many protocols such as http, ftp, imap, imaps, irc, msn, etc from the target.\nSession Hijacker\n    Listen for cookies on the network and hijack sessions.\nKill Connections\n    Kill connections preventing the target to reach any website or server.\nRedirect\n    Redirect all the http traffic to another adtress.\nReplace Images\n    Replace all images on webpages with the specified one.\nReplace Videos\n    Replace all youtube videos on webpages with the specified one.\nScript Injection\n    Inject a javascript in every visited webpage.\nCustom Filter\n    Replace custom text on webpages with the specified one.\n\nRequirements\n\nARM\n    Your device must have an ARM cpu.\nGingerbread\n    An Android device with at least the 2.3 ( Gingerbread ) version of the OS.\nRoot\n    The device must be rooted.\nBusyBox\n    The device must have a BusyBox full install, this means with every utility installed ( not the partial installation ). \n\n*******************************************************\n\nHack your friends, families, and others for free!\n\nDo not use this in public places on strangers, as doing this is ILLEGAL!!!\n\nYOU MUST HAVE A ROOTED ANDROID PHONE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!\n\nFor more info, please visit: http://www.dsploit.net/\n\nHere is a brief run through on all that it does: \n\nIf you like/use it,\n\nthen....\n\n\n\nSEEEEEEEEEEEED!!!","torrent":{"xt":"urn:btih:ce94491ca19ac30fae07e9153cff31adca9bf9a2","amp;dn":"Hack+with+your+Android%21+dSploit+1.0.31+APK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce94491ca19ac30fae07e9153cff31adca9bf9a2","infoHashBuffer":{"type":"Buffer","data":[206,148,73,28,161,154,195,15,174,7,233,21,60,255,49,173,202,155,249,162]},"announce":[],"urlList":[]}}