{"title":"The Self-Hypnosis Diet by Steven Gurgevich et al","uid":9409732,"size":35823093,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cea7f56d81a0db3e95066f1e657bf428a5af7c86&amp;dn=The+Self-Hypnosis+Diet+by+Steven+Gurgevich+et+al&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"420weedman","files":-1,"time":1388254440,"description":"Renowned hypnosis and health experts Steven and Joy Gurgevich reveal the most powerful tool available for sustainable weight loss-our subconscious minds. With The Self-Hypnosis Diet, readers can reach their perfect weight with proven, successful techniques designed to utilize and understand the subconscious mind-body connection.\nIn this instructive book and companion CD of guided self-hypnosis trancework sessions, readers will discover:- How to determine, reach, and maintain your ideal weight based on your own needs- How to increase willpower, change unhealthy eating patterns, and create new and lasting behaviours- How to still have an enjoyable, fulfilling love affair with food. As members of Dr. Andrew Weil's Integrative Medicine program, Steven and Joy Gurgevich have taught thousands how to use hypnosis to overcome the innate challenges of dieting. With The Self-Hypnosis Diet, now available in paperback, they provide the &quot;missing ingredient&quot; to any plan for achieving a healthy diet and lifestyle-and change that lasts for a lifetime.","torrent":{"xt":"urn:btih:cea7f56d81a0db3e95066f1e657bf428a5af7c86","amp;dn":"The+Self-Hypnosis+Diet+by+Steven+Gurgevich+et+al","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cea7f56d81a0db3e95066f1e657bf428a5af7c86","infoHashBuffer":{"type":"Buffer","data":[206,167,245,109,129,160,219,62,149,6,111,30,101,123,244,40,165,175,124,134]},"announce":[],"urlList":[]}}