{"title":"Richard Dawkins - The Greatest Show on Earth (Unabridged)","uid":5135395,"size":840487213,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ceddfa053f368fddffc7717d2fb8e42a7ee7b2f9&amp;dn=Richard+Dawkins+-+The+Greatest+Show+on+Earth+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"sheila6","files":-1,"time":1256435365,"description":"Audio Books : Misc. Educational : MP3/128Kbps : English\n\n\n\nCharles Darwin's masterpiece, On the Origin of Species, shook society to its core on publication in 1859. Darwin was only too aware of the storm his theory of evolution would provoke, but he would surely have raised an incredulous eyebrow at the controversy still raging a century and a half later. Evolution is now accepted as scientific fact by all reputable scientists and indeed theologians, yet millions of people continue to question its veracity. \n\nIn The Greatest Show on Earth, Richard Dawkins takes on creationists, including followers of 'Intelligent Design' and all those who question the fact of evolution through natural selection. Like a detective arriving on the scene of a crime, he sifts through fascinating layers of scientific facts and disciplines to build a cast-iron case: from the living examples of natural selection in birds and insects; the 'time clocks' of trees and radioactive dating that calibrate a timescale for evolution; the fossil record and the traces of our earliest ancestors; to confirmation from molecular biology and genetics. All of this, and much more, bears witness to the truth of evolution.\n\nThe Greatest Show on Earth comes at a critical time: systematic opposition to the fact of evolution is now flourishing as never before, especially in America. In Britain and elsewhere in the world, teachers witness insidious attempts to undermine the status of science in their classrooms. Richard Dawkins provides unequivocal evidence that boldly and comprehensively rebuts such nonsense. At the same time he shares with us his palpable love of the natural world and the essential role that science plays in its interpretation. Written with elegance, wit and passion, it is hard-hitting, absorbing and totally convincing.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:ceddfa053f368fddffc7717d2fb8e42a7ee7b2f9","amp;dn":"Richard+Dawkins+-+The+Greatest+Show+on+Earth+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceddfa053f368fddffc7717d2fb8e42a7ee7b2f9","infoHashBuffer":{"type":"Buffer","data":[206,221,250,5,63,54,143,221,255,199,113,125,47,184,228,42,126,231,178,249]},"announce":[],"urlList":[]}}