{"title":"Space Engineers v01.156.003","uid":15992905,"size":4060034528,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ceec8a8a9fb29bf25d9dac658798ca6a456ebeeb&amp;dn=Space+Engineers+v01.156.003&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":6,"uploader":"dauphong","files":1,"time":1476036867,"description":"Space Engineers is a sandbox game about engineering, construction and maintenance of space works. Players build space ships and space stations of various sizes and utilization (civil and military), pilot ships and perform asteroid mining.\r\n\r\nSpace Engineers utilizes a realistic volumetric-based physics engine: all objects can be assembled, disassembled, damaged and destroyed. The game comes with two game modes: creative and survival.\r\n\r\nVolumetric objects are structures composed from block-like modules interlocked in a grid. Volumetric objects behave like real physical objects with mass, inertia and velocity. Individual modules have real volume and storage capacity.\r\n\r\nSpace Engineers is inspired by reality and by how things work. Think about modern-day NASA technology extrapolated 60 years into the future. Space Engineers strives to follow the laws of physics and doesn't use technologies that wouldn't be feasible in the near future.\r\n\r\nSpace Engineers concentrates on construction aspects, but can be played as a tactical shooter as well. We expect players to avoid engaging in direct man-to-man combat and instead use their creativity and engineering skills to build war machines and fortifications. Space Engineers shouldn’t be about troops; it should be about the machinery you build","torrent":{"xt":"urn:btih:ceec8a8a9fb29bf25d9dac658798ca6a456ebeeb","amp;dn":"Space+Engineers+v01.156.003","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceec8a8a9fb29bf25d9dac658798ca6a456ebeeb","infoHashBuffer":{"type":"Buffer","data":[206,236,138,138,159,178,155,242,93,157,172,101,135,152,202,106,69,110,190,235]},"announce":[],"urlList":[]}}