{"title":"In This Moment - The Dream (2008)","uid":11436407,"size":103481970,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf3531ed8f8f3ebb1ce7ad74b64aeb37ad3f4c6d&amp;dn=+In+This+Moment+-+The+Dream+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"analogkid6103","files":11,"time":1415758375,"description":"Summary: A solid follow up to their major debut, which breaks with their previous metalcore sounds and establishes a more hard rock sound and feel.\n\nWith 'Beautiful Tragedy' the year 2007 turned out quite succesfull for In This Moment. Basically, it's a pretty young band, founded in 2005, though that does not have to mean a lot. Their major debut was solid and is still a fun listen. Metalcore with female vocals is not really a brand spanking new invention, but it's still a bit unusual. A pleasing singing voice with quite powerful shouts, combined with typical metalcore-rythms and arrangements, that was In This Moment anno 2007. With 'The Dream' the band presents their follow up album, which fans and critics alike are looking forward to and wonder how it actually turns out.\n\nMore or less the album follows an Alice in Wonderland scheme. The intro 'The Rabbit Hole', the artwork overall but especially the promotion pictures with singer Maria Brink suggest that. The songs and lyrics relate to everyday situation and topics like life on tour, love and the like. Not really different to the precessor. But, what the listener will notice on the first spin through: the way the lyrics are presented has changed a lot. Shouts and screams are almost completely gone, apart from two songs all vocals are clean. From all the songs, 'The Great Divide' resembles the style of the former album the most, and also the small breakdown-ish part in 'Her Kiss' hints toward that style. The rest of the vocals are 100% clean though. This is not really a bad thing, as the voice of Maria Brink is not bad. Some fans will miss the combination of clean female vocals and shouts, which was obviously for many the interesting part about the band. If all this is change for the better will be up to personal taste.\n\nThe vocals are not the only thing that changed, as the general sound of the band has moved away form metalcore, breakdowns and similar song elements. The guitarists Chris Howorth and Blake Bunzel have found the old treats of metal and rock, and construct a sound that reminds of hard rock and old-school heavy metal. A lot. Overall everything sounds more rock-like, every now and then paired with classic guitar solos or leads. The songs got catchier, almost with plain pop-appeal. Which the rythmsection reflects as well. We have a solid foundation here, but drummer Jeff Fabb keeps a more low profile compared to previous efforts. The same goes for bassist Jesse Landry. A very good example for the new style is the opener 'Forever', which is available for streaming on the bands MySpace page for quite a while now. Catchy riffs, almost siren-like vocals. The perfect single. Like mentioned earlier, most similar to the songs on 'The Beautiful Tragedy' is 'The Great Divide'. It showcases the combination of clean vocals, shouts, driving double-bass, heavy riffs and hymn like parts fans liked about the older songs of the band. If that will be enough to please their old fans, is yet to be seen. In the more rock-like context the ballad 'Into The Light' does not feel as misplaced as it may have before. It shows the voice Maria Brink accompanied by piano and string arrangements. This really supports her voice, a little pause, stepping on the brakes. It's actually very pleasing.\n\nStill, it's yet to be seen how the overall work will be recieved. Some will surely say it's too mellow and rock-like. Not enough shouts and heavy passages. Others will welcome the more mellow stance, incorporating more rock and classical metal elements, which makes it overall more accessible. If you're in the former or latter group after the dreamy sounds of the title track, will be up to personal taste. It's a fact though: with 'The Dream' the band emerges from the swamp of metalcore-like bands, and presents a quite entertaining metal/hard-rock album. The more dominant clean vocals, the sometimes sophisticated guitar riffs showcase some of the bands better qualities. Overall it's not ground breaking, but solid.\n\nIf you wanna spare a listen, try these songs: 'Forever', 'Her Kiss', 'Lost At Sea'.\n\n\n01. The Rabbit Hole (1:00)\n02. Forever (4:22)\n03. All For You (4:55)\n04. Lost At Sea (3:46)\n05. Mechanical Love (3:38)\n06. Her Kiss (4:30)\n07. Into The Light (4:12)\n08. You Always Believed (3:41)\n09. The Great Divide (4:11)\n10. Violet Skies (3:57)\n11. The Dream (4:43)\n\n\n\nGenre:\tNu-\nSubgenre:\tAlternative / Nu-Metal\nBitrate:\t320 k\nSize:\t98.69 MB\nShow/Hide Files: \t\n11 files","torrent":{"xt":"urn:btih:cf3531ed8f8f3ebb1ce7ad74b64aeb37ad3f4c6d","amp;dn":"+In+This+Moment+-+The+Dream+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf3531ed8f8f3ebb1ce7ad74b64aeb37ad3f4c6d","infoHashBuffer":{"type":"Buffer","data":[207,53,49,237,143,143,62,187,28,231,173,116,182,74,235,55,173,63,76,109]},"announce":[],"urlList":[]}}