{"title":"The Mountain Goats - All Hail West Texas (2013) [FLAC]","uid":8735476,"size":351070334,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf72c5fce00bdb59ab6dfc2d31ff76006885e63e&amp;dn=The+Mountain+Goats+-+All+Hail+West+Texas+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"politux","files":-1,"time":1374678493,"description":"\n  The Mountain Goats - All Hail West Texas (2013) [FLAC]\n\n  Released: 2002\n  Reissued: 2013\n  Genre: Pop/Rock\n  Styles: Folk, Indie, Singer/Songwriter, Lo-fi\n  Source: 2013 Remastered CD with Bonus Tracks (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 The Best Ever Death Metal Band In Denton\n  02 Fall of the Star High School Running Back\n  03 Color in Your Cheeks\n  04 Jenny\n  05 Fault Lines\n  06 Balance\n  07 Pink and Blue\n  08 Riches and Wonders\n  09 The Mess Inside\n  10 Jeff Davis County Blues\n  11 Distant Stations\n  12 Blues in Dallas\n  13 Source Decay\n  14 Absolute Lithops Effect\n\n  Bonus Tracks\n\n  15 Hardpan Song\n  16 Answering the Phone\n  17 Indonesia\n  18 Midland\n  19 Jenny\n  20 Tape Travel is Lonely\n  21 Waco\n\n  Complex, awe-inspiring, and fresh with fretwork excitement, John Darnielle steps up to the mike with guitar in hand, revealing sentimental and emotionally charged acoustic gems. Leader of the Mountain Goats, Darnielle doesn't hide any sense of creativity while composing the material for this record. All Hail West Texas has juicy bits and pieces of melodic tapestry, with a forceful percussive background statement keeping the music afloat. Perhaps what most often reveal themselves during this lush and stylistically complex endeavor are the mature and naturally contemplative lyrics that Darnielle has been able to put together into his songs. Highlights such as &quot;Riches and Wonders&quot; and &quot;Distant Stations&quot; jump at the chance to grab the listener. Other tunes that break through indie-level barriers are the eclectic &quot;Fall of the Star High School Running Back&quot; and the original &quot;Best Ever Death Metal Band in Denton.&quot; The textured feel of the variety of sounds and notes created by the Mountain Goats is appealing and gripping, a foray into sounds chilling and pristine. The delivery of the lyrics is wondrous and breathtaking during certain moments. The band's instrumental ability possesses dexterous flair, and the result is the charm of the record's immediacy and absorbing emotional impact. The tragic weakness of All Hail West Texas is perhaps its need for persistent listening in order to understand the direction of the music. However, maybe that just proves to be the magic key, and the route to further appreciation of this particular period of the Mountain Goats' music.","torrent":{"xt":"urn:btih:cf72c5fce00bdb59ab6dfc2d31ff76006885e63e","amp;dn":"The+Mountain+Goats+-+All+Hail+West+Texas+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf72c5fce00bdb59ab6dfc2d31ff76006885e63e","infoHashBuffer":{"type":"Buffer","data":[207,114,197,252,224,11,219,89,171,109,252,45,49,255,118,0,104,133,230,62]},"announce":[],"urlList":[]}}