{"title":"The.Settlers.7.Paths.to.a.Kingdom.Deluxe.Gold.Edition.DLC.Enable","uid":8200036,"size":14146233,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cfef7a920aeca2f3a073dc8fcad24f9db41af2f6&amp;dn=The.Settlers.7.Paths.to.a.Kingdom.Deluxe.Gold.Edition.DLC.Enable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Mr.Stifmeister","files":-1,"time":1361993134,"description":"\n                         -=- Proudly Presents -=-\n\n    The Settlers 7 Paths to a Kingdom Deluxe Gold Edition DLC Enabler\n\n\nRelease On   : 27 February 2013       Disk Amount/Format : DOX\nType of Game : Strategy               Media Protection   : UBI DRM\n\n\nRelease Information:\n\nDeluxe Gold Edition Includes:\n\n13 exclusive maps: 6 multiplayer maps and 7 single player campaigns.\n\nA dozen new buildings. Including the Crypt, Order of Knights, Infernal\nmine.\n\nOver 30 new locations. Including Field of Mandrake, Treasure Island,\nPilgrimage site.\n\nCastle forge elements allowing players to make their cities unique and\ncustomize their castles: 1 gate, 2 windows, 1 bay, 1 balcony and 1\ngargoyle.\n\nAbout the Game:\n\nChoose your own path to victory in The Settlers 7: Paths to a Kingdom,\nthe long-anticipated sequel to the award-winning strategy game. Embark\non an exciting quest to create, build and manage your kingdom in the\nmost innovative, customizable and re-playable version ever!\n\nImmerse Yourself in a Captivating Story\nUnravel an intriguing and unexpected story as you play. Combat enemies\nall across the land in a quest to conquer a formidable kingdom. Defeat\nruthless kings, forbidding lords and dark knights on your quest for\nvictory. Uncover undisclosed traitors along your path and turn enemies\ninto allies to pave your path to victory.\n\nExperience a Vast and Beautiful Kingdom\nA beautiful, colorful world awaits you with a level of detail unseen\nbefore now! A flourishing kingdom full of bustling Settlers will\nenthrall you from the very first moment.\n\nBuild, Develop and Manage Your Emerging Domain\nEnjoy a deep and rich building and production system as you create a\nkingdom of fortified towns, small villages and productive settlers.\nMake critical decisions as you expand your realm. Should you optimize\nproduction chains, build transport systems, construct new buildings or\nincrease worker efficiency? Every choice you make builds a critical\npath to victory or defeat.\n\nKey Features:\n\nExpand Your Empire Your Way\nExperience more freedom than ever before as you choose your own custom\nstrategy. Build strong armies and defeat your opponents in epic\nbattles. Be the first to develop new and attractive technologies. Or,\nlet money rule and occupy the most lucrative trade routes. It s\ncompletely up to you to devise your ideal strategy for beating your\nopponents.\n\nInnovative Victory Point System\nEvery match is truly unique with the new victory point system. A new\nlevel of tension is reached as you and your opponents collect points\nbased on victories you achieve throughout the game. Every decision\ncounts as you engage in tactics to earn the most points by:\n\nConquering Map Sectors\nBuilding the Biggest Army\nOccupying the Most Trade Routes\nDeveloping New Technologies\nBecoming the Richest Kingdom\nAnd More!\n\nMore Customization than Ever Before\nExperience a highly customizable experience as you:\n\nUnlock new items that are unique to you\nCreate and customize maps to your needs\nAdjust the victory point system based on your individual preferences\nSelect a fast or slow mode of play\nChoose the length of your game from quick match to an extended campaign\nSelect your level of difficulty\nPlay against a variety of AI profiles, up to 4 players or in team mode\n\nBuild Your Own Castle\nBring even more customization to your game as you assemble your castle\nfrom a wide range of styles, designs and architectural details. You and\nyour friends can share your creations online.\n\nSocial Networking Integration\nDeep social networking integration lets you bring your gaming experience\nto your social circle:\nInvite friends to compete or cooperate, upload screen shots,\ndisplay your gaming status\n\nTwitter: Provide summaries of your achievements as you play and receive\nthe latest product news\n\n\nBurn/mount, unpack into your The Settlers 7 main folder and overwrite!\n\nRemember to block game from internet.\n\n\nGreetz: LARGEiSO and MEDIUMiSO\n\n\n                                                                  (C) E/dfs\n                         &quot; SIZE DOES NOT MATTER! &quot;\n","torrent":{"xt":"urn:btih:cfef7a920aeca2f3a073dc8fcad24f9db41af2f6","amp;dn":"The.Settlers.7.Paths.to.a.Kingdom.Deluxe.Gold.Edition.DLC.Enable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfef7a920aeca2f3a073dc8fcad24f9db41af2f6","infoHashBuffer":{"type":"Buffer","data":[207,239,122,146,10,236,162,243,160,115,220,143,202,210,79,157,180,26,242,246]},"announce":[],"urlList":[]}}