{"title":"Sixx_Nikki-Heroin_Diaries_The.epub","uid":8884148,"size":3840538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0207cfcde941d2c3df0d00d15fe3ada24a51d87&amp;dn=Sixx_Nikki-Heroin_Diaries_The.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"420weedman","files":1,"time":1378408586,"description":"Set against the frenzied world of heavy metal superstardom, the co-founder of legendary Motley Crue offers an unflinching and gripping look at his own descent into drug addiction. par When Motley Crue were at the height of their fame, there wasn't a drug Nikki Sixx wouldn't do. He spent days - sometimes alone, sometimes with others addicts, friends and lovers - in a coke- and heroin-fuelled daze. THE HEROIN DIARIES reveals Nikki's personal diary entries alongside commentary from the people who know Nikki best including band mates Tommy, Vince and Mick. The book is a candid look at a nightmare come true: a punishing heroin addiction that brought Nikki to the edge of losing his talent, his career, his family and finally to a near-fatal overdose which left him clinically dead for a few minutes before being revived. Brutally honest, utterly riveting and shockingly moving, THE HEROIN DIARIES follows Nikki during the year he plunged to rock bottom and his courageous decision to pick himself up and start living again.","torrent":{"xt":"urn:btih:d0207cfcde941d2c3df0d00d15fe3ada24a51d87","amp;dn":"Sixx_Nikki-Heroin_Diaries_The.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0207cfcde941d2c3df0d00d15fe3ada24a51d87","infoHashBuffer":{"type":"Buffer","data":[208,32,124,252,222,148,29,44,61,240,208,13,21,254,58,218,36,165,29,135]},"announce":[],"urlList":[]}}