{"title":"The Unlikely Pilgrimage of Harold Fry - Rachel Joyce.epub","uid":8756177,"size":678067,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d02ac34d90be3de04f4781ce2d648dc3939e5f14&amp;dn=The+Unlikely+Pilgrimage+of+Harold+Fry+-+Rachel+Joyce.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1375152068,"description":"Harold Fry is convinced that he must deliver a letter to an old love in order to save her, meeting various characters along the way and reminiscing about the events of his past and people he has known, as he tries to find peace and acceptance.\n\nRecently retired, sweet, emotionally numb Harold Fry is jolted out of his passivity by a letter from Queenie Hennessy, an old friend, who he hasn't heard from in twenty years. She has written to say she is in hospice and wanted to say goodbye. Leaving his tense, bitter wife Maureen to her chores, Harold intends a quick walk to the corner mailbox to post his reply but instead, inspired by a chance encounter, he becomes convinced he must deliver his message in person to Queenie--who is 600 miles away--because as long as he keeps walking, Harold believes that Queenie will not die.\n\nSo without hiking boots, rain gear, map or cell phone, one of the most endearing characters in current fiction begins his unlikely pilgrimage across the English countryside. Along the way, strangers stir up memories--flashbacks, often painful, from when his marriage was filled with promise and then not, of his inadequacy as a father, and of his shortcomings as a husband.\n\nIronically, his wife Maureen, shocked by her husband's sudden absence, begins to long for his presence. Is it possible for Harold and Maureen to bridge the distance between them? And will Queenie be alive to see Harold arrive at her door ?","torrent":{"xt":"urn:btih:d02ac34d90be3de04f4781ce2d648dc3939e5f14","amp;dn":"The+Unlikely+Pilgrimage+of+Harold+Fry+-+Rachel+Joyce.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02ac34d90be3de04f4781ce2d648dc3939e5f14","infoHashBuffer":{"type":"Buffer","data":[208,42,195,77,144,190,61,224,79,71,129,206,45,100,141,195,147,158,95,20]},"announce":[],"urlList":[]}}