{"title":"Pluralsight - Building JAX-WS Web Services with Apache CXF With ","uid":10999504,"size":498966528,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d050d2a227227a8852b8500b0e9defe7b3ce0594&amp;dn=Pluralsight+-+Building+JAX-WS+Web+Services+with+Apache+CXF+With+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"yousef86","files":1,"time":1410119971,"description":"Pluralsight - Building JAX-WS Web Services with Apache CXF With Michael Hoffman\n===============================================================================\nEnglish | 4/22/2014 | .MP4 | h264, yuv420p, 1024x768, 15.00 fps(r) | aac, 44100 Hz, stereo | 475 MB\nGenre: E-learning\n\n\n\nThis course is designed to help you learn and practice implementing contract-first web services using Apache CXF. We will focus on Java's JAX-WS specification as it is mature and accepted as a standard approach for web service implementation.\n\nThis course is designed to help you learn and practice implementing contract-first web services using Apache CXF. We will focus on Java's JAX-WS specification as it is mature and accepted as a standard approach for web service implementation. This course has several objectives. Upon completion, you will be able to describe the Apache CXF architecture in detail. You will see the benefits of using CXF and understand the drivers for using it in your applications. You will be able to create a CXF web project using Maven. You will be able to use CXF for implementing a contract-first web service endpoint with a JAX-WS front-end. You will be able to implement unit tests, error handling, and interceptor logic for a CXF web service. Finally, you will be able to implement a web service client using CXF. This course is primarily intended for Java developers looking to implement web services. It will also be useful for technical and solution architects who are investigating technologies to leverage for implementing web services. It is recommended that you are proficient with Java and have an understanding of the Spring Framework core project. To best understand the drivers for using Apache CXF for your web service implementation, we will cover a brief history of the Java specifications, including JAX-RPC, JAX-WS, and JAX-RS. While the course will not cover CXF's capabilities around JAX-RS, we will cover the key architecture components that back the JAX-RS front-end. While viewing the course, you will be able to follow along with the many demonstrations it includes. Each demonstration will build on the previous demonstration to assure you a fluid experience.","torrent":{"xt":"urn:btih:d050d2a227227a8852b8500b0e9defe7b3ce0594","amp;dn":"Pluralsight+-+Building+JAX-WS+Web+Services+with+Apache+CXF+With+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d050d2a227227a8852b8500b0e9defe7b3ce0594","infoHashBuffer":{"type":"Buffer","data":[208,80,210,162,39,34,122,136,82,184,80,11,14,157,239,231,179,206,5,148]},"announce":[],"urlList":[]}}