{"title":"Propellerheads Rebirth Collection","uid":4615433,"size":450777781,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d09969da479e5ad18fb199396cf50ceb4e7add17&amp;dn=Propellerheads+Rebirth+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"kidknapp","files":387,"time":1230818283,"description":"............K  k II DDd  N   N    A    Pp    *****   \n\t    k k  ii d  d nn  n   a a   p P  *******\n            kk   ii d  d n n n  aaaaa  ppp  *******\n&quot;&quot;&quot;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&quot;&quot;k k&quot;&quot;ii&quot;d&quot;&quot;d&quot;n&quot;&quot;nn&quot;a&quot;&quot;&quot;&quot;&quot;a&quot;p&quot;&quot;&quot;&quot;*******&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&quot;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&quot;&quot;&quot;&quot;          ............K  k II DDd  N   N A     A P     *****     \n                                       P       \n                      *****PRESENTS*****\n               ReBirth 338 Version 2.0.1 w/ALL MODS \n               And A Few Hundred Songs off the old Museum.....\n     \n    No cracks, no patch, just good ole' software. Some might argue that \n    ReBirth-338 V 2.0.1 is obsolete and not useful because it is free. I \n    would say that it is one of the greatest sequencer programs ever brought\n    to a stable version. Once you work at the interface and overcome its\n    complexities you will understand its value is not in versatility or\n    ability, but in the sheer quality of it as a Real-time Virtual Module. \n    Free to play and create with, you must register account with Propellerhead\n    to download mods from museum, but I have included here for your convenience.\n    \n      To Install Rebirth - Mount .iso file or burn cd and install from that. \n      I recommend mounting in a virtual drive you can leave it in all the \n      time because the program requires the cd to be inserted for use.(Prevent \n      tying up your disc drive).\n    \n    \n   ^^Or Go with Propellerhead Info&gt;\n     \t \t\n\t\t\nThe ReBirth copy protection system uses a CD key that must be mounted when you launch the application. The CD-Rom includes the application, documentation manuals, example files and ReBirth Mods. There is no technical support from Propellerhead Software, however detailed instructions are provided on this page. Check the support section for more information.\n\t\n\tWindows\n\t\n\nThere is one disc image in .iso format available for download. You can burn this image file using a CD/DVD authoring software like Nero or any other software that can burn image files to a CD. For more information, see the documentation that comes with the application or the manufacturer's website.\n\nReBirth 2.0.1 Torrent\nWindows 95/98/NT/ME/XP version. 215 mb\n\nThis is a BitTorrent download. If you don't have a BitTorrent client, check here for example: http://azureus.sourceforge.net\n\nInstalling using CD/DVD authoring software (requires blank CD-R disc) Download &quot;ReBirth RB-338 2.0 iso.iso&quot; and burn the image to disc. Launch the &quot;Install ReBirth RB-338.exe&quot; from your disc. Follow the instructions on screen.\n\nWhat software should I choose?\nFor burning a CD you can always try Nero, it's a tried and tested application.\n\t\n\nNote: The following error-message may occur during installation on the Windows platform: C:WINDOWSSYSTEM32AUTOEXEC.NT.The system file is not suitable for running MS-DOS and Windows applications.\n\nThis means you'll have to replace some files on your computer. Please visit this link and read the text carefully.\n\t\n\t\n\tMac OS\n\t\n\nThere are two versions available for Mac users. However, if you're on Mac OS 9, you need to use the disc image version, as the cdr version only works for OS X users (who plan to run ReBirth in classic mode).\n\t\nMac OS 9 + Mac OS X\n\nTo use a disc image that you mount on your Desktop each time you launch ReBirth, download ReBirth RB-338 2.0.img.\n\nReBirth 2.0.1 Torrent\nMacOS version disc image - 259 mb\n\nThis is a BitTorrent download. If you don't have a BitTorrent client, check here for example: http://azureus.sourceforge.net\n\nInstalling from the Disc Image\nDownload &quot;ReBirth RB-338 2.0 img.img&quot;. Double-click on the file and wait until it mounts on the Desktop. On the mounted volume, locate and double click &quot;Install ReBirth RB-338&quot;. Follow the instructions on screen.\n\t\nMac OS X\n\nTo burn a CD (that you need to have inserted each time you run ReBirth), download ReBirth RB-338 2.0.cdr. Again, this option is only available to OS X users (although once you have burnt the CD, you'll be able to use it on both OS X and OS 9).\n\nReBirth 2.0.1 Torrent\nMacOS version complete CD - 369 mb\n\nThis is a BitTorrent download. If you don't have a BitTorrent client, check here for example: http://azureus.sourceforge.net\n\nInstalling from CD (requires blank CD-R disc)\nDownload &quot;ReBirth RB-338 2.0 cdr.cdr&quot; and put it on your Desktop. Launch the application &quot;Disk utility&quot; (included with Mac OS X). Locate the item &quot;ReBirth RB-338 2.0.cdr&quot; in the list to the left and click on it to select it. Click the Burn button on the Toolbar. Follow the instructions on screen.\n\nWhen the disk is ready, quit Disk Utility and insert the disk again. Double click &quot;Install ReBirth RB-338&quot;. Follow the instructions on screen.\n\t \n         \n  &gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;MODS!!!!!!!!!&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;,  \n    \n            \n      ReBirth Mods are a celebration of creativity from the user community. Skilled graphic design artists and musicians have taken ReBirth to a new level with new interfaces and innovative sample sets. These Mods work with ReBirth version 2.0.1.\n\t\n\t\n\tInstalling Mods\n\t\n\nAfter downloading the RBM file, move it into the &quot;Mods&quot; directory in the ReBirth Application folder.\n\nMacOS 9 users place RBM files in:\nDrive:Applications (Mac OS 9)ReBirth RB-338 2.0Mods\n\nWindows Users place the RBM files in:\nLocal Disc (C:)Program FilesPropellerheadReBirth RB-338 2.0Mods\n\nRelaunch ReBirth, and the Mod will appear in the &quot;Mods&quot; pull down menu.\n\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;Summaries!!!!!&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\nDubwiser\nBy Tim Bran and Fredrik HÃƒÂ¤gglund\nTim Bran of Dreadzone fame brings you Dubwiser, the ultimate dub mod. Featuring a custom sampleset that covers the nitty-gritty of dub drums and percussion, the Dubwiser comes replete with a quirky interface in green, gold and camouflage.\n\t\n\t\t\n\nMiDiMoD\nBy Neil Parker\nThe Midimod Made for Industrial Trax - a stripped down working version of ReBirth, that anyone could use and use well. The beaten and rusted gui is easy to use, samples stem from past mods, hardware and a few 80's records that were laying around.\n\t\n\t\t\n\nReBirthday\nBy Peff and bitplant\nThis mod was created as a gift to Propellerhead Software for its 10th anniversary by Peff and the Merkle brothers of bitplant. Reason Drum Kits drum sounds, Indian instruments and the Rhodes Piano from the Electromechanical ReFill.\n\t\n\t\t\n\nCircuitbreaker Theorem\nBy Minimal Concept III\nA pure techno mod with hard and edgy sounds in a very orange package. Apart from techno sounding drum samples, this mod also has a set of congas, chord stab samples and some effect sounds.\n\t\n\t\t\n\nBeatnik\nBy Flip Dog &amp; Supernaut\nThe Beatnik Mod has a futuristic interface with some cool effects and a sample set that seems suited for the darker side of music. it's a Rock n' Roll mod according to the authors - whatever that means...\n\t\n\t\t\n\nSidstation Mod 2.0\nBy Massen &amp; Elektron ESI AB\nA new masterpiece by Massen and Elektron ESI AB. This fantastic mod is a RBM version of the famous sidstation synth. The sounds are all samples from the sidstation. Bleeps galore!\n\t\n\t\t\n\nReBirth RMX\nBy bartr\nOriginally created as a school project for a design class, the RMX naturally comes with a stylish hi-tech interface. The sampleset contains some clean housey drums and a collection of synth bleeps and effects.\n\t\n\t\t\n\nSpassiba\nBy Supernaut\nLike Supernaut's previous creation, Dogma, this is a clean creation. It has a sample set with synth sounds, percussion and some drum loops. Many of the sounds should fit quite well in the electronica genre.\n\t\n\t\t\n\nReDirt!\nBy ThaCnaT\nReDirt! is a theme mod made by ThaCnaT to recreate the vibe of the Italian 'Afro-era' of the late 70s/early 80s. The mod has a mix of groovy drum and percussion loops as well as various instrument sounds.\n\t\n\t\t\n\nComposit\nBy P. Allert\nThe Composit mod has a varied sample set and a futuristic look. The samples are all crisp and clear with loops, synth sounds and various percussion sounds, some of them with unusual reverb effects.\n\t\n\t\t\n\nPlasmafire\nBy The Silencer &amp; CelticSons.\nA mod from Minimalist Techno veterans CelticSons and The Silencer ought to be good for minimalist styles. Behind it's clean plastic interface lies a very good sample set of weird bleeps, synths and drum sounds that should be very useful for making techno tunes.\n\t\n\t\t\n\nReConstructed\nBy O.I.N.K.\nA hardware software synth! As crazy as it may sound, O.I.N.K's new mod is comes packed with hardware references. Controls are made of screws, bolts and water-levels. The sound is what you expect it to be: metallic hammers, drills and so on. A truly weird mod.\n\t\n\t\t\n\nDogma\nBy Supernaut.\nA beautiful metallic interface and a set of really good, clean drum and synth samples makes this mod a very versatile one that should be useful in most genres of electronic music.\n\t\n\t\t\n\nRed Stripe - Drum &amp; Bass\nBy Peff, Jesuspark and JackPlug.\nIt's the mega Drum &amp; Bass Mod developed by Rebirthers as part of a music project for Red Stripe, a lager beer with a long association with the underground music scene. Conceived by JackPlug, the Red Stripe has samples and a breathtaking demo track by Peff and an awesome interface by JesusPark.\n\t\n\t\t\n\nIQ\nBy Dr. Bruno &amp; Syrusate.\nAnother team effort from the creators of the Aluwerk mod. This mod is a funky little piece of breakbeatish drums, jazzy chords and some quite weird electronic bleeps and noises packed in a black interface with... a howling wolf on the panel.\n\t\n\t\t\n\nNoize\nBy EinzelgÃƒÂ¤nger.\nA new mod from EinzelgÃƒÂ¤nger, it is somewhat along the same lines as Digalog sound wise: Very electro, very plastic. The graphics are something completely new. A very minimalistic, futuristic interface. Truly original\n\t\n\t\t\n\nDigalog\nBy EinzelgÃƒÂ¤nger.\nLong time board veteran EinzelgÃƒÂ¤nger has made this very electronic sounding and synthetic looking mod. The interface is a very plastic blue and the sample set offers lots of bleeps and synthetic percussion sounds.\n\t\n\t\t\n\nGroove ENGINE\nBy Leiff.\nThe beautifully crafted Groove ENGINE has the sound of a very groovy factory. The sample set is based on various industrial noises of very high quality. The sounds are very good, but the most stunning feature of this mod is the truly unique interface.\n\t\n\t\t\n\n7mb Funkbox v1.2\nBy 7mb.\nThis is a hip hop mod. The drums. the loops, stabs and effects all have a very distinct hip hop sound. It may not be the prettiest mod around, but the sounds should be very useful for the beat lovers out there.\n\t\n\t\t\n\nMillennium\nBy Massen.\nMassen's new creation is a beautifully crafted mod with a high-tech look and a clean sound. With it's clever mix of synth samples and percussion sounds this mod is destined to become a classic.\n\t\n\t\t\n\nAntrop\nBy Fasch.\nThe Antrop is one more variation on the same theme as the Sonor and the X-anvers. House style sounds with an emphasis on synth bleeps and pad sounds.\n\t\n\t\t\n\nX-Anvers\nBy Fasch.\nA new weird-colored contribution from Mr. Fasch. The X-Anvers is, like it's cousin Sonor, a house-style mod with pads and synth bleeps that makes a a beautiful sound when treated with a little PCF.\n\t\n\t\t\n\nSonor\nBy Fasch.\nThe Sonor is a mod with a deep house sound. The samples range from synth stabs, assorted bleeps, vocals to a set of crisp drum sounds that should provide the necessities for any house track. Just what's the deal with the guys in hats?\n\t\n\t\t\n\nBadRat BRM 2.0\nBy BadRat.\nThe truly unique BadRat mod has a hand scribbled interface and a sample set made up from... rat sounds. Yes, it's true. A living, breathing rat is the source of the samples. Despite this fact, the drums sound, well... organic and really tight.\n\t\n\t\t\n\nminimod\nBy Peff.\nThe house producers toolbox! Peff's minimod has an excellent sample set that includes house organs, house basses, house pianos, stabs, bleeps and much more. The beautifully crafted GUI makes you think of a certain old synth brand...\n\t\n\t\t\n\nInfernalizer\nBy Jesuspark.\nHailed by many as The Most Beautiful Mod Ever, the Infernalizer really is a sight. The sounds should be suitable for any 'dark or loud style' according to Mr. Jesuspark, and indeed - Lots of sharp drums, synths and a church organ (!) should do the trick!\n\t\n\t\t\n\nAnokhaV2\nBy Sam Laleo Singh.\nWith it's sitar loops and tabla samples, the AnokhaV2 has a definite Indian vibe to it. Decorated with Indian deities this mod is great for the ethnic minded producer. Who can live without a 'tablatronic'?\n\t\n\t\t\n\nAluwerk\nBy Dr Bruno &amp; Syrusate.\nA true concept-mod. Looks metallic, sounds metallic, tastes metallic, eh... With it's metallic sound, the Aluwerk should really appeal to anyone into industrial sounds and noises.\n\t\n\t\t\n\n030 Microdot v100\nBy Chengming Chang.\nPsychedelic trance anyone? The Microdot comes packed with the necessities of the genre. The many long sweeping synth lines makes this the biggest Mod to date, but it's well worth the download. Listed to the demo song!\n\t\n\t\t\n\nPolyvibe\nBy Jonas H.\nWith it's jazzy sounds, this is one unique mod. Pianos, brass, jazzy drums - it's all here. The blend of 'blue note'-ish samples and the 303's are really refreshening. Can you say Acid Jazz? And hey - it looks good too!\n\t\n\t\t\n\nMacroserv\nBy Servovalve.\nIf you like the sound of short circuits, broken equipment and electrical overloads, then you'll love the Macroserv. It has loads of piercing electric sounds and sharp drums as featured in the really haunting demo track.\n\t\n\t\t\n\nElectrolyte\nBy Epilogue.\nBehind all the black and green is a mod packed with drums and synth samples. Some basses and pads as well as percussion sounds are all included. Oh yeah... there are loops too.\n\t\n\t\t\n\nibex mk II\nBy Jonas H.\nThe ibex mkII is a has a very varied set of sounds, ranging from the tribal sounds of a didgeridoo to assorted synth sounds as well as a full set of drums. All the sounds are cleverly listed in the 'Select Mod' menu.\n\t\n\t\t\n\nSoftBlue\nBy O.I.N.K\nThe SoftBlue may not be the prettiest mod you've seen, but it's definitely original. It comes full of sampled... harmonicas. Along with a set of acoustic style drums, it has ten different harmonica samples - both short stabs and melody lines. The definite blues mod.\n\t\n\t\t\n\nOmega\nBy Omega777\nThe Omega probably has the most futuristic interface yet. It looks like something you would bring on a very long space journey. The sounds are quite sci-fi too. Drum n' bass style drums with lots of synth samples and loops.\n\t\n\t\t\n\nIllumitech 2.0\nBy dj.k\nA very sleek black mod by dj.k, the Illumitech has a set of drums that should be good for hip-hop or experimental tracks or just about any track where you need lots of different bass drums. It also has a few synth and effect samples.\n\t\n\t\t\n\nOrion - System 2000\nBy Cavey\nThe Orion has a retro sci-fi look and a set of very good drum sounds, chopped-up loops and sub-bass making the Orion a very good mod for Drum 'n Bass style music.\n\t\n\t\t\n\nRegulator\nBy Cipher/Jordan\nThe much anticipated Regulator is finally here. This mod has superb graphics, a well sounding set of drums and intelligently chopped up loops. This is a definite Drum 'n' Bass mod!\n\t\n\t\t\n\nCircuit\nBy Epilogue\nThis mod has a green glowing electric look and features a bunch of industrial type bass and snares along with a couple of loops and sub bass effects.\n\t\n\t\t\n\nVoltage2\nBy Dr.Bruno\nThe Voltage Mod is a take on a more industrial ReBirth. Lots of distorted guitar and loud drums would make this the Mod of choice for producers into really hard music.\n\t\n\t\t\n\nBone Vibes\nBy Syrusate\nA black and dark mod with lots of rattling bones and skulls (check out the 808 drum selection knob). This one should suit all the industrial / darkwave aficionados out there. The sound is rather dark too with lots of synth samples.\n\t\n\t\t\n\nReBasX\nBy Fusion\nReBasX is a noisy mod with a trippy look, or &quot;Loud,Green,and a tad bit painful to the eyes!&quot; as stated by the mod maker himself. The mod has a blend of noisy drums and instrument samples. Lots of guitar!\n\t\n\t\t\n\nTechnoBox mkII\nBy Peff\nThis is a ReBirth 2 version of the old TechnoBox 1.5 mod, one of the first ReBirth mods. This Mod has a bunch of techno-style drums and some evil sub basses that will send your woofers begging for mercy. Watch your speakers!\n\t\n\t\t\n\nDark Star\nBy Dr. Bruno\nThe Dark Star has a brilliant set of treated acoustic drums from the dub side as, well as organ and guitar. The sounds are all very high quality with a very smart combination of samples.\n\t\n\t\t\n\nAXIOM_peace\nBy Peff\nMod veteran Peff has designed this good looking Mod. Good, sharp drum and percussion sounds and intelligent combinations of pad sounds make this Mod a very capable one. Well worth the hefty download.\n\t\n\t\t\n\nTrancer\nBy Cybernetique\nThis mod was designed to reproduce &quot;those classic trancy sounds of early 90s dance music&quot; as Cybernetique puts it himself. Deep bass, reverbed drums and chord samples makes this a very well sounding mod.\n\t\n\t\t\n\nReBirth illusion\nBy DJ LoOp\nReBirth illusion by DJ LoOp is an elegant mod featuring some real punchy kick drums and assorted bass, sub bass and synth sounds for huge pads and rumbling sub bass.\n\t\n\t\t\n\nBluesteel2\nBy Dr. Bruno\nBluesteel is back in its version 2 incarnation! It's a flexible mod if you trust the author, and why not? It comes with a varied selection of acoustic sounding drums mixed with some weird dÃƒÂ¼sseldorf style electronic noises.\n\t\n\t\t\n\nDJ LuVcHiLE's Manic Box\nBy DJ LuVcHiLE\nThe Manic box is a mean black thing with a bunch of phat percussion sounds that should appeal to the tribal minded producer.\n\t\n\t\t\n\niCE!\nBy Entropy/SiNGULARiTY\nAccording to the author: &quot;chilly and cheezy...&quot; Can't argue with that. Most of the orignal sounds left in, but some cool stuff added!\n\t\n\t\t\n\nRB-SEMx\nBy Joy!Peff\nOne of the best 'theme' mods out there, very original. Graphics have an Oberheim-ish design and the drumsounds are made with analog synths!\n\t\n\t\t\n\nPoison Box\nBy Poison\nGraphics may not look like much, but the sounds are really cool, innovative and fresh. Light and electronic, yet dirty and dry, somewhat in the Autechre neighborhood.\n\t\n\t\t\n\nLiquid Birth II\nBy Freeman\nGraphics are blue and bubbly, sounds are technoish. Lots and lots of snare drums and bass drums everywhere.\n\t\n\t\t\n\nModulus\nBy Tristan\nModulus is a combination of really good, clean drum samples and some really wacky FX sounds. Basically, the bread'n'butter drums are on the 909 and the FX sounds are on the 808. Several 'brass stab' samples included.","torrent":{"xt":"urn:btih:d09969da479e5ad18fb199396cf50ceb4e7add17","amp;dn":"Propellerheads+Rebirth+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d09969da479e5ad18fb199396cf50ceb4e7add17","infoHashBuffer":{"type":"Buffer","data":[208,153,105,218,71,158,90,209,143,177,153,57,108,245,12,235,78,122,221,23]},"announce":[],"urlList":[]}}