{"title":"Art Blakey &amp; The Jazz Messengers - Caravan (1962) [Jazz][mp3 320","uid":4735242,"size":126076861,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d099bb0e85beae36e6af6e96b6a64d68e275c242&amp;dn=Art+Blakey+%26+The+Jazz+Messengers+-+Caravan+%281962%29+%5BJazz%5D%5Bmp3+320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"schon55","files":15,"time":1235245780,"description":"Art Blakey &amp; The Jazz Messengers - Caravan\nOriginal Release Date: October 23, 1962 \nAudio CD: July 1, 1991 \nLabel: Ojc \nBitrate: 320 kbps\n\nA killer set from Art Blakey &amp; The Jazz Messengers -- not a Blue Note album, but probably one of their best from the time that isn't! The group at this point are a sextet -- a lineup that changed the way that Blakey grooved, with Freddie Hubbard on trumpet, Wayne Shorter on tenor, Curtis Fuller on trombone, and Cedar Walton on piano. Tracks are long and open, with a bouncing lyrical groove that's more soaring than some of the heavy-hitting earlier albums, but no less pleasing -- and possibly even a bit more soulful! Titles include 'Sweet N Sour', 'This Is For Albert', 'Skylark', and 'Thermo'.  Includes 2 bonus tracks -- alternate takes of 'Thermo' and 'Sweet N Sour'. \n\nReviewer:\nArt Blakey led many editions of his Jazz Messengers over more than three decades, but a strong argument can be made that the Messengers of his Riverside period constituted his strongest unit. With Freddie Hubbard, Wayne Shorter, and Curtis Fuller in the front line, with Cedar Walton and Reggie Workman as Blakey's rhythm-section mates, its combination of musicianship and sheer swinging force has rarely been equaled in a small band. \n\nCaravan was the first of Blakey's Riverside albums and endures as a living monument to his nonpareil drumming and leadership. His solo on the title tune is one of the finest recorded examples of Blakey's unique melding of precision and power.  Hubbard and Shorter contributed memorable compositions and, with Fuller and Walton, some of the greatest soloing of the 1960s.\n\n...This album was given to me as an assignment to study the form of the tunes and phrasing of solos.  My teacher has listened to my comments heard me play, and usually tries to recommend albums that open me up to something I can connect to.  This wasn't the first album I have studied by his assignment so I trusted his selection without reserve.  For example, he had passed me Crescent ( probably the best studio recording John Coltrane ever did ), Art Pepper meets the Rhythm Section ( Philly Joe Jones solos here are ones I...and maybe every other drummer has memorized ), and Somethin' Else ( Miles as a sideman...sort of ).\nCaravan has taken its place amongst the recordings I hold close to my soul.  'This is for Albert' alone is an incredible tune, and I have spent enough time to justify buying this album ten times over with only that song.  The tune is difficult to navigate and Art Blakey, like a master moves the song along with delicate rhyth-melodic phrasing. The sound attracted me. \nListening to Freddie Hubbard on the whole album he is so energetic, so nineteen years old!  And he interacts with the group so well.  Art Blakey was an incredible leader, putting such youth and experience together and coming out with a monumental recording. \n\nThermo is a premonition to the F Hubbard sound which has carved its own place in the history of jazz.  The title track is also a masterful accomplishment. Art Blakey is a hard drummer, but that is Art Blakey....you try it and make that musical, because he does. It isnt just showmanship, there is more there to recognize.  ~ 'pedigoan'\n\nPersonnel:\nArt Blakey, drums \nCurtis Fuller, trumpet \nFreddie Hubbard, trumpet \nWayne Shorter, tenor saxophone \nCedar Walton, piano \nReggie Workman, bass \n\nArt Blakey &amp; The Jazz Messengers - Caravan Tracks:\n01 Caravan  9:46 \n02 Sweet 'N' Sour [Take 4]  5:30  *\n03 Sweet 'N' Sour  5:30 \n04 In The Wee Small Hours Of The Morning  4:05 \n05 This Is For Albert  8:20 \n06 Skylark  4:50 \n07 Thermo [Take 2]  7:28  *\n08 Thermo  6:45","torrent":{"xt":"urn:btih:d099bb0e85beae36e6af6e96b6a64d68e275c242","amp;dn":"Art+Blakey+%26+The+Jazz+Messengers+-+Caravan+%281962%29+%5BJazz%5D%5Bmp3+320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d099bb0e85beae36e6af6e96b6a64d68e275c242","infoHashBuffer":{"type":"Buffer","data":[208,153,187,14,133,190,174,54,230,175,110,150,182,166,77,104,226,117,194,66]},"announce":[],"urlList":[]}}