{"title":"SoftwareNetz Calendar3 v3.50","uid":15870374,"size":15402309,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d0a84b14721cbbca66522e9ff97f73b2fe06e10a&amp;dn=SoftwareNetz+Calendar3+v3.50&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"LxByte","files":1,"time":1474418877,"description":"SoftwareNetz Calendar3 v3.50\r\n\r\nNo longer forget appointments and birthdays in the future!\r\n\r\n\r\nCalendar 3 for Windows reminds you in time of every appointment and every birthday. The Calendar is easy to use. You can enter an appointment with just one click.\r\n\r\nWith four different views you keep the overview, whether you want to plan your holiday, the next appointment at the hairdresser. Just switch between the daily-, weekly-, monthly- or yearly view. \r\n\r\nNew home screen\r\n\r\nThe home screen displays all appointments and tasks of the current day and the birthdays in the coming days. You can also pin colored notes onto the home screen.\r\n\r\n\r\nSeveral calendar views\r\n\r\nSwap with just a click of the mouse between several calendar views. Use the daily- or weekly calendar to plan appointments with exact times. Use the yearly- or monthly calendar e.g. to plan your holiday. The appointment list shows or prints all appointments within a certain period.\r\n\r\n\r\nIntegrated birthday calendar\r\n\r\nYou can create a birthday calendar with all the birthdays of your family, friend or colleagues. The birthday will be displayed in the calendar automatically and if you like, will remind you to buy a present in time.\r\n\r\n\r\nTasks and notes\r\n\r\nThings to be done (tasks) and short notes can be entered into the calendar. It will help you to keep your desk clean of paper memos.\r\n\r\n\r\nDirect access to customers &amp; contacts\r\n\r\nThe new Calendar 3 can take over the contact details (name, address, phone...) and birthdays from Addresses 3 or Invoice 4.\r\n\r\n\r\nNetwork\r\n\r\nYou can use the calender onto as many workplaces within a network as you like. All workstations have access to the same details. New appointments and changes will be displayed onto all workstations automatically. For every workstation you need one licence. \r\n\r\nOfficial Website: http://www.softwarenetz.com/terminkalender.php","torrent":{"xt":"urn:btih:d0a84b14721cbbca66522e9ff97f73b2fe06e10a","amp;dn":"SoftwareNetz+Calendar3+v3.50","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0a84b14721cbbca66522e9ff97f73b2fe06e10a","infoHashBuffer":{"type":"Buffer","data":[208,168,75,20,114,28,187,202,102,82,46,159,249,127,115,178,254,6,225,10]},"announce":[],"urlList":[]}}