{"title":"A History of Beer and Brewing - Hornsey, I [Non-Fiction] Mobi/Ep","uid":8868777,"size":177117333,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0d5501998e7dfa431ba0ae4e4fc7cc145a9aca4&amp;dn=A+History+of+Beer+and+Brewing+-+Hornsey%2C+I+%5BNon-Fiction%5D+Mobi%2FEp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"K-Slender","files":5,"time":1377997037,"description":"A History of Beer and Brewing provides a comprehensive account of the history of beer. Research carried out during the last quarter of the 20th century has permitted us to re-think the way in which some ancient civilizations went about their beer production. There have also been some highly innovative technical developments, many of which have led to the sophistication and efficiency of 21st century brewing methodology. A History of Beer and Brewing covers a time-span of around eight thousand years and in doing so:Â·Stimulates the reader to consider how, and why, the first fermented beverages might have originatedÂ·Establishes some of the parameters that encompass the diverse range of alcoholic beverages assigned the generic name 'beer'Â·Considers the possible means of dissemination of early brewing technologies from their Near Eastern originsThe book is aimed at a wide readership particularly beer enthusiasts. However the use of original quotations and references associated with them should enable the serious scholar to delve into this subject in even greater depth.","torrent":{"xt":"urn:btih:d0d5501998e7dfa431ba0ae4e4fc7cc145a9aca4","amp;dn":"A+History+of+Beer+and+Brewing+-+Hornsey%2C+I+%5BNon-Fiction%5D+Mobi%2FEp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d5501998e7dfa431ba0ae4e4fc7cc145a9aca4","infoHashBuffer":{"type":"Buffer","data":[208,213,80,25,152,231,223,164,49,186,10,228,228,252,124,193,69,169,172,164]},"announce":[],"urlList":[]}}