{"title":"Ways of seeing (Art Ebook).epub","uid":9174454,"size":10423340,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d104bd17323cd3eb9f585445827e83aac51e8fd8&amp;dn=Ways+of+seeing+%28Art+Ebook%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"STBGD","files":-1,"time":1384124171,"description":"John Berger - Ways of Seeing (Penguin Modern Classics)\nPenguin Classics; Reprint edition (25 Sep 2008) | ISBN:014103579X | English | Pages: 176 | EPUB | 9.94 Mb\n\nBased on the BBC television series, John Berger's Ways of Seeing is a unique look at the way we view art, published as part of the Penguin on Design series in Penguin Modern Classics.\n\n'Seeing comes before words. The child looks and recognizes before it can speak.'\n\n'But there is also another sense in which seeing comes before words. It is seeing which establishes our place in the surrounding world; we explain that world with words, but word can never undo the fact that we are surrounded by it. The relation between what we see and what we know is never settled.'\n\nJohn Berger's Ways of Seeing is one of the most stimulating and influential books on art in any language. First published in 1972, it was based on the BBC television series about which the Sunday Times critic commented: 'This is an eye-opener in more ways than one: by concentrating on how we look at paintings . . . he will almost certainly change the way you look at pictures.' By now he has.\n\nJohn Berger (b. 1926) is an art critic, painter and novelist.born in Hackney, London.\n\nHis novel G. (1972) won both the James Tait Black Memorial Prize and the Booker Prize.\n\nIf you enjoyed Ways of Seeing, you might like Susan Sontag's On Photography, also available in Penguin Modern Classics.\n\n'Berger has the ability to cut right through the mystification of professional art critics ... he is a liberator of images: and once we have allowed the paintings to work on us directly, we are in a much better position to make a meaningful evaluation'\n\nPeter Fuller, Arts Review\n\n'The influence of the series and the book ... was enormous ... It opened up for general attention areas of cultural study that are now commonplace'\n\nGeoff Dyer in Ways of Telling\n\n'One of the most influential intellectuals of our time'\n\nObserver","torrent":{"xt":"urn:btih:d104bd17323cd3eb9f585445827e83aac51e8fd8","amp;dn":"Ways+of+seeing+%28Art+Ebook%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d104bd17323cd3eb9f585445827e83aac51e8fd8","infoHashBuffer":{"type":"Buffer","data":[209,4,189,23,50,60,211,235,159,88,84,69,130,126,131,170,197,30,143,216]},"announce":[],"urlList":[]}}