{"title":"Applications of Data Mining in E-Business and Finance","uid":4731223,"size":4783798,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d12c64e779ec13359fd615d58d806c5e10f21cad&amp;dn=Applications+of+Data+Mining+in+E-Business+and+Finance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"VasiaZozulia","files":1,"time":1235038619,"description":"The application of Data Mining (DM) technologies has shown an explosive growth in an increasing number of different areas of business, government and science. Two of the most important business areas are finance, in particular in banks and insurance companies, and e-business, such as web portals, e-commerce and ad management services.In spite of the close relationship between research and practice in Data Mining, it is not easy to find information on some of the most important issues involved in real world application of DM technology, from business and data understanding to evaluation and deployment. Papers often describe research that was developed without taking into account constraints imposed by the motivating application. When these issues are taken into account, they are frequently not discussed in detail because the paper must focus on the method. Therefore knowledge that could be useful for those who would like to apply the same approach on a related problem is not shared. The papers in this book address some of these issues. This book is of interest not only to Data Mining researchers and practitioners, but also to students who wish to have an idea of the practical issues involved in Data Mining.","torrent":{"xt":"urn:btih:d12c64e779ec13359fd615d58d806c5e10f21cad","amp;dn":"Applications+of+Data+Mining+in+E-Business+and+Finance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d12c64e779ec13359fd615d58d806c5e10f21cad","infoHashBuffer":{"type":"Buffer","data":[209,44,100,231,121,236,19,53,159,214,21,213,141,128,108,94,16,242,28,173]},"announce":[],"urlList":[]}}