{"title":"Superhumanoids - Exhibitionists (2013) [FLAC]","uid":8802887,"size":232143864,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d15f5fba2e421fffc96d1e1e601b3b9e541d8bf3&amp;dn=Superhumanoids+-+Exhibitionists+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1376252406,"description":"\n  Superhumanoids - Exhibitionists (2013) [FLAC]\n\n  Genre: Pop/Rock, Electronic\n  Styles: Alternative, Indie Electronic, New Wave, Post-Punk\n  Source: CD (log)\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Black Widow\n  02 Geri\n  03 Canteen\n  04 So Strange\n  05 Too Young for Love\n  06 A Gjost\n  07 Free State\n  08 Bad Weather\n  09 See It All\n  10 Do You Feel That?\n  \n  The L.A. trio Superhumanoids has a serious love of the synthesizer-heavy pop of the '80s, a serious fondness for modern electronic R&amp;B, and the skill to blend the two together into something that sounds good and packs a pretty deep emotional punch in the process. Cameron Parkins, Sarah Chernoff, and Max St. John switch off instruments, share vocal duties, and write the songs together, creating a warm and enveloping version of synth pop that's soft around the edges and has that highly sought-after John Hughes nostalgic feeling. Sure, lots of bands have tried for that same sound, but most of them, like M83, try to recapture the triumphant moment or the crushing heartbreak inherent in his films. Some, like M83, do a magnificent job. On their debut album, Exhibitionists, Superhumanoids soundtrack the quiet moments of introspection that might get lost in the shuffle, pushed aside by memory and time in favor of the big events and feelings. \n\n  The songs capture resignation (&quot;Canteen&quot;) and aching melancholy (&quot;Bad Weather&quot;), sound like songs you'd sing to yourself when you feel lost (&quot;Black Widow&quot;), and sink into your consciousness slowly (&quot;Too Young for Love&quot;) and quietly (&quot;Free State&quot;). Even though they aren't big songs, they are memorable and sound true. There aren't any obvious singles on the record, but instead it's made up of the kind of songs you might hear in passing, say, in a scene in a movie, and instantly feel like you want to hear more. Throughout the record the trio's mix of live instruments and synths is perfectly balanced, the vocals have some real depth (especially in Chernoff's case), and a couple songs do actually break out of their self-imposed restraints and aim for something larger. When it happens, as on &quot;A Gjost&quot; or the bouncy &quot;So Strange&quot; (which features Chernoff's most powerful vocals), the band still sounds great. They sound better when they play it small and burrow deeply into the behind-the-scenes moments that really matter, though. It's odd that they named the album Exhibitionists; a more apt title might have been Introspectionists. Either way, it's an impressive debut from a very promising group.","torrent":{"xt":"urn:btih:d15f5fba2e421fffc96d1e1e601b3b9e541d8bf3","amp;dn":"Superhumanoids+-+Exhibitionists+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d15f5fba2e421fffc96d1e1e601b3b9e541d8bf3","infoHashBuffer":{"type":"Buffer","data":[209,95,95,186,46,66,31,255,201,109,30,30,96,27,59,158,84,29,139,243]},"announce":[],"urlList":[]}}