{"title":"Crashlands","uid":13271076,"size":164979160,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d163e63409a2dc90525d36ee56ee68adb8b3642a&amp;dn=Crashlands&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"dauphong","files":1,"time":1453401003,"description":"About This Game\r\nCraft, battle, and quest your way through Crashlands, a story-driven Crafting ARPG overflowing with sass!\r\n\r\nBecome Flux Dabes, a galactic trucker whose latest shipment gets derailed by a chin-strapped alien menace named Hewgodooko, leaving you stranded on an alien planet. As you hustle to retrieve your packages you’ll become enmeshed in a nefarious plot of world domination, which will require all of your wits and both of your glutes to overcome. Learn recipes from the local sentient life, make new friends, uncover ancient secrets and deadly bosses, tame everything and build yourself a home-away-from-home as you learn to thrive on planet Woanope.\r\nKey Features\r\nExpansive Crafting System\r\nUnlock over 500 craftable items as you explore the world and learn its secrets!\r\n\r\nSelf-managing, Infinite Inventory\r\nIn Crashlands, your inventory is infinite, manages itself, and retrieves your tools when you need them, so you can focus on adventuring, questing, and building. You'll never have dig through your bag or return to your base to free up inventory space!\r\n\r\nRPG-Style Character Progression\r\nBecome more powerful through creating ever-more-amazing items! As you grow in power, you can venture to new regions of the world, meet strange characters, discover new stories, and encounter new and interesting enemies.\r\n\r\nSkill-Based Combat\r\nLearn the attacks of the enemies you encounter, and use your skill, agility, and wits to defeat them! You can even augment your fighting prowess with the power of the dozens of gadgets you can craft. Set your enemies on fire, stun them, slow down time, and more!\r\n\r\nIntuitive Base Building\r\nBuilding a base in Crashlands is so simple it feels like fingerpainting. You can create beautiful, sprawling bases in minutes!\r\n\r\nTameable Creatures\r\nEvery creature in Crashlands can become a trusty combat sidekick. Find an egg, incubate it, and hatch your very own adorable or hideous bundle of joy. You can even craft special items to grow and empower them!\r\n\r\nHuge World... with Huge Problems\r\nFour sentient races, three continents, an epic bid for the future of the planet, and you - trapped in the middle, trying to deliver your freakin' packages. Take your time to dive into the sidestories of the characters you meet or just rush headlong into making that special delivery. With hundreds upon hundreds of quests, there's a lot to do and discover on planet Woanope!\r\n\r\nCrossplatforminess\r\nDon't want the fun to stop? Crashlands is also available on mobile - the exact same game, with your cloud-synced progress - so you never have to stop!","torrent":{"xt":"urn:btih:d163e63409a2dc90525d36ee56ee68adb8b3642a","amp;dn":"Crashlands","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d163e63409a2dc90525d36ee56ee68adb8b3642a","infoHashBuffer":{"type":"Buffer","data":[209,99,230,52,9,162,220,144,82,93,54,238,86,238,104,173,184,179,100,42]},"announce":[],"urlList":[]}}