{"title":"Badshahi.Angti-DVD.rip-BENGALI-HEVC-x265.aac-1CD-[DDR]","uid":11815220,"size":729771356,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d19c01456095502001a8c8f6c3601353760e8413&amp;dn=Badshahi.Angti-DVD.rip-BENGALI-HEVC-x265.aac-1CD-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"SaM","files":1,"time":1429056449,"description":"\nSynopsis:\nFeluda (Abir Chatterjee) and Topshe (Sourav Das) have gone to Lucknow for a holiday and are staying with Mr. Sanyal (Biswajit Chatterjee) a friend of Topshe's father (Dipankar De). While they are there, they meet Dr. Srivastav (Bharat Kaul) who tells them about a valuable ring that was gifted to him by a grateful patient. Dr. Srivastav fears that the ring would be stolen and gives it to Mr. Sanyal for safekeeping. Next day they go to meet Bonobihari Sarkar (Paran Bandyopadhyay) who keeps a private zoo. When they come back, the emperor's ring is missing. Who has stolen the ring and can Feluda recover it?\n\nComments:\nStrictly speaking this is not the first Feluda story, but it is certainly the one that made him a household name in Bengal. Since it is an early Feluda we have a new combination of Abir Chatterjee and Sourav Das. Abir Chatterjee now has the distinction of portraying both Feluda and Byomkesh, the two beloved detectives in Bengali fiction and he excels in both roles. In this film, he has the right combination of cockiness and gauchiness to bring the Feluda I know to life. Sourav too looks his age. If there is one character who does not fit his role it is Paran Bandyopadhyay as the villainous Bonobihari Sarkar. It is not only a stretch of imagination to imagine him as an animal trainer, but he is neither as menacing or as subtle as the fictional character. Sandip Ray more or less sticks to the story, except at the end, where Feluda heroically saves Topshe from the rattlesnake. In the original story it was Mahabir who did that.\n\nFor a change I did not like the camera work of Shirsha Ray and that is a strange thing, but if you look carefully, you will find umpteen example of careless filming. In one scene there is a water drop on the camera lens that shouldn't have been there. In another as Feluda sits in a car, you can see a glass pane in between. Very unexpected for Ray is one of Bengal's finest camera wielders. Editing is slick and the story keeps its pace throughout.\n\nThese minor grouses notwithstanding, this is one of the better Feluda stories on film. I enjoyed this film and the gentle touch of the Director and i'm sure you will too.\n\n\nUploader's Notes:\nRijVnet will be uploading the x264 versions and I will give you the HEVC rips of this video. The hallmark of our rips is the color correction that we have achieved. The original video had a garish yellow tint which has been completely removed. In my rip, you may find the characters looking a little too fair (or a bit pinkish) though! Making them er was hiding some detail and I thought the compromise was acceptable. That aside you can see the way we have been able to enhance fine detail.\n\nI will be putting up a 720p HEVC next..\n\nBe aware though that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC or Media Player Classic or SMPlayer. Earlier versions may not work\n\nIMDB Link: &lt;a href=&quot;\nhttp://www.imdb.com/title/tt3447364&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt3447364&lt;/a&gt;\n\n\n &lt;a href=&quot;\nhttp://extraimago.com/image/wI8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wI8&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wQT&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wQT&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wQ2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wQ2&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wQw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wQw&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wQa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wQa&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wQ8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wQ8&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wLf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wLf&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wLW&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wLW&lt;/a&gt; &lt;a href=&quot;\nhttp://extraimago.com/image/wLA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://extraimago.com/image/wLA&lt;/a&gt;","torrent":{"xt":"urn:btih:d19c01456095502001a8c8f6c3601353760e8413","amp;dn":"Badshahi.Angti-DVD.rip-BENGALI-HEVC-x265.aac-1CD-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d19c01456095502001a8c8f6c3601353760e8413","infoHashBuffer":{"type":"Buffer","data":[209,156,1,69,96,149,80,32,1,168,200,246,195,96,19,83,118,14,132,19]},"announce":[],"urlList":[]}}