{"title":"Jamiroquai.Discografia .","uid":4542823,"size":532688564,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d29b445f17716f0b159a3a3041a3855bbd4803de&amp;dn=Jamiroquai.Discografia+.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"cholo24","files":90,"time":1228008702,"description":"Jamiroquai\n\nLa banda llamada Jamiroquai se formÃƒÂ³ en Londres en 1992, gracias a Jason Kay (JK). Su estilo musical era innovador y rancio al mismo tiempo, por lo que rompiÃƒÂ³ con todo lo anterior desde el momento en que saliÃƒÂ³ a la luz. Sus canciones mezclaban estilos como el funk y el soul y que suponÃƒÂ­an una vuelta a las raÃƒÂ­ces de la mÃƒÂºsica que se hacÃƒÂ­a en los 70.\nJason Kay cantante de Jamiroquai, estuvo influenciado por la mÃƒÂºsica desde muy chico ya que su madre Karen Kay fue una cantante de Jazz, desde muy chico escribiÃƒÂ³ canciones, con el pasar del tiempo formo su grupo Jamiroquai con un estilo de mÃƒÂºsica basado en la fusiÃƒÂ³n de Jazz-Disco-Funk-Disco. (Aunque no se puede definir muy bien el estilo de mÃƒÂºsica, ya que es muy variado). Hicieron un contrato millonario con Sony Music por 8 discos.\nEl nombre de Jamiroquai viene de los indios nativos americanos &quot;iroquois&quot; (veneraciÃƒÂ³n a la tierra). A ese nombre le unieron &quot;Jam&quot; (concierto). Por eso para Jason Kay, lÃƒÂ­der y cantante del grupo, Jamiroquai es el nombre de un sentimiento que nos recuerda constantemente de donde venimos.\nEn 1992 editaron su primer single When You Gonna Learn, del disco &amp;#039;Emergency On Planet Earth&amp;#039;, que inmediatamente entrÃƒÂ³ en los Top 10 UK, luego de este mismo ÃƒÂ¡lbum surgieron Grandes ÃƒÂ©xitos como Blow Your Mind, Emergency On Planet Earth y Too Young To Die. En 1995 Jamiroquai editaron su segundo disco &amp;#039;Retaund Of The Space Cowboy&amp;#039;, un disco que segÃƒÂºn los expertos es mejor que su primer disco y en el que resalto Jamiroquai todo el potencial, llego enseguida a los primeros puestos y tubo gran aceptaciÃƒÂ³n por el publico, creando grandes ÃƒÂ©xitos como Space Cowboy, Light Years, Mr Moon y otros.\nEn 1996 publicaron &amp;#039;Travelling Without Moving&amp;#039;, disco que Jay dudÃƒÂ³ en realizar, ya que el primer disco trataba de la Naturaleza. Finalmente decidiÃƒÂ³ hacerlo sobre una de sus mÃƒÂ¡s grandes pasiones, los coches y naciÃƒÂ³ Travelling Without Moving, su tercer disco, un trabajo mucho mÃƒÂ¡s dinÃƒÂ¡mico que los anteriores, que segÃƒÂºn los expertos es un trabajo mucho mÃƒÂ¡s maduro que los anteriores y que fue aceptado mundialmente por su publico, llego a los primeros puestos en todo el mundo y tuvo rÃƒÂ©cords de ventas. En este ÃƒÂ¡lbum encontramos grandes ÃƒÂ©xitos, Virtual Insanity, Comic Girl y Alright, como en todos sus ÃƒÂ¡lbumes tuvieron grandes canciones que no llegaron a ser Hits pero que para algunos tendrÃƒÂ­an que a verlo sido es el caso en este disco de High Times y Travelling Without Moving.\nEn 1997 Jamiroquai ganÃƒÂ³ su primer Grammy y en 1998 colabora en la banda sonora de la pelÃƒÂ­cula Godzilla, con cuyo tema llegÃƒÂ³ a los primeros puestos en las listas.\nEn 1999 Jamiroquai edita &amp;#039;Synkronized&amp;#039; e, inmediatamente, &amp;#039;Canned Heat&amp;#039;, su primer single, llegÃƒÂ³ a los primeros puestos y demostrÃƒÂ³ que la separaciÃƒÂ³n de Stuart, no hizo que Jamiroquai perdiera su potencial, y se podrÃƒÂ­a decir que es un disco en el que Jay en sus letras deja salir su enojo. TambiÃƒÂ©n de este ÃƒÂ¡lbum salieron grandes ÃƒÂ©xitos como Supersonic y King for a Day.\n","torrent":{"xt":"urn:btih:d29b445f17716f0b159a3a3041a3855bbd4803de","amp;dn":"Jamiroquai.Discografia+.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29b445f17716f0b159a3a3041a3855bbd4803de","infoHashBuffer":{"type":"Buffer","data":[210,155,68,95,23,113,111,11,21,154,58,48,65,163,133,91,189,72,3,222]},"announce":[],"urlList":[]}}