{"title":"Chickenfoot - Chickenfoot [CD 2009] [All Cov+CD] [Bubanee]","uid":4974527,"size":115733904,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2b7cb2a8063e012d7f8513036fe75654142cd99&amp;dn=Chickenfoot+-+Chickenfoot+%5BCD+2009%5D+%5BAll+Cov%2BCD%5D+%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bubanee","files":16,"time":1245938940,"description":"Recorded in 256Kbps MP3\nIncludes All Covers and CD\nPlease SEED For Others To Enjoy!\nCheers, Bubanee\n\n1. Avenida Revolution\t\t\n\t\n2. Soap On A Rope\t\t\n\t\n3. Sexy Little Thing\t\t\n\t\n4. Oh Yeah\t\t\n\t\n5. Runnin' Out\t\n\t\n6. Get It Up\t\t\n\t\n7. Down The Drain\t\t\n\t\n8. My Kinda Girl\t\n\t\n9. Learning To Fall\t\t\n\t\n10. Turning Left\t\n\t\n11. Future In The Past\n\nChickenfoot first performed together in February 2008 at a Sammy Hagar concert in Las Vegas. They had a three song set which included Led Zeppelin's &quot;Rock And Roll&quot; and Traffic's &quot;Dear Mr. Fantasy&quot;. From the performance it appeared that Chad Smith (drummer) was the 'glue' that holds the band together: &quot;The material is really slamming, and anybody who has ever been around Chad knows that he is a very huge personality, a very high-energy guy and his drumming in person is explosive,&quot; Satriani says. &quot;This band really gives him carte blanche to go crazy. I think it's the best of what you'd expect, that's the best way to put it. No one is acting out of character.&quot;\n\nChickenfoot performed during Conan O'Brien's first week as host of the Tonight Show, June 5th, 2009, playing their single, Oh Yeah!. This is the same date as their first album release. Chickenfoot began their tour in Europe shortly afterwards, as they plan to come back to North America, August 2nd, to finish their tour, starting with the Canadian Forces Halifax Rock Fest.\n\n Music style\n\n&quot;The style is high-energy rock 'n' roll ... We all bring to the table some unusual influences and then we also share a lot of roots. And I think that's where a true color of a band comes out, just how we react to each other. So, it's definitely rock music. We haven't brought each other together to do a techno record... We'll draw from funk, blues and experimental. We know what we want to get out of it. We want passages in songs that develop and we want everyone's personality to be able to come out. So, it's going to be expansive but it's going to be rough.&quot; says Joe Satriani, guitarist. Sammy Hagar has reportedly said that Chickenfoot could 'rival Led Zeppelin'. He said &quot;When people hear the music, it's Led Zeppelin, I know that's a bold statement, but it's as good as that.&quot; Hagar later retracted these statements to some degree, claiming he was intoxicated at the time. He has also stated a comparison to Van Halen, the band of which he used to front as a vocalist. He said &quot;It's ten times Van Halen, because it's functional - we all like each other.&quot;","torrent":{"xt":"urn:btih:d2b7cb2a8063e012d7f8513036fe75654142cd99","amp;dn":"Chickenfoot+-+Chickenfoot+%5BCD+2009%5D+%5BAll+Cov%2BCD%5D+%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2b7cb2a8063e012d7f8513036fe75654142cd99","infoHashBuffer":{"type":"Buffer","data":[210,183,203,42,128,99,224,18,215,248,81,48,54,254,117,101,65,66,205,153]},"announce":[],"urlList":[]}}