{"title":"God's Armies Crusade and Jihad, Origins, History, Aftermath","uid":16035418,"size":6898407,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2b8f4ef2bc609c9ae675cf08b1369e98398c0d5&amp;dn=God%27s+Armies+Crusade+and+Jihad%2C+Origins%2C+History%2C+Aftermath&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"marty14","files":1,"time":1476475077,"description":"God's Armies: Crusade and Jihad: Origins, History, Aftermath - Malcolm Lambert [epub]\r\n\r\nWith ramifications on geopolitics today, a vivid chronicle of the Christian and Islamic struggle to control the sacred places of Palestine and the Middle East between the seventh and thirteenth centuries. Crusade and jihad are often reckoned to have represented two sides of the same coin: each resonated on the opposing sides in the holy wars of the Middle Ages and each has been invoked during the war on terror.\r\n\r\nA chronicle of the Christian and Islamic struggle to control the sacred places of Palestine and the Middle East between the seventh and thirteenth centuries, this dynamic new history demonstrates that this simple opposition ignores crucial differences. Placing an equal emphasis on the inner histories of Christianity and Islam, the book traces the origins and development of crusade and jihad, showing for example that jihad reflected internal tensions in Islam from its beginnings. The narrative also reveals the ways in which crusade and jihad were used to disguise ambitions for power and to justify atrocity and yet also inspired acts of great chivalry and heroic achievement. The story brims with larger than life characters, among them Richard the Lionheart, Nur al-Din, Saladin, Baybars, and Ghengiz Khan.\r\n\r\nLambert concludes by considers the long after-effects of jihad and crusade, including the role of the latter in French imperialism and of the former in the wars now afflicting the Middle East and parts of Africa. This vivid, balanced account will interest all readers who wish to understand the complexities of the medieval world and how it relates our own","torrent":{"xt":"urn:btih:d2b8f4ef2bc609c9ae675cf08b1369e98398c0d5","amp;dn":"God%27s+Armies+Crusade+and+Jihad%2C+Origins%2C+History%2C+Aftermath","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2b8f4ef2bc609c9ae675cf08b1369e98398c0d5","infoHashBuffer":{"type":"Buffer","data":[210,184,244,239,43,198,9,201,174,103,92,240,139,19,105,233,131,152,192,213]},"announce":[],"urlList":[]}}