{"title":"Dogfight - Fred Vogelstein - Audible Audiobook MP3 CBR 64k","uid":10158983,"size":235062525,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d32c866a50df8e4604d27c82305eaa823cc81a50&amp;dn=Dogfight+-+Fred+Vogelstein+-+Audible+Audiobook+MP3+CBR+64k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1400214119,"description":"MP3 CBR 64k Joint Stereo.\nThis will work best with dedicated audiobook reader apps.\n\n\nDogfight: How Apple and Google Went to War and Started a Revolution\n\nWritten by: Fred Vogelstein\nNarrated by: J. P. Demont\nLength: 8 hrs and 13 mins \nFormat: Unabridged\nRelease Date:11-13-13\nProgram Type: Audiobook\n\nThe rise of smartphones and tablets has altered the business of making computers. At the center of this change are Apple and Google, two companies whose philosophies, leaders, and commercial acumen have steamrolled the competition. In the age of Android and the iPad, these corporations are locked in a feud that will play out not just in the marketplace but in the courts and on screens around the world.\n\nFred Vogelstein has reported on this rivalry for more than a decade and has rare access to its major players. In Dogfight, he takes us into the offices and board rooms where company dogma translates into ruthless business; behind outsize personalities like Steve Jobs, Apple's now lionized CEO, and Eric Schmidt, Google's executive chairman; and inside the deals, lawsuits, and allegations that mold the way we communicate. Apple and Google are poaching each other's employees. They bid up the price of each other's acquisitions for spite, and they forge alliances with major players like Facebook and Microsoft in pursuit of market dominance. ","torrent":{"xt":"urn:btih:d32c866a50df8e4604d27c82305eaa823cc81a50","amp;dn":"Dogfight+-+Fred+Vogelstein+-+Audible+Audiobook+MP3+CBR+64k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d32c866a50df8e4604d27c82305eaa823cc81a50","infoHashBuffer":{"type":"Buffer","data":[211,44,134,106,80,223,142,70,4,210,124,130,48,94,170,130,60,200,26,80]},"announce":[],"urlList":[]}}