{"title":"Theta Meditation (7.5Hz) Binaural Beats and Isochronic Tones - 1","uid":8581093,"size":1036846713,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:d394290bdb6513c04e449b2bce6a879a9211c164&amp;dn=Theta+Meditation+%287.5Hz%29+Binaural+Beats+and+Isochronic+Tones+-+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"dastaten","files":19,"time":1371415824,"description":"These are 7.5Hz isochronic tones, enhanced isochronic tones, and binaural beats that can be used to aid in meditation. They are forms of brainwave entrainment, the process of syncing one's brainwaves with an external beat or tone due to a natural phenomenon with the human brain called 'frequency following response.' Entrainment can induce a variety of states of consciousness, thereby facilitating meditation, relaxation, healing, creative thought, sleep, lucid dreaming, stress and anxiety reduction, and more. You can learn more about binaural beats here: http://en.wikipedia.org/wiki/Binaural_beats and isochronic tones here: http://en.wikipedia.org/wiki/Isochronic_tones.\n\nEach of the sessions included in this package includes an enhanced isochronic tone version (denoted by the 'Enh' in the file names). Enhanced isochronic tones use 'pitch panning,' an effect that makes the tone appear 'fuller,' almost as if it were surrounding you. Headphones are necessary to listen to binaural beats and enhanced isochronic tones, otherwise the effect is lost and the tones appear lopsided. Regular isochronic tones can be listened to with headphones or any kind of speakers.\n\nI personally created these tracks using professional grade software for creating binaural beats and isochronic tones. Your comments are greatly appreciated as I plan to make more of these for other uses (relaxation, stress reduction, etc.) and your feedback will help me to make them the best they can be.\n\nI hope you enjoy the beats and tones. Please feel free to share them with anyone you think may benefit from them. =)","torrent":{"xt":"urn:btih:d394290bdb6513c04e449b2bce6a879a9211c164","amp;dn":"Theta+Meditation+%287.5Hz%29+Binaural+Beats+and+Isochronic+Tones+-+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d394290bdb6513c04e449b2bce6a879a9211c164","infoHashBuffer":{"type":"Buffer","data":[211,148,41,11,219,101,19,192,78,68,155,43,206,106,135,154,146,17,193,100]},"announce":[],"urlList":[]}}