{"title":"Trapped_Dead_Lockdown-FLT","uid":11772314,"size":2774046029,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3fa0bfa42d2c57c95d63515cbf47c9c2e55e8e7&amp;dn=Trapped_Dead_Lockdown-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"vickey1992","files":3,"time":1427119035,"description":"System Requirements\nCPU:\t2 GHz\nRAM:\t1GB RAM\nVGA:\tDirect X 9.0c compatible with shader model 3.0 (onboard chipsets are not supported)\nDX:\tDirect X 9.0c\nOS:\tMicrosoftÂ® Windows XPÂ®SP3,VistaÂ®, 7\nHDD:\t1,2 GB\nODD:\t4x DVD-ROM drive\nNetwork:\tInternet connection required for product activation\n\n\nDescription\nIn Their 28th Year Of Glory, FairLight Released #1090\n\nTrapped Dead: Lockdown (c) Headup Games: Supplied by: FAIRLIGHT: Release Date: 20/03/2015: Cracked by: FAIRLIGHT Game Type: Action, RPG\nPackaged by: FAIRLIGHT Image Format: ISO\nDISCS: 1 Protection: Steam\n\nSystem Requirements: Nobody knows!\n\nGame information:\n\nA small American town is overrun by the living dead! You manage to enter\nthe town just before the military locks it down and now you must slice and\nshoot your way through thousands of zombies in order complete your mission\nin this action-packed Hack &amp; Slash RPG\n\nIn Trapped Dead: Lockdown, you fight your way through an interactive\nhorror story as one of five different characters: The marine, the butcher\nthe assassin, the marshal and the exorcist. Every class comes with their\nown custom storyline, as well as individual strengths and abilities - the\nassassin is an expert in firearms, the butcher slaughters his enemies in\nmelee combat and the exorcist fries zombies with his spiritual abilities\nEach of the characters features his own individual skill tree, where you\ncan unlock new defensive abilities and attacking moves to aid you in\ncombat\n\nIn Trapped Dead: Lockdown, you'll have to choose between wielding two\nweapons at the same time or equipping one powerful two-handed one. The\nhuge number of weapons keeps the gameplay interesting by letting you\nexperiment with new combinations all the time: Would you like to send a\nconcussion shot with the pistol first, then grab your hammer for a double\nblow, or rely on the mystical powers of the magic cross to set the zombies\non fire? Clubs, axes, knives, revolvers, tasers, rifles, shotguns, bows\ngrenades, spell books, etc. There are hundreds of different weapons with\nwhich to kill the living dead - you can even use vehicles to run them\nover!\n\nWhile discovering the huge game world, you'll encounter many different\ntypes of rotting enemies and menacing boss monsters whose different\nstrategies and abilities will require you to think fast and hit hard if\nyou want to live. The monsters thirst for blood and move in quickly from\nall sides, so make sure not to be surrounded! Friendly NPCs may ask you\nfor help or fight alongside you, but in the end, there's only one rule in\nthis world: kill or be killed! Lucky for you, the multiplayer mode enables\nyou to fight the hordes together with up to 4 friends!\n\nFeatures:\n\n* Zombie-Action in a rich horror atmosphere\n* Five different classes with individual storylines\n* Complex Skill tree to level up your abilities and attributes\nmakes for an individual RPG experience\n* Hundreds of weapons and items\n* Diverse enemies and boss monsters\n* Co-op-multiplayer for up to four players\n* Dialogue spoken by professional voice actors and fully subtitled\n\nInstallation Information:\n\n* Burn or mount\n* Install\n* Play the game\n\nNOTE: As usual, block the game exe in your firewall","torrent":{"xt":"urn:btih:d3fa0bfa42d2c57c95d63515cbf47c9c2e55e8e7","amp;dn":"Trapped_Dead_Lockdown-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3fa0bfa42d2c57c95d63515cbf47c9c2e55e8e7","infoHashBuffer":{"type":"Buffer","data":[211,250,11,250,66,210,197,124,149,214,53,21,203,244,124,156,46,85,232,231]},"announce":[],"urlList":[]}}