{"title":"Stephen Moss - The Fear Saga","uid":13478006,"size":1395360469,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d456b84b7b327e391314c11785ffaba3b3af4528&amp;dn=Stephen+Moss+-+The+Fear+Saga&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Cybotage","files":149,"time":1455029021,"description":"The Complete Trilogy\r\n\r\n\r\nFear the Sky: The Fear Saga, Book 1\r\n\r\nPublisher's Summary\r\n\r\n&quot;Real science in Science Fiction. This is a must read for fans of SF.&quot;\r\n—John S. Gertsch, Amazon Reviewer\r\n\r\nPerfect for fans of Peter F. Hamilton, Iain M. Banks, and Orson Scott Card, Fear the Sky is a hard-hitting sci-fi thriller that will have you looking at the stars in a different way.\r\n\r\nIn eleven years time, a million members of an alien race will arrive at Earth. Years before they enter orbit, their approach will be announced by the flare of a thousand flames in the sky, their ships' huge engines burning hard to slow them from the vast speeds needed to cross interstellar space. These foreboding lights will shine in our night sky like new stars, getting ever brighter until they outshine even the sun, casting ominous shadows and banishing the night until they suddenly blink out. Their technology is vastly superior to ours, and they know they cannot possibly lose the coming conflict. But they, like us, have found no answer to the destructive force of the atom, and they have no intention of facing the onslaught of our primitive nuclear arsenal, or the devastation it would wreak on the planet they crave. So they have flung out an advanced party in front of them, hidden within one of the countless asteroids randomly roaming the void. They do not want us, they want our planet. Their Agents are arriving.\r\n\r\n\r\n\r\nFear the Survivors: The Fear Saga, Book 2\r\n\r\n\r\nPublisher's Summary\r\n\r\nThe Earth lies shaken in the aftermath of a conspiracy. Some of the smartest minds on the planet have striven for and died in an effort to scour the skies of four vast alien satellites, but their success has brought a terrible vengeance down upon us.\r\n\r\nWhile alien agents stalk the Earth, a team of exhausted scientists and military outcasts struggle to fight them among a planet on the brink - the brink of plague, the brink of war, and the brink of an invasion larger than they can possibly imagine. But they have allies. Two of the alien agents have forsaken their homes, their families, and their very species to stop the greatest act of genocide any of them has ever known. They carry with them the knowledge we need to save humanity and take us into a new and marvelous age.\r\n\r\nBut Lana and the remaining enemy agents are far from defeated. As they begin to reap havoc among the diseased and bereft, Neal, Ayala, and Barrett must find a way to achieve the impossible - by fair means or foul, they must unite the world's disparate nations. And they must do so quickly, for the Armada is fast approaching, and behind the great fires of their decelerating engines, the huge fleet is readying itself for war.\r\n\r\n\r\n\r\nFear the Future: The Fear Saga, Book 3\r\n\r\nPublisher's Summary\r\n\r\nA predator hunts the skies over Earth. Its intent is peaceful, and its mission is essential, but it is the deadliest machine humanity has ever created.\r\n\r\nPiloted by a six-year-old girl, the godlike Skalm guards the Districts of TASC. Her family is long dead. Her adopted father is a synthetic copy of an alien, her nanny an artificial mind connected via subspace to every part of the globe, feeding the young girl information, finding prey to satiate her growing thirst.\r\n\r\nBut the young girl is an innocent, a victim, one of millions the war has already claimed. Her innocence has been sacrificed by a man with singular purpose: a man who will stop at nothing in order to prepare Earth for the coming conflict.\r\n\r\nThe armada is approaching, its far-off engines now bright as stars in the night sky. They mean to kill us. They have the power to do so. And as oblivion's maw opens up to engulf us, we brace ourselves for battle.\r\n\r\nWe will fight to the last. Live or die, we will leave a scar upon our attackers that will last an age, even if we ourselves do not.\r\n\r\n\r\n\r\n\r\nRead by R. C. Bray\r\nFormat: MP3\r\nBitrate: 64 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:d456b84b7b327e391314c11785ffaba3b3af4528","amp;dn":"Stephen+Moss+-+The+Fear+Saga","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d456b84b7b327e391314c11785ffaba3b3af4528","infoHashBuffer":{"type":"Buffer","data":[212,86,184,75,123,50,126,57,19,20,193,23,133,255,171,163,179,175,69,40]},"announce":[],"urlList":[]}}