{"title":"Mischling - Affinity Konar [EN EPUB] [ebook] [p_s]","uid":15794599,"size":2249050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4620907fbaf381fb977637b1e9dd416c2f255e1&amp;dn=Mischling+-+Affinity+Konar+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"perfect_stan","files":1,"time":1473439824,"description":"Mischling by Affinity Konar\r\nEnglish | 2016 | Historical Fiction | 2.1 MB\r\n\r\n\r\nPearl is in charge of: the sad, the good, the past.\r\nStasha must care for: the funny, the future, the bad.\r\nIt’s 1944 when the twin sisters arrive at Auschwitz with their mother and grandfather. In their benighted new world, Pearl and Stasha Zagorski take refuge in their identical natures, comforting themselves with the private language and shared games of their childhood.\r\nAs part of the experimental population of twins known as Mengele’s Zoo, the girls experience privileges and horrors unknown to others, and they find themselves changed, stripped of the personalities they once shared, their identities altered by the burdens of guilt and pain.\r\nThat winter, at a concert orchestrated by Mengele, Pearl disappears. Stasha grieves for her twin, but clings to the possibility that Pearl remains alive. When the camp is liberated by the Red Army, she and her companion Feliks–a boy bent on vengeance for his own lost twin–travel through Poland’s devastation. Undeterred by injury, starvation, or the chaos around them, motivated by equal parts danger and hope, they encounter hostile villagers, Jewish resistance fighters, and fellow refugees, their quest enabled by the notion that Mengele may be captured and brought to justice within the ruins of the Warsaw Zoo. As the young survivors discover what has become of the world, they must try to imagine a future within it.\r\nA superbly crafted story, told in a voice as exquisite as it is boundlessly original, Mischling defies every expectation, traversing one of the darkest moments in human history to show us the way toward ethereal beauty, moral reckoning, and soaring hope.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:d4620907fbaf381fb977637b1e9dd416c2f255e1","amp;dn":"Mischling+-+Affinity+Konar+%5BEN+EPUB%5D+%5Bebook%5D+%5Bp_s%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4620907fbaf381fb977637b1e9dd416c2f255e1","infoHashBuffer":{"type":"Buffer","data":[212,98,9,7,251,175,56,31,185,119,99,123,30,157,212,22,194,242,85,225]},"announce":[],"urlList":[]}}