{"title":"The Foods of the Greek Islands(ePUB,Retail) 32Skulls","uid":11892932,"size":39925756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d51bbc79412e00b319d418b0637055279e1598a0&amp;dn=The+Foods+of+the+Greek+Islands%28ePUB%2CRetail%29+32Skulls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"32Skulls","files":1,"time":1431043545,"description":"The Foods of the Greek Islands: Cooking and Culture at the Crossroads of the        Mediterranean\n\n\n\n\nStretching from the shores of Turkey to the Ionian Sea east of Italy, the Greek islands have been the crossroads of the Mediterranean since the time of Homer. Over the centuries, Phoenicians, Athenians, Macedonians, Romans, Byzantines, Venetians, Ottoman Turks, and Italians have ruled the islands, putting their distinctive stamp on the food.\n\nAglaia Kremezi, a frequent contributor to GOURMET and an international authority on Greek food, spent the past eight years collecting the fresh, uncomplicated recipes of the local women, as well as of fishermen, bakers, and farmers. Like all Mediterranean food, these dishes are light and healthful, simple but never plain, and make extensive use of seasonal produce, fresh herbs, and fish. Passed from generation to generation by word of mouth, most have never before been written down. All translate easily to the American home kitchen: Tomato Patties from Santorini; Spaghetti with Lobster from Kithira; Braised Lamb with Artichokes from Chios; Greens and Potato Stew from Crete; Spinach, Leek, and Fennel Pie from Skopelos; Rolled Baklava from Kos.\n\nIllustrated throughout with color photographs of the islanders preparing their specialties and filled with stories of island history and customs, THE FOODS OF THE GREEK ISLANDS is for all cooks and travelers who want to experience this diverse and deeply rooted cuisine firsthand.\n\n\n312 pages\nPublisher: Rux Martin/Houghton Mifflin Harcourt (March 31, 2015)\nLanguage: English\nISBN-10: 0544465024\nISBN-13: 978-0544465022","torrent":{"xt":"urn:btih:d51bbc79412e00b319d418b0637055279e1598a0","amp;dn":"The+Foods+of+the+Greek+Islands%28ePUB%2CRetail%29+32Skulls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d51bbc79412e00b319d418b0637055279e1598a0","infoHashBuffer":{"type":"Buffer","data":[213,27,188,121,65,46,0,179,25,212,24,176,99,112,85,39,158,21,152,160]},"announce":[],"urlList":[]}}