{"title":"Bruce Springsteen - Nebraska (1982) [24 bit FLAC] vinyl","uid":9458438,"size":846365844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d59f90369b4e6f4c9e41e452c46f3f4f4d9523d9&amp;dn=Bruce+Springsteen+-+Nebraska+%281982%29+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":-1,"time":1389310201,"description":"\n  Bruce Springsteen - Nebraska (1982) [24 bit FLAC] vinyl\n\n  Genre: Pop/Rock\n  Styles: Album Rock, Heartland, Folk-Rock\n  Source: Colombia vinyl\n  Codec: FLAC\n  Bitrate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  01 Nebraska\n  02 Atlantic City\n  03 Mansion on the Hill\n  04 Johnny 99\n  05 Highway Patrolman\n  06 State Trooper\n  07 Used Cars\n  08 Open All Night\n  09 My Father's House\n  10 Reason to Believe\n\n  There is an adage in the record business that a recording artist's demos of new songs often come off better than the more polished versions later worked up in a studio. But Bruce Springsteen was the first person to act on that theory, when he opted to release the demo versions of his latest songs, recorded with only acoustic or electric guitar, harmonica, and vocals, as his sixth album, Nebraska. It was really the content that dictated the approach, however. Nebraska's ten songs marked a departure for Springsteen, even as they took him farther down a road he had been traveling previously. Gradually, his songs had become darker and more pessimistic, and those on Nebraska marked a new low. They also found him branching out into better developed stories. The title track was a first-person account of the killing spree of mass murderer Charlie Starkweather. (It can't have been coincidental that the same story was told in director Terrence Malick's 1973 film Badlands, also used as a Springsteen song title.) That song set the tone for a series of portraits of small-time criminals, desperate people, and those who loved them. Just as the recordings were unpolished, the songs themselves didn't seem quite finished; sometimes the same line turned up in two songs. But that only served to unify the album. Within the difficult times, however, there was hope, especially as the album went on. Open All Night was a Chuck Berry-style rocker, and the album closed with Reason to Believe, a song whose hard-luck verses were belied by the chorus -- even if the singer couldn't understand what it was, people find some reason to believe. Still, Nebraska was one of the most challenging albums ever released by a major star on a major record label.","torrent":{"xt":"urn:btih:d59f90369b4e6f4c9e41e452c46f3f4f4d9523d9","amp;dn":"Bruce+Springsteen+-+Nebraska+%281982%29+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d59f90369b4e6f4c9e41e452c46f3f4f4d9523d9","infoHashBuffer":{"type":"Buffer","data":[213,159,144,54,155,78,111,76,158,65,228,82,196,111,63,79,77,149,35,217]},"announce":[],"urlList":[]}}