{"title":"Dead Boys - Young, Loud And Snotty (US Punk 1978 @192)","uid":3364257,"size":51960370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d6c619436cf78431e50ebf4a734e71c2966d220c&amp;dn=Dead+Boys+-+Young%2C+Loud+And+Snotty+%28US+Punk+1978+%40192%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"test78","files":12,"time":1122967931,"description":"Search for test78 if you are interested in my other uploads.\n\n\nAs both title phrase and capsule description, Young, Loud &amp; Snotty accurately defines the predominating aesthetic so well that one could just leave it at that, but there's a lot more going on here than on the face of it. With perhaps surprising great production from demi-famous '70s rocket Genya Ravan, the five-some found something sonically smack in-between the US garage/punk heritage of the past and the more modern thrashings from overseas. Bators sneers, gobs, gasps, and whines with the best of them, but he knows his rock history, as does his bandmates. Zero and Chrome aren't guitar virtuosos, but they do know what makes a song great and aren't afraid to concentrate on that, while the Magnum/Blitz rhythm section keeps things moving as it does. In some ways songs like &quot;All This and More&quot; and &quot;I Need Lunch&quot; simply emerge from an alternate '50s, with admittedly much more feedback and stereo sound. Stone cold rock classic &quot;Sonic Reducer&quot; starts things off -- amusingly -- with all sorts of phased drums and other fripperies that later generations wouldn't consider punk at all. That said, it's still blunt, brilliantly sung by Bators and kicks out the jams with messy energy. Other all-time greats include the perfect bored-and-needing-kicks anthem &quot;Ain't Nothin' to Do&quot; and the thoroughly wrong &quot;Caught With the Meat In Your Mouth.&quot; There's even a rock oldie -- a cover of &quot;Hey Little Girl&quot; live onstage at spiritual home CBGB's. And why not? With great punk rock and great rock, Young, Loud and Snotty still packs a punch. ~ \nNed Raggett, All Music Guide\n\n\n192kbs\n\nTracklist:\n\n1. Sonic Reducer\t\t \t \t\n2. All This and More\t\t \t \t\n3. What Love Is\t\t \t \t\n4. Not Anymore\t\t\t \t\n5. Ain't Nothin' to Do\t \t\n6. Caught With the Meat in Your Mouth\t\t \t \t\n7. Hey Little Girl\t \t \t\n8. I Need Lunch\t\t \t\n9. High Tension Wire\t\t \t \t\n10.Down in Flames\t \t \t\n11.Not Anymore/Ain't Nothin' to Do (Medley)\n\n\nEnjoy !","torrent":{"xt":"urn:btih:d6c619436cf78431e50ebf4a734e71c2966d220c","amp;dn":"Dead+Boys+-+Young%2C+Loud+And+Snotty+%28US+Punk+1978+%40192%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6c619436cf78431e50ebf4a734e71c2966d220c","infoHashBuffer":{"type":"Buffer","data":[214,198,25,67,108,247,132,49,229,14,191,74,115,78,113,194,150,109,34,12]},"announce":[],"urlList":[]}}