{"title":"Unholy Heights (GOG)","uid":10130733,"size":395878702,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d6d3a28e6774b43297eb56415279f8d869655362&amp;dn=Unholy+Heights+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Sarah116","files":3,"time":1399878345,"description":"Hey, a user requested this game and hear it is. Hope you guys enjoy and please help seed\n\n\n------------------------------------\n\n\nEach of the 20 monsters species is different. Some are lazy. Some are strong. Some are perverts.\nBuild a reputation with different monster families based on your performance and play style.\nBuild a stronger army as residents have children far stronger than themselves.\nGet monsters in the mood for love with inappropriately shaped erotic cakes.\nLook on in horror as lovingly hand-drawn monsters and humans horribly slaughter each other over money.\nMonster occupations, hobbies and desires are all procedurally generated to keep you on your toes.\n\n\nOverview:\nThe Devil has converted a tenement building into monsters-only housing in Unholy Heights, a mashup of Tower Defense and Apartment Management Simulation. Sucker monsters into moving into your building, charge them rent and keep them happy by buying them furniture.\n\nUnfortunately, heroes have caught wind of the Devil's plan, and will stop at nothing to wipe him out. Knock on residents' doors to call them to battle, trap heroes in devious pincer formations, and command your troops to victory. Monsters get jobs, fall in love, have children, and even skip out on their rent. Keep them happy or you might not have anyone to fight for you when heroes come knocking.\n\n &lt;a href=&quot;\nhttp://www.gog.com/game/unholy_heights&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gog.com/game/unholy_heights&lt;/a&gt;","torrent":{"xt":"urn:btih:d6d3a28e6774b43297eb56415279f8d869655362","amp;dn":"Unholy+Heights+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d3a28e6774b43297eb56415279f8d869655362","infoHashBuffer":{"type":"Buffer","data":[214,211,162,142,103,116,180,50,151,235,86,65,82,121,248,216,105,101,83,98]},"announce":[],"urlList":[]}}