{"title":"The Album Leaf - Between Waves (2016) [16.44 CD FLAC]","uid":15326137,"size":267575184,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d6d402911ffddb29b1b6618cb6d80a5dc6f080de&amp;dn=The+Album+Leaf+-+Between+Waves+%282016%29+%5B16.44+CD+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"politux","files":11,"time":1468699992,"description":"The Album Leaf - Between Waves (2016) [16.44 CD FLAC]\r\n\r\n  Genre: Electronic\r\n  Source: CD\r\n  Codec: FLAC\r\n  Bit rate: ~ 1,000 kbps\r\n  Bit depth: 16\r\n  Sample rate: 44.1 kHz\r\n\r\n  01 False Dawn\r\n  02 Glimmering Lights\r\n  03 New Soul\r\n  04 Back to the Start\r\n  05 Wandering Still\r\n  06 Never Far\r\n  07 Lost in the Fog\r\n  08 Between Waves\r\n\r\n  The Album Leaf began as the solo project of Jimmy LaValle, a San Diego-based songwriter who started recording solo material one year after forming the post-rock band Tristeza. Inspired by a number of genres -- classical, jazz, and post-rock among them -- LaValle constructed his own songs in a similarly eclectic manner, utilizing everything from ambient noise to field recordings to radio transmissions. An Orchestrated Rise to Fall introduced the resulting sound in 1999. An EP (In an Off White Room) preceded the release of LaValle's second full-length album, One Day I'll Be on Time, which was released by Tiger Style in March 2001. The Album Leaf's profile blossomed as a result of those recordings, and LaValle found himself opening shows for Sigur Rós' first American tour that fall. By the time he began recording his third album, he'd also secured the services of Sigur Rós' Iceland studios, along with the participation of several of that band's members. The resulting album, In a Safe Place, appeared on the Sub Pop label in June 2004.\r\n\r\n  The Seal Beach EP, originally issued in 2003 in Spain, appeared stateside in early 2005, and LaValle's next album, Into the Blue Again, followed in September 2006. The Album Leaf toured sporadically throughout the remainder of the decade, performing in multiple continents and opening for Devendra Banhart at the Hollywood Bowl in 2008. Two years later, LaValle returned with his fifth full-length album, A Chorus of Storytellers, which, for the first time, was recorded with a full live band and featured vocals on a number of tracks. After touring, the band went quiet for several years, with LaValle focusing on film-scoring work. The Album Leaf resurfaced in 2016 with their sixth album, Between Waves. In an extremely surprising collaboration that no fan of the band could have anticipated, the album was released through revered extreme metal label Relapse, although their sound had not changed significantly","torrent":{"xt":"urn:btih:d6d402911ffddb29b1b6618cb6d80a5dc6f080de","amp;dn":"The+Album+Leaf+-+Between+Waves+%282016%29+%5B16.44+CD+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6d402911ffddb29b1b6618cb6d80a5dc6f080de","infoHashBuffer":{"type":"Buffer","data":[214,212,2,145,31,253,219,41,177,182,97,140,182,216,10,93,198,240,128,222]},"announce":[],"urlList":[]}}