{"title":"EMCO MSI Package Builder Enterprise v4.5.5.7328 with Key [TorDig","uid":8731893,"size":13544531,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d73765be748e225dac5322eabc0c9934e4be8acc&amp;dn=EMCO+MSI+Package+Builder+Enterprise+v4.5.5.7328+with+Key+%5BTorDig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"TorDigger","files":12,"time":1374620673,"description":"EMCO MSI Package Builder\n\nCreate MSI Packages and Convert EXE to MSI With No Hassle\nAn innovative installation editor designed for an effortless creation of MSI packages. It helps you create MSI packages automatically by using the changes tracking technology, or manually by using the visual editor. The application can be used to repackage legacy installations and convert EXE to MSI files in order to customize installers and prepare them for a silent remote deployment. Thus created packages can be deployed through Group Policy or EMCO Remote Installer.\n\nEMCO MSI Package Builder is an installation authoring tool designed to help administrators to create, maintain and distribute Windows Installer packages. It can be used to create MSI packages easily, to modify existing installations and to repackage setups from the EXE to MSI format. The application is available in the following editions:\n\n-Starter Edition features an intuitive visual MSI editor that can be used to build MSI packages easily.\n-Professional Edition includes a visual editor and a changes monitor. It can be used to create MSI packages manually by means of the editor or automatically with the help of the changes monitor. It allows EXE to MSI repackaging and modifying existing installations.\n-Enterprise Edition is an advanced builder and repackager that can be used to create MSI packages and convert complex installations into the MSI format. Its changes monitor can track service installations and environment variables changes.\n\nSupported OS:\n\nWindows All\n\nHomepage: http://emcosoftware.com/msi-package-builder\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.\n","torrent":{"xt":"urn:btih:d73765be748e225dac5322eabc0c9934e4be8acc","amp;dn":"EMCO+MSI+Package+Builder+Enterprise+v4.5.5.7328+with+Key+%5BTorDig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d73765be748e225dac5322eabc0c9934e4be8acc","infoHashBuffer":{"type":"Buffer","data":[215,55,101,190,116,142,34,93,172,83,34,234,188,12,153,52,228,190,138,204]},"announce":[],"urlList":[]}}