{"title":"Encyclopedia of Stanley Kubrick From Day of the Fight to Eyes Wi","uid":11413605,"size":6545003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d76b2c4807dffc8bce681e574fcca771e52ddc4d&amp;dn=Encyclopedia+of+Stanley+Kubrick+From+Day+of+the+Fight+to+Eyes+Wi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415553650,"description":"From anti-war dramas such as &quot;Paths of Glory&quot; to the complexity of his final film, &quot;Eyes Wide Shut&quot;, controversial film director Stanley Kubrick always commanded his audience's attention. This encyclopaedia offers complete coverage of his life and the 13 feature films he directed, including &quot;2001, A Space Odyssey&quot;, &quot;A Clockwork Orange&quot;,and &quot;The Shining&quot;. In-depth entries survey: the actors who performed in his films, the writers with whom he collaborated, key members of his crew, inspiration for his movies; music and composers for his films, and recurring themes and genres.\n\nProduct Description\n\nFrom Booklist\nFacts On File's Great Filmmakers set includes individual volumes on three major directors (Hitchcock, Kubrick, and Orson Welles) as well as the two-volume Encyclopedia of Filmmakers (p.2008). Entries in the volume reviewed here are arranged alphabetically and cover films and screenplays, (A Clockwork Orange, Eyes Wide Shut); themes and motifs (Film noir, Science fiction); people (Kubrick, Christiane; Sellers, Peter); process ( Steadicam) ; and other important topics (HAL-9000).\n\nBiographical entries focus on the subject's importance and influence on Kubrick's life or works and are especially informative and interesting to read. The book also includes entries for prominent biographers and critics. Each film analysis discusses its significance in the director's oeuvre as well as describing the plot, characters, acting, production details, critical response, and other notable data. Reference lists for articles are often extensive. A surprising omission is a straight filmography, with works in chronological order, though this may be gleaned from the biographical narrative for Kubrick. Cross-references are noted in the text by capitalized words. Attractive black-and-white photos accompany many of the major articles.\n\nBecause Kubrick is among the best, most popular, and most-studied film directors, this authoritative books will get a lot of use in both public and academic libraries. RBB\nCopyright Â© American Library Association. All rights reserved\nAbout the Author\nGene D. Phillips is a professor of English and film at Loyola University and is the author of many articles and books on literature and film. He lives in Chicago, IL. Rodney Hill is the head of marketing and publicity at WinStar Cinema, a New York-based distributor of international art films. He lives in Bronx, NY.\n\nPublisher: Facts On File Inc (30 June 2002)\nLanguage: English\nISBN-10: 0816043884\nISBN-13: 978-0816043880","torrent":{"xt":"urn:btih:d76b2c4807dffc8bce681e574fcca771e52ddc4d","amp;dn":"Encyclopedia+of+Stanley+Kubrick+From+Day+of+the+Fight+to+Eyes+Wi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76b2c4807dffc8bce681e574fcca771e52ddc4d","infoHashBuffer":{"type":"Buffer","data":[215,107,44,72,7,223,252,139,206,104,30,87,79,204,167,113,229,45,220,77]},"announce":[],"urlList":[]}}