{"title":"The Logic Book, 6E [PDF] [StormRG]","uid":10593077,"size":14306289,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d772626f6f2e40e637d504cdb7eb392c6453f390&amp;dn=The+Logic+Book%2C+6E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"steelballz","files":-1,"time":1405823453,"description":"Description\nThe Logic Book, Sixth Edition\nAuthor:Merrie Bergmann\nPublished:Feb. 8 2013\nPublisher:McGraw-Hill Humanities/Social Sciences/Languages; 6 edition\nISBN-10:0078038413\nISBN-13:9780078038419\nFormat: Retail PDF\nReader Required: Adobe Acrobat\n\n\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\nIf you do have difficulties opening this file while running a Linux OS, try opening in windows or mac using Adobe Acrobat. If you still can't open, pm me and I'll investigate.\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\nThe Logic Book is a leading text for symbolic logic courses that presents all concepts and techniques with clear, comprehensive explanations. There is a wealth of carefully constructed examples throughout the text, and its flexible organization places materials within largely self-contained chapters that allow instructors the freedom to cover the topics they want, in the order they choose.\nAbout the Author\nMerrie Bergmann received her Ph.D. in philosophy from the University of Toronto and is currently an Associate Professor in the Computer Science Department at Smith College. She has published articles in formal semantics and logic, philosophy of language, and computational linguistics.\n\nJames Moor received his Ph.D. in history and philosophy of science from Indiana University and is currently a Professor of Philosophy at Dartmouth College. He has developed software for teaching logic and has published articles in philosophy of science, philosophy of mind, logic, philosophy of artificial intelligence, and computer ethics.\n\nJack Nelson received his Ph.D. in philosophy from the University of Chicago and is currently Associate Dean of the College of Liberal Arts and Sciences and the Interim Chair of the Philosophy Department at Arizona State University. He has developed software for teaching logic and has published articles in personal identity, epistemology, and philosophy of science.\n\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:d772626f6f2e40e637d504cdb7eb392c6453f390","amp;dn":"The+Logic+Book%2C+6E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d772626f6f2e40e637d504cdb7eb392c6453f390","infoHashBuffer":{"type":"Buffer","data":[215,114,98,111,111,46,64,230,55,213,4,205,183,235,57,44,100,83,243,144]},"announce":[],"urlList":[]}}