{"title":"Bang: More Lays in 60 Days - Roosh V","uid":9416095,"size":18421451,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d779968982d4fba238e6d85e601e8be3ffc801e2&amp;dn=Bang%3A+More+Lays+in+60+Days+-+Roosh+V&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ddog7x","files":-1,"time":1388446787,"description":"Scanned, but it's better than nothing.\n\n\nBang is a pickup textbook intended for men who weren't born with the natural ability to sleep with a lot of women. It contains simple but powerful techniques, moves, and lines that offer a direct line to casual sex. \n\nBang includes...\nThe 8 essential beliefs of the alpha male\nThe 5 critical components of the &quot;vibe,&quot; an optimal attitude women find most attractive\nTons of natural, high-impact opening lines that work just about anywhere women can be found\nBest answers to a girl's common questions that heighten the tension and build attraction\nA technique to get her phone number without asking for it\nDetailed text messaging strategy that shows you word-for-word how to get dates in the shortest amount of time possible (no need to make voice calls)\nThe one text messaging mistake 95% of guys make that kill the interaction\nA simple trick for the first date that will make her feel like she has known you longer than she actually has\nBang goes into explicit detail on how to escalate to intimacy...\n&quot;Four key moves&quot; to the kiss that are so natural and easy to pull off that the girl won't even recognize them as moves\nA comprehensive dating strategy so you bang her no later than the third date\nThe 5 magic words to say when you want to get inside her place\nHow to make a smooth transition to the bedroom \n7 detailed steps to taking off her clothes\nThere is also an appendix that covers unique situations you may face...\nHow to approach girls in coffee shops, the gym, and foreign countries\nHow to prevent a girl from seeing you as too young or too old\nA bonus &quot;cheat sheet&quot; that contains six of the most crucial points you need to remember when it's time to pickup girls\nDozens of additional topics are logically organized into five chapters...\nInternal Game. How to build your confidence and adopt the correct beliefs that maximize your notch count\nEarly Game. How to meet women, have good conversations, build attraction, and get either numbers, kisses, or one-night stands\nMiddle Game. How to set up a date along with what to do and say while out on them\nLate Game. How to seal the deal and plan for future dates\nEnd Game. How to take your results to the next level\nThe lessons taught in this no-nonsense, no-fluff textbook aim to help men reach their sex potential based on their existing look and status. ","torrent":{"xt":"urn:btih:d779968982d4fba238e6d85e601e8be3ffc801e2","amp;dn":"Bang%3A+More+Lays+in+60+Days+-+Roosh+V","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d779968982d4fba238e6d85e601e8be3ffc801e2","infoHashBuffer":{"type":"Buffer","data":[215,121,150,137,130,212,251,162,56,230,216,94,96,30,139,227,255,200,1,226]},"announce":[],"urlList":[]}}