{"title":"Quicksilver by Neal Stephenson [MU]","uid":8621014,"size":8886029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8bd44f5b7cf359aab55b7cc436dc91262741701&amp;dn=Quicksilver+by+Neal+Stephenson+%5BMU%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"Max-Upload","files":-1,"time":1372371783,"description":"Quicksilver by Neal Stephenson (September 21st 2004) in PDF, EPUB and MOBI format. \n\n\nFor ebook devices use an ebook converter like: \nCalibre - {spam link removed}download \nOnline - http://ebook.online-convert.com \nHamster Ebook Converter - http://www.hamstersoft.com/free-ebook-converter\n\nSet against the backdrop of the late 17th and early 18th centuries, Quicksilver tells the intertwining tales of 3 unforgettable main characters (descendants of characters from Cryptonomicon) as they traverse a landscape populated by mad alchemists, Barbary pirates, and bawdy courtiers, as well as historical figures including Ben Franklin, William of Orange, Louis XIV, and many others. \n\nThis breathtaking story ranges from the American colonies to the Tower of London to the glittering palace at Versailles, and all manner of places in between--and plays out during a singular nexus point in history, when rationality triumphed over mysticism, monarchy was overthrown, markets become free, and religious tolerance gained ground over harsh oppression. \n\nIt is the story of Daniel Waterhouse, fearless thinker and conflicted Puritan, pursuing knowledge in the company of the greatest minds of Baroque-era Europe, in a chaotic world where reason wars with the bloody ambitions of the mighty, and where catastrophe, natural or otherwise, can alter the political landscape overnight. \n\nIt is a chronicle of the breathtaking exploits of &quot;Half-Cocked Jack&quot; Shaftoe--London street urchin turned swashbuckling adventurer and legendary King of the Vagabonds--risking life and limb for fortune and love while slowly maddening from the pox... \n\nand Eliza, rescued by Jack from a Turkish harem to become spy, confidante, and pawn of royals in order to reinvent a contentious continent through the newborn power of finance. \n\nA gloriously rich, entertaining, and endlessly inventive novel that brings a remarkable age and its momentous events to vivid life--a historical epic populated by the likes of Samuel Pepys, Isaac Newton, William of Orange, Benjamin Franklin, and King Louis XIV--Quicksilver is an extraordinary achievement from one of the most original and important literary talents of our time.\n\nAnd it's just the beginning ...\n\n\nSeed and Enjoy!","torrent":{"xt":"urn:btih:d8bd44f5b7cf359aab55b7cc436dc91262741701","amp;dn":"Quicksilver+by+Neal+Stephenson+%5BMU%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8bd44f5b7cf359aab55b7cc436dc91262741701","infoHashBuffer":{"type":"Buffer","data":[216,189,68,245,183,207,53,154,171,85,183,204,67,109,201,18,98,116,23,1]},"announce":[],"urlList":[]}}