{"title":"Sony Vegas Pro 12 Build 563 (64 bit patch-KHG) [ChingLiu]","uid":8350130,"size":240817678,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d965816860eedc45ea860f64442c4455991651cc&amp;dn=Sony+Vegas+Pro+12+Build+563+%2864+bit+patch-KHG%29+%5BChingLiu%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"Ching_Liu","files":-1,"time":1365315207,"description":"Notable fixes/changes in version 12.0 (Build 563)\n*Added support for rendering 24p AVC-Intra 100 Panasonic P2 video to a folder on your computer or to a connected P2 camera.. \n*Improved performance for decoding XAVC 4K video from Sony F5/F55 cameras. \n*Added support for exporting event timestretching as velocity when exporting to Final Cut Pro X format. \n*Added support for exporting event pan and crop settings as motion when exporting to Final Cut Pro X format. Please note that event zooming, cropping, and scaling are exported as separate operations. \n- To export event zoom, the Event Pan/Crop Maintain aspect ratio control must be set to No, and Stretch to fill frame must be set to Yes. \n- To export event crop, the Event Pan/Crop Stretch to fill frame control must be set to No. \n- To export event rotation, the Event Pan/Crop Stretch to fill frame control must be set to Yes. \n*Added support for importing event pan and crop settings when importing a Final Cut Pro X format. \n*Timecode for MOV files is now read properly and displayed in Vegas Pro media properties. \n*Added support for reading and rendering up to 16 channels of audio in SD OP1a MXF files. \n*Added new rendering templates to the Sony AVC/MVC format: use Internet 1920x1080-30p and Internet 1280x720-30p to render HD video for Internet distribution. \n*Fixed a bug that could cause a crash when using Tools &gt; Selectively Prerender Video. \n*Fixed a bug that could cause a crash when browsing in the Vegas Explorer when the Documents library was empty. \n*Fixed a bug that could prevent Windows Explorer libraries from being displayed in the Vegas Pro Explorer after refreshing the Explorer window. \n*Fixed a bug that prevented inserting busses, input busses, and assignable effects after opening and closing the Render As window. \n*Fixed a bug that could cause the application to freeze when loading thumbnail images in the Project Media window. \n*Fixed a bug that could cause the Video Preview window to display red when choosing Clipboard from the Split-Screen View button's drop-down list. \n*Fixed a bug that could cause problems drawing audio peaks or saving files when using Open in Sound Forge or Open Copy in Sound Forge. \n*Fixed a bug that could prevent Vegas Pro from starting when using a non-Administrator user account.\n\nVegas Pro 12 system requirements\n\n* MicrosoftÂ® Windows VistaÂ® 64-bit SP2, Windows 7 64-bit, or WindowsÂ® 8 64-bit operating system\n* 2 GHz processor (multicore or multiprocessor CPU recommended for HD or stereoscopic 3D)\n* 500 MB hard-disk space for program installation\n* 4 GB RAM (8 GB recommended)\n* OHCI-compatible IEEE-1394DV card (for DV and HDV capture and print-to-tape)\n* USB 2.0 connection (for importing from AVCHD, XDCAM EX, NXCAM, or DVD camcorders)\n* 512 MB GPU memory\n* Windows-compatible sound card\n* DVD-ROM drive (for installation from a DVD only)\n* Supported CD-recordable drive (for CD burning only)\n* Supported DVD-R/-RW/+R/+RW (for DVD burning only)\n* Supported BD-R/-RE drive (for Blu-ray Discâ„¢ burning only)\n* Microsoft .NET Framework 3.51 (included on application disc)\n* AppleÂ® QuickTimeÂ® 7.1.6 or later for reading and writing QuickTime files\n* Internet Connection (for Gracenote MusicID Service)\n* GPU-accelerated video processing and rendering require an OpenCLâ„¢-supported NVIDIAÂ®, AMD/ATIâ„¢, or IntelÂ® GPU with 512MB memory or more.\n\nLanguage : English\n\nHomepage :  &lt;a href=&quot;\nhttp://www.sonycreativesoftware.com/vegaspro&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sonycreativesoftware.com/vegaspro&lt;/a&gt;","torrent":{"xt":"urn:btih:d965816860eedc45ea860f64442c4455991651cc","amp;dn":"Sony+Vegas+Pro+12+Build+563+%2864+bit+patch-KHG%29+%5BChingLiu%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d965816860eedc45ea860f64442c4455991651cc","infoHashBuffer":{"type":"Buffer","data":[217,101,129,104,96,238,220,69,234,134,15,100,68,44,68,85,153,22,81,204]},"announce":[],"urlList":[]}}