{"title":"[Linda Gilbert] Elements of Modern Algebra (8th Edition)(pdf){Zz","uid":11215532,"size":29641645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d9a315d24f74a29e79a97449ea0aad67ae149d44&amp;dn=%5BLinda+Gilbert%5D+Elements+of+Modern+Algebra+%288th+Edition%29%28pdf%29%7BZz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413323126,"description":"Elements Of Modern Algebra, Eighth Edition, with its user-friendly format, provides you with the tools you need to succeed in abstract algebra and develop mathematical maturity as a bridge to higher-level mathematics courses. Strategy boxes give you guidance and explanations about techniques and enable you to become more proficient at constructing proofs. A summary of key words and phrases at the end of each chapter help you master the material. A reference section, symbolic marginal notes, an appendix, and numerous examples help you develop your problem-solving skills.\n\nProduct Description\nReview\n1. FUNDAMENTALS. Sets. Mappings. Properties of Composite Mappings (Optional). Binary Operations. Permutations and Inverses. Matrices. Relations. 2. THE INTEGERS. Postulates for the Integers (Optional). Mathematical Induction. Divisibility. Prime Factors and Greatest Common Divisor. Congruence of Integers. Congruence Classes. Introduction to Coding Theory (Optional). Introduction to Cryptography (Optional). 3. GROUPS. Definition of a Group. Properties of Group Elements. Subgroups. Cyclic Groups. Isomorphisms. Homomorphisms. 4. MORE ON GROUPS. Finite Permutation Groups. Cayley's Theorem. Permutation Groups in Science and Art (Optional). Cosets of a Subgroup. Normal Subgroups. Quotient Groups. Direct Sums (Optional). Some Results on Finite Abelian Groups (Optional). 5. RINGS, INTEGRAL DOMAINS, AND FIELDS. Definition of a Ring. Integral Domains and Fields. The Field of Quotients of an Integral Domain. Ordered Integral Domains. 6. MORE ON RINGS. Ideals and Quotient Rings. Ring Homomorphisms. The Characteristic of a Ring. Maximal Ideals (Optional). 7. REAL AND COMPLEX NUMBERS. The Field of Real Numbers. Complex Numbers and Quaternions. De Moivre's Theorem and Roots of Complex Numbers. 8. POLYNOMIALS. Polynomials over a Ring. Divisibility and Greatest Common Divisor. Factorization in _F[x]_ . Zeros of a Polynomial. Solution of Cubic and Quartic Equations by Formulas (Optional). Algebraic Extensions of a Field.\nAbout the Author\nLinda Gilbert received her Ph.D. from Louisiana Tech University with a specialty in Linear and Abstract Algebras. She has been writing textbooks since 1981 with her husband Jimmie Gilbert, including ELEMENTS OF MODERN ALGEBRA and LINEAR ALGEBRA and MATRIX THEORY (now in its second edition) with Cengage Learning, plus titles in College Algebra, Precalculus, College Algebra and Trigonometry, Trigonometry, and Intermediate Algebra. \n\nPublisher: Brooks/Cole; 8th Revised edition edition (5 February 2014)\nLanguage: English\nISBN-10: 1285463234\nISBN-13: 978-1285463230","torrent":{"xt":"urn:btih:d9a315d24f74a29e79a97449ea0aad67ae149d44","amp;dn":"%5BLinda+Gilbert%5D+Elements+of+Modern+Algebra+%288th+Edition%29%28pdf%29%7BZz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9a315d24f74a29e79a97449ea0aad67ae149d44","infoHashBuffer":{"type":"Buffer","data":[217,163,21,210,79,116,162,158,121,169,116,73,234,10,173,103,174,20,157,68]},"announce":[],"urlList":[]}}