{"title":"Democracy At Work: A Cure for Capitalism","uid":9889130,"size":182947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dab52183b6dc17a7bf3e926d5efe1a4d9e0b8259&amp;dn=Democracy+At+Work%3A+A+Cure+for+Capitalism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"NoMoreAVI","files":-1,"time":1396620231,"description":"&quot;A new historical vista is opening before us in this time of change, Wolff writes in this compelling new manifesto for a democratic alternative based on workers managing their own workplaces.\n\nCapitalism as a system has spawned deepening economic crisis alongside its bought-and-paid for political establishment. Neither serves the needs of our society. Whether it is secure, well-paid and meaningful jobs or a sustainable relationship with the natural environment that we depend on, our society is not delivering the results people need and deserve.\n\nOne key cause for this intolerable state of affairs is the lack of genuine democracy in our economy as well as in our politics. The solution requires the institution of genuine economic democracy, starting with workers managing their own workplaces, as the basis for a genuine political democracy.\n\nHere Wolff lays out a hopeful and concrete vision of how to make that possible, addressing the many people who have concluded economic inequality and politics as usual can no longer be tolerated and are looking for a concrete program of action.\n\nRichard D. Wolff is Professor of Economics Emeritus, University of Massachusetts, Amherst. He is currently a Visiting Professor at the New School University in New York. Wolf is the author of many books, including Capitalism Hits the Fan: The Global Economic Meltdown and What to Do About It. He hosts the weekly hour-long radio program Economic Update on WBAI (Pacifica Radio) and writes regularly for The Guardian, Truthout.org, and the MRZine.&quot;","torrent":{"xt":"urn:btih:dab52183b6dc17a7bf3e926d5efe1a4d9e0b8259","amp;dn":"Democracy+At+Work%3A+A+Cure+for+Capitalism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dab52183b6dc17a7bf3e926d5efe1a4d9e0b8259","infoHashBuffer":{"type":"Buffer","data":[218,181,33,131,182,220,23,167,191,62,146,109,94,254,26,77,158,11,130,89]},"announce":[],"urlList":[]}}