{"title":"Plague Inc: Evolved 1.0 [MAC OS X]","uid":13876665,"size":386412366,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:db0f0c302a6deeb6ee9dfee9a24d4c319906f0b1&amp;dn=Plague+Inc%3A+Evolved+1.0+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"iAlexander","files":1,"time":1458128954,"description":"MADE IN UKRAINE\r\n\r\nPlague Inc: Evolved 1.0 – A unique mix of high strategy and terrifyingly realistic simulation.\r\n\r\nPlague Inc: Evolved is a unique mix of high strategy and terrifyingly realistic simulation. Your pathogen has just infected ‘Patient Zero’ – now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself.\r\n\r\nCan you infect the world? Your pathogen has just infected ‘Patient Zero’. Now you must bring about the end of human history by evolving a deadly, global Plague whilst adapting against everything humanity can do to defend itself. Plague Inc: Evolved is a unique mix of high strategy and terrifyingly realistic simulation which is now available on PC, Mac and Linux via Steam. Plague Inc. has infected over 60 million players to date and has now been entirely redeveloped for PC, Mac and Linux. Get ready to take strategy gaming to the next level!\r\n\r\nOver 65 million players have been infected by Plague Inc. already. Now, Plague Inc: Evolved combines the original critically acclaimed gameplay with significant, all-new features for PC including multiplayer, user-generated content support, improved graphics and lots more.\r\n\r\n- 10 Different Disease Types – Master every pathogen; from bacteria to bio-weapons and mind control to zombies, end humanity by any means possible – different diseases will need radically different approaches.\r\n\r\n- 20 Unique Scenarios – Adapt your strategy; scenarios create further challenges for your pandemic – how will you handle a new strain of Swine Flu, or infect a world in Ice Age?\r\n- Hyper-Realistic World – Strategize in the real world; advanced AI and use of real-world data and events make Plague Inc: Evolved a highly authentic simulation of a world-ending pathogen. Even the CDC likes it!\r\n\r\n- Competitive Multiplayer – The world is unlucky enough to be infected with two plagues, but how will you win the battle for genetic dominance against your opponent? Players get all new evolutions, abilities and genes to help them fight for global control and destroy their opponent!\r\n- Co-Operative Mode – Two different diseases team up to infect and destroy the world together but Humanity has new tricks up its sleeve to fight back! Work closely with your partner and use brand-new genes, traits and strategies to smash cure labs all over the world before they eradicate you.\r\n\r\n- Contagious Content Creator – Hit the lab and develop your own custom scenarios – creating new plague types, worlds and in-game events. Sophisticated tools support user-generated content to let players bring their deadliest ideas to life and share them on Steam Workshop. With over 10,000 custom scenarios already released – there is always something new to infect!\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:db0f0c302a6deeb6ee9dfee9a24d4c319906f0b1","amp;dn":"Plague+Inc%3A+Evolved+1.0+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0f0c302a6deeb6ee9dfee9a24d4c319906f0b1","infoHashBuffer":{"type":"Buffer","data":[219,15,12,48,42,109,238,182,238,157,254,233,162,77,76,49,153,6,240,177]},"announce":[],"urlList":[]}}