{"title":"Three Philosophical Filmmakers Hitchcock, Welles, Renoir [Irving","uid":9547868,"size":4064037,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db4693aa499e71d85bfa70db68e1081786056b9e&amp;dn=Three+Philosophical+Filmmakers+Hitchcock%2C+Welles%2C+Renoir+%5BIrving&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1391128318,"description":"Although Alfred Hitchcock, Orson Welles, and Jean Renoir do not pontificate about &quot;eternal verities or analytical niceties,&quot; as Irving Singer remarks in Three Philosophical Filmmakers, each expresses, through his work, his particular vision of reality. In this study of these great directors, Singer examines the ways in which meaning and technique interact within their different visions.Singer's account reveals Hitchcock, Welles, and Renoir to be not only consummate artists and inspired craftsmen but also sophisticated theorists of film and its place in human experience. They left behind numerous essays, articles, and interviews in which they discuss the nature of their own work as well as more extensive issues. Singer draws on their writings, as well as their movies, to show the pervasive importance of what they did as dedicated filmmakers.Hitchcock used his mastery of contrived devices not as mere formalism divorced from content, Singer notes, but in order to evoke emotional responses that are meaningful in themselves and that matter greatly to millions of people. Singer's discussion of Hitchcock's work analyzes, among other things, his ideas about suspense, romance, and the comic. Singer also makes a detailed comparison of the original Psycho with Gus Van Sant's recent remake. Considering the work of Welles, Singer shows how and why the theme of vanished origins -- &quot;the myth of the past&quot; -- recurs in many of his films, starting with the Rosebud motif in Citizen Kane and continuing much later in his little-known masterpiece The Immortal Story. Expanding upon Renoir's comment that his own films were &quot;always the same film,&quot; Singer studies his entire work as a coherent though evolving search for contact and &quot;conversation&quot; with the audience. While recognizing the primacy of technique, Renoir used cinematic artifice in the service of that humanistic aspiration.","torrent":{"xt":"urn:btih:db4693aa499e71d85bfa70db68e1081786056b9e","amp;dn":"Three+Philosophical+Filmmakers+Hitchcock%2C+Welles%2C+Renoir+%5BIrving","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db4693aa499e71d85bfa70db68e1081786056b9e","infoHashBuffer":{"type":"Buffer","data":[219,70,147,170,73,158,113,216,91,250,112,219,104,225,8,23,134,5,107,158]},"announce":[],"urlList":[]}}