{"title":"Lyn 1.5.6 MacOSX-CORE [ATOM]","uid":11363373,"size":18067206,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:db5b52224676a4b1548a2a185661130dcab78cdc&amp;dn=Lyn+1.5.6+MacOSX-CORE+%5BATOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"AtomTPB","files":5,"time":1415023025,"description":"Description:\nLyn is a lightweight and fast image browser and viewer designed for photographers, graphic artists and Web designers. Featuring an extremely versatile and aesthetically pleasing interface, it delivers an easy-to-use geotagging technology and a complete solution for sharing your photographs.\nLyn natively supports all popular image formats like JPEG, TIFF, JPEG 2000, PNG, PPM, TGA, RAW, HDR, OpenEXR, animated GIF, and any other image format supported by OS X. It also integrates a movie player to watch camera recordings.\n\nThe new editing inspector gives you everything to turn your shots into great photos. Adjust exposure, color temperature, brightness, and contrast or reveal image details with highlight and shadow adjustments. You can experiment and convert your color photos to black and white, try a classic sepia tone, or add a vignette.\n\n\nFeatures:\n-Progressive display, on single- or multiple-monitor configurations, of images of virtually any size.\n-Multi-threading to take advantage of multicore CPUs.\n-Display color-corrected images and soft-proofing function.\n-Compatible with High Dynamic-Range images like TIFF float as well as Radiance and OpenEXR.\n-Common metadata parser: EXIF, Camera's makernote, GPS, GeoTIFF, IPCT.\n-Image navigation with Apple Remote Control or Magic Trackpad.\n-User-switchable thumbnails cache.\n-Filtering by tags and metadata.\n-Fullscreen and slideshow with music.\n-Full IPTC editing with user-defined presets.\n-Batch operations: convert and rename.\n-User-defined places.\n-Non-destructive editing.\n-Editing inspector with filters and effects: temperature and tint, exposure, brightness, contrast, highlight, and shadow. Black and white, sepia tone, and vignette.\n-Easily browse your iPhoto, Aperture, and Lightroom libraries!\n-Facebook, Flickr, Dropbox, SmugMug, 500px, and Picasa Web Albums sharing!\n-Maps layout: geotag your photographs and edit locations with a simple drag and drop.\n-Integrated QuickTime video player\n\n\nWhat's New: \nVersion 1.5.6:\n\n-Polished toolbar's icons for Yosemite\n-Optimized folders management\n-Optimized fullscreen's panels delay\n-Added shortcuts for copy/move operations\n-Fixed an issues on Yosemite when exiting from fullscreen mode with maximized window\n-Fixed artifacts when switching browser view and zooming on Yosemite\n-Fixed some issues related to smart search and customization\n-Fixed an issue with scrolling image area on a retina display\n-Fixed behaviour of the size field in email exporter\n-Fixed hang when synching viewer and browser in stripview\n\nSystem Requirements:\n-Intel\n-OS X 10.6.8 or later","torrent":{"xt":"urn:btih:db5b52224676a4b1548a2a185661130dcab78cdc","amp;dn":"Lyn+1.5.6+MacOSX-CORE+%5BATOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db5b52224676a4b1548a2a185661130dcab78cdc","infoHashBuffer":{"type":"Buffer","data":[219,91,82,34,70,118,164,177,84,138,42,24,86,97,19,13,202,183,140,220]},"announce":[],"urlList":[]}}