{"title":"168 Hours - You Have More Time Than You Think By Laura Vanderkam","uid":7956911,"size":2400012,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:db669206963c59d8a614a06711b8d219fc14543e&amp;dn=168+Hours+-+You+Have+More+Time+Than+You+Think+By+Laura+Vanderkam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"KatQwerty","files":3,"time":1356454876,"description":"[PDF] - Publication Date: May 27, 2010\n \nThere are 168 hours in a week. This is your guide to getting the most out of them. \n\n\nIt's an unquestioned truth of modern life: we are starved for time. We tell ourselves we'd like to read more, get to the gym regularly, try new hobbies, and accomplish all kinds of goals. But then we give up because there just aren't enough hours to do it all. Or if we don't make excuses, we make sacrifices- taking time out from other things in order to fit it all in. \n \n \nThere has to be a better way...and Laura Vanderkam has found one. After interviewing dozens of successful, happy people, she realized that they allocate their time differently than most of us. Instead of letting the daily grind crowd out the important stuff, they start by making sure there's time for the important stuff. When plans go wrong and they run out of time, only their lesser priorities suffer. \n \n \nVanderkam shows that with a little examination and prioritizing, you'll find it is possible to sleep eight hours a night, exercise five days a week, take piano lessons, and write a novel without giving up quality time for work, family, and other things that really matter.\n \n ","torrent":{"xt":"urn:btih:db669206963c59d8a614a06711b8d219fc14543e","amp;dn":"168+Hours+-+You+Have+More+Time+Than+You+Think+By+Laura+Vanderkam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db669206963c59d8a614a06711b8d219fc14543e","infoHashBuffer":{"type":"Buffer","data":[219,102,146,6,150,60,89,216,166,20,160,103,17,184,210,25,252,20,84,62]},"announce":[],"urlList":[]}}