{"title":"Rocco Siffredi Hard Academy 2 (Evil Angel) 2016 Split Scenes","uid":15777118,"size":2541296389,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dbe3d6c66184b7efee0414498712398e6679ffa1&amp;dn=Rocco+Siffredi+Hard+Academy+2+%28Evil+Angel%29+2016+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":4,"uploader":"EndYou","files":5,"time":1473245965,"description":"DaughterSwap The Best NEW XXX PACK:  https://thepiratebay.org/torrent/15710946\r\n\r\nCzechStreets Amateur Pack (Episode 1-30):  https://thepiratebay.org/torrent/15748076\r\n\r\nMore exclusive porn at:  https://thepiratebay.org/user/EndYou\r\n\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――    \nhttp://imgpremium.com/img-57cfd6eb40bad.html  \nhttp://imgpremium.com/img-57cfd6ebc0863.html  \nhttp://imgpremium.com/img-57cfd6ec05cef.html  \nhttp://imgpremium.com/img-57cfd6ec41af9.html  \nhttp://imgpremium.com/img-57cfd6ec75658.html  \nhttp://imgpremium.com/img-57cfd6eca2cff.html \r\n\r\nAlexa Tomas, Alison Blond, Anael Angeli, Angel Wicky, Brittany Bardot, Carolina Abril, Felicia Kiss, Kayla Green, Kittina, Kitty, Lara De Santis, Lexie Candy, Mea Melone, Ners Zen, Nikita Bellucci, Orsolya, Subil Arch, Szabina, Timea, Vivien, 13, Alberto, Alessandro, Alessandro Twin, Andrea, Angelo, Antonio, Begasus, Chad Rockwell, Erik Everhard, Fabio, Fabrizio, Flipper, Fornaro, Gabriel Zero, Giampaolo, Giorgio, Giovanni, Giovanni D, Giuseppe, Gold Boy, Gyorgy, Hunter Leone, Il Carol, Jhon Prize, Joel Tomas, Julien, Lutro, Marco, Mike Angelo, PG, Pier Luigi, Raffaele, Rastapica, Roberto, Rocco Siffredi, Simone Twin, Steve, Tommy Sy.\r\n\r\nSexual icon Rocco Siffredi shares his expertise with the new generation of XXX talent in a rollicking porn boot camp! The lectures, games and intense, hands-on orgy experiences of ''Rocco Siffredi Hard Academy Part 2'' prove that with passion, amour and some irony, sex cinema is entertainment. A platoon of prospective studs rides dirt bikes while lingerie-clad sluts pummel them with water balloons. Pro fuckers Erik Everhard and Mike Angelo aggressively double-penetrate athletic blonde Brittany Bardot, the camp's playfully nasty drill sergeant. Stunning Nikita Bellucci and the recruits make it an anal gang orgy. Pretty Alison Blond offers her accommodating mouth in a blow bang lesson. Four racy sluts take on a dozen apprentice dicks in a crazy, outdoor cluster fuck of face sitting, double penetration and ass-to-mouth cocksucking. The girls slurp semen from jumbo jugs. Seven beauties service a gang of blindfolded porn pros, with Mea Melone manhandled in a double-anal pounding! An extra sex segment shows 10 graduates sharing a dorm room celebration orgy with three smokin' camp counselors. Sloppy BJs and orgasmic sodomy lead to creamy girl-girl kisses and oral semen swapping.\r\n\r\nMPEG4 Video (H264) 960x544","torrent":{"xt":"urn:btih:dbe3d6c66184b7efee0414498712398e6679ffa1","amp;dn":"Rocco+Siffredi+Hard+Academy+2+%28Evil+Angel%29+2016+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbe3d6c66184b7efee0414498712398e6679ffa1","infoHashBuffer":{"type":"Buffer","data":[219,227,214,198,97,132,183,239,238,4,20,73,135,18,57,142,102,121,255,161]},"announce":[],"urlList":[]}}