{"title":"Windows 8 Personalization unlocker and Activator All in one","uid":8319779,"size":2537481,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc0b83a0c0e34b53b8f6969a146e09ed8db4cd85&amp;dn=Windows+8+Personalization+unlocker+and+Activator+All+in+one&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Halloweenpsycho","files":-1,"time":1364649809,"description":"This my Unlocker and Activator all in one. I had taken time to write a detailed instruction tutorial, but i best feel it has been done very well by *OptoMystical*\nHe was kind enough to take time out to write this nice turorial and i feel he deserves credit for the tutorial at hand.\n\n@halloweenpsycho From *OptoMystical*\n\nThis method has worked for everyone so far, please help me support it because people usually only listen to you, thanks\n\n1. Download Windows 8 Pro Retail [Permanent Activation Wmc Included]\n2. Update to windows 8\n3. If your key does not work it is fine.\n4.  ... Download and open this file, and your windows should be activated.\n5. Go to Control Panel and click on &quot;Additional features&quot; It is either &quot;additional&quot; or &quot;more&quot; features, then use the WMC code that came with this program, and you should be able to download WMC.\n6. After it downloads, windows should be unactivated, but then just download this FILE: ... and even though it is supposed to be a personalization unlocker, it actually activated windows for me.\n7. after you open the file, your computer will open a blank blue screen, but be patient for windows is only preparing for a restart. after it restarts, windows should be activated! Good Luck! :)\nFOR FUTURE WINDOWS UPDATES MAKE SURE TO REPEAT STEP 6 (open and run the personalization unlocker again\n\nThanks again OptoMystical for the nice tutorial..\n\nI have worked very hard for all of you, on this and i always hope to provide the very best. If you would like to give me a rating on the progress and quality i provide, or if you are not happy with the torrents provided by me, please make your comment here https://forum.suprbay.org/reputation.php?uid=329935\nIf you would rather just leave your comments below that would be well appriciated as well. I welcome all comments be it Positive or Negative.\nThank you all, as for with out you my work would be sitting un used. I am proud to be a part of the TPB community and i hope to be around for years to come. Long Live the Pirates!!\n\nFor any of you that may wish to go another way with this as in being totally geniune with a geniune key i will always add updated links to my keys on here as well..A big thanks to you all..Please ENjoy!\n\nPlease Note: in the above tutorial that Line #4 and Line #6 i have removed the download links as they will be changing and once i list this torrent i will list the new links Below :)\nPlease seed!!\n\nLook for more quality ups from Halloweenpsyco\n\nPlease leave your comment for the next downloader.","torrent":{"xt":"urn:btih:dc0b83a0c0e34b53b8f6969a146e09ed8db4cd85","amp;dn":"Windows+8+Personalization+unlocker+and+Activator+All+in+one","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc0b83a0c0e34b53b8f6969a146e09ed8db4cd85","infoHashBuffer":{"type":"Buffer","data":[220,11,131,160,192,227,75,83,184,246,150,154,20,110,9,237,141,180,205,133]},"announce":[],"urlList":[]}}