{"title":"ANABOLICS - 10th Edition (Epub &amp; Mobi) Gooner","uid":11716917,"size":8395485,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd340d622e3b9c839f20deba71544cc47e503302&amp;dn=ANABOLICS+-+10th+Edition+%28Epub+%26amp%3B+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"GoonerTPB","files":2,"time":1424620311,"description":"Publisher: Molecular Nutrition; 10th Ed. edition (2010)\nLanguage: English\nISBN-10: 0982828012\nISBN-13: 978-0982828014\n\nThe #1 BESTSELLING anabolic reference guide is back with the 10th ed. William Llewellyn's ANABOLICS is the most comprehensive guide to performance-enhancing drugs ever written. This 800+ page monster encyclopedia covers it all, from steroids, to growth hormone, insulin, and just about every imaginable agent in-between. With over 900 medical citations, ANABOLICS cuts right to the science. You'll learn everything there is to know about this controversial subject, from one of the most trusted experts in the field. A few reasons why William Llewellyn's ANABOLICS remains the #1 Bestselling Anabolic Reference Guide worldwide: - Nearly 200 Pharmaceutical Compounds reviewed. - Graphs and Diagrams help visually explain the different properties of the performance drugs. - Extensive Side Effects discussion, with detailed explanations of the risks of anabolics, as well as effective prevention and harm reduction strategies. - Informative Steroid Cycling and Stacking sections help take the guesswork out of cycle construction. Maximize your benefits; minimize your costs and side effects. - More Counterfeits exposed than ever before! Includes a new chapter on Advanced Detection Techniques! - Dig into the science behind anabolics, with Steroid and Muscle Biochemistry sections that won't find in University textbooks. - Comprehensive Global Drug Availability Tables allow you to reference what anabolic steroids are sold around the world. - Approximately 3,000 Colour Photographs of legitimate, counterfeit, and underground drug products are at your fingertips. ANABOLICS is trusted because it is the most accurate and relevant guide. Whether you are interested in using these substances, or simply want to research them - this is THE must have","torrent":{"xt":"urn:btih:dd340d622e3b9c839f20deba71544cc47e503302","amp;dn":"ANABOLICS+-+10th+Edition+%28Epub+%26amp%3B+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd340d622e3b9c839f20deba71544cc47e503302","infoHashBuffer":{"type":"Buffer","data":[221,52,13,98,46,59,156,131,159,32,222,186,113,84,76,196,126,80,51,2]},"announce":[],"urlList":[]}}