{"title":"Astral Projection - Amazing Journeys Outside Your Body - Abhishe","uid":4413165,"size":2960277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de15f84ebe5f4ab82b5e89bc1e2598ada820e93d&amp;dn=Astral+Projection+-+Amazing+Journeys+Outside+Your+Body+-+Abhishe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"achumama","files":2,"time":1222368156,"description":"Astral Projection - Amazing Journeys Outside Your Body - Abhishek Agarwal\n\nIf you are one of the average people, you will probably brush off the concept of Astral Projection as mere fantast. But since you have purchased this book, I know you are not average. You believe, somewhere deep down in you heart, that this might be true. I am glad that you took this small decision to start this journey...a journey towards realization...a journey towards self-discovery.\n\nOne of the most difficult things about Astral Projection is making others &quot;believe&quot; that this is true. BUt for those who have experieced this reality, they know how real it is. No one can make them believe otherwise. They know that they can exist outside their physical body.\n\nIt is my sincere request to you not to read this book for entertainment purpose. I also ask you not to believe blindly whatever i have written in this book. But I want you to have an open mind. Start reading this book with a clean slate. Judge it by experiment. Devote some time to this wonderful topic. Practice. And with practice you will have belief. With belief, you will have experience. And with experience you will have conviction. An unshaken conviction that you are much more than your physical self.\n\nSo this is all I ask the reader to do. Experience it!\n\nIt will be my endeavor to give you as much of information possible, theory and practical, and at the same time, avoid too much technicalities, so that you can understand Astral Projection and experience it.\n\nI can promise the reading will be sheer delight! Hope you enjoy this blissful journey!\n\nAbhishek Agarwal.\n----------------------------------\n\nThis book have changed my life...\nI have 6 OBE experience till now after reading this book.\nWhen i read the book for the first time i got very interested in it, and i started doing meditation and all to reach that state but unfortunately i fell asleep. I think its not for a person like me. But during deep sleeping as usual i turned my body towards the side. At that moment i opened my eyes, as it is a sleepy state i closed my eyes again. But i remebered about the Astral Projection which i failed to do. thinking of that i tried the Rope Technique(Mentioned in this book) one more time in my mind....I heard a high freqency sound and its amplitude increased at a very high speed. Some kinds of feeling over my head and i'm out of my body. I felt no weight and i feel like i'm flowing but i can't see any things at that moment. After few other OBE experience i saw my room, now i feel it all like a dream.\n\nAt that moment i reaized that i'm not this body but the conciousness, i also noticed that during the time of astral travel we are like an observer who observes things without fear, angry, lust, etc...etc. All the negative aspects and emotions of our material nature will not be there (In dreams we see our decesed relatives and dead persons but when dreaming we talk with them without any fear, but its fearfull to see a dead person when we are awake, Like that in OBE we will be such a position). The soul is pure and divine\n\nI realized that even if the body is slain the soul is not slain - Bhagwad Gita\nMy outlook towards life have changed in a few months. \n\nI'm very thankful to Abhishek Agarwal for this book. I wish everyone to experience OBE. Its good for self realization.\n\nAstral Projeciton is Real.  \n\n.achumama.","torrent":{"xt":"urn:btih:de15f84ebe5f4ab82b5e89bc1e2598ada820e93d","amp;dn":"Astral+Projection+-+Amazing+Journeys+Outside+Your+Body+-+Abhishe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de15f84ebe5f4ab82b5e89bc1e2598ada820e93d","infoHashBuffer":{"type":"Buffer","data":[222,21,248,78,190,95,74,184,43,94,137,188,30,37,152,173,168,32,233,61]},"announce":[],"urlList":[]}}