{"title":"WinAce Archiver 2.69-serial incl","uid":4620352,"size":4045205,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e02ff01c1156b6d78d1b2ae087cc4ae5d3076696&amp;dn=WinAce+Archiver+2.69-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"jmb2012","files":2,"time":1231008473,"description":"WinAce - because sometimes, size does matter...\n\nWhen you want to compress your files, you should be looking for a tool that offers excellent performance in three categories: \ncompression ratio\ncompression speed\nease-of-use\n\n\nA compression tool that crunches the last free bit from your data, but takes twice to ten times longer for compressing and - even worse - for extracting your data probably will not work for you - or your customers. \n\nOn the other hand, a compression tool that deflates your files as quick as lightning but leaves a lot of &quot;air&quot; in the compressed file will not take you far either. \t\n\nClick on screenshot to zoom in\n\n\nSo you are most likely looking for a versatile tool that \nblends both compression speed and power in an intuitive interface \ngives you quick and convenient access to your archives during your everyday work \nbut also allows you to use all the extra features for professional file distribution\n- like password protection, disk-spanning archives or the possibility to create self-extracting archives? \n\n\nWell, look no further. We would like to invite you to take a closer look at WinAce, the new companion for your archiving needs.\n\nWinAce features\n\nWinAce is not just another archiving shell. With it's own powerful compression format ACE and built-in support for other popular compression types like ZIP, RAR and MS-CAB (to name a few), WinAce could actually become the only archiver you need. \n\nThe feature list of WinAce includes: \ncompression of the following formats: ACE, ZIP, LHA, MS-CAB, JAVA JAR \ndecompression of: ACE, ZIP, LHA, MS-CAB, RAR, ARC, ARJ, GZip, TAR, ZOO, JAR \nmulti-volume (disk spanning) archives for ACE, ZIP, CAB \nself-extracting archives (SFX) for ACE and ZIP \npassword encryption &amp; recovery records for data protection \nIntegrity check for ACE, ZIP, LHA, MS-CAB, RAR, ARC, ARJ, GZip, TAR, ZOO, JAR \nRepair functionality for ACE and ZIP archives \nAuthenticity verification for ACE archives \ncomment files in HTML, ANSI or ASCII for ACE- and ZIP-Archives \nfull command line access (compatible with DOS ACE) \ndetailed information for all archive types \nQuickviewer for graphic files, Word Documents, HTML pages and ASCII files \nfull drag&amp;drop support \ncomplete file-management (copying, moving and deleting of files and directories) \noptimization of existing archives \naccess to your archives in Windows Explorer and via the context menu (shell extension) \ntable of contents in the &quot;Properties&quot; panel of ACE and ZIP files (shell extension) \n... and so much more!\n\nTitle:\tWinAce 2.69\nFilename:\twace269i.exe\nFile size:\t3.86MB (4,042,444 bytes)\nRequirements:\tWindows (All Versions)\n\n","torrent":{"xt":"urn:btih:e02ff01c1156b6d78d1b2ae087cc4ae5d3076696","amp;dn":"WinAce+Archiver+2.69-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e02ff01c1156b6d78d1b2ae087cc4ae5d3076696","infoHashBuffer":{"type":"Buffer","data":[224,47,240,28,17,86,182,215,141,27,42,224,135,204,74,229,211,7,102,150]},"announce":[],"urlList":[]}}