{"title":"Zoom: How Everything Moves: From Atoms and Galaxies (2014)","uid":10526331,"size":2492066,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e187bda12150becea26ba180919d9c09fab71c1a&amp;dn=Zoom%3A+How+Everything+Moves%3A+From+Atoms+and+Galaxies+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"bookzilla","files":1,"time":1405044404,"description":"Zoom: How Everything Moves: From Atoms and Galaxies to Blizzards and Bees\n\nepub\n\nFrom the speed of light to moving mountains--and everything in between--ZOOM explores how the universe and its objects move.\n\n If you sit as still as you can in a quiet room, you might be able to convince yourself that nothing is moving. But air currents are still wafting around you. Blood rushes through your veins. The atoms in your chair jiggle furiously. In fact, the planet you are sitting on is whizzing through space thirty-five times faster than the speed of sound.\n\n Natural motion dominates our lives and the intricate mechanics of the world around us. In ZOOM, Bob Berman explores how motion shapes every aspect of the universe, literally from the ground up. With an entertaining style and a gift for distilling the wondrous, Berman spans astronomy, geology, biology, meteorology, and the history of science, uncovering how clouds stay aloft, how the Earth's rotation curves a home run's flight, and why a mosquito's familiar whine resembles a telephone's dial tone.\n\n For readers who love to get smarter without realizing it, ZOOM bursts with science writing at its best.\n","torrent":{"xt":"urn:btih:e187bda12150becea26ba180919d9c09fab71c1a","amp;dn":"Zoom%3A+How+Everything+Moves%3A+From+Atoms+and+Galaxies+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e187bda12150becea26ba180919d9c09fab71c1a","infoHashBuffer":{"type":"Buffer","data":[225,135,189,161,33,80,190,206,162,107,161,128,145,157,156,9,250,183,28,26]},"announce":[],"urlList":[]}}