{"title":"M.I.A. - Matangi (2013) [FLAC]","uid":9135510,"size":428635182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e271a043fc1021ffe2b2cf90a07e26b3a4054a55&amp;dn=M.I.A.+-+Matangi+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"politux","files":-1,"time":1383406803,"description":"\n  M.I.A. - Matangi (2013) [FLAC]\n\n  Genre: Hip-Hop, Electronic\n  Styles: Alternative Dance\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 900 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Karmageddon \n  02 Matangi \n  03 Only 1 U \n  04 Warriors \n  05 Come Walk With Me \n  06 aTENTion \n  07 Exodus (feat. The Weeknd) \n  08 Bad Girls \n  09 Boom Skit \n  10 Double Bubble Trouble \n  11 Y.A.L.A. \n  12 Bring the Noize\n  13 Lights \n  14 Know It Ain't Right\n  15 Sexodus (feat. The Weeknd) \n\n  If you read a lot about new music on the web, odds are pretty good that, at some point between the September 2004 release of &quot;Galang&quot; and the March 2005 release of Arular, you were struck with the urge to turn your computer off or maybe even heave it out of a nearby window. If you don't read a lot about new music on the web, the preceding sentence indicates how bewildering and draining the chatter about M.I.A. became. Arular, M.I.A.'s first album, leaked well before its official release, allowing journalists and downloaders plenty of time to dissect it and bat ideas back and forth -- taking in the sounds, words, and absolutely all of the context -- before average music fans were able to develop their own opinions.\n\n  Maya Arulpragasam spent the early years of her life in a number of places. She moved from London, England, to her parents' native Sri Lanka at the age of six months, only to relocate to Madras, India. During a return stay in Sri Lanka, the civil war taking place within the country escalated to the point where Arulpragasam began to lose family members and friends. She didn't see her father -- a devout and active separatist as part of the Tamil rebellion, which has clashed with the Sinhalese majority -- often throughout these years, but her life stabilized once she and the rest of her family were able to make it back to London.\n\n  As a student, Arulpragasam became involved in the arts and published a monogram book of her paintings titled M.I.A. and heavily influenced by the Tamil rebellion. She later connected with Elastica, providing the photography and graphics for the group's second album, and she shot footage during their American tour. Elastica's support act, Peaches, introduced her to the Roland MC-505, a sequencer she became familiar with after returning home. Steve Mackey (Pulp) and Ross Orton became involved after hearing a demo; they made adjustments to &quot;Galang,&quot; a song that was then pressed into 500 copies and released, under the name M.I.A., by the Showbiz label. It didn't take long for the song -- a bold, righteous amalgamation of hip-hop, electro, dancehall, grime, and baile funk -- to make an impact with DJs. She wound up signing a contract with XL, which re-released the single and, eventually, her debut album Arular in 2005. Anticipation for the release was considerable, only heightened by the Piracy Funds Terrorism mixtape she put together with DJ Diplo.\n\n  Her second album, Kala, was released in 2007 and was recorded while she spent time in numerous countries. M.I.A. produced most of its tracks with Switch; Blaqstarr, Diplo, and Timbaland also contributed. One single from the album, &quot;Paper Planes,&quot; became a surprise hit in summer 2008 after it was used in trailers for the film Pineapple Express; it eventually reached the Top Ten. The soundtrack for the Academy Award-winning Slumdog Millionaire also featured M.I.A.'s music; the release featured new material from the artist and was the first disc issued on her N.E.E.T. label. ///Y/, the third M.I.A. album, was released in 2010. After spending two years preparing her fourth studio album, Matangi, she released the single &quot;Bad Girls, a reworked version of a song that debuted on her Vicki Leekx mixtape and featured production by Danja, in early 2012. Around that time, M.I.A. performed &quot;Give Me All Your Luvin'&quot; with Madonna and Nicki Minaj at Super Bowl XLVI's halftime show; during the performance, she extended her middle finger at the camera. A month later, the NFL responded by suing her for $1.5 million, claiming that she breached her contract and tarnished the organization's image. Matangi was originally scheduled for release at the end of 2012, but was delayed until the following year. Two more singles, &quot;Bring the Noize&quot; and &quot;Come Walk with Me,&quot; were released in June and September 2013 respectively. Featuring production by Switch and Surkin, Matangi arrived that November.","torrent":{"xt":"urn:btih:e271a043fc1021ffe2b2cf90a07e26b3a4054a55","amp;dn":"M.I.A.+-+Matangi+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e271a043fc1021ffe2b2cf90a07e26b3a4054a55","infoHashBuffer":{"type":"Buffer","data":[226,113,160,67,252,16,33,255,226,178,207,144,160,126,38,179,164,5,74,85]},"announce":[],"urlList":[]}}