{"title":"Cloud Computing- Theory and Practice, 2013 [PDF]~StormRG~","uid":9508178,"size":13905879,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2ac725ed98218a1099a46aa7a41ad6d1eea750b&amp;dn=Cloud+Computing-+Theory+and+Practice%2C+2013+%5BPDF%5D%7EStormRG%7E&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"steelballz","files":-1,"time":1390354107,"description":"Description\nCloud Computing - Theory and Practice\nAuthor: Dan C. Marinescu\nPublished: June 7, 2013\nPublisher: Morgan Kaufmann\nISBN: 0124046274\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\nimage\nCover from actual book file\n\n\nBook Description\nPublication Date: June 7, 2013 | ISBN-10: 0124046274 | ISBN-13: 978-0124046276 | Edition: 1\n\nCloud Computing: Theory and Practice provides students and IT professionals with an in-depth analysis of the cloud from the ground up. Beginning with a discussion of parallel computing and architectures and distributed systems, the book turns to contemporary cloud infrastructures, how they are being deployed at leading companies such as Amazon, Google and Apple, and how they can be applied in fields such as healthcare, banking and science. The volume also examines how to successfully deploy a cloud application across the enterprise using virtualization, resource management and the right amount of networking support, including content delivery networks and storage area networks. Developers will find a complete introduction to application development provided on a variety of platforms.\n\nLearn about recent trends in cloud computing in critical areas such as: resource management, security, energy consumption, ethics, and complex systems\nGet a detailed hands-on set of practical recipes that help simplify the deployment of a cloud based system for practical use of computing clouds along with an in-depth discussion of several projects\nUnderstand the evolution of cloud computing and why the cloud computing paradigm has a better chance to succeed than previous efforts in large-scale distributed computing\n\n","torrent":{"xt":"urn:btih:e2ac725ed98218a1099a46aa7a41ad6d1eea750b","amp;dn":"Cloud+Computing-+Theory+and+Practice%2C+2013+%5BPDF%5D%7EStormRG%7E","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2ac725ed98218a1099a46aa7a41ad6d1eea750b","infoHashBuffer":{"type":"Buffer","data":[226,172,114,94,217,130,24,161,9,154,70,170,122,65,173,109,30,234,117,11]},"announce":[],"urlList":[]}}