{"title":"A Chinese Bestiary - Strange Creatures from the Guideways Throug","uid":10889289,"size":62608423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2bc426a284485c90ff760fbc5341999a163d7df&amp;dn=A+Chinese+Bestiary+-+Strange+Creatures+from+the+Guideways+Throug&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"STBGD","files":-1,"time":1409089268,"description":"A Chinese Bestiary - Strange Creatures from the Guideways Through Mountains and Seas by Richard E. Strassberg by Richard E. Strassberg\nUniversity of California Press; 1 edition | Pages: 360 | PDF | 59,7 MB\n\nA Chinese Bestiary presents a fascinating pageant of mythical creatures from a unique and enduring cosmography written in ancient China. The Guideways through Mountains and Seas, compiled between the fourth and first centuries b.c.e., contains descriptions of hundreds of fantastic denizens of mountains, rivers, islands, and seas, along with minerals, flora, and medicine. The text also represents a wide range of beliefs held by the ancient Chinese. Richard Strassberg brings the Guideways to life for modern readers by weaving together translations from the work itself with information from other texts and recent archaeological finds to create a lavishly illustrated guide to the imaginative world of early China. Unlike the bestiaries of the late medieval period in Europe, the Guideways was not interpreted allegorically; the strange creatures described in it were regarded as actual entities found throughout the landscape. The work was originally used as a sacred geography, as a guidebook for travelers, and as a book of omens.","torrent":{"xt":"urn:btih:e2bc426a284485c90ff760fbc5341999a163d7df","amp;dn":"A+Chinese+Bestiary+-+Strange+Creatures+from+the+Guideways+Throug","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2bc426a284485c90ff760fbc5341999a163d7df","infoHashBuffer":{"type":"Buffer","data":[226,188,66,106,40,68,133,201,15,247,96,251,197,52,25,153,161,99,215,223]},"announce":[],"urlList":[]}}