{"title":"J.R.R. Tolkien's Sanctifying Myth: Understanding Middle-Earth","uid":11851526,"size":1122163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e305937c922a86a227331e3e8047b4e213609a43&amp;dn=J.R.R.+Tolkien%27s+Sanctifying+Myth%3A+Understanding+Middle-Earth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"ancapcatholic","files":4,"time":1430105886,"description":"J.R.R. Tolkien's Sanctifying Myth: Understanding Middle-Earth (EPUB, MOBI)\n\nPeter Jackson's film version of the Lord of the Rings trilogy, and the accompanying proliferation of Rings-related paraphernalia, has once again brought the work of J.R.R. Tolkien to a popular audience. There are, however, few full and accessible treatments of the religious vision permeating Tolkien's influential works. Bradley Birzer has remedied that with his fresh study, J.R.R. Tolkien's sanctifying Myth: understanding Middle-earth. In it Birzer explicates the religious symbolism and significance of Tolkien's Middle-earth stories. More broadly, Birzer situates Tolkien within the Christian humanist tradition represented by Thomas More and T. S. Eliot, Dante and C. S. Lewis. He argues that through the genre of myth Tolkien is able to provide a sophisticated--and appealing--social and ethical world view.\n\n\nThe past year has brought a bumper crop of spirituality-of-Tolkien books, no doubt fueled by the heightened interest generated by the new film series. Birzer's book differs somewhat from recent volumes on the Christian themes to be found in The Lord of the Rings, including Mark Eddy Smith's Tolkien's Ordinary Virtues and Kurt Bruner and Jim Ware's Finding God in the Lord of the Rings. Tolkien's spirituality, says Birzer, was not generically Christian but specifically Roman Catholic: the lembas that sustains the company represents the Eucharist; Galadriel and Elbereth exemplify traits of the Virgin Mary; and the company looks to the restoration of a kingdom similar to the Holy Roman Empire. The best chapter of Birzer's study explores how Tolkien's &quot;sanctifying myth&quot; was informed by such Roman Catholic beliefs; Tolkien told a Jesuit friend, for example, that the trilogy was &quot;a fundamentally religious and Catholic work; unconsciously so at first, but consciously in the revision.&quot; Other chapters place Tolkien more generally within the usual canon of 20th-century Christian humanists, including his on-again, off-again friend, C. S. Lewis. Birzer is a fine writer who does a wonderful job of integrating primary sources such as letters, reminiscences and journals into his text; he also includes glimpses of unpublished materials, such as a scuttled LOTR chapter about Sam, as well as Tolkien's little-known attack on Lewis, &quot;The Ulsterior Motive.&quot; This is, overall, a fine tribute to the man who, Birzer suggests, &quot;resuscitated the notion that the fantastic may tell us more about reality than do scientific facts.&quot; - Publisher's Weekly\n\n\nTolkien said that The Lord of the Rings is a Catholic book, but commentators have shied away from writing about its Catholicism. After all, he also said it wasn't an allegory, so you don't need to know the Catholicism to understand it--right? Perhaps, but Tolkien hoped the book would prove a stealth evangelizer, arguing a Catholic worldview in its setting, characterizations, and plot. Birzer reveals The Lord's Catholicism in five riveting chapters. Middle-Earth is a subcreation, he says, resembling real Creation so that a salvific myth of heroic virtue triumphing over dire evil may be played out in it. The sapient beings (hobbits, elves, etc.) in it form a hierarchy surmounted by God, and evil in it is, as in classical Christianity, the result of willful separation from God. When evil is finally vanquished, Middle-Earth will be paradisaical, but as God's handiwork, it is already profoundly good, and its pastoralism rebukes the secularism, centralization, industrialism, and mechanization (only the evil build machines in Middle-Earth) that Tolkien despised. Essential reading for all Tolkien enthusiasts. - Ray Olson, Booklist\n\n---\n\nPlease seed!\n\nMore:  &lt;a href=&quot;\nhttps://thepiratebay.se/user/ancapcatholic/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/ancapcatholic/&lt;/a&gt;\n\nTips:  &lt;a href=&quot;\nhttps://bit.co.in/ancapcatholic&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://bit.co.in/ancapcatholic&lt;/a&gt;\n\nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–„â–„ â–ˆâ–€â–„â–€ â–€   â–„â–„â–€â–„â–ˆâ–„â–„â–€â–ˆ â–ˆâ–€â–€â–€â–€â–€â–ˆ\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ  â–„â–ˆâ–ˆ â–€â–€ â–„â–„ â–€â–„â–€â–„ â–€ â–„â–„â–€ â–ˆ â–ˆâ–ˆâ–ˆ â–ˆ\nâ–ˆ â–€â–€â–€ â–ˆ â–„â–€â–ˆâ–„â–ˆ â–€â–ˆâ–„â–ˆâ–„ â–ˆâ–ˆ â–ˆâ–€ â–„â–€  â–ˆ â–€â–€â–€ â–ˆ\nâ–€â–€â–€â–€â–€â–€â–€ â–ˆâ–„â–€â–„â–€ â–€ â–€ â–ˆâ–„â–€â–„â–€â–„â–ˆ â–€ â–€ â–€â–€â–€â–€â–€â–€â–€\nâ–„   â–ˆâ–ˆâ–€â–€â–„â–€ â–€â–ˆâ–„â–„â–€â–€ â–€  â–„ â–ˆâ–€  â–€â–ˆ â–€â–€â–„ â–„â–ˆ \nâ–€ â–ˆâ–ˆ  â–€â–ˆâ–ˆâ–ˆâ–€â–ˆâ–„â–ˆâ–€â–ˆâ–€â–ˆâ–ˆâ–€â–ˆâ–ˆâ–ˆâ–ˆ â–€ â–ˆ â–€â–„â–€ â–€â–ˆâ–„ \nâ–ˆâ–ˆ â–€â–ˆâ–€â–€ â–€â–€â–„â–„â–ˆâ–ˆâ–€â–€ â–€â–€ â–€â–€â–ˆâ–„  â–€â–€â–„â–€â–€ â–„â–€â–€â–ˆâ–ˆ\nâ–ˆâ–„ â–ˆâ–„â–ˆâ–€â–„â–ˆ â–€â–ˆ â–ˆâ–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ   â–€â–„â–„â–ˆâ–€â–„â–€â–„ â–„\n â–„â–ˆ  â–„â–€â–ˆâ–„â–ˆâ–ˆâ–€â–€â–„â–ˆ  â–€â–€â–€â–€ â–„â–ˆâ–€â–ˆ â–„â–€â–ˆâ–ˆâ–€â–ˆ â–ˆ â–€\nâ–„â–„â–€â–„â–€ â–€â–€ â–„    â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆ â–€ â–ˆ â–ˆâ–„ â–„â–„â–ˆâ–„â–„\nâ–€â–ˆâ–„â–„  â–€â–€â–€ â–ˆâ–„â–ˆâ–„â–ˆ  â–ˆâ–ˆâ–ˆâ–ˆ  â–ˆâ–„â–ˆâ–„â–„â–„â–€â–€â–€â–„â–€â–€â–„ \nâ–€â–ˆâ–ˆ â–€ â–€â–€â–„â–„ â–„â–ˆâ–ˆâ–„â–„ â–„â–„ â–„â–„â–ˆâ–ˆâ–„  â–ˆâ–„â–€â–€â–„  â–ˆâ–€ \nâ–„â–ˆ â–€â–„â–€â–€â–„ â–€â–ˆâ–„â–„â–ˆâ–„â–ˆâ–„â–ˆâ–ˆâ–„â–ˆâ–„â–€ â–„â–ˆâ–ˆâ–€â–„â–„â–€ â–„ â–ˆâ–ˆâ–€\n  â–„â–€â–„â–€â–€â–ˆâ–ˆâ–€â–ˆâ–„â–€ â–€ â–„â–„ â–ˆâ–€â–ˆâ–ˆâ–ˆâ–€ â–„â–ˆ  â–ˆâ–€ â–€â–„â–€ \nâ–€â–€ â–€â–€ â–€ â–ˆâ–„ â–€â–ˆâ–„â–„â–„ â–„â–„â–€â–ˆâ–€ â–„â–„â–ˆâ–„ â–ˆâ–€â–€â–€â–ˆâ–€â–ˆâ–„ \nâ–ˆâ–€â–€â–€â–€â–€â–ˆ â–ˆâ–€ â–€â–ˆâ–„ â–€â–ˆ â–ˆâ–ˆâ–ˆâ–„â–ˆâ–€ â–€â–ˆ â–ˆ â–€ â–ˆ â–ˆâ–ˆâ–„\nâ–ˆ â–ˆâ–ˆâ–ˆ â–ˆ â–€ â–„â–„â–„â–„â–„â–€â–ˆâ–€â–€â–„â–ˆâ–„â–€â–€â–€â–€ â–„â–€â–ˆâ–ˆâ–€â–ˆâ–€â–€â–€ \nâ–ˆ â–€â–€â–€ â–ˆ  â–„â–€â–„â–€â–ˆâ–„â–ˆâ–„â–„â–€ â–€â–ˆâ–€ â–„â–€â–„â–ˆ â–€â–€â–€ â–€â–„â–ˆ \nâ–€â–€â–€â–€â–€â–€â–€  â–€ â–€ â–€â–€â–€â–€â–€â–€â–€ â–€ â–€   â–€ â–€  â–€  â–€â–€","torrent":{"xt":"urn:btih:e305937c922a86a227331e3e8047b4e213609a43","amp;dn":"J.R.R.+Tolkien%27s+Sanctifying+Myth%3A+Understanding+Middle-Earth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e305937c922a86a227331e3e8047b4e213609a43","infoHashBuffer":{"type":"Buffer","data":[227,5,147,124,146,42,134,162,39,51,30,62,128,71,180,226,19,96,154,67]},"announce":[],"urlList":[]}}