{"title":"Thelonious Monk - Plays Duke Ellington","uid":9601863,"size":212551704,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e321513acd8e4f3b41ae16a1568656444e319a1d&amp;dn=Thelonious+Monk+-+Plays+Duke+Ellington&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"jamezua","files":-1,"time":1392132767,"description":"Thelonious Monk (piano/arranger) began his illustrious relationship with Riverside Records on the pair of July 21 and 27, 1955, dates needed to complete the eight sides for Plays Duke Ellington (1955). Monk commands a trio that also presents the talents of Oscar Pettiford (bass) and Kenny Clarke (drums) on all the tracks sans &quot;Solitude,&quot; which appropriately enough features an unaccompanied piano. The delicacy and inherently intricate melodies that Duke Ellington is best known for are perfectly matched to Monk's angular and progressive interpretations. The combo are comfortable behind the pianist who remains somewhat subdued, if not arguably tentative, during the opening of &quot;It Don't Mean a Thing (If It Ain't Got That Swing),&quot; although by his solo, Monk eases into some nice give and take with a playful Pettiford, whose steady bounce undeniably congeals the unit's sound. Monk takes the refined grace of &quot;Sophisticated Lady&quot; into a virtually unsurpassed strata as his seemingly disjointed notes organically coalesce into a simply stunning, yet stark introduction, with Clarke's understated backbeat allowing room for Monk to embellish and thoroughly adorn. The dark optimism of &quot;Black and Tan Fantasy&quot; stands out as another perfect combination of music and musician. &quot;I Let a Song Go Out of My Heart&quot; is a fun little romp with Monk taking some tricky and rhythmically unanticipated side trips throughout his nimble and rollicking leads. &quot;Caravan&quot; is a gem as Clarke's sinuous trapwork becomes a perfect foil for Pettiford's buoyant basslines. It also reels in Monk's animated keyboard antics. Plays Duke Ellington is a recommended title for all dimension of jazz enthusiast. However, Monk and Ellington aficionados may rate it slightly higher. \n\nTracks:\n\n1. It Don't Mean A Thing (If It Ain't Got That Swing)\t4:42\t\n2. Sophisticated Lady\t                                4:31\t\n3. I Got It Bad (And That Ain't Good)\t                5:57\t\n4. Black And Tan Fantasy\t                        3:28\t\n5. Mood Indigo\t                                        3:16\t\n6. I Let A Song Go Out Of My Heart\t                5:43\t\n7. Solitude\t                                        3:45\t\n8. Caravan                                              5:56","torrent":{"xt":"urn:btih:e321513acd8e4f3b41ae16a1568656444e319a1d","amp;dn":"Thelonious+Monk+-+Plays+Duke+Ellington","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e321513acd8e4f3b41ae16a1568656444e319a1d","infoHashBuffer":{"type":"Buffer","data":[227,33,81,58,205,142,79,59,65,174,22,161,86,134,86,68,78,49,154,29]},"announce":[],"urlList":[]}}