{"title":"Hardtied--Red Handed  Ruby Red High","uid":15543016,"size":2254475228,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e398781d535c49d7b50133ae1f41e4de9f39b67a&amp;dn=Hardtied--Red+Handed++Ruby+Red+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"merzedes","files":1,"time":1470939166,"description":"Red Handed | Ruby Red\r\n\r\nAugust 3, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBound Bitch Gets Found and Fucked \r\n \r\nRuby Red is just relaxing in the comfort of her own home when she hears a noise from downstairs and goes to check it out. When she gets to her living room she finds a woman dressed in black trying to steal her things. She makes a break for the door to get help but the burglar is too fast and chokes her unconscious before she can reach the outside. When Ruby wakes up she is gagged with tape and her own panties and hogtied on her floor, but the woman is gone so she is safe. Or so she thinks.\r\n\r\nWhile walking down the street, O.T. hears a commotion from inside the house and goes to check up on it. When he finds Ruby tied up on the ground he at first decides to help her out, but then his urges take over and he decides he deserves a little reward for being a good Samaritan. He takes advantage of the position she is in and starts paddling her feet with a rubber spatula and kissing her neck and face. He will help her out of her bondage soon, but for now he is going to have some fun.\r\n\r\nO.T. moves her to the kitchen and ties Ruby up on the counter where he has better access to her pussy. Then he fingers her and vibrates her clit with the celebrator. Who could blame him? He just can't control himself. And after a few minutes of being finger fucked, vibrated, and choked by O.T.'s neck rope, neither can Ruby. He has her mind and body fighting against each other, her mind saying no, but her body screaming yes. She starts squirting all over her nice marble counter. Once O.T. is satisfied with how he's used Ruby, he abandons his original plan and leaves her tied up in the kitchen for the burglar to come back and finish the job. \r\n \r\nScreens \nhttp://www.hardtied.com/hogtied/bondage/trailer.php?y=2016&amp;p=08_03rred&amp;u=Hardtied-Ruby-Red-Red-Handed\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:e398781d535c49d7b50133ae1f41e4de9f39b67a","amp;dn":"Hardtied--Red+Handed++Ruby+Red+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e398781d535c49d7b50133ae1f41e4de9f39b67a","infoHashBuffer":{"type":"Buffer","data":[227,152,120,29,83,92,73,215,181,1,51,174,31,65,228,222,159,57,182,122]},"announce":[],"urlList":[]}}