{"title":"[Clips4Sale] Jodi West (Inside Mother) 720p [Roleplay]","uid":13552441,"size":1045165590,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e4e5e439b091233223fdcc19641ce6246b02a778&amp;dn=%5BClips4Sale%5D+Jodi+West+%28Inside+Mother%29+720p+%5BRoleplay%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"ImgSnaps","files":1,"time":1455564507,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/G7H\r\n \nhttp://imgsnaps.com/image/G7N\r\n\r\nWHEN BOTH MOTHER AND SON ARE GETTING READY FOR THEIR DATES TONIGHT, THEY HAVE NO IDEA IT'S GOING TO BE WITH EACH OTHER!\r\n\r\nMother speaks quietly on the phone with her friend in confidence. &quot;And nobody ever found out&quot; She asks, as she slips on her dress for the evenings secret rendezvous.\r\n\r\nMother had put an ad on an internet &quot;hookup&quot; site, just to see what would happen. When a young man with a piece of manhood much larger then her husbands replied in interest, she was flattered. She never had envisioned it going this far, but there she was, dressing for the hookup.\r\n\r\nNervously she checks everything. She got a disposable phone for the young man to contact her on, so that he did not have her real number. She never sent pictures of her face, so he could not identify her later, and the we going to meet for &quot;just sex&quot; and that's it. It should be clean, and no way her husband could find out.\r\n\r\nIt's not like he would care anyway. It had been so long since he had paid any attention to her in that way. She really missed the intimacy of sex.\r\n\r\nAs she is getting ready, she hears Tyler coming up the stairs. As he finishes his phone call with his friend, also talking of his evening, he knocks on the bedroom door.\r\n\r\n&quot;Come on in&quot; Mother says, and greats him. It seams that the young man wants to use his father's car for a date tonight. Mother has never met the woman before, but he wants to impress her. Mother is too wrapped up in he thought to be concerned. &quot;Go ahead, the keys are downstairs&quot; Mother says &quot;Just don't be too late&quot;\r\n\r\nTyler also has a date he has found on the internet. It appears he has a liking for the older women, and he found one that just wants to hook up! This should be a great night, he just has to call the number she gave him to find where they are meeting.\r\n\r\nTyler rings the number, and Mother asks him to take his call out of her room, because she has to answer her phone also....\r\n\r\nWhen they both say hello to the partner on the other side of the call, they realize. The call has been to each other! Their dates for the &quot;Hook Up&quot; are with EACH OTHER!\r\n\r\nKnowing that this need will not go away, Mother and Son decide to come to an arrangement. After Tyler forces himself upon her, knowing Mother needs this as much as he does, she gives in to the thought of his huge Manhood!\r\n\r\nHer only concern is that as Tyler gets close to the point and can't hold back from shooting his seed any longer, she needs him to not come inside her. But it seams that's all he wants! Can she stop him from cuming INSIDE MOTHER?! Or is that what she REALLY WANTS! It's okay for him to shoot a few thick streams on her, but he needs to put some of his hot semen in her waiting pussy! STARRING JODI WEST AND TYLER PAGE. A VERY HOT SCENE WITH HOT SEDUCTION AND STEAMY PASSION","torrent":{"xt":"urn:btih:e4e5e439b091233223fdcc19641ce6246b02a778","amp;dn":"%5BClips4Sale%5D+Jodi+West+%28Inside+Mother%29+720p+%5BRoleplay%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4e5e439b091233223fdcc19641ce6246b02a778","infoHashBuffer":{"type":"Buffer","data":[228,229,228,57,176,145,35,50,35,253,204,25,100,28,230,36,107,2,167,120]},"announce":[],"urlList":[]}}