{"title":"ACDC - Who Made Who (1986) WMA320","uid":6085133,"size":124840934,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e514549977aa4e60a7c5acc99b0a371578e44548&amp;dn=ACDC+-+Who+Made+Who+%281986%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1294293134,"description":"AC/DC's 1986 release entitled &quot;Who Made Who&quot; is actually the music from the soundtrack &quot;Maximim Overdrive&quot; written by Stephen King. The entire soundtrack's music was provided by AC/DC which was ideal for this movie,which was about machines taking over, hence depicted in the song &quot;Who Made Who&quot;. There are some excellent rocker's here pulled from the various AC/DC catalog (the several exceptions being the title song &quot;Who Made Who&quot;, &quot;D.T.&quot; and &quot;Chase The Ace&quot; which made their debut on this album) such as &quot;Hells Bells&quot; and &quot;You Shook Me All Night Long&quot; (from Back In Black), &quot;Sink The Pink&quot; and &quot;Shake Your Foundations&quot; (from Fly On The Wall),&quot;Ride On&quot; (from Dirty Deeds Done Dirt Cheap)and &quot;For Those About To Rock (We Salute You)&quot; (from the album For Those About To Rock...). I purchased this cd just for the three above mentioned songs &quot;Who Made Who&quot;, &quot;D.T.&quot; and &quot;Chase The Ace&quot;, the last two are ... kicking instrumental rockers and are unique to this album (or cd in this case). Those of you who remember watching &quot;Maximum Overdrive&quot; will instantly have flashbacks when hearing these three songs. The song &quot;Who Made Who&quot; opens the movie with an awesome car collision due to a drawbridge opening on it's own as cars are lined up on top. Total chaos erupts as the bridge opens and cars crash into one another and a motorcylist and car plunge into the river below. Also, the song &quot;Chase The Ace&quot; is played during a a car chase scene where a Mack truck driving with no one at the wheel, continues to rear end a newlywed couple's car until the truck ends up going over an embankment and going up in flames. &quot;D.T.&quot; is played as a young boy rides his bike down a neighborhood street and sprinklers and a lawnmower seem to have a mind of their own and go on for no apparent reason. This newly remastered cd is ten times better than it's non-remastered version, with the volume increased, the mid-range and bottom end pumped up as well. The digipack that houses the cd is attractive and there's also a fifteen page booklet enclosed that has information about the soundtrack &quot;Maximum Overdrive&quot;, the making of &quot;Who Made Who&quot; and color photos of the band. This is a must have for all AC/DC lovers and fans of 80's rock. Highly Recommended! \n\nby highway_star\n\nTRACKLIST:\n\n01 - Who Made Who.wma                                            \n02 - You Shook Me All Night Long.wma                             \n03 - D.T..wma                                                    \n04 - Sink The Pink.wma                                           \n05 - Ride On.wma                                                 \n06 - Hells Bells.wma                                             \n07 - Shake Your Foundations.wma                                  \n08 - Chase The Ace.wma                                           \n09 - For Those About To Rock.wma \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:e514549977aa4e60a7c5acc99b0a371578e44548","amp;dn":"ACDC+-+Who+Made+Who+%281986%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e514549977aa4e60a7c5acc99b0a371578e44548","infoHashBuffer":{"type":"Buffer","data":[229,20,84,153,119,170,78,96,167,197,172,201,155,10,55,21,120,228,69,72]},"announce":[],"urlList":[]}}