{"title":"Clinical Manual of Cultural Psychiatry, 2E [PDF][StormRG]","uid":11890318,"size":2230483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e54cd4798082a43fba4bf563ea83526675f0a758&amp;dn=Clinical+Manual+of+Cultural+Psychiatry%2C+2E+%5BPDF%5D%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"0xmovva","files":2,"time":1430978020,"description":"TITLE/EDITION Clinical Manual of Cultural Psychiatry\nBy: Russell F. Lim \nPaperback: 630 pages\nPublisher: American Psychiatric Publishing; 2nd edition (October 25, 2014)\nLanguage: English\nISBN-10: 158562439X\nISBN-13: 978-1585624393\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nThe interaction of culture and mental illness is the focus of the Clinical Manual of Cultural Psychiatry, which is designed to help mental health clinicians become culturally competent and skilled in the treatment of patients from diverse backgrounds. The product of nearly two decades of seminar experience, the book teaches clinicians when it is appropriate to ask &quot;Is what I am seeing in this patient typical behavior in his or her culture?&quot; The ability to see someone else's worldview is essential for working with ethnic minority and culturally diverse patients, and the author, who designed the course that was this handbook's precursor, has expanded the second edition to take into account shifting demographics and the changing culture of mental health treatment. The content of the new edition has been completely updated, expanded to include new material, and enhanced by innovative features that will prove helpful for mental health clinicians as they encounter diverse patient populations. * The new chapter on women reflects the fact that mental health disparities extend beyond ethnic minorities. Women have significantly higher rates of posttraumatic stress disorder and affective disorders, for example, yet research on women has been limited largely to the relationship between reproductive functioning and mental health. * Two new chapters address the alarming number of unmet mental health needs that lesbian, gay, bisexual, and transgender patients suffer from. These chapters emphasize the need for mental health providers and policy makers to remedy these disparities.* A new chapter has been added to help clinicians determine the role religious and spiritual beliefs play in psychological functioning, because religious and spiritual beliefs have been found to have both positive and negative effects on mental health.* The newly introduced DSM-5(R) Cultural Formulation Interview (CFI) is addressed in the book's introduction and is included in its entirety, along with an informant module, 12 supplementary modules, and guidelines for their use in a psychiatric assessment. In addition, the reader has access to videotaped examples using simulated patients to illustrate practical application of the DSM-5(R) Outline for Cultural Formulation and CFI.* Extensive information on ethnopsychopharmacology, reviewing clinical reports of ethnic variation with several different classes of psychotropic medications and examining the relationship of pharmacogenetics, ethnicity, and environmental factors to pharmacologic treatment of minorities. The book updates coverage of African American, Asian American, Latino/Hispanic, and Native American/Alaskan Native cultures as they relate to mental health issues while retaining the nuanced approach that was so effective in the first edition. Course-tested and DSM-5(R) compatible throughout, the Clinical Manual of Cultural Psychiatry is a must-read for clinicians in our diverse era","torrent":{"xt":"urn:btih:e54cd4798082a43fba4bf563ea83526675f0a758","amp;dn":"Clinical+Manual+of+Cultural+Psychiatry%2C+2E+%5BPDF%5D%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e54cd4798082a43fba4bf563ea83526675f0a758","infoHashBuffer":{"type":"Buffer","data":[229,76,212,121,128,130,164,63,186,75,245,99,234,131,82,102,117,240,167,88]},"announce":[],"urlList":[]}}