{"title":"Abraham-Hicks 2004-10-02 - Boston, MA 4CDs","uid":15110363,"size":443966153,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e59973a05a21c8e90a023410a24d73abce15706f&amp;dn=Abraham-Hicks+2004-10-02+-+Boston%2C+MA+4CDs&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"artofallowing","files":40,"time":1466998863,"description":"Abraham-Hicks Abraham-Hicks 2004-10-02 - Boston, MA 4CDs.txt\r\n\r\nIncluded in this torrent are:\r\n1. Track titles in .mp3  (4 hours 38 minutes)\r\n2. Audio book in m4b format. (For a list of programs that can open .m4b files visit: http://fileinfo.com/extension/m4b )\r\n\r\nThe Abraham-Hicks Sharing Community\r\n\r\nOur intention as a Community is to help one another to get all of the Abraham's material, particularly the latest. We as a group and as individuals buy it and share it, in any way we can (mainly via Torrents, DropBox, BTSync). \r\n\r\nTo see the list of the LATEST Abraham-Hicks torrents release, visit:  http://www.abeshares.com/\r\n \r\nTo be automatically informed of NEW Abraham-Hicks torrents and be added to the Abraham-Hicks Sharing Community mailing list, write to: \n\r\nThanks to all who participated and make this possible!\r\n\r\nFor more information about the teachings of Abraham and the Law of Attraction, visit:  http://www.abraham-hicks.com/lawofattractionsource/index.php \r\n\r\nTrack Titles\r\n\r\n01 - 2004-10-02 in Boston, MA - Abraham-Hicks Publications.mp3\r\n02 - They taught you not faith in yourself.mp3\r\n03 - Why do some medicines work for some.mp3\r\n04 - Can't get sick enough to help sick.mp3\r\n05 - Isn't there any such thing as -karma-.mp3\r\n06 - Where's our Consciousness when we're dreaming nightmares.mp3\r\n07 - What is my name.mp3\r\n08 - Am I still a card carrying member of the family of Abraham.mp3\r\n09 - I did the website I was suppose to do.mp3\r\n10 - Does Abraham care if he wants to be a Shaman.mp3\r\n11 - Every religion has the potential for goodness.mp3\r\n12 - Are there better times ahead for Earth.mp3\r\n13 - Artist, teacher's hands are hindering his work.mp3\r\n14 - Should singer learn to feel less empathetic.mp3\r\n15 - Ordered -Invisible Ideas- book still hasn't appeared.mp3\r\n16 - Regarding medication, should he have warned her.mp3\r\n17 - Would Massachusetts environment improve California Mom's dementia.mp3\r\n18 - She's soaring, but wants to soar more.mp3\r\n19 - Was contrast ever meant to motivate us.mp3\r\n20 - Why wanting to connect with -autistic- teenager.mp3\r\n21 - Sisters have been suffering from food allergies.mp3\r\n22 - How are they limiting their business expansions.mp3\r\n23 - To attract the solution before the problem.mp3\r\n24 - Can reading crime oriented books affect her.mp3\r\n25 - To overlook evidence of an unwanted diagnosis.mp3\r\n26 - Who do you trust regarding your health.mp3\r\n27 - Do you believe in your business concept.mp3\r\n28 - For your age, you seem healthy, but.mp3\r\n29 - Experiencing glitches for the drama of it.mp3\r\n30 - Her romantic  love for another woman causes concern over homosexuality.mp3\r\n31 - He's interested in consciously blending with Source.mp3\r\n32 - What's the expectation regarding one's Soul Mate.mp3\r\n33 - Expecting her marriage to reach new heights.mp3\r\n34 - Are all enlightened teachers connected to same.mp3\r\n35 - Is there a way for spiritual teachers to help us.mp3\r\n36 - Abraham closes the Boston Massachusetts Workshop.mp3","torrent":{"xt":"urn:btih:e59973a05a21c8e90a023410a24d73abce15706f","amp;dn":"Abraham-Hicks+2004-10-02+-+Boston%2C+MA+4CDs","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e59973a05a21c8e90a023410a24d73abce15706f","infoHashBuffer":{"type":"Buffer","data":[229,153,115,160,90,33,200,233,10,2,52,16,162,77,115,171,206,21,112,111]},"announce":[],"urlList":[]}}