{"title":"The Vampire Diaries Seizoen 2 (2010) DivX HDTV NL Subs NLtoppers","uid":9122847,"size":8085506495,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e63a9e5612a30bf7ec13d2bebac963beb1220974&amp;dn=The+Vampire+Diaries+Seizoen+2+%282010%29+DivX+HDTV+NL+Subs+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ChickieChicken","files":-1,"time":1383165803,"description":"The Vampire Diaries\n\nSeizoen 2\n\nKatherine Pierce (Nina Dobrev) duikt weer op. Ze komt terug met een weerwolf, de oom van Tyler, Mason Lockwood, om de maansteen te bemachtigen. Daarmee kunnen ze immers de vloek van de zon en de maan opheffen. Die vloek weerhoudt de vampieren om in het daglicht te lopen en de weerwolven zichzelf te kunnen laten veranderen, wanneer ze maar willen. Katherine heeft dit plan helemaal uitgedacht om Elena uit te leveren aan Klaus, een Original (familie van de 1e vampiers aller tijden), omdat zij zelf een Petrova dubbelganger is en zij eigenlijk moest sterven om de vloek op te heffen. Om de vloek te verbreken is er namelijk een weerwolf (Tyler), een vampier (Caroline), een heks (Bonnie), de maansteen en de Petrova-dubbelganger (Elena) nodig. Daarom is Katherine op de vlucht en daar wil ze van af. Katherine en Elena zijn familie en daardoor lijken ze zo op elkaar. Toen Katherine nog een mensenleven had heette ze Katerina Petrova en kreeg ze een kind. Haar baby mocht ze niet houden, omdat Katherine nog niet getrouwd was en het allemaal een geheim moest blijven. Er komt een ritueel waarbij Klaus Jenna getransformeerd heeft tot vampier, hij een weerwolf heeft en Elena, de dubbelganger. Tijdens dit ritueel wordt niet de vloek van de zon en de maan opgeven, maar de vloek op Klaus. Klaus is namelijk een buitenechtelijk kind en heeft een weerwolf als vader. Er wordt bij het ritueel geen vloek opgeheven, maar een vloek ingezet. Klaus wordt via deze vloek een hybride, een vampier EN een weerwolf.\n\nFile extension : Avi\nAfleveringen: 1 T/m 23\nAudio: English\nSubtitles: Dutch ( Ingebakken )\nCategory: Series\nSource: HDTV\nGenre: Drama, Horror, Romance\nIMDB: http://www.imdb.com/title/tt1405406/\n\n\nVeel plezier met de film.\n\nGroetjes CC","torrent":{"xt":"urn:btih:e63a9e5612a30bf7ec13d2bebac963beb1220974","amp;dn":"The+Vampire+Diaries+Seizoen+2+%282010%29+DivX+HDTV+NL+Subs+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63a9e5612a30bf7ec13d2bebac963beb1220974","infoHashBuffer":{"type":"Buffer","data":[230,58,158,86,18,163,11,247,236,19,210,190,186,201,99,190,177,34,9,116]},"announce":[],"urlList":[]}}