{"title":"1948: A History of the First Arab-Israeli War (MOBI)","uid":8774436,"size":7552146,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e65e18efb26f1f12e3b309e7521c9d15f59143ad&amp;dn=1948%3A+A+History+of+the+First+Arab-Israeli+War+%28MOBI%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"KaavaBoT","files":1,"time":1375517382,"description":"1948: A History of the First Arab-Israeli War (MOBI)\n\n\nAuthor: Benny Morris\nLanguage: English\nPages: 544 pages \nISBN-10: 0300151128 \nFormat: MOBI \nSize: 7.2 MB\n\nThis history of the foundational war in the Arab-Israeli conflict is groundbreaking, objective, and deeply revisionist. A riveting account of the military engagements, it also focuses on the war's political dimensions. Benny Morris probes the motives and aims of the protagonists on the basis of newly opened Israeli and Western documentation. The Arab side-where the archives are still closed-is illuminated with the help of intelligence and diplomatic materials.\n\n\nMorris stresses the jihadi character of the two-stage Arab assault on the Jewish community in Palestine. Throughout, he examines the dialectic between the war's military and political developments and highlights the military impetus in the creation of the refugee problem, which was a by-product of the disintegration of Palestinian Arab society. The book thoroughly investigates the role of the Great Powers-Britain, the United States, and the Soviet Union-in shaping the conflict and its tentative termination in 1949. Morris looks both at high politics and general staff decision-making processes and at the nitty-gritty of combat in the successive battles that resulted in the emergence of the State of Israel and the humiliation of the Arab world, a humiliation that underlies the continued Arab antagonism toward Israel.\n\nPlease Rate and Comment \n\nPlease seed atleast upto 1:1 Ratio","torrent":{"xt":"urn:btih:e65e18efb26f1f12e3b309e7521c9d15f59143ad","amp;dn":"1948%3A+A+History+of+the+First+Arab-Israeli+War+%28MOBI%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65e18efb26f1f12e3b309e7521c9d15f59143ad","infoHashBuffer":{"type":"Buffer","data":[230,94,24,239,178,111,31,18,227,179,9,231,82,28,157,21,245,145,67,173]},"announce":[],"urlList":[]}}