{"title":"PC Gamer UK August 2016","uid":16017690,"size":53369029,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e663fe15c2b330d3fabe2fc789d91abe23689a7e&amp;dn=PC+Gamer+UK+August+2016+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"robchan","files":1,"time":1476312474,"description":"PC Gamer UK – August 2016\r\nEnglish | 132 pages | PDF | 50.90 MB\r\n\r\nIn addition to a great visual design, PC Gamer focuses more on communities, user-made content and of course the big-name games we know and love! Each issue also offers exclusive previews and insightful features to make sure youâ™re at the top of your game. Delivering authoritative, honest, informative and entertaining reviews, PC Gamer is the ultimate buyerâ™s guide.\r\n\r\nPC Gamer is a magazine founded in the United Kingdom in 1993 devoted to PC gaming and published monthly by Future plc. The magazine has several regional editions, with the UK and US editions becoming the best selling PC games magazines in their respective countries.[1][2] The magazine features news on developments in the video game industry, previews of new games, and reviews of the latest popular PC games, along with other features relating to hardware, mods, &quot;classic&quot; games and various other topics.\r\n\r\nPC Gamer reviews are written by the magazine's editors and freelance writers, and rate games on a percent scale. In the US edition, no game has yet received a rating higher than 98% (Sid Meier's Alpha Centauri, Half-Life 2, and Crysis), while the UK edition has never awarded more than 96% (Kerbal Space Program, Civilization II, Half-Life, Half-Life 2, Minecraft, Spelunky and Quake II).\r\n\r\nIn the UK edition, the lowest numerical score was 2%, awarded to The 4th Golden Satellite Awards for Interactive Media Winner Big Brother 1. The sequel, Big Brother 2, was given an even lower score of N/A%, the review explaining that &quot;[PC Gamer] put as much effort into reviewing it as they did in making the game&quot;. In issue 255, August 2013, the score of 2% was matched by the review of the re-released Leisure Suit Larry: Magna Cum Laude, originally given 3% when it first launched. In the US edition, the lowest score awarded was 4%, given to Mad Dog McCree, unseating the previously lowest-rated game, Skydive!, given 5%.\r\n\r\n450px-PC_Gamer_logo.svg.png","torrent":{"xt":"urn:btih:e663fe15c2b330d3fabe2fc789d91abe23689a7e","amp;dn":"PC+Gamer+UK+August+2016+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e663fe15c2b330d3fabe2fc789d91abe23689a7e","infoHashBuffer":{"type":"Buffer","data":[230,99,254,21,194,179,48,211,250,190,47,199,137,217,26,190,35,104,154,126]},"announce":[],"urlList":[]}}