{"title":"The Entrepreneur's Solution: The Modern Millionaire's Path","uid":11778919,"size":618617,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6dfe8cda87787f6ce9ed44940df9eaa31076270&amp;dn=The+Entrepreneur%27s+Solution%3A+The+Modern+Millionaire%27s+Path&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"mdusanjay","files":1,"time":1427471705,"description":"The Entrepreneur's Solution: The Modern Millionaire's Path to More Profit, Fans &amp; Freedom by Mel H. Abraham\n\nRequirements: ePUB reader, 605 KB\n\nOverview: &quot;The Entrepreneur's Solution&quot; reawakens the entrepreneurial spirit in us all: the drive to fulfill our highest potential-as individuals, as a country, and as members of a global community. &quot;The Entrepreneur's Solution&quot; is required for the start-up and for the seasoned business owner to understand the new rules of the game. It is the new entrepreneurial manual.\n\nIt is filled with the very frameworks that were built through Mel Abraham's decades of experience as an entrepreneur, advisor and mentor. He gives you the recipe that not only helps you build a business but to build a life and create an entrepreneurial journey of epic proportions. &quot;The Entrepreneur's Solution&quot; is about harnessing your creative force, breaking free of your former state, and getting your life in alignment with your intention and purpose. It is through these frameworks (and the author's stories) that you journey to a land where your team is connected, committed and loyal, your customers become raving fans and your life full with fulfillment because the business you are creating is in congruence with your values, operated in alignment with your higher vision and connected to all stakeholders at an emotional level As a result, your business serves them by transforming their lives. All of this will translate into more profits, fans and freedom. Welcome to The Entrepreneur's Solution!","torrent":{"xt":"urn:btih:e6dfe8cda87787f6ce9ed44940df9eaa31076270","amp;dn":"The+Entrepreneur%27s+Solution%3A+The+Modern+Millionaire%27s+Path","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6dfe8cda87787f6ce9ed44940df9eaa31076270","infoHashBuffer":{"type":"Buffer","data":[230,223,232,205,168,119,135,246,206,158,212,73,64,223,158,170,49,7,98,112]},"announce":[],"urlList":[]}}