{"title":"The Autobiography Ebook Collection  (epub/mobi)","uid":6815388,"size":2410634042,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6f732b948e85d290a38c3c08f109f1d2c8434e1&amp;dn=The+Autobiography+Ebook+Collection++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"rosie1966","files":2465,"time":1321142832,"description":"Autobiography Collection\n\n\n\n\nAutobiography: General\t\n\nThe Know-It-All: One Man's Humble Quest to Become the Smartest Person in the World\t - A. J. Jacobs\nThe Year of Living Biblically: One Man's Humble Quest to Follow the Bible as Literally as Possible\t - A. J. Jacobs\nThe Poison King: The Life and Legend of Mithradates, Rome's Deadliest Enemy\t - Adrienne Mayor\nAgahta Christie: An Autobiography\t - Agatha Christie\nThe Second Coming of Steve Jobs\t - Alan Deutschman\nRichard Dawkins: How a Scientist Changed the Way We Think : Reflections by Scientists, Writers, and Philosophers\t - Alan Grafen, Mark Ridley\nI, Partridge\t - Alan Partridge\nThe House of Wittgenstein: A Family at War\t - Alexander Waugh\nDon't Let's Go to the Dogs Tonight: An African Childhood\t - Alexandra Fuller\nScribbling the Cat\t - Alexandra Fuller\nChildren of Dust: A Memoir of Pakistan\t - Ali Eteraz\nThe Snowball: Warren Buffett and the Business of Life\t - Alice Schroeder\nConfessions of a Prairie Bitch: How I Survived Nellie Oleson and Learned to Love Being Hated\t - Alison Arngrim\nBattle Hymn of the Tiger Mother\t - Amy Chua\nTownie: A Memoir\t - Andre Dubus, Iii\nKeeper: One House, Three Generations, and a Journey Into Alzheimer's\t - Andrea Gillies\nParty Girl: A Novel\t - Anna David\nYou Say Tomato, I Say Shut Up\t - Annabelle Gurwitch\nAyn Rand and the World She Made\t - Anne C. Heller\nMust You Go?\t - Antonia Fraser\nStraight Life\t - Art Pepper, Laurie Pepper\nMagical Thinking\t - Augusten Burroughs\nRunning the Books: The Adventures of an Accidental Prison Librarian\t - Avi Steinberg\nJournals of Ayn Rand\t - Ayn Rand, Leonard Peikoff, David Harriman\nRivethead\t - Ben Hamper\nMy Korean Deli: Risking It All for a Convenience Store\t - Ben Ryder Howe\nConfessions of a GP\t - Benjamin Daniels\nThe Imaginations of Unreasonable Men: Inspiration, Vision, and Purpose in the Quest to End Malaria\t - Bill Shore\nCheever: A Life\t - Blake Bailey\nFlannery: A Life of Flannery O'Connor\t - Brad Gooch\nThe Council of Dads\t - Bruce Feiler\nThe Gates of November\t - Chaim Potok\nWhen Broken Glass Floats: Growing Up Under the Khmer Rouge\t - Chanrithy Him\nWhat I Learned When I Almost Died\t - Chris Licht\nElephant Man\t - Christine Sparks\nHitch-22: A Memoir\t - Christopher Hitchens\nLarry's Kidney: Being the True Story of How I Found Myself in China With My Black Sheep Cousin and His Mail-Order Bride, Skirting the Law to Get Him a Transplant--And Save His Life\t - Daniel Asa Rose\nZeitoun\t - Dave Eggers\nCocaine's Son: A Memoir\t - Dave Itzkoff\nBobby Fischer Goes to War: How a Lone American Star Defeated the Soviet Chess Machine\t - David Edmonds, John Eidinow\nAlthough of Course You End Up Becoming Yourself: A Road Trip With David Foster Wallace\t - David Lipsky\nCatching the Big Fish: Meditation, Consciousness, and Creativity\t - David Lynch\nFinding Everett Ruess: The Life and Unsolved Disappearance of a Legendary Wilderness Explorer\t - David Roberts\nBeautiful Boy: A Father's Journey Through His Son's Addiction\t - David Sheff\nEvery Day by the Sun: A Memoir of the Faulkners of Mississippi\t - Dean Faulkner Wells\nThe Stardust Lounge: Stories From a Boy's Adolescence\t - Deborah Digges\nReport From Engine Co. 82\t - Dennis Smith\nI'm Sorry You Feel That Way: The Astonishing but True Story of a Daughter, Sister, Slut, Wife, Mother, and Friend to Man and Dog\t - Diana Joseph\nAfrican Laughter\t - Doris May Lessing\nTwo or Three Things I Know for Sure\t - Dorothy Allison\nMr. Strangelove: A Biography of Peter Sellers\t - Ed Sikov\nThe Hare With Amber Eyes\t - Edmund de Waal\nBrother, I'm Dying\t - Edwidge Danticat\nAll Rivers Run to the Sea: Memoirs\t - Elie Wiesel\nBlack Milk\t - Elif Shafak\nCommitted: A Skeptic Makes Peace With Marriage\t - Elizabeth Gilbert\nEat, Pray, Love: One Woman's Search for Everything Across Italy, India and Indonesia\t - Elizabeth Gilbert\nAn Exact Replica of a Figment of My Imagination: A Memoir\t - Elizabeth McCracken\nThis Child Will Be Great\t - Ellen Johnson Sirleaf\nKlee Wyck\t - Emily Carr, Kathryn Bridge\nA Child Al Confino: The True Story of a Jewish Boy and His Mother in Mussolini's Italy\t - Eric Lamet\nThe Freedom Writers Diary\t - Erin Gruwell, The Freedom Writers\nWhen I Was Puerto Rican\t - Esmeralda Santiago\nA Warrior's Life: A Biography of Paulo Coelho\t - Fernando Morais\nEndgame: Bobby Fischer's Remarkable Rise and Fall - From America's Brightest Prodigy to the Edge of Madness\t - Frank Brady\nTis: A Memoir\t - Frank McCourt\nCrazy for God: How I Grew Up as One of the Elect, Helped Found the Religious Right, and Lived to Take All\t - Frank Schaeffer\nI Was Vermeer: The Rise and Fall of the Twentieth Century's Greatest Forger\t - Frank Wynne\nEcce Homo\t - Friedrich Nietzsche\nLet's Take the Long Way Home: A Memoir of Friendship\t - Gail Caldwell\nMob Star: The Story of John Gotti\t - Gene Mustain, Jerry Capeci\nA Guest in My Own Country\t - George Konrad\nThe Corfu Trilogy\t - Gerald Durrell\nForeign Correspondence: A Pen Pal's Journey From Down Under to All Over\t - Geraldine Brooks\nThe Girls of Room 28: Friendship, Hope, and Survival in Theresienstadt\t - Hannelore Brenner-Wonschick, Hannelore Brenner\nWhat I Talk About When I Talk About Running\t - Haruki Murakami\nBitch Is the New Black: A Memoir\t - Helena Andrews\nRocket Boys\t - Homer Hickam\nSky of Stone\t - Homer Hickam\nThe Coalwood Way\t - Homer Hickam\nAn Anatomy of Addiction: Sigmund Freud, William Halsted, and the Miracle Drug, Cocaine\t - Howard Markel\nCharles Bukowski: Locked in the Arms of a Crazy Life\t - Howard Sounes\nThe Boy in the Moon: A Father's Search for His Disabled Son\t - Ian Brown\nUnbillable Hours: A True Story\t - Ian Graham\nEven Silence Has an End: My Six Years of Captivity in the Colombian Jungle\t - Ingrid Betancourt\nHermit in Paris: Autobiographical Writings\t - Italo Calvino, Martin McLaughlin\nYesterday, I Cried: Celebrating the Lessons of Living and Loving\t - Iyanla Vanzant\nSummertime: Scenes From Provincial Life\t - J. M. Coetzee\nThe Tender Bar: A Memoir\t - J. R. Moehringer\nGimme Something Better: The Profound, Progressive, and Occasionally Pointless History of Bay Area Punk From Dead Kennedys to Green Day\t - Jack Boulware, Silke Tudor\nTokyo Vice: An American Reporter on the Police Beat in Japan\t - Jake Adelstein\nA Million Little Pieces\t - James Frey\nPulitzer: A Life in Politics, Print, and Power\t - James McGrath Morris\nAdland: Searching for the Meaning of Life on a Branded Planet\t - James P. Othmer\nThe Little Prisoner: A Memoir\t - Jane Elliott, Andrew Crofts\nA Stolen Life: A Memoir\t - Jaycee Dugard\nWhere We Going, Daddy?: Life With Two Sons Unlike Any Other\t - Jean-Louis Fournier\nThe Glass Castle: A Memoir\t - Jeannette Walls\nThe Girls From Ames: A Story of Women and a Forty-Year Friendship\t - Jeffrey Zaslow\nWoman Who Fell From the Sky\t - Jennifer Steil\nFrom Those Wonderful Folks Who Gave You Pearl Harbor\t - Jerry Della Femina, Charles Sopkin\nWhen I Stop Talking, You'll Know I'm Dead: Useful Stories From a Persuasive Man\t - Jerry Weintraub\nSome Girls: My Life in a Harem\t - Jillian Lauren\nThe Ledge: An Adventure Story of Friendship and Survival on Mount Rainier\t - Jim Davidson, Kevin Vaughan\nThe Year of Magical Thinking\t - Joan Didion\nMentally Incontinent\t - Joe Peacock\nAlmost a Family\t - John Darnton\nThe Sugar King of Havana: The Rise and Fall of Julio Lobo, Cuba's Last Tycoon\t - John Paul Rathbone\nInto the Wild\t - Jon Krakauer\nWhere Men Win Glory\t - Jon Krakauer\nChronic City\t - Jonathan Lethem\nThe Wolf of Wall Street\t - Jordan Belfort\nSmall Memories\t - JosÃƒÆ’Ã‚Â© Saramago, Margaret Jull Costa\nPill Head: The Secret Life of a Painkiller Addict\t - Joshua Lyon\nA Widow's Story: A Memoir\t - Joyce Carol Oates\nThe Tenth Muse\t - Judith Jones\nNothing to Be Frightened Of\t - Julian Barnes\nWeekends at Bellevue\t - Julie Holland\nAmerican Rose: A Nation Laid Bare: The Life and Times of Gypsy Rose Lee\t - Karen Abbott\nAn Unquiet Mind\t - Kay Redfield Jamison\nNothing Was the Same: A Memoir\t - Kay Redfield Jamison\nKeith Haring Journals\t - Keith Haring, Robert Farris Thompson\nBegin Again: A Biography of John Cage\t - Kenneth Silverman\nJ. D. Salinger: A Life\t - Kenneth Slawenski\nDirty Little Secrets\t - Kerry Cohen\nGhost in the Wires: My Adventures as the World's Most Wanted Hacker\t - Kevin Mitnick, Steve Wozniak, William L. Simon\nA Common Pornography: A Memoir\t - Kevin Sampsell\nThe Royals\t - Kitty Kelley\nStieg Larsson, My Friend\t - Kurdo Baksi\nA Man Without a Country\t - Kurt Vonnegut\nPalm Sunday: An Autobiographical Collage\t - Kurt Vonnegut\nSomewhere Inside\t - Laura Ling, Lisa Ling\nSugar and Spice: An L.A. Candy Novel\t - Lauren Conrad\nPrayers for Bobby\t - Leroy Aarons\nThe Chronology of Water\t - Lidia Yuknavitch\nObjects of Our Affection: Uncovering My Family's Past, One Chair, Pistol, and Pickle Fork at a Time\t - Lisa Tracy\nBreaking Night\t - Liz Murray\nProust's Overcoat\t - Lorenza Foschini, Eric Karpeles\nFirst They Killed My Father: A Daughter of Cambodia Remembers\t - Loung Ung\nAn Education\t - Lynn Barber\nSwimming to Antarctica: Tales of a Long-Distance Swimmer\t - Lynne Cox\nTip It!: The World According to Maggie\t - Maggie Griffin\nThe Gang That Wouldn't Write Straight: Wolfe, Thompson, Didion, Capote, and the New Journalism Revolution\t - Marc Weingarten\nAmerican Chica: Two Worlds, One Childhood\t - Marie Arana\nThe Fortunate Pilgrim\t - Mario Puzo\nAutobiography of Mark Twain, Vol. 1\t - Mark Twain\nJust Like Someone Without Mental Illness Only More So: A Memoir\t - Mark Vonnegut\nThe Eden Express: A Memoir of Insanity\t - Mark Vonnegut\nTravels With Myself and Another\t - Martha Gellhorn\nThe Will of the People: Winston Churchill and Parliamentary Democracy\t - Martin Gilbert\nFall to Pieces: A Memoir of Drugs, Rock 'N' Roll, and Mental Illness\t - Mary Forsberg Weiland, Larkin Warren\nLit\t - Mary Karr\nThe Cure for Anything Is Salt Water: How I Threw My Life Overboard and Found Happiness at Sea\t - Mary South\nTwo Kisses for Maddy: A Memoir of Loss &amp; Love\t - Matthew Logelin\nI Love a Broad Margin to My Life\t - Maxine Hong Kingston\nThe Woman Warrior: Memoirs of a Girlhood Among Ghosts\t - Maxine Hong Kingston\nA Song Flung Up to Heaven\t - Maya Angelou\nGather Together in My Name\t - Maya Angelou\nI Know Why the Caged Bird Sings\t - Maya Angelou\nLetter to My Daughter\t - Maya Angelou\nSingin' and Swingin' and Gettin' Merry Like Christmas\t - Maya Angelou\nThe Heart of a Woman\t - Maya Angelou\nThen They Came for Me: A Family's Story of Love, Captivity, and Survival\t - Maziar Bahari, Aimee Molloy\nEvery Man in This Village Is a Liar: An Education in War\t - Megan K. Stack\nThis Life Is in Your Hands: One Dream, Sixty Acres, and a Family Undone\t - Melissa Coleman\nHero: The Life and Legend of Lawrence of Arabia\t - Michael Korda\nThe Blind Side: Evolution of a Game\t - Michael Lewis\nA Place of My Own: The Architecture of Daydreams\t - Michael Pollan\nWill Eisner\t - Michael Schumacher\nWreck of the Carl D.: A True Story of Loss, Survival, and Rescue at Sea\t - Michael Schumacher\nDown Among the Dead Men: A Year in the Life of a Mortuary Technician\t - Michelle Williams\nTide, Feather, Snow: A Life in Alaska\t - Miranda Weiss\nHands of My Father: A Hearing Boy, His Deaf Parents, and the Language of Love\t - Myron Uhlberg\nIn the Sanctuary of Outcasts: A Memoir\t - Neil White\nTweak: Growing Up on Methamphetamines\t - Nic Sheff\nWiseguy: Life in a Mafia Family\t - Nicholas Pileggi\nThree Weeks With My Brother\t - Nicholas Sparks, Micah Sparks\nFever Pitch\t - Nick Hornby\nTolstoy and the Purple Chair: My Year of Magical Reading\t - Nina Sankovitch\nVoluntary Madness: My Year Lost and Found in the Loony Bin\t - Norah Vincent\nA Ticket to the Circus: A Memoir\t - Norris Church Mailer\nThoughts Without Cigarettes: A Memoir\t - Oscar Hijuelos\nAlfred Hitchcock: A Life in Darkness and Light\t - Patrick McGilligan\nJust Kids\t - Patti Smith\nIdea Man: A Memoir by the Cofounder of Microsoft\t - Paul Allen\nBlack Is the New White\t - Paul Mooney, Dave Chappelle\nAn Ordinary Man\t - Paul Rusesabagina, Tom Zoellner\nAn Ordinary Man: An Autobiography\t - Paul Rusesabagina, Tom Zoellner\nKeeping the Feast\t - Paula Butturini\nThe Pilgrimage: A Contemporary Quest for Ancient Wisdom\t - Paulo Coelho\nDrinking Life\t - Pete Hamill\nPoe\t - Peter Ackroyd\nUnbearable Lightness: A Story of Loss and Gain\t - Portia de Rossi\nIn the Land of Invisible Women: A Female Doctor's Journey in the Saudi Kingdom\t - Qanta Ahmed\nCreation: Darwin, His Daughter &amp; Human Evolution\t - Randal Keynes\nThe Last Lecture\t - Randy Pausch, Jeffrey Zaslow\nThe Immortal Life of Henrietta Lacks\t - Rebecca Skloot\nA Time to Betray: The Astonishing Double Life of a CIA Agent Inside the Revolutionary Guards of Iran\t - Reza Kahili\nSurely You're Joking, Mr. Feynman!\t - Richard P. Feynman\nBlack Boy\t - Richard Wright\nAll Over but the Shoutin'\t - Rick Bragg\nAva's Man\t - Rick Bragg\nThe Prince of Frogtown\t - Rick Bragg\nLove Is a Mix Tape: Life and Loss, One Song at a Time\t - Rob Sheffield\nTalking to Girls About Duran Duran: One Young Man's Quest for True Love and a Cooler Haircut\t - Rob Sheffield\nThe Company We Keep: A Husband-And-Wife True-Life Spy Story\t - Robert Baer, Dayna Baer\nBoyd\t - Robert Coram\nPieces of My Heart: A Life\t - Robert J. Wagner, Scott Eyman\nTarget\t - Robert K. Wilcox\nThe Accountant's Story: Inside the Violent World of the MedellÃƒÆ’ n Cartel\t - Roberto Escobar, David Fisher\nChinaberry Sidewalks\t - Rodney Crowell\nLife Itself\t - Roger Ebert\nThe Boys of Summer\t - Roger Kahn\nTitan: The Life of John D. Rockefeller, Sr\t - Ron Chernow\nThe Secret History of Rock: The Most Influential Bands You've Never Heard\t - Roni Sarig\nBetween Two Worlds\t - Roxana Saberi\nUgly Beauty: Helena Rubinstein, L'OrÃƒÆ’Ã‚Â©al, and the Blemished History of Looking Good\t - Ruth Brandon\nComfort Me With Apples\t - Ruth Reichl\nNothing to Lose, Everything to Gain: How I Went From Gang Member to Multimillionaire Entrepreneur\t - Ryan Blair\nFifth Avenue, 5 A.M.: Audrey Hepburn, Breakfast at Tiffany's, and the Dawn of the Modern Woman\t - Sam Wasson\nSaul Bellow: Letters\t - Saul Bellow, Benjamin Taylor\nHappy Chaos\t - Soleil Moon Frye\nThe Journals of Spalding Gray\t - Spalding Gray, Nell Casey\nOn the Grand Trunk Road\t - Steve Coll\nThe Bin Ladens: An Arabian Family in the American Century\t - Steve Coll\nIWoz: Computer Geek to Cult Icon : How I Invented the Personal Computer, Co-Founded Apple, and Had Fun Doing It\t - Steve Wozniak, Gina Smith\nGang Leader for a Day: A Rogue Sociologist Takes to the Streets\t - Sudhir Alladi Venkatesh\nFixing My Gaze\t - Susan R. Barry, Oliver Sacks\nBig Sex Little Death: A Memoir\t - Susie Bright\nThinking in Pictures: And Other Reports From My Life With Autism\t - Temple Grandin\nPiano Shop on the Left Bank\t - Thad Carhart, Thaddeus Carhart\nLucky Child\t - Thomas Buergenthal\nSearching for Schindler\t - Thomas Keneally\nIll Fares the Land\t - Tony Judt\nThe Memory Chalet\t - Tony Judt\nHiding Man: A Biography of Donald Barthelme\t - Tracy Daugherty\nA House for Mr. Biswas\t - V. S. Naipaul\nBeware of Cat: And Other Encounters of a Letter Carrier\t - Vincent Wyckoff\nSteve Jobs\t - Walter Isaacson\nLost in the Meritocracy\t - Walter Kirn\nOutcasts United\t - Warren St. John\nThe Wilder Life: My Adventures in the Lost World of Little House on the Prairie\t - Wendy McClure\nThe Other Wes Moore: One Name, Two Fates\t - Wes Moore\nIn the Place of Justice: A Story of Punishment and Deliverance\t - Wilbert Rideau\nThe Last Tycoons: The Secret History of Lazard FrÃƒÆ’Ã‚Â¨res &amp; Co\t - William D. Cohan\nA Jane Austen Education\t - William Deresiewicz\nWe Did Porn: Memoir and Drawings\t - Zak Smith\nDust Tracks on a Road\t - Zora Neale Hurston, Maya Angelou\nWhy We Suck: A Feel Good Guide to Staying Fat, Loud, Lazy and Stupid\t - Denis Leary\nSleepwalk With Me: And Other Painfully True Stories\t - Mike Birbiglia\n\nAutobiography: Celeberties\t\n\nBaby, Let's Play House: Elvis Presley and the Women Who Loved Him\t - Alanna Nash\nWhatever You Say I Am: The Life and Times of Eminem\t - Anthony Bozza\nAll That Is Bitter and Sweet: A Memoir\t - Ashley Judd, Nicholas D. Kristof, Maryanne Vollers\nLady Blue Eyes: My Life With Frank\t - Barbara Sinatra\nMud Sweat &amp; Tears\t - Bear Grylls\nIf You Ask Me\t - Betty White\nLost in the Funhouse: The Life and Mind of Andy Kaufman\t - Bill Zehme\n700 Sundays\t - Billy Crystal\nPriceless Memories\t - Bob Barker, Digby Diehl\nNo Regrets\t - Carolyn Burke\nAmy Winehouse: The Biography\t - Chas Newkey-Burden\nNeon Angel\t - Cherie Currie, Tony O'neill\nA Lion's Tale: Around the World in Spandex\t - Chris Jericho\nKate: Kate Middleton\t - Claudia Joseph\nHank Williams\t - Colin Escott, George Merritt, William MacEwen\nCybill Disobedience\t - Cybill Shepherd, Aimee Lee Ball\nChords of Strength: A Memoir of Soul, Song and the Power of Perseverance\t - David Archuleta, Monica Haim\nMy Lucky Life in and Out of Show Business: A Memoir\t - Dick Van Dyke\nPossessed: The Life of Joan Crawford\t - Donald Spoto\nWhere Mercy Is Shown, Mercy Is Given\t - Duane Dog Chapman\nIt's So Easy\t - Duff Mckagan\nSeriously...I'm Kidding\t - Ellen DeGeneres\nClapton: The Autobiography\t - Eric Clapton\nNeil Young: Long May You Run\t - Gary Graff, Daniel Durchholz\nMr Nice: An Autobiography\t - Howard Marks\nSenor Nice\t - Howard Marks\nFab: An Intimate Life of Paul McCartney\t - Howard Sounes\nHere's the Deal: Don't Touch Me\t - Howie Mandel, Josh Young\nIce: A Memoir of Gangster Life and Redemption--From South Central to Hollywood\t - Ice-T, Douglas Century\nMichael Jackson: The Magic, the Madness, the Whole Story, 1958-2009\t - J. Randy Taraborrelli\nThe Secret Life of Marilyn Monroe\t - J. Randy Taraborrelli\nFrank: The Voice\t - James Kaplan\nSeven Dirty Words: The Life and Crimes of George Carlin\t - James Sullivan\nDecoded\t - Jay-Z\nJeff Corwin: A Wild Life : The Authorized Biography\t - Jeff Corwin\nI Want to Take You Higher: The Life and Times of Sly &amp; the Family Stone\t - Jeff Kaliss\nLove, Lust &amp; Faking It: The Naked Truth About Sex, Lies, and True Romance\t - Jenny McCarthy\nI Met the Walrus: How One Day With John Lennon Changed My Life Forever\t - Jerry Levitan\nDean and Me: A Love Story\t - Jerry Lewis, James Kaplan\nAmerican Outlaw\t - Jesse James\nTommy Cooper: Always Leave Them Laughing\t - John Fisher\nI Just Want You to Know: Letters to My Kids on Love, Faith, and Family\t - Kate Gosselin\nLife\t - Keith Richards, James Fox (Contributor)\nBeing Kendra: Cribs, Cocktails, and Getting My Sexy Back\t - Kendra Wilkinson\nHis Way: The Unauthorized Biography of Frank Sinatra\t - Kitty Kelley\nOprah: A Biography\t - Kitty Kelley\nLoretta Lynn: Coal Miner's Daughter\t - Loretta Lynn, George Vecsey\nHigh on Arrival\t - Mackenzie Phillips, Hilary Liftin\nMight as Well Laugh About It Now\t - Marie Osmond, Marcia Wilkie\nGrowing Up Laughing: My Story and the Story of Funny\t - Marlo Thomas\nBrando: Songs My Mother Taught Me\t - Marlon Brando, Robert Lindsey\nThe Elephant to Hollywood\t - Michael Caine\nRobert Redford\t - Michael Feeney Callan\nA Funny Thing Happened on the Way to the Future: Twists and Turns and Lessons Learned\t - Michael J. Fox\nLife and Laughing: My Story\t - Michael McIntyre\nJohn Wayne : The Man Behind the Myth\t - Michael Munn\nDiaries 1969-1979: The Python Years\t - Michael Palin\nPriceless\t - Nicole Richie\nI Am Ozzy\t - Ozzy Osbourne, Chris Ayres\nBetween a Heart and a Rock Place: A Memoir\t - Pat Benatar, Patsi Bale Cox\nWe'll Be Here for the Rest of Our Lives: A Swingin' Show-Biz Saga\t - Paul Shaffer, David Ritz\nDream Boogie: The Triumph of Sam Cooke\t - Peter Guralnick\nMan of Constant Sorrow: My Life and Times\t - Ralph Stanley, Eddie Dean\nMe\t - Ricky Martin\nBlonde Ambition: The Untold Story Behind Anna Nicole Smith's Death\t - Rita Cosby\nStories I Only Tell My Friends: An Autobiography\t - Rob Lowe\nMy Word Is My Bond: A Memoir\t - Roger Moore, Gareth Owen\nThe Hardest (Working) Man in Showbiz\t - Ron Jeremy\nFurious Love: Elizabeth Taylor, Richard Burton, and the Marriage of the Century\t - Sam Kashner, Nancy Schoenberger\nRed\t - Sammy Hagar\nBob Dylan in America\t - Sean Wilentz\nFrom This Moment On\t - Shania Twain\nSomebody: The Reckless Life and Remarkable Career of Marlon Brando\t - Stefan Kanfer\nFry: A Memoir\t - Stephen Fry\nProfessional Idiot: A Memoir\t - Stephen Glover\nMy Appetite for Destruction: Sex, and Drugs, and Guns N' Roses\t - Steven Adler\nDoes the Noise in My Head Bother You?: A Rock 'N' Roll Memoir\t - Steven Tyler\nAll My Life: A Memoir\t - Susan Lucci, Laura (CON) Morton\nSinner Takes All: A Memoir of Love &amp; Porn\t - Tera Patrick; Carrie Borzillo\nThe Sinatra Files: The Secret FBI Dossier\t - Tom Kuntz, Phil Kuntz\nIs It Just Me?: Or Is It Nuts Out There?\t - Whoopi Goldberg\nShatner Rules\t - William Shatner, Chris Regan\n\nAutobiography: Food &amp; Travel\t\n\nBig in China: My Unlikely Adventures Raising a Family, Playing the Blues, and Becoming a Star in Beijing\t - Alan Paul\nKitchen Confidential: Adventures in the Culinary Underbelly\t - Anthony Bourdain\nMedium Raw: A Bloody Valentine to the World of Food and the People Who Cook\t - Anthony Bourdain\nBetween a Rock and a Hard Place\t - Aron Ralston\nHeat: An Amateur's Adventures as Kitchen Slave, Line Cook, Pasta-Maker, and Apprentice to a Dante-Quoting Butcher in Tuscany\t - Bill Buford\nThe Lost City of Z: A Tale of Deadly Obsession in the Amazon\t - David Grann\nBlood, Bones, and Butter: The Inadvertent Education of a Reluctant Chef\t - Gabrielle Hamilton\nMy Life in France\t - Julia Child, Alex Prud'homme\nCleaving\t - Julie Powell\nJulia Child: A Life\t - Laura Shapiro\nHallelujah! The Welcome Table: A Lifetime of Memories With Recipes\t - Maya Angelou\nThe Reach of a Chef: Beyond the Kitchen\t - Michael Ruhlman\nAppetite for Life: The Biography of Julia Child\t - Noel Riley Fitch\nFarm City: The Education of an Urban Farmer\t - Novella Carpenter\nThe Pat Conroy Cookbook: Recipes and Stories of My Life\t - Pat Conroy\n30 Days in Sydney: A Wildly Distorted Account\t - Peter Carey\nTender at the Bone: Growing Up at the Table\t - Ruth Reichl\nThe Lady and the Panda: The True Adventures of the First American Explorer to Bring Back China's Most Exotic Animal\t - Vicki Croke\n\nAutobiography: Politics &amp; Religon\t\n\nUnplanned: The Dramatic True Story of a Former Planned Parenthood Leader's Eye-Opening Journey Across the Life Line\t - Abby Johnson, Cindy Lambert\nThe Audacity of Hope\t - Barack Obama\nNearing Home\t - Billy Graham\nRonnie and Nancy: Their Path to the White House\t - Bob Colacello\nEscape\t - Carolyn Jessop, Laura Palmer\nCome to the Edge: A Memoir\t - Christina Haag\nBarack and Michelle\t - Christopher P. Andersen\nNo Higher Honor\t - Condoleezza Rice\nTears of a Clown: Glenn Beck and the Tea Bagging of America\t - Dana Milbank\nMy Year Inside Radical Islam: A Memoir\t - Daveed Gartenstein-Ross\nThe Bridge: The Life and Rise of Barack Obama\t - David Remnick\nRawhide Down: The Near Assassination of Ronald Reagan\t - Del Quentin Wilber\nIn My Time\t - Dick Cheney, Liz Cheney\nKnown and Unknown\t - Donald Rumsfeld\nKnown and Unknown: A Memoir\t - Donald Rumsfeld\nTrue Compass: A Memoir\t - Edward M. Kennedy\nResilience: Reflections on the Burdens and Gifts of Facing Life's Adversities\t - Elizabeth Edwards\nLetters to Jackie: Condolences From a Grieving Nation\t - Ellen Fitzpatrick\nBonhoeffer: Pastor, Martyr, Prophet, Spy: A Righteous Gentile vs. The Third Reich\t - Eric Metaxas\nTeaching the Pig to Dance: A Memoir\t - Fred Thompson\nAt the Center of the Storm: My Years at the CIA\t - George Tenet, Bill Harlow\nDecision Points\t - George W. Bush\nOn the Brink: Inside the Race to Stop the Collapse of the Global Financial System\t - Henry M. Paulson\nThis Is Herman Cain!\t - Herman Cain\nA Singular Woman\t - Janny Scott\nWithout a Word: How a Boy's Unspoken Love Changed Everything\t - Jill Kelly, Tim McGraw, Faith Hill\nThe Spiral Staircase: My Climb Out of Darkness\t - Karen Armstrong\nWilliam and Harry\t - Katie Nicholl, C Nicholl\nThe Boy Who Came Back From Heaven: A Remarkable Account of Miracles, Angels, and Life Beyond This World\t - Kevin Malarkey, Alex Malarkey\nSpoken From the Heart\t - Laura Bush\nThe Kennedy Men: 1901-1963\t - Laurence Leamer\nRead My Pins: Stories From a Diplomat's Jewel Box\t - Madeleine Albright, Madeleine Korbel Albright\nWinston Churchill's War Leadership\t - Martin Gilbert\nDirty Sexy Politics\t - Meghan McCain\nHere Comes Trouble\t - Michael Moore\nHave a Little Faith\t - Mitch Albom\nThe Long Walk to Freedom\t - Nelson Mandela\nThe Obamas: The Untold Story of an African Family\t - Peter Firstbrook\nAn American Life\t - Ronald Reagan\nIn the Words of Ronald Reagan: The Wit, Wisdom, and Eternal Optimism of America's 40th President\t - Ronald Reagan, Michael Reagan, James D. Denney\nAgainst All Odds: My Life of Hardship, Fast Breaks, and Second Chances\t - Scott Brown\nKennedy: The Classic Biography\t - Ted Sorensen\nA Journey: My Political Life\t - Tony Blair\nFair Game\t - Valerie Plame Wilson\nReading Jackie: Her Autobiography in Books\t - William Kuhn\n\nAutobiography: Sports\t\n\nDeath Clutch\t - Brock Lesnar, Paul Heyman\nUndisputed: How to Become the World Champion in 1,372 Easy Steps\t - Chris Jericho, Peter Thomas Fornatale\nThe Last Hero: A Life of Henry Aaron\t - Howard Bryant\nThe Last Boy: Mickey Mantle and the End of America's Childhood\t - Jane Leavy\nSweetness: The Enigmatic Life of Walter Payton\t - Jeff Pearlman\nThe Yankee Years\t - Joe Torre, Tom Verducci\nTommy's Honor: The Story of Old Tom Morris and Young Tom Morris, Golf's Founding Father and Son\t - Kevin Cook\nWe Were Young and Carefree\t - Laurent Fignon\nI Beat the Odds: From Homelessness, to the Blind Side, and Beyond\t - Michael Oher\nRafa\t - Rafael Nadal, John Carlin\nSweet Thunder: The Life and Times of Sugar Ray Robinson\t - Wil Haygood\n\nAutobiography: Other\t\n\nThe Courtier and the Heretic: Leibniz, Spinoza, and the Fate of God in the Modern World\t - Matthew Stewart\nHow to Live: A Life of Montaigne in One Question and Twenty Attempts at an Answer\t - Sarah Bakewell\nGenius: The Life and Science of Richard Feynman\t - James Gleick\nKingpin: How One Hacker Took Over the Billion Dollar Cyber Crime Underground\t - Kevin Poulsen\nPink Boots and a MacHete: My Journey From NFL Cheerleader to National Geographic Explorer\t - Mireya Mayor, Jane Goodall\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:e6f732b948e85d290a38c3c08f109f1d2c8434e1","amp;dn":"The+Autobiography+Ebook+Collection++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f732b948e85d290a38c3c08f109f1d2c8434e1","infoHashBuffer":{"type":"Buffer","data":[230,247,50,185,72,232,93,41,10,56,195,192,143,16,159,29,44,132,52,225]},"announce":[],"urlList":[]}}