{"title":"Spider Man 3 (Direct Play) (Spiderman 3) (Sandbox Game)","uid":6864368,"size":2195999860,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e74141e5e9ab3e1d5c9afc9d3dce3eea2ec50c69&amp;dn=Spider+Man+3+%28Direct+Play%29+%28Spiderman+3%29+%28Sandbox+Game%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":2,"uploader":"FuCtUpPuNk","files":6,"time":1323035097,"description":"INSTALLATION:\nExtract Using 7-zip or winrar (www.7-zip.org it's free)\nRun &quot;Game.exe&quot; or &quot;Spider-Man 3.exe&quot;\nPlay the game\n-------------------\n-------------------\n-------------------\n\nPLOT:\nThe game starts off as Spider-Man swings into a burning building. He defeats the bombers of the building and saves a woman from being killed. It then skips to the next day. His former best friend Harry Osborn does not talk to him anymore and he has a new rival in the Daily Bugle: Eddie Brock. Meanwhile, an escaped convict Flint Marko falls into a lab pit and turns into sand. A small meteor crashes, with a symbiote inside.\nSpider-Man takes Mary Jane Watson, his girlfriend, on a thrill ride, and after that, talks about Harry. Mary Jane comforts him; while talking, the symbiote attaches to Peter's shoe. Meanwhile, Harry comes out of a chamber in the Green Goblin lair, filled with Goblin gas.\nAfter visiting his science teacher Dr. Connors, who turned into the Lizard by performing a experiment on himself to grow a new arm. The Lizard then turns other people into lizards, then escapes into the sewers, Spider Man then follows and defeats the Lizard, turning Connors back to himself. Harry (now the New Goblin) attacks Peter. They go on a high-fly battle on New Goblin's glider, but Goblin is defeated and knocked unconscious. Peter brings New Goblin to the hospital, where he will be treated.\nRumors where spreading that numerous gangs (Waste Tribe, Dragon Tails, H-Bombers, and the Apocalypse) are threatening the city to death. After Spider-Man foils all of their plans, he went to another mission of the H-Bomber gang which was posibbly kiddnapping J. Jonah Jameson and killing him by Carlyle.\nSpider-Man then visits an abandoned Laboratory where a doctor attempts to kill a person: Mac Gargan. But while testing him he accidentally turned him into the Scorpion.\nSpider-Man goes to the city to chase and battle Scorpion to the city and then goes to sleep due to a very tiring day.\nDuring his sleep, the symbiote consumes Peter, leading Peter to have a new jet-black suit. The new symbiote suit makes him stronger, more agile, and more aggressive. Marko, now the Sandman, recently robbed a bank, and is headed for the subways. Spider-Man pursues him, and eventually defeats him, washing him away in a sewer line.\nBrock and Peter both are given an assignment by their boss, J. Jonah Jameson: catch Spider-Man robbing something, and the one who does gets a promotion. Brock attempts to cheat by paying someone to pose as Spider-Man. The real Spider-Man appears, now influenced by the black suit, breaks Brock's camera and punches him. Brock tells him that he has many more cameras, and automatically photographs Spider-Man punching him. Spider-Man is able to recover the cameras and Brock swears revenge.\nPeter gives Mary Jane a ride back to her apartment after a horrible date, where under the influence of the black suit, he alienates her. After acting too bossy and asking her to shut up, she decides to call off the relationship, which saddens Peter. Peter decides to go to a church, where he attempts to remove the symbiote suit, and successfully releases its bond to him. Unfortunately, Brock secretly finds and watches Peter unmask himself, and attaches to the symbiote, becoming Venom.\nBrock finds a still-alive Sandman, and blackmails him to work together to defeat Spider-Man, or he will kill Sandman's daughter, Penny. Sandman eventually agrees. They kidnap MJ, so Peter suits up again in the red suit as Spider-Man. He goes to the construction site where Venom and Sandman are holding MJ captive in a taxi. He fights Venom and Sandman while Harry, recovered from his head injury, decides to help Peter rescue MJ as the New Goblin. Harry arrives and rescues MJ, and fights a giant Sandman which he defeats. Harry attempts to help Spider-Man fight Venom, but is killed in the process. Peter eventually defeats Venom by weakening him with sonic vibrations then dropping the two of them off a building. He survives as Venom is impaled by a steel bar.\nPeter mends his relationship with MJ, and Sandman, still alive, is reunited with Penny, who has just been rescued by police.\n\nGAMEPLAY:\nThe game retains many of the gameplay elements from the previous game. Among the holdovers from the previous game is the freely explorable Manhattan map, which is larger in area than the one in Spider-Man 2. There have been various changes to the movement and combat system, including the usage of motion sensitive controls on the Wii version. The Nintendo DS version's combat system is entirely operated using the DS's touch screen - the d-pad is only used for moving Spider-Man. Players are also now able to interact at certain points during some cutscenes. Another prominent feature is the ability to play as the black-suited Spider-Man from the film, which allows access to new attacks and special &quot;Rage&quot; moves.\n\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\nHELP ME SEED MY LOW-SEEDED TORRENTS SO I CAN UPLOAD MORE AND NOT WORRY ABOUT THE OLD ONES!\n-------------------------------------------------------------------------------------------\n-------------------------------------------------------------------------------------------\n\nDon't forget to snag a copy of my Land of the Dead torrent (you can play it online).\n\n\nI HAVE A FEW ONLINE PLAYABLE TORRENTS SO FAR:\nLand of the Dead\nPostal 1 and Postal 2 Share The Pain (All Mods)\nSniper Elite\nSerious Sam: The First and Second Encounter\nNexuiz\nall doom, heretic sotsr, hexen + ddc, n similar stuff (52 games)    NOTE: This Requires a mod to play online (skulltag), it's free, google it\nDoom Collection (all the older doom games)  NOTE: This Requires a mod to play online (skulltag), it's free, google it\nOTHERS CAN MOST LIKELY BE PLAYED VIA HAMACHI\n\n\nDOWNLOAD ALL MY TORRENTS HERE:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/FuCtUpPuNk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/FuCtUpPuNk&lt;/a&gt;","torrent":{"xt":"urn:btih:e74141e5e9ab3e1d5c9afc9d3dce3eea2ec50c69","amp;dn":"Spider+Man+3+%28Direct+Play%29+%28Spiderman+3%29+%28Sandbox+Game%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e74141e5e9ab3e1d5c9afc9d3dce3eea2ec50c69","infoHashBuffer":{"type":"Buffer","data":[231,65,65,229,233,171,62,29,92,154,252,157,61,206,62,234,46,197,12,105]},"announce":[],"urlList":[]}}