{"title":"The Baddest of George Thorogood [FLAC+MP3]","uid":9512479,"size":539869211,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e84e8db027d911138dc45c43bae85c8d6ba64dba&amp;dn=The+Baddest+of+George+Thorogood+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":8,"uploader":"Big-Papi","files":-1,"time":1390436745,"description":"The Baddest of George Thorogood and the Destroyers [FLAC+MP3] (Big Papi)\n\n\nSource: CD\n\n\nBy N. P. \nThis is one of those discs I don't have to be in the mood for--it always works. This is pure, unpretentious rock and roll by a man who compares his brand of rock to a cheeseburger.\n\nBad to the Bone has been played and played to death. But nearly every song is a little gem, an old fashioned rock feel to the proceedings on tracks like You Talk Too Much, Gear Jammer, I Drink Alone. The oft covered Bo Diddley classic Who Do You Love (once used by Nike to sell sneakers) is a snarling song full of attitude.\n\nI Drink Alone is either a romping good tune or a cry for help from Thorogood himself. Yeah right. George Thorogood makes no secret that he likes drinking, likes driving a truck, likes whiskey, bourbon, scotch, beer, has a woman who talks too much, and will, when push comes to shove, leave his woman if she doesn't start drinking, too. This is about as manly as it gets; enough listens and you'll start challenging people to feats of strength at your local bar.\n\nIn a world where rockers like to whine about their personal problems and how confusing the world is, you can depend on Thorogood to do anything but. He straps on a guitar and name drops Jack Daniels &quot;and his partner Jimmy Beam&quot;.","torrent":{"xt":"urn:btih:e84e8db027d911138dc45c43bae85c8d6ba64dba","amp;dn":"The+Baddest+of+George+Thorogood+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84e8db027d911138dc45c43bae85c8d6ba64dba","infoHashBuffer":{"type":"Buffer","data":[232,78,141,176,39,217,17,19,141,196,92,67,186,232,92,141,107,166,77,186]},"announce":[],"urlList":[]}}