{"title":"The Social Climber's Bible: A Book of Manners (2014) epub","uid":11367459,"size":519403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e84f423ad4ede95b51831d47bbe41e7012c8508a&amp;dn=The+Social+Climber%27s+Bible%3A+A+Book+of+Manners+%282014%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bookzilla","files":1,"time":1415056954,"description":"The Social Climber's Bible: A Book of Manners, Practical Tips, and Spiritual Advice for the Upwardly Mobile \n\nWelcome fledging Social Climbers! Allow us to show you the way.\n\n Birds do it, bees do it, even educated fleas do it, so what's the big deal? You shouldn't be punished for wanting to improve your lot in life! This is America, after all. In the grand tradition of True Prep and The Hipster Handbook, The Social Climber's Bible will teach you everything you need to know to become a pro Mountaineer:\n The Art of Social Climbing at gallery openings, cocktail parties, and funerals\n Social Climbing as a family\n How to handle sex, dating, marriage, and love\n Your social climbing IQ and how to improve it\n How to spot a Big Fish, Whale, Turtle or Unicorn, and what they can do for you\n Johnson &amp; Johnson heiress Jazz Johnson is a lifelong insider in that rarefied world that fans of both Downton Abbey and Gossip Girl dream about. Raconteur Dirk Wittenborn is old enough to remember when sex was safe and cocaine wasn't addictive. In short, Jazz belongs to some of the most exclusive clubs in the world, whereas Dirk has been kicked out of them. Who better to guide you?","torrent":{"xt":"urn:btih:e84f423ad4ede95b51831d47bbe41e7012c8508a","amp;dn":"The+Social+Climber%27s+Bible%3A+A+Book+of+Manners+%282014%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e84f423ad4ede95b51831d47bbe41e7012c8508a","infoHashBuffer":{"type":"Buffer","data":[232,79,66,58,212,237,233,91,81,131,29,71,187,228,30,112,18,200,80,138]},"announce":[],"urlList":[]}}