{"title":"Kudos 2 precracked","uid":9405987,"size":32273762,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e95cfc5617ea0e91b99bb9ea0635203c119c6495&amp;dn=Kudos+2+precracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Rafeweisz","files":1,"time":1388158424,"description":"Kudos 2 is the life-simulation strategy game from Positech Games (makers of Kudos, Democracy and Rock Legend). Kudos is the original inspiration for the game SimSocial by EA (also known as the myspace sims game). Kudos is a turn-based game that puts you in control of a single character and manages their life from age 20 to 30. You get to pick their friends, their job, and how they spend their free time, but there is a catch! You can only choose to do one thing each day, or two at the weekends. This makes Kudos 2 a game of agonizing choices. Do you turn down an invitation from a friend because you are too tired from work? Do you put more time into your friends or your career? When do you find time to look for a better job, or to spend time with your pet? \n\nKudos 2 is unlike any strategy or casual game you have played before. The game has a totally original style, and uses artwork by legendary comic artist Jamie McKelvie. Every game of Kudos is unique. Did you become a high-flying corporate lawyer who cruises to the office each morning in a luxury car, but has no social life, or do you become a popular, trendy and much loved guitar-player, who works as a waitress to pay the bills? Will you have the money to splash out on a burglar alarm, or rely on your martial arts (or your faithful pet dog) to protect you from crime?\n\n----------------------------\n\nGame is in english.\n\nPrecracked. Just install and play.","torrent":{"xt":"urn:btih:e95cfc5617ea0e91b99bb9ea0635203c119c6495","amp;dn":"Kudos+2+precracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e95cfc5617ea0e91b99bb9ea0635203c119c6495","infoHashBuffer":{"type":"Buffer","data":[233,92,252,86,23,234,14,145,185,155,185,234,6,53,32,60,17,156,100,149]},"announce":[],"urlList":[]}}