{"title":"Busqueda implacable (Taken) Dvdrip [Eng]","uid":6558465,"size":734248960,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eae22be710281c9d60f3c4a351094fe510fa4c1d&amp;dn=Busqueda+implacable+%28Taken%29+Dvdrip+%5BEng%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"leoned111","files":1,"time":1311371240,"description":"Seventeen year-old Kim is the pride and joy of her father Bryan Mills. Bryan is a retired agent who left the Central Intelligence Agency to be near Kim in California. Kim lives with her mother Lenore and her wealthy stepfather Stuart. Kim manages to convince her reluctant father to allow her to travel to Paris with her friend Amanda. When the girls arrive in Paris they share a cab with a stranger named Peter, and Amanda lets it slip that they are alone in Paris. Using this information an Albanian gang of human traffickers kidnaps the girls. Kim barely has time to call her father and give him information. Her father gets to speak briefly to one of the kidnappers and he promises to kill the kidnappers if they do not let his daughter go free. The kidnapper wishes him &quot;good luck,&quot; so Bryan Mills travels to Paris to search for his daughter and her friend. Written by Claudio Carvalho, Rio de Janeiro, Brazil\n \nAfter reluctantly agreeing to let his 17-year-old daughter, Kim (Maggie Grace), go to France with her best friend, Bryan Mills (Liam Neeson) is horrified to hear that she is kidnapped by an Albanian gang whose specialty is prostitution rings. With only 96 hours to go before he'll never find her again, Bryan rushes to France to save her. As a former CIA agent, he has all the skills necessary to rescue her - if he can only find her. Written by The Mariah\n ","torrent":{"xt":"urn:btih:eae22be710281c9d60f3c4a351094fe510fa4c1d","amp;dn":"Busqueda+implacable+%28Taken%29+Dvdrip+%5BEng%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eae22be710281c9d60f3c4a351094fe510fa4c1d","infoHashBuffer":{"type":"Buffer","data":[234,226,43,231,16,40,28,157,96,243,196,163,81,9,79,229,16,250,76,29]},"announce":[],"urlList":[]}}