{"title":"South Pacific (1958) Rossano Brazzi  Eng","uid":5864012,"size":1778848362,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb42a75641a681e45b1a73185e179d5fba8e34f2&amp;dn=South+Pacific+%281958%29+Rossano+Brazzi++Eng&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"johnefp","files":-1,"time":1286074761,"description":"Producer/director Joshua Logan's long-awaited filmization of Rodgers &amp; Hammerstein's Pulitzer Prize winning musical South Pacific  was not the classic that everyone hoped it would be, principally because of some curious creative choices made by the production personnel. Adapted from James A. Michener's best-selling novel Tales of the South Pacific, the film stars Mitzi Gaynor  as WAVE officer Nellie Forbush, who while stationed overseas during World War II falls in love with wealthy French planter Emile De Becque (Rosanno Brazzi). The Navy would like DeBecque to help them in a reconnaissance mission against the Japanese, but he refuses; having run away from the outside world after killing a man in his home town, De Becque sees no reason to become involved in a war which he did not start and in which he has no interest. But when Nellie, her inbred bigotry aroused when she discovers that Emile has two mixed-race children, refuses his proposal of marriage, DeBecque, having nothing to lose, agrees to go on the mission. His partner in this venture is Lt. Joseph Cable (John Kerr), who like Nellie is a victim of prejudicial feelings; Cable has previously thrown away a chance at lasting happiness by refusing to marry Liat (France Nuyen), the dark-skinned daughter of Tokinese trader Bloody Mary (Juanita Hall). When Cable is killed and DeBecque is seemingly lost in battle, Nellie, realizing the stupidity of her racism, prays for Emile's safe return. The dramatic elements of South Pacific are offset by the low-comedy antics of &quot;Big Dealer&quot; seabee Luther Billis (Ray Walston). Outside of Walston and Hall, both repeating their stage characterizations, South Pacific suffers from a largely noncharismatic cast. Mitzi Gaynor never rises above cuteness in the difficult role of Nellie Forbush, while Rosanno Brazzi (whose singing is dubbed by Giorgio Tozzi) seems to be striking poses rather than acting as Emile DeBecque. These casting deficiencies might have been ignored had not South Pacific been laboring under an additional handicap: director Joshua Logan's decision to use colored filters in several key scenes, representing the emotions experienced by the actors. The constant color shift is more unsettling than attractive, drawing attention to Logan's technique and thereby taking the audience &quot;out&quot; of the picture. With all this going against it, however, South Pacific has much to be treasured. For one thing, all of Rodgers &amp; Hammerstein's immortal songs--&quot;Some Enchanted Evening,&quot; &quot;Bali H'ai,&quot; &quot;There is Nothing Like a Dame,&quot; &quot;I'm in Love With a Wonderful Guy,&quot; &quot;Younger Than Springtime&quot; etc.--are retained, and, as a bonus, a song cut from the original stage production, &quot;My Girl Back Home,&quot; is revived herein. In addition, the film is a bonanza for movie buffs who enjoy playing &quot;spot the bit player:&quot; among the supporting-cast ranks are Tom McLaughlin, Ron Ely, Doug McClure, John Gabriel and James Stacy (rumors persist that Joan Fontaine shows up unbilled as a nurse, but we've yet to spot her). Though artistically disappointing, South Pacific ended up one of the biggest box-office gold mines of the 1950s. \n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0052225/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0052225/&lt;/a&gt;\n\n\nSubs\n\n &lt;a href=&quot;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-44606&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.opensubtitles.org/en/search/sublanguageid-all/idmovie-44606&lt;/a&gt;\n\n\n[Movie]\nValid : Yes [AVI]\nDuration : 02:30:58\nMovie complete : Yes\n\n[Video]\nResolution : 720x336 2.41:1\nCodec : DivX (4 / 5 / 6)\nFPS : 23,98\nBitRate : 1443 Kbps\nQuality Factor : 0,25 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 128 Kbps\n\n\nPlease seed at least as much as you D/L.\n\nDon't hit and run.\n=======================================\nThanks \n\nJohn\n\n\n\n","torrent":{"xt":"urn:btih:eb42a75641a681e45b1a73185e179d5fba8e34f2","amp;dn":"South+Pacific+%281958%29+Rossano+Brazzi++Eng","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb42a75641a681e45b1a73185e179d5fba8e34f2","infoHashBuffer":{"type":"Buffer","data":[235,66,167,86,65,166,129,228,91,26,115,24,94,23,157,95,186,142,52,242]},"announce":[],"urlList":[]}}