{"title":"State-Sponsored Terrorism, Crimes, and Lies-Collection22 (Syria)","uid":11856098,"size":90708205,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eccb064c44e44fc662098897b19247640abb50d7&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies-Collection22+%28Syria%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"moman73","files":35,"time":1430159466,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 22 (Syria):\n\nThe dictatorship Regime in Syria is committing horrendous atrocities against its own people including the use of chemical weapons under the watching eyes of the 'civilized' world. It is estimated that in a span of 5-years of civil war, more than 300,000 civilians were killed and millions were wounded and/or displaced.\n\nWe have 35 titles here:\n\n-  AlJazeera Center for Studies - Syrian Presidential Elections; Final Blow to Geneva (June 2014)\n\n-  Amnesty International Report 2014_15; Syrian Arab Republic\n\n-  Bar - Bashar's Syria; the Regime and its Strategic Worldview (2006)\n\n-  Barnes-Dacey &amp; Levy - The Regional Struggle for Syria, European Council on Foreign Relations (2013)\n\n-  Blanchard et al - Armed Conflict in Syria; Overview and U.S. Response, Congressional Research Service (Sep 2014)\n\n-  Buchs - The Resilience of Authoritarian Rule in Syria under Hafez and Bashar Al-Asad, GIGA Working Paper (March 2009)\n\n-  Center for Civilians in Conflict - Syria; Civilian Harm and Assistance (Sept 2013)\n\n-  Erlich - Inside Syria; the Backstory of Their Civil War and What the World Can Expect (2014)\n\n-  Gelvin - The Arab Uprisings; What Everyone Needs to Know (2012)\n\n-  Holliday - The Assad Regime from Counterinsurgency to Civil War, ISW (March 2013)\n\n-  HRW - Attacks on Ghouta; Analysis of Alleged Use of Chemical Weapons in Syria (2013)\n\n-  HRW - Death form the Skies; Deliberate and Indiscriminate Air Strikes on Civilians (2013)\n\n-  HRW - In Cold Blood; Summary Executions by Syrian Security Forces and Pro-Government Militias (2012)\n\n-  HRW - Torture Archipelago; Arbitrary Arrests, Torture, and Enforced Disappearances in Syria's Underground Prisons since March 2011 (2012)\n\n-  Human Rights Council - Report of the Independent Int. Commission of Inquiry on the Syrian Arab Republic (June, 2013)\n\n-  Jenkins - The Dynamics of Syria's Civil War, RAND (2014)\n\n-  Lebanon's Hizbollah Turns Eastward to Syria, Int. Crisis Group, Report No. 153 (May 2014)\n\n-  Littell - Syrian Notebooks; Inside the Homs Uprising (2015)\n\n-  Mallat et al - A Strategy for Syria Under Int. Law; How to End the Asad Dictatorship While Restoring Nonviolence.., Harvard Int. Law J. (March 2012)\n\n-  McHugo - Syria; a History of the Last Hundred Years (2015)\n\n-  McLaren - The Plain of Dead Cities; a Syrian Tale (2015)\n\n-  Nikitin et al - Syria's Chemical Weapons; Issues for Congress, Congressional Research Service (Sep 2013)\n\n-  Pipes - The Alawi Capture of Power in Syria, Middle Eastern Studies, Vol. 25, No. 4 (Oct 1989)\n\n-  Pitzke - UN Report; Gas Attack in Syria 'Indisputable', Spiegel Online (2013)\n\n-  Qaddour - Unlocking the Alawite Conundrums in Syria, The Washington Quarterly (Fall 2013)\n\n-  Sahner - Among the Ruins; Syria Past and Present (2014)\n\n-  Samii - A Stable Structure on Shifting Sands; Assessing the Hizbullah-Iran-Syria Relationship, Middle East Journal (Winter 2008)\n\n-  Security Council - Report of the UN Mission to Investigate Allegations of the Use of Chemical Weapons in the Syrian Arab Republic... (Sept. 2013)\n\n-  Springett - Secret Sects of Syria and the Lebanon; Consideration of Their Origin, Creeds and Religious Ceremonies, .. (2006) \n\n-  Sullivan - Hezbollah in Syria, ISW (April 2014)\n\n-  The Anglo-French Patrons of Syria's Hafez al-Assad, Executive Intelligence Review (Nov 1996)\n\n-  Trenin - The Mythical Alliance; Russia's Syria Policy, The Carnegie Papers (Feb 2013)\n\n-  United Nations Mission to Investigate Allegations of the Use of Chemical Weapons in the Syrian Arabic Republic (2013)\n\n-  Worren - Fear and Resistance; the Construction of Alawi Identity in Syria (Feb 2007)\n\n-  Ziadeh - Power and Policy in Syria; Intelligence Services, Foreign Relations and Democracy in the Modern Middle East (2011)","torrent":{"xt":"urn:btih:eccb064c44e44fc662098897b19247640abb50d7","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies-Collection22+%28Syria%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eccb064c44e44fc662098897b19247640abb50d7","infoHashBuffer":{"type":"Buffer","data":[236,203,6,76,68,228,79,198,98,9,136,151,177,146,71,100,10,187,80,215]},"announce":[],"urlList":[]}}