{"title":"Barry Manilow - Ultimate Manilow [FLAC+MP3]","uid":9512882,"size":188854009,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ecd10520d710c503f072d3de7e552ce1153f8794&amp;dn=Barry+Manilow+-+Ultimate+Manilow+%5BFLAC%2BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"Big-Papi","files":-1,"time":1390449498,"description":"Barry Manilow - Ultimate Manilow [FLAC+MP3]\n\n\nSource: CD\n\n\n\n\nBy Carole\n\nWhen was the last time Barry Manilow seriously charted a record? My guess is that it's been about 20 years since broke the top 25, let alone the top 10. Well, lookie here -- this album debuts on the Billboard 100 this week at #3. You read it right.....NUMBER THREE.\n\nThe really &quot;Ultimate&quot; thing about Manilow is that for all the jokes about him over the years - he has always had the last laugh. As a songwriter/arranger who most thought had only a passable voice with his thick Brooklyn accent, he became one of the top vocalists of the 1970's with many of his biggest hits being the songs he DIDN'T write. He also single-handedly brought back the sound of a full orchestra in popular music after years of only rhythm instruments.\n\nWhen the early 1980's arrived and musical tastes changed, Manilow disappeared from the airwaves. But he has never disappeared from the public. He maintained and built his solid concert following worldwide, selling out shows for years and years. The average person in the U.S.A. has no concept of how big Barry is all over the world. In fact, unless you have and play his old albums, many people haven't heard him in years because his records don't even get played on &quot;oldies&quot; stations and only occasionally on &quot;granny&quot; stations.\n\nManilow's unabashed vocal sincerity and musical romanticism, while not always hip, has always been &quot;in&quot;. As be-bop, hip-hop, new wave, grunge, and every other here today/gone tomorrow style passes by, the one constant is the romantic ballad. Barry knows it and never strays far from it. Unlike Coca-Cola who foolishly changed their winning formula several years ago to disasterous effect, Manilow is constant and loyal to both his product and his fans.\n\nAs for the songs in this collection, they are quintessential Barry - huge production values, soaring vocals, the halting drum break before the inevitable key-change. I had the full library of Manilow albums while growing up and we have long since parted. It's great to have the cream of the crop (with a few minor omissions) on one CD. These songs bring back some great memories.\n\nI'm thrilled for Barry that he's regaining some prominence with this collection, his appearance on &quot;Ally McBeal&quot;, and at the Super Bowl pre-game festivities. I suspect that about four years from now when he turns 60 and is tired of touring, we're going to see Barry pitch his tent in Branson, Missouri at the Copacabana Theater! Good for him.","torrent":{"xt":"urn:btih:ecd10520d710c503f072d3de7e552ce1153f8794","amp;dn":"Barry+Manilow+-+Ultimate+Manilow+%5BFLAC%2BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd10520d710c503f072d3de7e552ce1153f8794","infoHashBuffer":{"type":"Buffer","data":[236,209,5,32,215,16,197,3,240,114,211,222,126,85,44,225,21,63,135,148]},"announce":[],"urlList":[]}}