{"title":"The Johann Strauss II Complete Edition","uid":6257989,"size":5551449192,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ece88fbe83b7a1d22b56c3f733f5678549bfa170&amp;dn=The+Johann+Strauss+II+Complete+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"rosie1966","files":53,"time":1300647668,"description":"Here is ALL the music Strauss composed for the Viennese public for over 50 years!! This torrent contains all 51 CDs of the now out-of print Strauss Edition. \n\nAs many of you may already have some of this music, I have presented each volume separately in the torrent so you can pick and choose if you do not want to DL the whole thing. A file named &quot;Index Booklet&quot; indicates which works are on which volumes for your reference. The producers of this Edition only provided one or two well-known pieces on each CD so that Strauss-lovers would have to buy more volumes to get their favorites!!\n\nThere are, sadly, no scans, but I was able to find some track info for some of the volumes from another site. If anybody knows where more track listings can be obtained, please leave a comment.\n\nNotice to Mac Users: The original uploader made the liner notes available through the Get Info (command-I) box. Just GETINFO on each file to get a nice description of each work. There is also cover art embedded as an icon for each file.\n\nNotice to Windows Users: I was unable to access this info using File Properties (comments). Perhaps some Windows guru will be able to enlighten me with a comment. In consolation, about 60% of the volumes contain a pdf file with the liner notes. Sorry I couldn't get them all.\n\nI hope most of you DL the whole torrent. You will then have the 478 tracks of some of the happiest music ever written!.","torrent":{"xt":"urn:btih:ece88fbe83b7a1d22b56c3f733f5678549bfa170","amp;dn":"The+Johann+Strauss+II+Complete+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ece88fbe83b7a1d22b56c3f733f5678549bfa170","infoHashBuffer":{"type":"Buffer","data":[236,232,143,190,131,183,161,210,43,86,195,247,51,245,103,133,73,191,161,112]},"announce":[],"urlList":[]}}