{"title":"Rapid Review of Radiology","uid":7287223,"size":42193707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed1c56de122e1bcac42b9a6b9d84817296452e6a&amp;dn=Rapid+Review+of+Radiology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"chami1988","files":-1,"time":1337620789,"description":"In this book the author has compiled a selection of cases covering many aspects of radiology to help trainees with the practical aspects of image recognition and formulating a differential diagnosis. The selection of cases is broad enough to provide an introduction for some readers, with more testing cases for those in the later stages of training. Each self-test case is presented with an image, or set of images, together with the pertinent clinical details. The solution and explanation is presented over the page along with differential diagnoses that logically derive from the images and history. The correct diagnosis is followed by a discussion of the underlying diagnosis with teaching points and main imaging findings, plus any other important factors emerging from the discussion. The book contains 423 images including X-rays, ultrasound, CT, MRI, interventional techniques and nuclear medicine. It will be useful to radiologists in training and other health professional wishing to improve their radiological skills.","torrent":{"xt":"urn:btih:ed1c56de122e1bcac42b9a6b9d84817296452e6a","amp;dn":"Rapid+Review+of+Radiology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed1c56de122e1bcac42b9a6b9d84817296452e6a","infoHashBuffer":{"type":"Buffer","data":[237,28,86,222,18,46,27,202,196,43,154,107,157,132,129,114,150,69,46,106]},"announce":[],"urlList":[]}}