{"title":"The Art of Digital Audio Recording","uid":11601819,"size":7363656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed341fd9800258f138d43922b849cbc5542a6b46&amp;dn=The+Art+of+Digital+Audio+Recording&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"FrankFoo2","files":-1,"time":1417360963,"description":"\nThe Art of Digital Audio Recording: A Practical Guide for Home and Studio by Steve Savage\n\nEnglish | 2011 | ISBN: 0195394100 |  288 pages |\n\nMaking great audio recordings requires striking the right balance between technical know-how and practical understanding of recording sessions.\n \nEven in the digital age, some of the most important aspects of creating and recording music are non-technical and, as a result, are often overlooked by traditional recording manuals.\n\nThe Art of Digital Audio Recording teaches readers what they really need to know in order to make great sound recordings with computers - both the practical and the technical information, including:\n\n* What to look and listen for in a recording environment\n\n* Straightforward advice on recording almost any instrument\n\n* Essentials of digital audio workstations\n\n* Essentials of recording gear: microphones, mixers, and speakers\n\n* Fundamentals of understanding and applying EQ, compression, delay, and reverb\n\n* Secrets to running creative recording sessions\n\n* Practical application of digital editing, mixing, and mastering\n\n\nA special section identifies solutions to the most common challenges in the recording studio, and the book also features an addendum with essential tips and reference information including:\n\n* How to walk into a commercial studio and be the engineer\n\n* Researching and buying gear: Internet vs. brick and mortar\n\n* Digital formats: A handy reference\n\nAs a whole, The Art of Digital Audio Recording is an essential resource that gives recordists the tools they need to let technical understanding serve greater musical goals.\n\nMultiTracker @ FrankFoo","torrent":{"xt":"urn:btih:ed341fd9800258f138d43922b849cbc5542a6b46","amp;dn":"The+Art+of+Digital+Audio+Recording","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed341fd9800258f138d43922b849cbc5542a6b46","infoHashBuffer":{"type":"Buffer","data":[237,52,31,217,128,2,88,241,56,212,57,34,184,73,203,197,84,42,107,70]},"announce":[],"urlList":[]}}