{"title":"WARSHIFT-SKIDROW","uid":16032451,"size":1228378368,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ed539f68b7f80439345940947cb850c6821653b8&amp;dn=WARSHIFT-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":4,"uploader":"johflat","files":2,"time":1476441111,"description":"S K I D R O W\r\nthe leading force\r\n\r\nproudly presents\r\nWARSHIFT\r\n(c) Nominia Ltd\r\n\r\n13-10-2016......Release Date  Protection.................Steam\r\nRTS................Game Type  Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nIn 2062, the colonial planet &quot;Enigma&quot; was invaded by an aggressive\r\nalien race Atroid's from the parallel world that has gone into our\r\nuniverse through the hypothetical &quot;Gates of Chaos&quot;. This non-material\r\nbeings were forced to clothe their energy nucleuses in the strong\r\nphysical shells (exoskeletons), as they needed to have impact on the\r\nenvironment in our world. As a result, they created an army of alien\r\ndroids which are capable to fight in any environment and at any\r\ntemperature. The fortifications of the planetary defense line turned\r\nout to be not effective against the powerful energy weapon used by the\r\naliens. Soon, the biosphere of the planet felt the destructive power of\r\ntheir deadly attack, and a half of its surface turned into a lifeless\r\ndesert. The miner colony garrison that was made up of volunteer\r\nsoldiers suffered huge losses and was urgently evacuated. All resource\r\nextraction works on the planet were suspended, and corporations began\r\nto bear huge losses. But, after numerous antiwar protests, the\r\ngovernment of the Colonial Republic did not want to risk human lives\r\nand scientists had to create an entirely new army of intergalactic\r\noperations. The republican fleet and the assault battalion &quot;Delta&quot;\r\nconsisting of cyber-guards, heavy machinery and robotic\r\ndrones-transformers was sent to the planet. The Commanders who have\r\ntelepathic skills control that steel armada while being aboard the\r\nARKS. For the purpose of their own safety, they are forbidden to leave\r\nthe ARK. However, they can be directly involved in battles as operators\r\nof combat avatars (unmanned combat robotic vehicle). If any\r\ncombat avatar gets a critical damage, it will be immediately evacuated\r\nand, after a quick repair, again will be sent to the battlefield. But\r\nif the aliens are still able to destroy all the ARKS, the Colonial\r\nRepublic will lose control of the planet forever\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:ed539f68b7f80439345940947cb850c6821653b8","amp;dn":"WARSHIFT-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed539f68b7f80439345940947cb850c6821653b8","infoHashBuffer":{"type":"Buffer","data":[237,83,159,104,183,248,4,57,52,89,64,148,124,184,80,198,130,22,83,184]},"announce":[],"urlList":[]}}