{"title":"Problems of Multiphase Fluid Filtration","uid":15738484,"size":2551203,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed5c299f8a549372e72287cc9e7713a743aa6c28&amp;dn=Problems+of+Multiphase+Fluid+Filtration&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"clouderone","files":1,"time":1472867206,"description":"Problems of Multiphase Fluid Filtration - A.N. Konovalov (WSP, 1994).djvu\r\n\r\nThis book deals with a spectrum of problems related to the mathematical modeling of multiphase filtration. Emphasis is placed on an inseparable triad: model — algorithm — computer code. An analysis of new and traditional filtration problems from the point of view of both their numerical implementation and the reproduction of one or another technological characteristics of the processes under consideration is given. The basic principles which underlie the construction of efficient numerical methods taking into account the filtration problems are discussed: non-evolutionary nature, degeneration, strongly varying coefficients, the (temporal) duration of the processes involved, etc. Also attention is paid to the splitting method in terms of the physical processes involved, the method of fictitious domains and the method of front separation in grid solution. A modular analysis is performed with computational algorithms, making it possible to set up simultaneously the structure of the algorithms themselves and the structure of programs to implement these algorithms on a computer. In conclusion, the author discusses issues concerning the possibility of constructing a model of an oil deposit on a computer","torrent":{"xt":"urn:btih:ed5c299f8a549372e72287cc9e7713a743aa6c28","amp;dn":"Problems+of+Multiphase+Fluid+Filtration","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5c299f8a549372e72287cc9e7713a743aa6c28","infoHashBuffer":{"type":"Buffer","data":[237,92,41,159,138,84,147,114,231,34,135,204,158,119,19,167,67,170,108,40]},"announce":[],"urlList":[]}}