{"title":"Paul Anand - The Handbook of Rational and Social Choice [2009][A","uid":10094489,"size":2872778,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee25e9ea50d654197fc398161f3a14fd8dcf08a4&amp;dn=Paul+Anand+-+The+Handbook+of+Rational+and+Social+Choice+%5B2009%5D%5BA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1399258040,"description":"Description\nProduct Details\nBook Title: The Handbook of Rational and Social Choice (Oxford Handbooks)\t\nBook Author: Paul Anand, Prastanta Pattanaik, Clemens Puppe\nSeries: Oxford Handbooks\nHardcover: 624 pages\nPublisher: Oxford University Press (March 15, 2009)\nLanguage: English\nISBN-10: 0199290423\nISBN-13: 978-0199290420\n\n===================================================================================\nBook Description\nPublication Date: March 15, 2009 | ISBN-10: 0199290423 | ISBN-13: 978-0199290420\nThe Handbook of Rational and Social Choice provides an overview of issues arising in work on the foundations of decision theory and social choice over the past three decades. Drawing on work by economic theorists mainly, but also with contributions from political science, philosophy and psychology, the collection shows how the related areas of decision theory and social choice have developed in their applications and moved well beyond the basic models of expected utility and utilitarian approaches to welfare economics.\nContaining twenty-three contributions, in many cases by leading figures in their fields, the handbook shows how the normative foundations of economics have changed dramatically as more general and explicit models of utility and group choice have been developed. This is perhaps the first time these developments have been brought together in a manner that seeks to identify and make accessible the recent themes and developments that have been of particular interest to researchers in recent years. The collection will be of particular value to researchers in economics with interests in utility or welfare but it will also be of interest to any social scientist or philosopher interested in theories of rationality or group decision-making.\n\n===================================================================================\nReview\n...a rich resource of material in individual and collective choice. Conrad Heilman Journal of Economics and Philosophy Volume 28\n\n===================================================================================\nAbout the Author\nPaul Anand was a Research Fellow of Templeton College Oxford when the book was written and currently has affiliations to the Open University, Oxford and LSE.\nPrasanta Pattanaik is Emeritus Professor of Economics at the University of California, Riverside. Previously he has held a number of research and teaching posts including Nuffield College, Oxford University and Harvard University. He has also acted as editor on a number of journals including Social Choice and Welfare, Journal of Human Development, and Journal of International Trade and Development. Clemens Puppe is Professor of Economics at the University of Karlsruhe. Previously he has held a number of posts including an Associate Professorship at the University of Bonn and Visiting Fellowships at the Universities of California at Davis and Harvard University.\n===================================================================================","torrent":{"xt":"urn:btih:ee25e9ea50d654197fc398161f3a14fd8dcf08a4","amp;dn":"Paul+Anand+-+The+Handbook+of+Rational+and+Social+Choice+%5B2009%5D%5BA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee25e9ea50d654197fc398161f3a14fd8dcf08a4","infoHashBuffer":{"type":"Buffer","data":[238,37,233,234,80,214,84,25,127,195,152,22,31,58,20,253,141,207,8,164]},"announce":[],"urlList":[]}}