{"title":"Sigur Ros Discography","uid":4164115,"size":638509039,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:eee218733de9e4e74de3c067b46e71964f0c559d&amp;dn=Sigur+Ros+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":2,"uploader":"Sotha_syl","files":107,"time":1209519306,"description":"This is simply my collection of all of the Sigur RÃƒÂ³s albums and EPs that I could find. I&amp;#039;ve probably put this all together over the period of a few weeks, and I thought I&amp;#039;d share what I had with TPB, seeing as I tried to find a torrent exactly like this when I first fell in love with this group.\n\nIt includes the following official Sigur RÃƒÂ³s albums - \n\n\nVon (1997) - Their first and strangest album, I like it.\n\nÃƒ?gÃƒÂ¦tis byrjun (1999)- My personal favourite.\n\n( ) (2002) - Untitled, all in &amp;#039;hopelandic&amp;#039;, which means no lyrics, just vocals that sound vaguely like Icelandic\n\nTakk... (2005) - Their newest material, which I don&amp;#039;t like as much, most of the songs sound the same to me.\n\n\nAlso a few side projects, EPs, and Soundtracks\n\nRÃƒÂ­mur EP (2001) - a very rare EP, 1000 copies were released and sold on an Icelandic Tour. I&amp;#039;ve uploaded a torrent of this as a standalone. Good luck finding it anywhere else.\n\nSÃƒÂ¦glÃƒÂ³pur EP (2006) - A japan only EP\n\nHlemmur Soundtrack (2007) - Instrumental soundtrack to an Icelandic documentary about the homeless population in ReykjavÃƒÂ­k\n\nHvarf-Heim (2007)- Sort of a compilation album, but has some good new material.\n(Unannounced New Studio Album - I&amp;#039;ll include this once I can obtain it)\n\n\nThe Following material is NOT included in this torrent, for various reasons : \n\nHrafnagaldr Ãƒ?ÃƒÂ°ins - A symphony of sorts, I believe. I have yet to find a solid release of this. \n\nPopp ÃƒÂ­ ReykjavÃƒÂ­k - a documentary on Icelandic music featuring Sigur RÃƒÂ³s, as far as I can tell just songs from the albums I have on here.\n\nAngels of the Universe Soundtrack - They contributed two songs. Good movie, download it, or the soundtrack, it&amp;#039;s all on TPB.\n\nHeima - A film, and there are plenty of torrents of it everywhere. I reccomend it.\n\nBa Ba Ti Ki Di Do EP - a three song EP that I have been unable to find, but it sounds amazing. Three independent songs, that if played at the same time form another song. Similar to the Flaming Lips project &amp;#039;Zaireeka&amp;#039;. If anyone can find this, PLEASE let me know.\n\nVon brigÃƒÂ°i - The recycled album. Remixes. I&amp;#039;m not a fan of that kind of material, but I&amp;#039;d give it a chance.\n\nAll of their Singles - I find it kinda pointless, it&amp;#039;s just songs that were on their albums.\n\nI&amp;#039;ll try and get as much as I can of the material I don&amp;#039;t have and update this torrent, if that&amp;#039;s possible. Sort of new to uploading, sorry if you disagree with my comments on each of the albums. But this is the core material of Sigur RÃƒÂ³s, and I hope you like it.","torrent":{"xt":"urn:btih:eee218733de9e4e74de3c067b46e71964f0c559d","amp;dn":"Sigur+Ros+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eee218733de9e4e74de3c067b46e71964f0c559d","infoHashBuffer":{"type":"Buffer","data":[238,226,24,115,61,233,228,231,77,227,192,103,180,110,113,150,79,12,85,157]},"announce":[],"urlList":[]}}