{"title":"Michael Jackson - Xscape (2014) [Deluxe HD Version]","uid":10155072,"size":1708642270,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ef41f1cdddfcbbcfeb2aad7463d08c8310114cdf&amp;dn=Michael+Jackson+-+Xscape+%282014%29+%5BDeluxe+HD+Version%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"sidmal","files":-1,"time":1400150332,"description":"\nMichael Jackson - Xscape (2014) [Deluxe HD Version]\n FLAC (tracks) 24 bit/96 kHz | Time - 73:25 minutes | 1,67 GB\nOfficial Digital Download - Source: Epic/Qoobuzzz | Front cover\n\n XSCAPE is another album of previously unreleased Michael Jackson songs. The album is produced and curated by Epic Records Chairman and CEO L.A. Reid, who retooled the production to add a fresh, contemporary sound that retains Jackson's essence and integrity. It's a process Reid calls &quot;contemporizing&quot;. The list of producers include global hitmakers Timbaland, Rodney Jerkins, Stargate, and John McClain.\n\n\n Underneath it all, underneath all the keyboards and programmed rhythms designed to bring the music on XSCAPE into the 21st century, is this simple fact: the lead single, &quot;Love Never Felt So Good,&quot; was co-written by Paul Anka, a superstar of another era who never quite made his presence known in the new millennium. Jackson didn't care. MJ loved old show biz and songcraft in equal measure and that love can be heard on &quot;Love Never Felt So Good,&quot; along with the other seven songs on XSCAPE. Only the second major posthumous release in his catalog -- he passed in 2009 on the eve of an orchestrated comeback -- XSCAPE delves deep into that past, excavating songs that have been languishing in the vaults for various reasons since at least 1983 or perhaps later. Exact dates aren't published because XSCAPE isn't meant to be an archival release, it's designed to push Jackson back onto the charts, which means &quot;Love Never Felt So Good&quot; is constructed as a duet with Justin Timberlake, who is as eager as a puppy to sing with his idol. That he's not really trading lines with MJ doesn't matter; his presence is endorsement, ensuring chart attention which it might not have received. The deluxe edition of XSCAPE contains the original demos of the eight songs on this album -- it's a short record by any measure -- and, ultimately, these are fascinating in a way the finished tracks aren't; these spare voice and keyboard sketches are nevertheless full-bodied, so it's possible to imagine how the songs would've fit on Bad, Dangerous, or Invincible. Often, the demos reveal how strong Jackson's songwriting is -- they're so flexible, they could withstand any number of arrangements, which is why &quot;Love Never Felt So Good&quot; is so instructive. In its original voice-and-piano arrangement it's possible to hear its glitzy show biz roots via Anka, but the production -- supervised by L.A. Reid and Timbaland -- is clever, accentuating Off the Wall while being spare and clean enough to sound modern. This is especially true of the version of &quot;Love,&quot; which is a duet with Justin Timberlake -- the show biz kid is happy to create an illusion -- but the entire affair is savvier than 2010's Michael, which was caught between the twilight of sentiment and commerce. XSCAPE considers Jackson's legacy quite carefully, deciding to emphasize the splashy soul and diluted disco of Off the Wall over the triumphant Thriller or any of the calculated records that followed in its wake. If he had lived, Jackson likely wouldn't have followed this path -- everything from Bad and beyond showed he was acutely aware of pop trends, often to his detriment (he'd hold himself back instead of engage) -- but that's also the appeal of XSCAPE. Timbaland and Reid evoke the Michael Jackson we all love and miss, finding songs that are worthy and giving them arrangements that are simultaneously nostalgic and modern. It's a difficult trick to pull off but they largely succeed, so XSCAPE is a worthy and memorable coda to Jackson's career.  \n\n\nTracklist:\n\n 01 - Love Never Felt So Good\n 02 - Chicago\n 03 - Loving You\n 04 - A Place With No Name\n 05 - Slave to the Rhythm\n 06 - Do You Know Where Your Children Are\n 07 - Blue Gangsta\n 08 - Xscape\n 09 - Love Never Felt So Good (Original Version)\n 10 - Chicago (Original Version)\n 11 - Loving You (Original Version)\n 12 - A Place With No Name (Original Version)\n 13 - Slave To The Rhythm (Original Version)\n 14 - Do You Know Where Your Children Are (Original Version)\n 15 - Blue Gangsta (Original Version)\n 16 - Xscape (Original Version)\n 17 - Love Never Felt So Good (Feat. Justin Timberlake)\n\nPlease Note: Album contains tracks in 44k/48k tracking with 96/24 overdubs. Mixed &amp; Mastered to 96/24. \n","torrent":{"xt":"urn:btih:ef41f1cdddfcbbcfeb2aad7463d08c8310114cdf","amp;dn":"Michael+Jackson+-+Xscape+%282014%29+%5BDeluxe+HD+Version%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef41f1cdddfcbbcfeb2aad7463d08c8310114cdf","infoHashBuffer":{"type":"Buffer","data":[239,65,241,205,221,252,187,207,235,42,173,116,99,208,140,131,16,17,76,223]},"announce":[],"urlList":[]}}