{"title":"Korn - MTV Unplugged (2007) WMA320","uid":6405516,"size":120641662,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:efa449fd86043c043a553a6c4e4f3bceb8dbad59&amp;dn=Korn+-+MTV+Unplugged+%282007%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"MARCELODRGZ","files":-1,"time":1305796870,"description":"After 7 studio albums Korn have finally been asked to perform for MTV's Unplugged series. The result is much better than I ever could have expected. \n\n1. Blind \nA very different take on Korn's very first single. This version of Blind sounds very latin and &quot;flamenco&quot;esque. It has some very nice guitar work. \n\n2. Hollow Life \nProbably one of the weaker tracks on the album but still nice. A little less piano and this track would have been better for me. \n\n3. Freak On A Leash feat. Amy Lee from Evanescence \nKorn's biggest single still to this day would probably be Freak On A Leash. This version is quite different but still a classic in everyway. Amy Lee brings her amazing vocals to this track and compliments it very well. \n\n4. Falling Away From Me \nExcellent version of Falling Away From Me. From the eery bells at the beginning through to the &quot;heavy&quot; accoustic break down at the end. The guys pull this one off very well. \n\n5. Creep \nProbably one of the best performances on the whole album. This is a cover of Radiohead's classic 'Creep'. Korn make this song a little bit quieter and darker but no less intense. Amazing vocals on this one. \n\n6. Love Song \nAn amazing song but probably one of the weaker ones on this album. It does not have the same feel as the version on See You On The Other Side on which it is probably one of my favourite tracks. \n\n7. Got The Life \nNice version of Got The Life. It actually works quite well as an accoustic song considering its tempo, etc. \n\n8. Twisted Transistor \nA very good performance of Twisted Transistor. Nice use of the 'orchestra'. \n\n9. Coming Undone \nA nice solid version of this song. A bit repetitive but the original song is like that too. Nice use of the saw though. Good performance. \n\n10. Make Me Bad / In Between Days feat. The Cure \nAn amazing mashup of two great songs. I never thought i would see these 2 bands perform together but here they are. Both bands work together very well and the result is great. \n\n11. Throw Me Away \nThe finale. A great performance of this song. Probably better than the original album version. For this song they brought out a Taiko drum ensamble. Very powerful song. \n\n12. BONUS TRACK only for Japanese Edition!!\n\nENJOY this album!!! \n\nby R. Ogston\n\nTRACKLIST:\n\n01 - Blind.wma                                              \n02 - Hollow Life.wma                                        \n03 - Freak On A Leash (Feat. Amy Lee From Evanescence).wma  \n04 - Falling Away From Me.wma                               \n05 - Creep (Cover On Radiohead).wma                         \n06 - Love Song.wma                                          \n07 - Got The Life.wma                                       \n08 - Twisted Transistor.wma                                 \n09 - Coming Undone.wma                                      \n10 - Make Me Bad - In Between Days  (Feat. The Cure).wma    \n11 - Throw Me Away.wma                                      \n12 - Dirty (Bonus Track For Japan Only).wma   \n\nWMA 320Kbps 44100Hz STEREO\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!  ","torrent":{"xt":"urn:btih:efa449fd86043c043a553a6c4e4f3bceb8dbad59","amp;dn":"Korn+-+MTV+Unplugged+%282007%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efa449fd86043c043a553a6c4e4f3bceb8dbad59","infoHashBuffer":{"type":"Buffer","data":[239,164,73,253,134,4,60,4,58,85,58,108,78,79,59,206,184,219,173,89]},"announce":[],"urlList":[]}}