{"title":"Star Wars: Thrawn Trilogy [Retail Edited] -- VoV","uid":6992142,"size":19120496,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f012b4b91e0ce438eccf10d4e4fe5424669fc24d&amp;dn=Star+Wars%3A+Thrawn+Trilogy+%5BRetail+Edited%5D+--+VoV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"VixenofVenus","files":-1,"time":1327747248,"description":"\n*******************************************************************************\nThe Thrawn Trilogy\n*******************************************************************************[/b]\n\n\nCommon File Information\n-----------------------------------\n[b]Source / Type........: Retail E-Book\n[b]Compatibility........:[/b] iPad / nook / Kindle / etc.\n[b]E-Book Format........:[/b] ePub &amp; Mobi\n[b]Genre................:[/b] Science Fiction / Adventure\n[b]Information..........:[/b] [url]http://starwars.wikia.com/wiki/Thrawn_trilogy[/url]\n[b]Description(s).......:[/b] The trilogy follows the campaigns of Imperial Grand Admiral Thrawn, from the Battle of Obroa-skai to the Battle of Bilbringi. It also recounts the efforts of the Dark Jedi Joruus C'baoth, and his efforts to claim Luke Skywalker, Leia Organa Solo, and her children as his apprentices. \n[hr]\n\nOkay, it's been a long, long time since I've uploaded any torrents.  Mostly just been too busy with other things to continue doing the work to convert films and upload them.  Plus, with all the wonderful people using HolyRoses's conversion methods and uploading their own conversions, most films get converted to portable formats and uploaded before I could anyways.  So, I have to take this opportunity to say how great they're all doing.\n\nI've recently been using my nook to re-read some old Star Wars novels, and I gotta thank kileko for the large collection of Star Wars Retail Novels.  But I've noticed even these wonderfully formatted &quot;retail&quot; ebooks have some errors and issues.  So as I read, I highlighted the errors and then corrected them in Sigil when I was finished.  I'm not promising that I caught everything, but I know I caught about 10+ errors in each of these three books.  Probably the funniest error was in &quot;Dark Force Rising&quot;, every instance where the author wrote &quot;kind&quot; it was instead replaced by the word &quot;land&quot; ... so there is a point where one character said, &quot;We need to find some land of way to land this thing.&quot;  I've also removed all the excerpts and such that were at the end of each book, which reduced the file size by about one-third each.\n\nIf there are those of you reading this who have never read ANY Star Wars Expanded Universe fiction, this is the series to start with.  Pretty much all fans agree this is one of the best (if not THE BEST) series ever written.  The series takes place in 9 ABY (nine years after the Battle of Yavin in Episode IV and five years after the Battle of Endor in Episode VI), and introduces some of the most iconic EU characters ever, including the Noghri, Mara Jade, Jaina and Jacen Solo, Talon Karrde, and the Grand Admiral Mitth'raw'nuruodo himself.  George Lucas himself has been credited with saying that while he never plans to do a sequel trilogy to the Original Trilogy, Zahn's &quot;Thrawn Trilogy&quot; is probably the closest thing fans will get.\n\n\n[hr]\n[center][b]Additional Info[/b][/center]\n[hr]\n\nAfter downloading, please leave your client open and the torrent actively seeding so others may download as well and your ratio will remain high!  Also remember not to severely limit your upload speed by over-throttling.  Be kind, rewind!  Remember to eat your green vegetables.  And ...\n\n[center][b]-- Please Enjoy and Keep Seeding for Others to Enjoy!! --[/b][/center][/font]","torrent":{"xt":"urn:btih:f012b4b91e0ce438eccf10d4e4fe5424669fc24d","amp;dn":"Star+Wars%3A+Thrawn+Trilogy+%5BRetail+Edited%5D+--+VoV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f012b4b91e0ce438eccf10d4e4fe5424669fc24d","infoHashBuffer":{"type":"Buffer","data":[240,18,180,185,30,12,228,56,236,207,16,212,228,254,84,36,102,159,194,77]},"announce":[],"urlList":[]}}