{"title":"Somme 1914-18: Lessons in War","uid":15744604,"size":7831981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f01f3deec73ef7197d7e1e6c6edb931e5f34566c&amp;dn=Somme+1914-18%3A+Lessons+in+War&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"marty14","files":1,"time":1472953035,"description":"Somme 1914-18: Lessons in War by Martin Marix Evans [epub]\r\n\r\nDiaries, trench maps, and previously unpublished photographs transport the reader, in this story of how on the battlefields of the Somme the nature of warfare changed forever\r\n \r\nOne of the largest battles of World War I, the Battle of the Somme is understood to be one of the bloodiest military operations ever recorded. Terrible though that day was, it takes its place in a wider story: the long, painful process of learning how to fight a new kind of war. From the war movement of 1914, when the French fought on the fields of the Somme, the conflict evolved to massive frontal assaults by the British and Allied troops in 1916. Here the first tank was used in September 1916. Increasing sophistication in the terrifying use of artillery by the Germans broke the Allied lines in March 1918. Allied use of this same technology was then combined with other arms to create the fighting complex that inflicted the &quot;Black Day&quot; on the German army in August and smashed the Hindenburg Line in September. Thus the British, Australian, Canadian, American, and French forces defeated the German Army in the field at last. This book reveals how the Somme was the bloody classroom in which this new art of war was studied and it tells the story of the men who paid the price for this knowledge with their own blood","torrent":{"xt":"urn:btih:f01f3deec73ef7197d7e1e6c6edb931e5f34566c","amp;dn":"Somme+1914-18%3A+Lessons+in+War","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f01f3deec73ef7197d7e1e6c6edb931e5f34566c","infoHashBuffer":{"type":"Buffer","data":[240,31,61,238,199,62,247,25,125,126,30,108,110,219,147,30,95,52,86,108]},"announce":[],"urlList":[]}}