{"title":"Encyclopedia of Behavioral Neuroscience - George F. Koob et al.","uid":15571866,"size":47643316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0ab5ad1efd5fae5cb1f94a67c0521e3473b2d8f&amp;dn=Encyclopedia+of+Behavioral+Neuroscience+-+George+F.+Koob+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"clouderone","files":1,"time":1471269947,"description":"Encyclopedia of Behavioral Neuroscience - George F. Koob et al. (AP, 2010).pdf\r\n\r\nBehavioral Neuroscientists study the behavior of animals and humans and the neurobiological and physiological processes that control it. Behavior is the ultimate function of the nervous system, and the study of it is very multidisciplinary. Disorders of behavior in humans touch millions of people’s lives significantly, and it is of paramount importance to understand pathological conditions such as addictions, anxiety, depression, schizophrenia, autism among others, in order to be able to develop new treatment possibilities.\r\n\r\nEncyclopedia of Behavioral Neuroscience is the first and only multi-volume reference to comprehensively cover the foundation knowledge in the field. This three volume work is edited by world renowned behavioral neuroscientists George F. Koob, The Scripps Research Institute, Michel Le Moal, Université Bordeaux, and Richard F. Thompson, University of Southern California and written by a premier selection of the leading scientists in their respective fields. Each section is edited by a specialist in the relevant area. The important research in all areas of Behavioral Neuroscience is covered in a total of 210 chapters on topics ranging from neuroethology and learning and memory, to behavioral disorders and psychiatric diseases.\r\n\r\nThe only comprehensive Encyclopedia of Behavioral Neuroscience on the market\r\nAddresses all recent advances in the field\r\nWritten and edited by an international group of leading researchers, truly representative of the behavioral neuroscience community\r\nIncludes many entries on the advances in our knowledge of the neurobiological basis of complex behavioral, psychiatric, and neurological disorders\r\nRichly illustrated in full color\r\nExtensively cross referenced to serve as the go-to reference for students and researchers alike\r\nThe online version features full searching, navigation, and linking functionality\r\nAn essential resource for libraries serving neuroscientists, psychologists, neuropharmacologists, and psychiatrists","torrent":{"xt":"urn:btih:f0ab5ad1efd5fae5cb1f94a67c0521e3473b2d8f","amp;dn":"Encyclopedia+of+Behavioral+Neuroscience+-+George+F.+Koob+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0ab5ad1efd5fae5cb1f94a67c0521e3473b2d8f","infoHashBuffer":{"type":"Buffer","data":[240,171,90,209,239,213,250,229,203,31,148,166,124,5,33,227,71,59,45,143]},"announce":[],"urlList":[]}}