{"title":"STEP UP 2[DVDRIP-DIVX-ITA-SOM]","uid":4367807,"size":733607936,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1d54853457cb9d4c64d84f2be5f7f757a4f82eb&amp;dn=STEP+UP+2%5BDVDRIP-DIVX-ITA-SOM%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"mitimex","files":1,"time":1219978583,"description":"Andy, la nuova arrivata alla Maryland School of the Arts, ha pochi mezzi ma un obiettivo fermo: partecipare a &quot;the Streets&quot;, la piÃƒÂ¹ importante competizione di ballo hip-hop di Baltimora. Anche Chase, il ragazzo piÃƒÂ¹ ricco e concupito dell&amp;#039;istituto, sogna quella gara, per distinguersi dagli altri e sfidare le convenzioni della scuola. Insieme, vanno a caccia di talenti misconosciuti e formano una &quot;crew&quot;, all&amp;#039;insaputa di Blake, fratello di Chase e rigido direttore della MSA. \nIl soggetto di Step Up 2 sembra costruito sul riflesso del primo capitolo, come se anche la sceneggiatura fosse ricorsa ad uno specchio, elemento chiave della scenografia dei film sul ballo. Nel film diretto da Anne Fletcher, il protagonista era un ragazzo bianco proveniente da un ghetto di neri (Tyler/Channing Tatum), catapultato, per caso e per amore della prima ballerina, nel milieu della scuola d&amp;#039;arte, moderna versione dell&amp;#039;inarrivabile accademia newyorkese di &quot;Fame&quot;. Qui, Andie viene dallo stesso quartiere, ha lo stesso viso pallido e la stessa grinta. Proprio grazie all&amp;#039;intercessione di Tyler, anche lei capita nella scuola d&amp;#039;ÃƒÂ©lite e s&amp;#039;imbatte nel primo ballerino, ribelle e insoddisfatto. Se Tyler combatteva per essere ammesso, Andie lotta per non essere estromessa; se il primo portava la break-dance sui palchi dabbene, la seconda porta gli studenti dabbene per le strade buie di periferia. Ma, nonostante lo schematismo del plot, non c&amp;#039;ÃƒÂ¨ dubbio che il numero due si situi effettivamente un &quot;passo&quot; avanti rispetto alla pellicola apripista. \nLa regia passa nelle mani dell&amp;#039;esordiente Jon M.Chu e, se volessimo definire la sequenza d&amp;#039;apertura del film come il suo provino, dovremmo aggiungere che tanto basta per promuoverlo. Come nei migliori esempi del genere, la coreografia si fa scambiare inizialmente per realtÃƒÂ  e la realtÃƒÂ  si mescola con il palcoscenico virtuale di YouTube, svecchiando all&amp;#039;improvviso un intero universo. Il resto del film, purtroppo, non mantiene le promesse in quanto a stile, ma non mancano un paio di ottime coreografie, dall&amp;#039;assolo di Tyler, in testa, alla coreografia dei 410 (la prima crew di Andie) in coda. \nLa naturalezza delle interpretazioni di Robert (Chase) Hoffman e Briana (Andie) Evigan, e il simpatico gruppo di macchiette outsider che li affiancano in prospettiva del grande evento di street-dancing, fa sÃƒÂ¬ che il film non viva soltanto dei numeri di ballo, ma abbia un&amp;#039;energia propria, indubbiamente suggerita dalla musica onnipresente e sabotata dalla prevedibilitÃƒÂ  di un copione che procede ancora una volta sul doppio binario dei due mondi opposti, troppo lontani l&amp;#039;uno dall&amp;#039;altro per non finire in un bacio appassionato. \nNarrativamente meno attento alle dinamiche del ghetto e piÃƒÂ¹ incline alla commedia, il secondo Step Up, dunque, non ÃƒÂ¨ un passo falso, ma nemmeno un&amp;#039;acrobazia.","torrent":{"xt":"urn:btih:f1d54853457cb9d4c64d84f2be5f7f757a4f82eb","amp;dn":"STEP+UP+2%5BDVDRIP-DIVX-ITA-SOM%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1d54853457cb9d4c64d84f2be5f7f757a4f82eb","infoHashBuffer":{"type":"Buffer","data":[241,213,72,83,69,124,185,212,198,77,132,242,190,95,127,117,122,79,130,235]},"announce":[],"urlList":[]}}