{"title":"Bryan A. Garner - Garner's Modern American Usage [2003][A]","uid":10270797,"size":30245472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f2f6e82e64e9453da1caa468e96c64aa6cd2d87b&amp;dn=Bryan+A.+Garner+-+Garner%27s+Modern+American+Usage+%5B2003%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Anette14","files":-1,"time":1401583931,"description":"Description\nProduct Details\nBook Title: Garner's Modern American Usage\t\nBook Author: by Bryan A. Garner\nSeries: Garner's Modern American Usage\nHardcover: 928 pages\nPublisher: Oxford University Press; 2 edition (October 30, 2003)\nLanguage: English\nISBN-10: 0195161912\nISBN-13: 978-0195161915\n\n===================================================================================\nBook Description\nPublication Date: October 30, 2003 | ISBN-10: 0195161912 | ISBN-13: 978-0195161915 | Edition: 2\nThe first edition of Garner's Modern American Usage established Bryan Garner as &quot;an American equivalent of Fowler&quot; (Library Journal). With more than 23,500 copies sold, this witty, accessible, and engaging book has become the new classic reference work praised by professional copyeditors as well as the general public looking for clear advice on how to write more effectively. In 1999, Choice magazine named it an Outstanding Academic Book and the American Library Association dubbed it an Outstanding Reference Source. With thousands of succinct entries, longer essays on key issues and problematic areas, and up-to-the-minute judgments on everything from trendy words to the debate over personal pronouns, GMAU is approachable yet authoritative.\nSince the book first appeared in 1998, Bryan Garner has diligently continued tracking how we use our language. The second edition includes hundreds of new entries ranging from Dubya to weaponize (coined in 1984 but used extensively since 9/11) to foot-and-mouth, plethora (a &quot;highfalutin equivalent of too many&quot;), Slang, Standard English, and Dialects. It also updates hundreds of existing entries. Meanwhile, Garner has written a major essay on the great grammar debate between descriptivists and prescriptivists. Painstakingly researched with copious citations from books and newspapers and newsmagazines, this new edition furthers Garner's mission to help everyone become a better writer, and to enjoy it in the process.\n\n===================================================================================\nEditorial Review\nFrom Booklist\nGarner's Modern American Usage is the latest by the author and editor of several legal dictionaries (including Black's Law Dictionary), among other works on language and style. The second edition maintains the same basic format as the first (called Dictionary of Modern American Usage), published in 1998: each entry discusses the usage of the word, provides quotations for illustration, and gives citations. There are two types of entries. Word entries, which are generally short, discuss individual words or groups of words. Essay entries discuss topics related to usage and style, including contractions, danglers, punctuation, and subject-verb agreement, among others. Compared to the first edition's entry for complexioned; complected, the second edition makes only minor editorial changes; the real difference is the easier-to-read spacing in the updated volume. The second edition shows more substantive changes in the essay entry for Passive voice without changing the basic meaning or adding unnecessarily to the length of the essay. New entries include DVD, Internet, World Wide Web, and, as Garner insists, webpage.\nThe Columbia Guide to Standard American English (Columbia Univ., 1993) takes a more prescriptive tone than Garner's and maintains more succinct entries on usage topics (comparing entries on passive voice, for instance). The New Fowler's Modern English Usage (3d ed., Oxford, 2000) is more descriptive, on the other hand, and includes examples from published fiction, where most of Garner's quotations come from newspapers and journals. Because of its somewhat conversational style and extensive essays on usage topics like sexism, Garner's might be best used, as the author suggests, for &quot;browsing a little at a time or for serious reading&quot; and later consultation. Appended material includes a glossary, &quot;A Timeline of Books on Usage,&quot; and a selected bibliography. Recommended for public and academic libraries, especially if the institution does not own the first edition. RBB\nCopyright Â© American Library Association. All rights reserved\n\n===================================================================================\nReviews\n&quot;Garner's Modern American Usage by Bryan A. Garner should have a place on every writer's reference shelf. Combining meticulous research, clear explanations and a subtle sense of fun, this masterwork is the new authority to which we all should submit.&quot;--Writer's Digest\n\n&quot;In Garner's Modern American Usage... Bryan A. Garner offers a reference guide for writers, editors and students, and a playground for language lovers. This updated and expanded version of the 1998 book features 900-plus pages with more than 9,000 alphabetical entries and subentries, 181 essays, and 7,200 examples culled from newspapers, books and magazines, all to promote the proper use of English words.&quot;--Ron Berthel, Associated Press\n\n&quot;The second edition is as informative and entertaining as the first....An excellent guide to American English usage with the added strength of easy readability. Highly recommended.&quot;--Choice\n\n&quot;People who are serious about their writing collect and frequently consult usage manuals. Theodore Bernstein's The Careful Writer and The New Fowler's Modern English Usage, edited by R.W. Burchfield, are classics and are still in print. But the one I turn to first is Garner's Modern American Usage by Dallas-based Bryan A. Garner (Oxford University Press, $39.95; 879 pp.). His judgments are solid, and he has a knack for explaining knotty grammatical and stylistic matters in clear language. First published in 1998, the book is just out in an updated second edition.&quot;--Houston Chronicle\n\n&quot;A jewel of a reference, now in its second edition, answers just about any question you may have about the usage of American English.... paging through is a treat because you never know what you will learn next. Garner, whose passion for language is evident throughout, also includes illuminating essays addressing issue of usage and style, neatly listed at the beginning of the book to help users identify them. The entries are detailed and engaging--those for 'impactful.' 'sexism,' and 'phrasal adjectives,' for example, are so thorough that they alone make the book worth the price. Essential for wordsmiths, librarians, and literary types of all persuasions.&quot;--Library Journal (starred review)\n\n===================================================================================\nAbout the Author\nBryan A. Garner is a best-selling legal author with more than a dozen titles to his credit, including A Dictionary of Modern Legal Usage, The Winning Brief, A Dictionary of Modern American Usage, and Legal Writing in Plain English. He is also the editor in chief of Black's Law Dictionary in all its current editions.\n===================================================================================","torrent":{"xt":"urn:btih:f2f6e82e64e9453da1caa468e96c64aa6cd2d87b","amp;dn":"Bryan+A.+Garner+-+Garner%27s+Modern+American+Usage+%5B2003%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2f6e82e64e9453da1caa468e96c64aa6cd2d87b","infoHashBuffer":{"type":"Buffer","data":[242,246,232,46,100,233,69,61,161,202,164,104,233,108,100,170,108,210,216,123]},"announce":[],"urlList":[]}}