{"title":"MTCDC-NMC 19 DC's The Flash! (joshua13The More than Complete DC","uid":6541018,"size":12819815559,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f3366c9f9cb69ac321a9618c2a13167ae98e54f8&amp;dn=MTCDC-NMC+19+DC%5C%27s+The+Flash%21+%28joshua13The+More+than+Complete+DC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":12,"uploader":"joshua13","files":-1,"time":1310689861,"description":"The More than Complete DC-Now More Completerer!\n\nThis nineteenth alphabetical installment is:DC comics beginning with Flash, that are named for The Flash. Other DC Comics beginning with flash, such as Flashpoint and Flash Gordon are in the preceding torrent, part 18 &quot;DC from Fi-Fz -skipping The Flash&quot;\n\nWhat's This?\n It's a project to upload everything that's been scanned that DC ever published or distributed, whatever name was on the cover. That's DC, Vertigo (ugghh!)Ã‚Â®, Wildstorm, Helix, Milestone, Minx, Paradox, Piranha, Tangent, America's Best Comics, Cliffhanger, CMX, Homage, Humanoids, and MC.Gaines among others.\n Plus, for characters and titles DC picked up from other companies, as much of those &quot;Pre-DC&quot; comics as I can find. This includes many major and minor DC superheroes, war comics, romance comics and various licensed characters such as Tarzan, Star Trek, Loony Toons, Scooby-Doo etc. A few of the heros include Shazam!, Blue Beetle, Plastic Man, Gen13, The Web, The Shield, Phantom Lady, Captain Atom and many more. There may be a lot of things you didn't know started with a different company. There will some &quot;Post DC&quot; comics of characters like Fallen Angel that have moved on. But that will be arbitrarily selective on my part. Assorted related material will be included. It's going to be  800-850gb in total. It will take a year or two. I've already done a 600+gb subset of this in an earlier project (MTCDC). So clearly, I'm insane, which is what you look for in a guy promising this. So here we go again, but bigger.\n\nSome covers if you want to see \n &lt;a href=&quot;\nhttp://img825.imageshack.us/img825/5131/flashv101.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img825.imageshack.us/img825/5131/flashv101.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/3472/showcase04.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/3472/showcase04.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img842.imageshack.us/img842/4567/flashv1105.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img842.imageshack.us/img842/4567/flashv1105.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img163.imageshack.us/img163/804/flashv201.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img163.imageshack.us/img163/804/flashv201.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img43.imageshack.us/img43/5918/flashv301.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img43.imageshack.us/img43/5918/flashv301.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img706.imageshack.us/img706/4893/flashv312.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img706.imageshack.us/img706/4893/flashv312.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img707.imageshack.us/img707/3884/flashannual01.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img707.imageshack.us/img707/3884/flashannual01.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img197.imageshack.us/img197/2379/flashannualjlape.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img197.imageshack.us/img197/2379/flashannualjlape.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img135.imageshack.us/img135/9351/flashannualpulp.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img135.imageshack.us/img135/9351/flashannualpulp.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img202.imageshack.us/img202/4428/flashowaw.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img202.imageshack.us/img202/4428/flashowaw.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img4.imageshack.us/img4/7826/flashrebirth01.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img4.imageshack.us/img4/7826/flashrebirth01.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://img192.imageshack.us/img192/5493/flashspecial01.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img192.imageshack.us/img192/5493/flashspecial01.jpg&lt;/a&gt; \n\n\n        The size of this group of comics meant I was either going to have a big F torrent, split in the middle of the Flash or spin him off into his own, as I did with Batman, Action, Adventure and I will do with Green Lantern, Justice League, Superman, and Wonder Woman and possibly others in the future. Off on his own it's good for a lot of people who don't have the commitment :-)to download the whole series but do want the Flash\n\tFor commitment, read Obsessive Comics Disorder, which in some case really might qualify as OCD, I know personally I really am an obsessive downloader of many things, but I have not added compulsive to my list of SCMI. (see blow)\n\n \tI remember growing up as a kid (like post people I was born young) , reading the adventures of Barry Allen, never really grasping that Jay Garrick had gone before. There was the occasional Earth II story with the original scarlet speedster and sometimes the word &quot;Golden Age&quot; would be used, but I don't think at the time I understood that this guy with the funny hat was the original Flash. I never would have expected that the character would live on but person would not. Nobody fricken dies in comics! And so yeah, even though I don't read past the silver age (usually)  I know Barry's Back. Because that makes so much sense to have 3 or four Flashes alive at the same time  -  and you never know about Bart.\n\n       Sometimes I wonder if any kids read comics anymore with the way the pricing and distribution model have changed. If they do -  Do the three men in very similar costumes confuse them? Do they even know about all of them? How is rebooting the universe going to solve anything except add another layer of sedimentary history to the fossil record of DC?  \n\n\t If I may step on my soapbox for a moment - and just try and stop me! (Unless you are um A Mod or The Admin and CAN stop me, in which case forgive this humble one, Mighty Lord of this blessed site. I grovel in apology for daring to taunt thee. I beg thee not to smite me in thine righteous anger, offering my humble torrents that they might cover my sins, though they are many, and thou art great. \n\tSo anyway for the rest of you peasants, SCMI = so called mental illness. As &quot;A BiPolar Guy&quot; (ManicDepressive) it irritates the heck out of me that MI is classed separately from physical illness, allowing many to dismiss it as imaginary, a moral issue, or (this one kills me) 'all in your head&quot;, which uh, yeah it most likely is, and your diabetes in all in your pancreas, so there. \n\tYour brain is made of cells like your liver or heart. Just like them, it can go wrong. Say it ain't so Joe! Unbelievable, but true, There's no blood test x-ray or microscope test, but brains cans are showing promise as we know more. So? Lots of things didn't have tests in the past, many still don't. We diagnose by symptoms. Brain disorders may have behavioral-rationality symptoms, eye disorders may have visual symptoms.Shocking!\n\tDrugs work for many organ disorders. Brains too. Yeah they are probably over-prescribed and some people &quot;malinger&quot; by blaming MI just like some blame other things. Someday I hope we will be able to make indisputable diagnosis to weed out those people.\n\tMe, i'm not mentally hill. I have a neurotransmitter malfunction called &quot;bipolar type I&quot;.among other neuronic screw ups. I take drugs that mess with my neurotransmitters in the hopes that a different role of the chemical dice will be a winner ('cause yeah it's almost that bad -medicine is still pretty much in the dark) You neuro-typcicals don't know what you are missing! (But I wish I did) see wikipedia.org/wiki/Neurodiversity about that  word. I don't endorse the idea, as do some users of that term, that all neurological diversity is fine and wonderful. Folks with Asberger's (&quot;sort of&quot; a mild autism) may be (are) a valuable diverse aspect of our totality, many gifted artists writers and such have been bipolar - and there is a probable link, but what's wonderful about a severely autistic child, a psychotic bipolar killer,  or a delusional schizophrenic who wanders the street unable to care for himself?\n\n\tWhew. must be a bit manic today, so you can of course ignore everything I say because &quot;He's a little manic today. He gets obsessive/fanatic about things, tends toward wild ideas, and really says what he thinks and thinks he says is THE WORD. And talk? - he talks like a mountain river at flood time - way to fast and way too much for anyone in his path!&quot; \n\tSo much better when I'm in the down cycle and say pretty much nothing. :-) And no long hilarious intro to torrents then. You can chart my cycles by that! It's fun! it's sciencey!  Don't get all alarmed, Im not suicidal, but there have been times we I wondered why wanting to die is such an unpopular idea? There is really nothing crazy about disagreeing about the merits of living. (My wife disagrees)  Survival and consequent reproduction is just your gene's way of making copies of themselves. I'm done with reproduction, surgically enforced  - and I am not going to clone myself!  God in heaven, raising MY twin? I don't deserve that kind of punishment. Nobody deserves that. Nobody. (Or worse letting someone ELSE raise my twin. I'm WAY to special for that.)\n\n\tSo shut up already evolution!\n\n\tThese are not the genes you're looking for - Move along!\n\n\t&quot;I'm a an uploader, and aren't you glad! I sort all day and I talk all night!&quot; (think monty python lumberjack song) So let's here some chatter out there. Not about my soap box speeches, which you endure like you endure a rich uncle's boring stories and bad jokes because you hope to be in the will, drop those subjects like the blue-hot potatoes they are. Instead, say thanks, say hi, tell me how the weather is in your universe! Talk about about me!  - About how wonderful I am, about how glad you are to have these. About the unknown or forgotten Gems you find in these rivers of gold that I send forth (and rivers of silver, bronze and &quot;modern&quot;  - what the hell is a &quot;river of modern&quot; Isn't GA, SA, BA and then MA a rather huge mixed metaphor?- Has whoever makes up these things never heard of Copper, Iron or Tin? . What about Platinum? She was a pretty nice &quot;Metal Man&quot; as I recall. Would have been pretty sexy except for that whole &quot;she's a machine and not warm or soft&quot; thing which even a 13 year old boy might find less than sexy, and 13 year old boys have REALLY low standards!\n \n\tALL-RIGHTY THEN!\n\nToday's offering:The Scarlet Speedsters. The Fastest Men Alive! \n\nPresenting The Flash, The Flash , The Flash and Especially THE FLASH!! (I'm not telling which one is &quot;especially THE FLASH&quot;)\n\n\nEnjoy! \n\nFlash I - Jay Garrick \n\nFlash Comics v1 001-104 (1940-1949) \nFlash Comics-Wheaties Giveaway (194x)\n\nFlash Comics was not &quot;All-Flash&quot;. It had other golden age greats such as\n     Hawkman -A reincarnated ancient egyptian prince, museum curator, archaeologist and scientist-ahead-of-his-time turned crime fighter who prefers medieval weapons. Seriously!   I'm not surprised they went with &quot;alien cop&quot; for the revived version in the Silver Age, but I like this one better.\n     Black Canary - the real, original Widow of a PI, Dinah Drake!\n     The Atom. Short and strong, but always the same size. Really nothing in common with Ray Palmer but the name.\n\nFlash II  - Barry Allen\nFlash v1 105-350 (1959-1985)  \nFlash v1 Annual 001 (1963)\nFlash v1 Annual 001 Replica Edition 001 (2001)\nFlash Archives v1-DC Archive Editions\n\nFlash III - Wally West\nFlash v2 Zero, Ã‚Â½, 1 Million, 001-230 (1987-2006) \nFlash v2b 231-247 (2007-2009)\nFlash v2 Annuals 01-13 (1987-2000)\nFlash &amp; Green Lantern-The Brave &amp; Bold 01-06 (1999-2000)\nFlash-Iron Heights (2001)\nFlash-Our Worlds at War 001 (10-2001)\nFlash-Time Flies (2002)\nFlash Secret Files &amp; Origins 01-03 (1997-2001)\nFlash Plus Nightwing\n\nFlash IV - Bart Allen\nFlash-The Fastest Man Alive 01-13 (2006-2007)\n\nFlash II  Barry Allen Returns - &quot;Not so dead after all, eh?&quot;\nFlash-Rebirth 01-06 (2009-2010)\nFlash, The-Secret Files and Origins 001 (2010)\nFlash v3 01-xx (2010-20xx)\n\n\nMore Flash\nFlash 80-Page Giant 001-Impulse Flash I Jesse Quick (08-1998)\nFlash 80-Page Giant 002-Flash I Flash III Teen Titans (04-1999)\nFlash Special 001-50th Anniversary (1990)\nFlash TV Special, The (1991) - TV version of Barry Allan\nFlash Bookmark (2004).jpg\nFlush, The (Topps Krazy Little Comic(1967) -  The Flush. Not a typo\n\nOut of Order Flash Material - It will appear again. I really thought it would be good to put it here for the sake of flash fans\n\nJust Imagine Stan Lee with Kevin Maguire Creating the Flash v01 01\nKellogg's Cinnamon Mini-Buns - Flash\nLegends of the DC Universe 015 Flash II (1999)\nLegends of the DC Universe 016 Flash II (1999)\nLegends of the DC Universe 017 Flash II (1999)\nLife Story of the Flash, The TPB (1997)\nLimited Collectors' Edition C-48-Superman vs The Flash 58p (1976)\nSecret Origin of Flash Mini (Leaf) 1980 (SSScans)\nSecret Origins Annual 002-Flash II Flash III (1988)\nSecret Origins v3 041-The Rogue's Gallery of the Flash\nShowcase v1 004-Flash (10-1956) - FIrst Barry Allen Flash\nShowcase v1 008-Flash (06-1957)\nShowcase v1 013-Flash (04-1958)\nShowcase v1 014-Flash (06-1958)\nSilver Age The Flash 001 (07-2000)\nSpeed Force-Flash (1997)\nSuper Powers Collection 004-The Flash Mini Comic\nSuperman vs the Flash TPB (2005)\n\n========================================================================\n\nPlease Seed! Lots of people will start on the series months\nor even a year or two from now. You are their only hope to complete\ntheir downloads.\n\n=========================================================================\nThanks to the Scanners and editors, and thanks to the seeders, the\nanonymous folk that make the work of the scanners and uploaders multiply!\n=========================================================================\nBe seeing you.\n\n13\n\nYou can see my other torrents at \n\nd-e-m-o-n-o-id.me/files/?uid=1213225&amp;seeded=2\n\nor\n-h-3-3-t.com-/userdetails.php?id=72866\n\nor &lt;a href=&quot;\nhttp://thepiratebay.se/user/joshua13/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/joshua13/&lt;/a&gt;","torrent":{"xt":"urn:btih:f3366c9f9cb69ac321a9618c2a13167ae98e54f8","amp;dn":"MTCDC-NMC+19+DC%5C%27s+The+Flash%21+%28joshua13The+More+than+Complete+DC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3366c9f9cb69ac321a9618c2a13167ae98e54f8","infoHashBuffer":{"type":"Buffer","data":[243,54,108,159,156,182,154,195,33,169,97,140,42,19,22,122,233,142,84,248]},"announce":[],"urlList":[]}}