{"title":"Spike Lee's When The Levees Broke: A Requiem in Four Parts","uid":8657298,"size":3028856832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f34b8fed3a9afef146565c11dd11717e0b2e8941&amp;dn=Spike+Lee%27s+When+The+Levees+Broke%3A+A+Requiem+in+Four+Parts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"cockymountainoyster","files":-1,"time":1373239931,"description":"Spike Lee's When The Levees Broke: A Requiem in Four Parts\n\nAct I sets the scene; as the hurricane nears the Crescent City, some residents leave town, while others stay behind, figuring they'll just ride the storm out (Mayor Ray Nagin's &quot;mandatory evacuation&quot; order rings fairly hollow, as there's no public transportation provided for the many who don't own vehicles and thus couldn't get out even if they wanted to). The real problems begin after Katrina makes landfall on August 29, 2005. Displaced New Orleaneans crowd into the Superdome, soon to become a living hell for those stuck there; the incredibly poorly engineered levees break, flooding some 80 percent of the city; and people start dying by the hundreds, victims of drowning, lack of food, water, and medicine, and other causes. And so it goes.\n\nAct II finds the survivors struggling to keep it together while the federal, state, and local assistance they've been promised fails to show up; Act III traces the dispersal of these so-called &quot;refugees&quot; (as one man puts it, &quot;Refugees? You mean they took away our citizenship, too?&quot;) all over the country, not knowing where their families, friends, and neighbors are, or even if they're still alive; and Act IV deals with the slow rebuilding of the city while insurance companies refuse to pay claims and money keeps going toward the Iraq war effort instead. \n\nThe shameful ineptitude of the response was appalling; it's hard not to be disgusted when it's pointed out more than once that while we were able to provide supplies and assistance to Indonesians within two days of the 2004 tsunami, American citizens were virtually ignored for five days or more. Most of all, When the Levees Broke leaves us feeling the sheer rage of the poor and dispossessed of New Orleans, where the population is 70 percent African-American. Confronted with the ignorance, arrogance, and callousness of the people whose job it was to protect them, they can point to just one cause: racism.\n\nBonus: The Red White &amp; Economic Blues\n\nWant more? &lt;a href=&quot;\nhttp://thepiratebay.se/user/cockymountainoyster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cockymountainoyster&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f34b8fed3a9afef146565c11dd11717e0b2e8941","amp;dn":"Spike+Lee%27s+When+The+Levees+Broke%3A+A+Requiem+in+Four+Parts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f34b8fed3a9afef146565c11dd11717e0b2e8941","infoHashBuffer":{"type":"Buffer","data":[243,75,143,237,58,154,254,241,70,86,92,17,221,17,113,126,11,46,137,65]},"announce":[],"urlList":[]}}