{"title":"George Baker Selection - Little Green Bag [1970]","uid":4618630,"size":107824055,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f47f3d4fbe6b138ca848a4fdec6e300b2a72cd06&amp;dn=George+Baker+Selection+-+Little+Green+Bag+%5B1970%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"Iron_Horse","files":16,"time":1230938279,"description":"George Baker Selection - Little Green Bag [1969]\nMp3 320 mbit/s\nGenre:Pop,Rock,Country,Blues\n\nGeorge Baker (born Johannes Bouwens, December 8, 1944, Hoorn, Netherlands) is a Dutch singer and songwriter.He was the lead singer of the pop musical ensemble, George Baker Selection. .\n\nBiography for: George Baker Selection \nThe George Baker Selection was an eclectic Dutch pop-rock band from the Netherlands that was fronted by the extremely talented and versatile singer, composer, guitarist, keyboard player and songwriter George Baker. The band was first formed as Soul Invention in 1967. They subsequently changed their name to the George Baker Selection in 1969. In 1970 the group scored a substantial smash hit with the insanely groovy and quirky psychedelic rock pip &quot;Little Green Bag,&quot; which reached #21 on the US Billboard pop charts and was recorded by the band with their own money. (&quot;Little Green Bag&quot; was featured on the soundtrack to Quentin Tarantino's &quot;Reservoir Dogs,&quot; plus has been used on episodes of the TV shows &quot;Red Dwarf&quot; and &quot;Freaks and Geeks.&quot;) Alas, the lovely country ballad &quot;Dear Ann&quot; stalled at #93 on the US Billboard charts. However, the George Baker Selection enjoyed a steady succession of Dutch radio hits that include such terrific songs as &quot;Morning Sky,&quot; &quot;Wild Bird,&quot; &quot;Manana,&quot; &quot;Holy Day,&quot; and &quot;I'm on My Way.&quot; In 1975 the band achieved their single greatest success with the bubbly, catchy and upbeat &quot;Una Paloma Blanca;&quot; the infectiously frothy and cheerful tune was a #1 hit in many countries, reached #26 on the US Billboard charts, and sold over three million copies worldwide. The group sold over twenty million records in their 70's heyday. Unfortunately, the George Baker Selection broke up in 1978 because the pressure of being in the spotlight was too much to easily bear. Baker revived the group in 1985; this new incarnation of the band lasted until 1989. George Baker has since gone on to have a hugely successful solo career.\nIMDb Mini Biography By: woodyanders\n\nTrivia\nIn 1999 Tom Jones did a cover version of the band's first breakthrough hit song &quot;Little Green Bag&quot; which has sold over three million copies.\nThere have been over 125 versions of the band's biggest hit song &quot;Una Paloma Blanca&quot; recorded throughout the years. In 1999 German comedian/superstar Stefan Raab had a #1 hit in Germany, Switzerland and Austria with his million-selling cover version of the song.\n\nGeorge Baker Selection, nederlÃƒÂ¤ndsk musikgrupp bildad 1967 under namnet Soul Invention. Medlemmar i gruppen var George Baker (sÃƒÂ¥ng, gitarr), Georges ThÃƒÂ© (gitarr), Jacubus Anthonius Greuter (keyboard), Jan Gerbrand Wisser (bas), Jan Hop (trummor). Gruppen bytte namn infÃƒÂ¶r debutsingeln &quot;Little Green Bag&quot; 1969. LÃƒÂ¥ten blev en hit och sÃƒÂ¥lde ocksÃƒÂ¥ bra i USA. Jan Hop tog ÃƒÂ¶ver basen 1971. 1975 fick gruppen sin stÃƒÂ¶rsta hit &quot;Paloma Blanca&quot; vilken bl. a. lÃƒÂ¥g etta pÃƒÂ¥ Topplistan i Sverige. Baker lÃƒÂ¤mnade gruppen 1977, men kom tillbaka igen 1982.\n\nTracklist:\n01_Little Green Bag\n02_Winter Time\n03_Funny Girl.\n04_The Prisoner\n05_Road of Peace\n06_Fly\n07_Dear Ann\n08_Impressions\n09_I Wanna Love You\n10_Have Another Drink\n11_I'll Be Your Baby Tonite\n12_Goodbye\n13_Little Green Bag (single version) \nRunningtime: 44:21 min\n\nLineup:\nGeorge Baker - Vocals/Guitar\nGeorges ThÃƒÂ© - Guitar\nJacubus Anthonius Greuter - Keyboard\nJan Gerbrand Wisser - Bass\nJan Hop - Drums","torrent":{"xt":"urn:btih:f47f3d4fbe6b138ca848a4fdec6e300b2a72cd06","amp;dn":"George+Baker+Selection+-+Little+Green+Bag+%5B1970%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f47f3d4fbe6b138ca848a4fdec6e300b2a72cd06","infoHashBuffer":{"type":"Buffer","data":[244,127,61,79,190,107,19,140,168,72,164,253,236,110,48,11,42,114,205,6]},"announce":[],"urlList":[]}}