{"title":"The 5 Elements of Effective Thinking [Kindle Edition]","uid":8650781,"size":275396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f499e7e941d8a98c796c4f5c50c748383576e75c&amp;dn=The+5+Elements+of+Effective+Thinking+%5BKindle+Edition%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":null,"files":-1,"time":1373093305,"description":"\n\nThe 5 Elements of Effective Thinking presents practical, lively, and inspiring ways for you to become more successful through better thinking. The idea is simple: You can learn how to think far better by adopting specific strategies. Brilliant people aren't a special breed--they just use their minds differently. By using the straightforward and thought-provoking techniques in The 5 Elements of Effective Thinking, you will regularly find imaginative solutions to difficult challenges, and you will discover new ways of looking at your world and yourself--revealing previously hidden opportunities.\n\nThe book offers real-life stories, explicit action items, and concrete methods that allow you to attain a deeper understanding of any issue, exploit the power of failure as a step toward success, develop a habit of creating probing questions, see the world of ideas as an ever-flowing stream of thought, and embrace the uplifting reality that we are all capable of change. No matter who you are, the practical mind-sets introduced in the book will empower you to realize any goal in a more creative, intelligent, and effective manner. Filled with engaging examples that unlock truths about thinking in every walk of life, The 5 Elements of Effective Thinking is written for all who want to reach their fullest potential--including students, parents, teachers, businesspeople, professionals, athletes, artists, leaders, and lifelong learners.\n\nWhenever you are stuck, need a new idea, or want to learn and grow, The 5 Elements of Effective Thinking will inspire and guide you on your way.\n\nTo share thinking stories, go to: http://5elementsofthinking.wordpress.com\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Elements-Effective-Thinking-ebook/dp/B008JUVDUE/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Elements-Effective-Thinking-ebook/dp/B008JUVDUE/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f499e7e941d8a98c796c4f5c50c748383576e75c","amp;dn":"The+5+Elements+of+Effective+Thinking+%5BKindle+Edition%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f499e7e941d8a98c796c4f5c50c748383576e75c","infoHashBuffer":{"type":"Buffer","data":[244,153,231,233,65,216,169,140,121,108,79,92,80,199,72,56,53,118,231,92]},"announce":[],"urlList":[]}}