{"title":"Harold Bloom - Shakespeare: The Invention of the Human (pdf)","uid":8738830,"size":6336799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f49e3f22e9f27e3c108d90e9cb341e5de137f4c9&amp;dn=Harold+Bloom+-+Shakespeare%3A+The+Invention+of+the+Human+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"pharmakate","files":-1,"time":1374734912,"description":"Harold Bloom - Shakespeare: The Invention of the Human (Riverhead Books, 1998). 745 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nShakespeare: The Invention of the Human is the culmination of Harold Bloom's life's work in reading, writing about, and teaching Shakespeare. It is his passionate and convincing analysis of the way in which Shakespeare not merely represented human nature as we know it today, but actually created it: before Shakespeare, there was characterization; after Shakespeare, there was character, men and women with highly individual personalities--Hamlet, Falstaff, Iago, Cleopatra, Macbeth, Rosalind, and Lear, among them. In making his argument, Bloom leads us through a brilliant and comprehensive reading of every one of Shakespeare's plays. According to a New York Times report on Shakespeare last year, &quot;more people are watching him, reading him, and studying him than ever before.&quot; Shakespeare: The Invention of the Human is a landmark contribution, a book that will be celebrated and read for many years to come. It explains why Shakespeare has remained our most popular playwright for more than four hundred years, and in helping us to understand ourselves through literature, it restores the role of critic to one of central importance to our culture.\n\nReview\n\n&quot;Personality, in our sense, is a Shakespearean invention, and is not only Shakespeare's greatest originality but also the authentic cause of his perpetual pervasiveness.&quot; So Harold Bloom opines in his outrageously ambitious Shakespeare: The Invention of the Human. This is a titanic claim. But then this is a titanic book, wrought by a latter-day critical colossus--and before Bloom is done with us, he has made us wonder whether his vision of Shakespeare's influence on the whole of our lives might not be simply the sober truth. Shakespeare is a feast of arguments and insights, written with engaging frankness and affecting immediacy. Bloom ranges through the Bard's plays in the probable order of their composition, relating play to play and character to character, maintaining all the while a shrewd grasp of Shakespeare's own burgeoning sensibility.\n\nIt is a long and fascinating itinerary, and one littered with thousands of sharp insights. Listen to Bloom on Romeo and Juliet: &quot;The Nurse and Mercutio, both of them audience favorites, are nevertheless bad news, in different but complementary ways.&quot; On The Merchant of Venice: &quot;To reduce him to contemporary theatrical terms, Shylock would be an Arthur Miller protagonist displaced into a Cole Porter musical, Willy Loman wandering about in Kiss Me Kate.&quot; On As You Like It: &quot;Rosalind is unique in Shakespeare, perhaps indeed in Western drama, because it is so difficult to achieve a perspective upon her that she herself does not anticipate and share.&quot; Bloom even offers some belated vocational counseling to Falstaff, identifying him as an Elizabethan Mr. Chips: &quot;Falstaff is more than skeptical, but he is too much of a teacher (his true vocation, more than highwayman) to follow skepticism out to its nihilistic borders, as Hamlet does.&quot;\n\nIn the end, it doesn't matter very much whether we agree with all or any of these ideas. What does matter is that Bloom's capacious book sends us hurrying back to some of the central texts of our civilization. &quot;The ultimate use of Shakespeare,&quot; the author asserts, &quot;is to let him teach you to think too well, to whatever truth you can sustain without perishing.&quot; Bloom himself has made excellent use of his hero's instruction, and now he teaches us all to do the same. --Daniel Hintzsche\n\nFrom Publishers Weekly\n\nIn some ways the crowning achievement of the controversial Yale critic's career (which has produced The Anxiety of Influence; The Book of J; etc.), this sweeping monograph devotes an essay to each of the plays, emphasizing their originality and their influence on subsequent literature, feeling and thought. The result is a series of brilliant, persuasive, highly idiosyncratic readings punctuated by attacks on current Shakespeare criticism and performance. The ratio of screed to reading is blessedly low; although Bloom has kept his common touch, one feels that he has ceased the play to the peanut gallery that made The Western Canon a cause celebre. The leitmotif of Shakespeare's &quot;invention of the human,&quot; i.e., of the changeable, individual human character, is a useful through-line to the essays but never hijacks them as Bloom's critical tropes sometimes do. Other extravagant claims - that Shakespeare wrote an early version of Hamlet between 1589 and '93, or that the playwright may have lived in physical terror of his street-tough rival Marlowe - may raise eyebrows, but they will not matter to readers who need this book. Those readers fall into two categories: performers and everyone who studies Shakespeare outside the academy. For the latter, Bloom is an ideal cicerone: a passionate, sensitive reader who tempers his irreverent common sense with an even-more-instructive stance of awe. And no critic - not even Bloom's masters A.C. Bradley or Harold Goddard - writes as well for actors and directors, or understands as clearly the performability of the plays. Indeed, it is a great pity that Bloom has not followed the example of Helen Vendler's recent edition of the sonnets and included a recording of his own recitations.","torrent":{"xt":"urn:btih:f49e3f22e9f27e3c108d90e9cb341e5de137f4c9","amp;dn":"Harold+Bloom+-+Shakespeare%3A+The+Invention+of+the+Human+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49e3f22e9f27e3c108d90e9cb341e5de137f4c9","infoHashBuffer":{"type":"Buffer","data":[244,158,63,34,233,242,126,60,16,141,144,233,203,52,30,93,225,55,244,201]},"announce":[],"urlList":[]}}