{"title":"The Architecture Design of Apartment in the World (Art Ebook).pd","uid":11020139,"size":111041767,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f547d36ffe5f0c3a5a2865b3aeb5e4cb46c76bd6&amp;dn=The+Architecture+Design+of+Apartment+in+the+World+%28Art+Ebook%29.pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"STBGD","files":-1,"time":1410555807,"description":"The Architecture Design of Apartment in the World &gt; Bakerman\nHuazhong University of Science and Technology Press | 2011 | ISBN: 7560967127 | English | 316 pages | PDF | 105.9 MB\n\n\nThe book has selected more than 60 cases of the latest works of apartment architectural design in the world. These cases are novel and not only meet the function of comfortable living, but also show the intelligent and new environment-friendly architectural technologies. The layout of each unit in the case not only meets the requirement of lighting and a field of view in the room, but also ensures privacy and permeability. These works around the world show the diversity and artistry of apartment architectural design from different climatic conditions, complex terrain features and cultural differences. The book comprehensively analysis the latest design concept of apartment architecture and reflects the trend of design to the new way of life for modern through study, description and display to these works. In addition to the photos with high quality, the book provides comprehensive information on the original architectural design, including floor plans, elevations, sections and diagrams and also provides architect with valuable and referenced information. Those energy-saving and environment-friendly design and application of energy-saving materials provide a reference and basis for architects to explore green design of apartment architecture. ","torrent":{"xt":"urn:btih:f547d36ffe5f0c3a5a2865b3aeb5e4cb46c76bd6","amp;dn":"The+Architecture+Design+of+Apartment+in+the+World+%28Art+Ebook%29.pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f547d36ffe5f0c3a5a2865b3aeb5e4cb46c76bd6","infoHashBuffer":{"type":"Buffer","data":[245,71,211,111,254,95,12,58,90,40,101,179,174,181,228,203,70,199,107,214]},"announce":[],"urlList":[]}}