{"title":"Gamestorming: A Playbook for Innovators, Rule-breakers,,,","uid":9621718,"size":28748447,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5c2bc50b763cdd2f2ecd475a1440d5781bce825&amp;dn=Gamestorming%3A+A+Playbook+for+Innovators%2C+Rule-breakers%2C%2C%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"PirateBook","files":2,"time":1392507906,"description":"\nGreat things dont happen in a vacuum. But creating an environment for creative thinking and innovation can be a daunting challenge. How can you make it happen at your company? The answer may surprise you: gamestorming.\n\nThis book includes more than 80 games to help you break down barriers, communicate better, and generate new ideas, insights, and strategies. The authors have identified tools and techniques from some of the worlds most innovative professionals, whose teams collaborate and make great things happen. This book is the result: a unique collection of games that encourage engagement and creativity while bringing more structure and clarity to the workplace. Find out why -- and how -- with Gamestorming.\n\nOvercome conflict and increase engagement with team-oriented games\nImprove collaboration and communication in cross-disciplinary teams with visual-thinking techniques\nImprove understanding by role-playing customer and user experiences\nGenerate better ideas and more of them, faster than ever before\nShorten meetings and make them more productive\nSimulate and explore complex systems, interactions, and dynamics\nIdentify a problems root cause, and find the paths that point toward a solution\n\nGenre: Non Fiction , Business","torrent":{"xt":"urn:btih:f5c2bc50b763cdd2f2ecd475a1440d5781bce825","amp;dn":"Gamestorming%3A+A+Playbook+for+Innovators%2C+Rule-breakers%2C%2C%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5c2bc50b763cdd2f2ecd475a1440d5781bce825","infoHashBuffer":{"type":"Buffer","data":[245,194,188,80,183,99,205,210,242,236,212,117,161,68,13,87,129,188,232,37]},"announce":[],"urlList":[]}}