{"title":"Mafia Book Collection 2013 [Epub, PDF]","uid":8869539,"size":14813810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f61fe0566d216e10cfbd92b93f009e67453d5e9a&amp;dn=Mafia+Book+Collection+2013+%5BEpub%2C+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"F1restorm","files":-1,"time":1378023696,"description":"1. Animal | Casey Sherman......................[Epub]\n2. Final Confession | Brian P Wallace..........[Epub]\n3. In the Godfather Garden | Richard Linnett...[PDF]\n4. Made Men | Antonio Nicaso and Marcel Danesi.[Epub]\n5. Mob Daughter| Karen Gravano.................[Epub]\n6. See No Evil | Ron Felber....................[Epub]\n7. The Honored Society | Petra Reski...........[Epub]\n8. The Last Supper | Philip Willan.............[Epub]\n9. The Last Testament of Lucky Luciano | Gosch.[Epub]\n10.Whitey's Payback | TJ English...............[Epub]\n\nAll published 2013, all retail. Final Confession, The Last Supper and The Honored Society were previously published as paperbacks. See No Evil is also known as Il Dottore : The Double Life of a Mafia Doctor in the US (both use American English, same book- different title).\nReaders: Epub- Adobe Digital Editions, Calibre, MoonReader for Android etc. PDF- Adobe Acrobat Reader/ ADE\nFor conversion to other formats use Calibre.\nAll epubs tested on PC and Android tablet with no issues. The PDF was tested on PC in Acrobat and ADE.\n_____________________________________________________________________________\n\nDescription from Whitey's Payback:\nJames 'Whitey Bulger is the last of the old-fashioned gangsters. A polished, sophisticated psychopath, Bulger's Boston reign of fear lasted 20 years - he was second only to Osama bin Laden on the FBI's most wanted list. Captured after 16 years in hiding, he now sits in a maximum security prison awaiting trial on racketeering charges and 19 counts of murder. But Bulger will have his payback: at trial he has promised to lift the lid a toxic conspiracy of federal agents, cops, judges and politicians that helped enforce his rule.\nCombining first-rate reporting and the storytelling of a novelist, T.J. English has been writing about men like Bulger for over two decades. Here, in addition to coming face to face with Whitey, you'll discover hitman Joesph 'Mad Dog' Suliivan's favoured assassination method, you'll meet Eric Vassel, the Jamaican rudeboy who took on the Italian mob, you'll travel deep into the Mexican/American narcosphere as English takes his readers on a bloody but fascinating journey to the dark side of the American Dream.\n\nDescription from See No Evil: \nSee No Evil is the riveting true story of a Jewish kid from the Bronx who became a mafia insider and physician to top NY Mafia dons such as John Gotti, Carlo Gambino, Paul Castellano and Joe Bonanno. As a result, the doctor led a double life: a well respected surgeon and socialite by day, and &quot;Il Dottore,&quot; a gambler and sex addict, by night. Welcomed into an exciting and glamorous underworld which included discos, drugs, highstake gambling and beautiful women, he somehow managed to pursue his true profession seriously and in time became one of the nation's leading cardiac surgeons. Eventually, he had to make a choice between loyalty to the mob and killing a government witness on the operating table, or remaining true to his Hippocratic Oath, all under the watchful eye of New York's top federal prosecutor, Rudolph Giuliani. This extraordinary true story has been made into a major Fox TV series The Mob Doctor, which replaced the smash hit series House.","torrent":{"xt":"urn:btih:f61fe0566d216e10cfbd92b93f009e67453d5e9a","amp;dn":"Mafia+Book+Collection+2013+%5BEpub%2C+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f61fe0566d216e10cfbd92b93f009e67453d5e9a","infoHashBuffer":{"type":"Buffer","data":[246,31,224,86,109,33,110,16,207,189,146,185,63,0,158,103,69,61,94,154]},"announce":[],"urlList":[]}}