{"title":"Ex Drummer (English subtitles)","uid":4684903,"size":1013150983,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f632b35c6cc9454a982d0c699a7c47cc875adf05&amp;dn=Ex+Drummer+%28English+subtitles%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"Ghost Radio","files":-1,"time":1233199252,"description":"Belgian movie from 2007 based on a novel written by Herman Brusselmans. It's on TPB already but I hardcoded English subtitles into it so English speaking people can enjoy the movie too.\n\nGenre: dark comedy / drama\n\nThe story deals with a succesful but sarcastic writer who is visited by three men one day. They tell him that they are starting a band and are looking for a drummer. All three men have a small handicap: the bass player has a stiff arm, the singer has a lisp and is psychotic, and the guitar player has very bad hearing. To top it off they are also degenerate losers - the complete opposite of what the writer is. The writer senses that the three men just seek to use his success to jumpstart their own fame but he decides to play along. In secret he wants to descend into the lower class world the three men live in to get inspiration for a new novel. But after being confronted with the depravity that fills the lives of the three men he gets fed up with them, and to improve his story he starts manipulating them...\n\nDon't be fooled by the genre tag or the silly synopsis. This movie is packed with hostile atmospheres, violence, sex and enough scenes to leave the squeamish needing twenty romantic comedies to wash the dirt out of their eyes. It's one of those movies that spares few in it's relentless depiction of the dark side of man and society. If you take the movie Trainspotting but take away the happy scenes and replace them with the violence from Takeshi Miike movies you'd end up with something like this. A brutal slapstick at the expense of the underclass. Filmed with flair but presented in only one color: black.\n\n\n\nuploaded by:\n &lt;a href=&quot;\nhttp://www.ghostradio.co.nr&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ghostradio.co.nr&lt;/a&gt;\n","torrent":{"xt":"urn:btih:f632b35c6cc9454a982d0c699a7c47cc875adf05","amp;dn":"Ex+Drummer+%28English+subtitles%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f632b35c6cc9454a982d0c699a7c47cc875adf05","infoHashBuffer":{"type":"Buffer","data":[246,50,179,92,108,201,69,74,152,45,12,105,154,124,71,204,135,90,223,5]},"announce":[],"urlList":[]}}