{"title":"The Pocket First-Aid Field Guide - Dr. George Dvorchak","uid":11706804,"size":4058990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6a35f5c191aa44e7bf8beceb1b474d29761e837&amp;dn=The+Pocket+First-Aid+Field+Guide+-+Dr.+George+Dvorchak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"starxteel","files":1,"time":1424166897,"description":"\nPractical advice for the on-the-go outdoorsman, this field-friendly guide is essential for anyone interested in first-aid preparation and care. Here is advice useful on a hike or for any fishing trip, including step-by-step instructions on dealing with fractures, suturing wounds, treating eyes and ears, managing allergic reactions, and more. With common sense advice, and in a handy, portable package, this is one little book that no one should be without in a campsite or in their forest hideaway.\n\nAbout the Author:\n George E. Dvorchak Jr., M.A., M.D. is a recognized outdoor writer with articles on firearms, hunting, survival and outdoor medicine. Over the past 20 years, his health-related articles have been featured in national magazines as S.W.A.T., American Survival Guide, Self Reliance Journal and Modern Survival. He is a contributing editor to The Varmint Hunter and Modern Survival magazines and has published articles in Gun World, Guns, American Handgunner, Guns &amp; Ammo, Safari, Shooter's Bible and Handguns. He contributes to Starzal magazine in Poland and Magnum magazine in Brazil. His work has been published in 88 different international, national and state publications since 1983. George Dvorchak holds a Bachelors degree in education, a Masters in human anatomy and an M.D","torrent":{"xt":"urn:btih:f6a35f5c191aa44e7bf8beceb1b474d29761e837","amp;dn":"The+Pocket+First-Aid+Field+Guide+-+Dr.+George+Dvorchak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6a35f5c191aa44e7bf8beceb1b474d29761e837","infoHashBuffer":{"type":"Buffer","data":[246,163,95,92,25,26,164,78,123,248,190,206,177,180,116,210,151,97,232,55]},"announce":[],"urlList":[]}}