{"title":"Carl von Clausewitz - On War (2 editions)","uid":9839820,"size":4899823,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6d3dc10640ad8d7c02d530f05f0c1921c970586&amp;dn=Carl+von+Clausewitz+-+On+War+%282+editions%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1395965836,"description":"\nON WAR [Vom Kriege] is a book on war and military strategy by Prussian general CARL VON CLAUSEWITZ (1780-1831), written mostly after the Napoleonic wars and published posthumously by his wife in 1832.  It is the most significant attempt in Western history to understand war, both in its internal dynamics and as an instrument of policy.  Clausewitz studied the human and social factors that affect outcomes, as well as the tactical and technological ones.  He understood that war was a weapon of government, and that political purpose, chance, and enmity combine to shape its dynamics.  ON WAR has been studied by generations of soldiers, statesmen, and intellectuals throughout the world and remains both controversial and an influence on strategic thinking.\n\nThe Michael Howard and Peter Paret translation, originally published by Princeton University Press in 1976 (revised 1984), is the standard, modern English translation of ON WAR.  In addition to containing the complete text, this edition also features several valuable introductory essays.\n\nThe Oxford World's Classics abridged edition by Beatrice Heuser, using the translation by Howard and Paret, selects the central books in which Clausewitz's views on the nature and theory of war are developed.  Heuser's introduction explains the originality of Clausewitz's ideas, his education and background, and summarizes his key theories, while explanatory notes provide further information on the historical examples Clausewitz cites.\n\n\n* ON WAR (Princeton University Press, 1984).  Edited and translated by Michael Howard and Peter Paret; Introductory Essays by Peter Paret, Michael Howard, and Bernard Brodie; with a Commentary by Bernard Brodie. -- ePUB + MOBI\n\n* ON WAR (Oxford World's Classics, 2007).  Translated by Michael Howard and Peter Paret; Abridged with an Introduction and Notes by Beatrice Heuser. -- PDF\n\n________________________________________________________________________\n\n\nNOTE: I can be contacted via the SuprBay forum with comments, suggestions, requests, error reports, etc.:\n            &lt;a href=&quot;\nhttp://forum.suprbay.org/User-workerbee&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/User-workerbee&lt;/a&gt;\n\nIf you like these books and want others to have access to them, please consider seeding for as long as you can.  The more you seed, the longer the torrent will live, and the easier it will be to upload new content.  Thank you!\n","torrent":{"xt":"urn:btih:f6d3dc10640ad8d7c02d530f05f0c1921c970586","amp;dn":"Carl+von+Clausewitz+-+On+War+%282+editions%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d3dc10640ad8d7c02d530f05f0c1921c970586","infoHashBuffer":{"type":"Buffer","data":[246,211,220,16,100,10,216,215,192,45,83,15,5,240,193,146,28,151,5,134]},"announce":[],"urlList":[]}}