{"title":"The Secrets of Action Screenwriting - William C. Martell","uid":9788621,"size":1271467,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7727009e225ecca99c82ddaa78d903fe89087e5&amp;dn=The+Secrets+of+Action+Screenwriting+-+William+C.+Martell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1395209933,"description":"240 pages packed with techniques and tips for screenwriters, focusing on the action, thriller and suspense genres. No theories! Only actual techniques! The ultimate HOW TO screenwriting book! Creating the ultimate villain, harvesting the audience's secrets desires or hidden fears to create a hit film, how to write a plot twist, the four kinds of suspense, using reversals to keep your descriptions exciting, four ways to explode cliches, the two types of heroes, ten ways to create exciting action scenes, using secrets and lies, weapons for weirdos, instant character identifiers, your script's DNA, 16 steps to better description, pacing secrets, rugpulls, visual characterization, &quot;Popeye&quot; points, and more! &quot;Secrets Of Action Screenwriting&quot; was written by a working professional screenwriter with seventeen produced films. He knows what works!\n\nReview\n&quot;... the best book on the practical nuts-and-bolts mechanics of writing a screenplay I've ever read.&quot; -- Ted Elliott, co-writer of THE MASK OF ZORRO with Terry Rossio\n\n&quot;My only complaint... is that it wasn't around when I was starting out... would have saved me years of trial and error!&quot; -- Ken Wheat, co-writer of PITCH BLACK and THE FLY 2 with Jim Wheat\n\n&quot;William C. Martell knows the action genre inside out. Read and learn from an expert!&quot; -- Mark Verheiden, writer of TIME COP and THE MASK\nAbout the Author\nWilliam C. Martell has written seventeen produced films for cable and video including three HBO World Premieres, two Made For Showtimes, three CineMax Premieres, two films for USA Network, and many others. Reviewer David Nuttycombe of The Washington Post calls him &quot;The Robert Towne of made for cable movies&quot; and he was the only non-nominated screenwriter mentioned on Siskel &amp; Ebert's 1997 Oscar Special &quot;If We Picked The Winners&quot;. He doesn't teach screenwriting, he writes for a living.\nThe naval warfare action film &quot;Steel Sharks&quot; (HBO) stars Gary Busey and Billy Dee Williams, and was made with the cooperation of the US Navy and Department Of Defense onboard an actual aircraft carrier. &quot;Hard Evidence&quot; (USA) was released to video the same day as Julia Roberts' film &quot;Something To Talk About&quot; and out-rented it, landing at the #7 position nationally while the Roberts' film ended up #8 (&quot;Hard Evidence&quot; was the better reviewed film). Submarine thriller &quot;Crash Dive&quot; (HBO) starred Frederic Forest, and introduced &quot;JAG&quot;s Catherine Bell and Christopher Titus from Fox's sit-com &quot;Titus&quot;. &quot;Treacherous&quot; (Cinemax) Starred Tia Carrere, Adam Baldwin and C. Thomas Howell. His family film &quot;Invisible Mom&quot; starring &quot;ET&quot;s Dee Wallace Stone won Best Children's Film at the Santa Clarita Film Festival. Mr. Martell is currently working on several projects for major studios.","torrent":{"xt":"urn:btih:f7727009e225ecca99c82ddaa78d903fe89087e5","amp;dn":"The+Secrets+of+Action+Screenwriting+-+William+C.+Martell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7727009e225ecca99c82ddaa78d903fe89087e5","infoHashBuffer":{"type":"Buffer","data":[247,114,112,9,226,37,236,202,153,200,45,218,167,141,144,63,232,144,135,229]},"announce":[],"urlList":[]}}