{"title":"Brutal DooM v20","uid":12981478,"size":530040320,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f79788ba0b154beefa31a7b8951ab530c3d2afd9&amp;dn=Brutal+DooM+v20&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":1,"uploader":"docrobot","files":1,"time":1450037099,"description":"Brutal DooM v20\r\n\r\nYear: 2015\r\nGenre: Action\r\nDeveloper: id Software\r\nPublisher: GT Interactive\r\nPlatform: PC\r\nVersion: V20\r\nPublication Type: RePack\r\nLanguage: English\r\nLanguage: English\r\nLicense: Freeware\r\nSystem requirements: Operating System: Windows XP / Windows Vista / Windows 7 / Windows 8 / Windows 8.1\r\n\r\nDescription:\r\nOld Doom, but now more blood, dismemberment monster cards have become more just tightened the schedule in general and lighting and some monsters, play is now much more fun.\r\nExtras. information:\r\nAll WaDs complete, the distribution is made as a simple exe made in WinZip, unzip the folder in which you will be comfortable in the unpacked folder, find the file to launch the game at poryadku-\r\n1 label-Brutal doom 20 (Doom, Doom 2), this shortcut works The Ultimate Doom and Doom II: Hell on Earth (here expanded levels, music plays in the processing, graphics tightened as some monsters, lighting also improved) if you run this shortcut doom TNT or PLUTONIA it will not operate (run 1 or 2 Doom).\r\n2 label-Brutal doom (doom TNT, PLUTONIA) (Metal Music from Doom, Doom 2), this shortcut works doom TNT: Evilution and The Plutonia Experiment (here the music plays in the processing 1 and 2 of Doom, for these 2 additions original music alas not processed), so this was a shortcut for those who want to play it with new music, though not with these additions.\r\n3 label-Brutal doom (doom TNT, PLUTONIA) (Original Music), this shortcut also works doom TNT: Evilution and The Plutonia Experiment but with the original &quot;native&quot; music.\r\nNew yarlyki-\r\n1 Project Brutality-modified version of Brutal doom 20 (Doom, Doom 2), this shortcut works The Ultimate Doom and Doom II: Hell on Earth (here expanded levels, music plays in the processing, graphics tightened as some monsters, lighting as well improved), if you run this shortcut doom TNT or PLUTONIA it will not operate (run 1 or 2 Doom).\r\n2 Project Brutality (TNT, PLUTONIA) (Metal Music from Doom, Doom 2) -Just modified version of Brutal doom (doom TNT, PLUTONIA) (Metal Music from Doom, Doom 2), this shortcut works doom TNT: Evilution and The Plutonia Experiment (here the music plays in the processing 1 and 2 of Doom, for these 2 additions original music alas not processed), so this was a shortcut for those who want to play it with new music, though not with these additions.\r\n3 Project Brutality (TNT, PLUTONIA) (Original Music) - third modified version of Brutal doom (doom TNT, PLUTONIA), this shortcut works doom TNT: Evilution and The Plutonia Experiment (played here by original music from these two additions).\r\nAdvanced level Only for The Ultimate Doom and Doom II: Hell on Earth, for the doom TNT: Evilution and The Plutonia Experiment alas net.Grafika and everything else is present.\r\n\r\nAll the information that's new in Project Brutality listed below.\r\nThe assembly added SUPPLEMENT-Project Brutality, who shook, siphon torrent","torrent":{"xt":"urn:btih:f79788ba0b154beefa31a7b8951ab530c3d2afd9","amp;dn":"Brutal+DooM+v20","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f79788ba0b154beefa31a7b8951ab530c3d2afd9","infoHashBuffer":{"type":"Buffer","data":[247,151,136,186,11,21,75,238,250,49,167,184,149,26,181,48,195,210,175,217]},"announce":[],"urlList":[]}}