{"title":"Straight Outta Compton 2015 DVDSCR UNCENSORED x264-CPG","uid":13030209,"size":1603274622,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f7b141f690cafb49f2ec9aef00c09c6c0b18685a&amp;dn=Straight+Outta+Compton+2015+DVDSCR+UNCENSORED+x264-CPG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"makintos13","files":2,"time":1450441565,"description":"screens:\r\n \nhttp://imgmak.com/Kzh \nhttp://imgmak.com/Kzl \nhttp://imgmak.com/KzV \nhttp://imgmak.com/Kze \nhttp://imgmak.com/Kzg \nhttp://imgmak.com/Kzo \nhttp://imgmak.com/KzN \nhttp://imgmak.com/KzQ\r\n\r\nREAD NOTE\r\n\r\nok hear me out, i wanna to watch this movie so bad i hold myself till web/scr came out and finally yesterday dvdscr was out. i download the source, but turns out it haS some issues so like a true p2p guy i download the follow renecode done by very old group with the hope that everything will be fixed this time i mean they are first to upload so everything should be fixed, so, i order big chessy pizza and bear, i sat my good looking ass and ready to enjoy the movie and my Pizza. but damn...  when i hit play it has oos, blocky video and wrong ar, apparently that group done its best Now. i was like WTF man................... i was so pissed off,\r\n\r\ni turn on my alienware and decided to fix that sh*t, i fix oos, ar, blockiness but something was not right so my peep told me few weeks back there was CH WEBRip floating around, so i download the CH Source apparently it had HC subs and censored version BUT way better HD Quality, thank you chinese  so i decided to merge them, Now next thing i know to find myself some naked bootys and tities  in video where it was missing.. but i don't want to ruin this movie so i check comments on previous releases, no one wrote at which point the chinese censored the movie, then i play the video and find myself, then i cut the same part from dvdscr which is uncensored, and merge with chinese  WEBRip, \r\n\r\nthen did some usual stuff on it and did 2 pass encode. by the time it was ready, i was out of pizza, bear and kitkats, and i was feeling sleepy too so went straight to bed, wake up after few hours, no one had fix that so here it is sharing with ya all.  i will try to watch this again tonight,  \r\n\r\nP/S: Ffs! i am retired so please fix your shit at first place. thank you!! that group owe me pizza, drink and 2 kitkats.\r\n\r\nits complete movie, all in sync and Uncensored. decided to went with SCR tag. take it or leave it what i care \r\n\r\n\r\nVideo: x264 mp4 2Pass @ 1200kbps\r\nResolution: 720x288 @ 30fps\r\nAudio: AAC 2.0 256kbps\r\nRuntime: 2hrs 25mins 10sec\r\nLanguage: English\r\nSubtitles: none\r\nSource: DvDR+CH1080P\r\nEncoder: CPG\r\nSample: included\r\n \nhttp://www.imdb.com/title/tt1398426/\r\n8.1/10","torrent":{"xt":"urn:btih:f7b141f690cafb49f2ec9aef00c09c6c0b18685a","amp;dn":"Straight+Outta+Compton+2015+DVDSCR+UNCENSORED+x264-CPG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7b141f690cafb49f2ec9aef00c09c6c0b18685a","infoHashBuffer":{"type":"Buffer","data":[247,177,65,246,144,202,251,73,242,236,154,239,0,192,156,108,11,24,104,90]},"announce":[],"urlList":[]}}