{"title":"Pharmacology, 8E Kee, Hayes  McCuistion[PDF][StormRG]{HTD15}","uid":11785100,"size":50036891,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8418e33c94cdaca55a29d7c93b2c88d2f2195cc&amp;dn=Pharmacology%2C+8E+Kee%2C+Hayes++McCuistion%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"0xmovva","files":3,"time":1427724753,"description":"TITLE/EDITION Pharmacology: A Patient-Centered Nursing Process Approach, 8e (Kee, Pharmacology) \nBy: Linda E. McCuistion PhD RN ANP CNS (Author), Joyce LeFever Kee MS RN (Author), Evelyn R. Hayes PhD MPH FNP-BC (Author)\nSeries: Kee, Pharmacology\nPaperback: 1008 pages\nPublisher: Saunders; 8 edition (February 13, 2014)\nLanguage: English\nISBN-10: 1455751480\nISBN-13: 978-1455751488\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nPrepare to administer drugs safely by mastering key pharmacology concepts and drug calculation skills! Pharmacology: A Patient-Centered Nursing Process Approach, 8th Edition covers nursing pharmacology within a real-world nursing context. Using a clear, streamlined approach, this text makes it easier to understand pharmacology with a detailed unit on dosage calculations, a nursing process framework for drug therapy, and summaries of prototype drugs. Written by nursing educators Joyce Kee, Evelyn Hayes, and Linda McCuistion, this edition includes a strong QSEN focus, enhanced coverage of prioritization, and more NCLEXÂ® Examination-style questions on the subject of pharmacology.\n\nNEW QSEN focus emphasizes patient-centered care, safety, quality, and collaboration and teamwork.\nNEW content covers the most commonly used drugs, including updated Prototype Drug Charts and drug tables.\nEnhanced coverage of prioritization includes nursing interventions in the Nursing Process sections listed in order of priority.\nUpdated illustrations include new drug labels in the Drug Calculations chapter","torrent":{"xt":"urn:btih:f8418e33c94cdaca55a29d7c93b2c88d2f2195cc","amp;dn":"Pharmacology%2C+8E+Kee%2C+Hayes++McCuistion%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8418e33c94cdaca55a29d7c93b2c88d2f2195cc","infoHashBuffer":{"type":"Buffer","data":[248,65,142,51,201,76,218,202,85,162,157,124,147,178,200,141,47,33,149,204]},"announce":[],"urlList":[]}}