{"title":"Chinese Herbal Medicine {BBS}","uid":6790429,"size":11035148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f89aff64a332ba6c3379688942c3aae7677ebc89&amp;dn=Chinese+Herbal+Medicine+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1320243247,"description":"A roadmap for easily navigating through the complexities of Chinese herbal medicine, Chinese Herbal Medicine: Modern Applications of Traditional Formulas presents information about herbal formulas in a practical and easy-to-access format. Bridging the gap between classroom study and the clinical setting, the book supplies information on disease symptoms and their corresponding Chinese herbal formulas. Drawing from more than 20 years of experience, the author includes more than 840 formulas that can be used to tailor herbal formulas to meet the specific needs of every patient. Integrating traditional medicine with allopathic terminology, the book provides quick reference to both Chinese and Western diagnoses.\n\nPart I provides the herbal formulas in tables, giving quick and easy access to the information. Part II contains allopathic symptoms listed in alphabetical order within each chapter. These two sections allow users to compare back and forth between TCM and allopathic diagnoses. In addition, Part III lists 640 single herbs arranged by the Traditional Chinese Medicine classification system and organized into tables so that practitioners can quickly scan for the similarities and differences of each herb. A number of cross-referenced indexes make it easy to find single herbs and herbal formulas either by their Pinyin, English, or Botanical Latin name. The wealth of information and range of topics covered combined with the straightforward presentation make the book a useful clinical desktop reference and guide for practitioners and students.\n\n\n# Hardcover: 904 pages\n# Publisher: CRC Press; 1 edition (July 28, 2004)\n# Language: English\n# ISBN-10: 0849315689\n# ISBN-13: 978-0849315688","torrent":{"xt":"urn:btih:f89aff64a332ba6c3379688942c3aae7677ebc89","amp;dn":"Chinese+Herbal+Medicine+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f89aff64a332ba6c3379688942c3aae7677ebc89","infoHashBuffer":{"type":"Buffer","data":[248,154,255,100,163,50,186,108,51,121,104,137,66,195,170,231,103,126,188,137]},"announce":[],"urlList":[]}}