{"title":"Batman vs. Predator and Aliens","uid":5301901,"size":271275603,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f8f1b87dfe0cc24d3cfa9a4c1b1012cfa635429a&amp;dn=Batman+vs.+Predator+and+Aliens&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"brodahisou","files":-1,"time":1264252253,"description":"Collection of mini-series where Batman goes up against the Predator and Alien creatures from the movies.\n\nBatman versus Predator\nThe hunter becomes the hunted as Batman, Earth's ultimate detective, is pitted against Predator, the galaxy's most ruthless hunter! \nWritten by Dave Gibbons, with art by Andy Kubert. \n\nBatman versus Predator II: Bloodmatch\nSeven high-paid killers have come to Gotham to collect the price on Batman's head and erstwhile Huntress has come to Batman's aid.  But both get more than they cargained for when a young rogue Predator comes to Earth to tackle the champion of Gotham.\nWritten by Doug Moench, with art by Paul Gulacy and Terry Austin. \n\nBatman versus Predator III: Blood Ties\nA father-son Predator duo come to Gotham to take on Batman and Robin. \nWritten by Chuck Dixon, with art by Rodolfo Damaggio. \n\nBatman/Aliens\nBatman meets a handful of mercenaries when he has to travel on a &quot;mission of mercy&quot; near the Guatemala and Mexico borderline. Into the jungle, the group finds a spaceship and later discovers they have to prevent an Alien outbreak, besides saving themselves.\n\nBatman/Aliens II\nIn 1927 an explorer discovered something frozen in the Alaskan ice and he brought it home with him to Gotham City where he sealed himself in a lab. It remained undiscovered until a present day construction crew broke it open to find the explorer torn apart.\nDr. Fortune, an army scientist, soon gets wind of this and hatches a plan to combine the aliens with DNA from Arkham Asylum inmates to create a xenomorph/supervillain hybrid capable of keeping the superheroes in check.\n\nSuperman and Batman vs. Aliens and Predator \nWhen a group of explorers goes missing near a dormant volcano in the Andes mountains, Clark Kent and Lois Lane are sent to investigate. Meanwhile, the Batman is following leads of his own, following unprecedented worldwide sightings of Predators. But in the volcano's heart, both Superman and Batman discover something they'd never expected - and unless they can stop it, the Earth is doomed! \nWritten by Mark Schultz (Aliens, Cadillacs &amp; Dinosaurs) and illustrated by Ariel Olivetti (Punisher War Journal).\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:f8f1b87dfe0cc24d3cfa9a4c1b1012cfa635429a","amp;dn":"Batman+vs.+Predator+and+Aliens","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8f1b87dfe0cc24d3cfa9a4c1b1012cfa635429a","infoHashBuffer":{"type":"Buffer","data":[248,241,184,125,254,12,194,77,60,250,154,76,27,16,18,207,166,53,66,154]},"announce":[],"urlList":[]}}