{"title":"The Elder Scrolls IV: Oblivion Soundtrack","uid":4356594,"size":85857488,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f8fff60624ff6319018a809890872a522f4c703f&amp;dn=The+Elder+Scrolls+IV%3A+Oblivion+Soundtrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":10,"leechers":0,"uploader":"GoS360","files":27,"time":1219438765,"description":"Jeremy Soule&amp;#039;s significant game score credits have a concentration in the fantasy genre, and Elder Scrolls IV: Oblivion is the latest. Winner of the Best Video Game Score award at the 2006 MTV VMA&amp;#039;s, Oblivion continues Soule&amp;#039;s use of his highly developed sample music library to create a fully orchestral sound for his music (see review for Dungeon Siege II). Building upon the brass-dominated sound of his work for Elder Scrolls III: Morrowind in 2002, Soule continues the soundscape he often applies to these epic fantasy games, such as Dungeon Siege II and Guild Wars.\n\nTwo main themes are introduced in the opening track, &quot;Reign of the Septims&quot;. Beginning with the low strings, the trombones come in with a brassy statement of the action theme, which is followed by a light string version of a secondary theme. This secondary theme shows up again in a more complex form in &quot;Watchman&amp;#039;s Ease&quot;. The main theme makes its next large-scale appearance in &quot;March of the Marauders&quot;. It is also hinted at a number of times in other sounds, as in &quot;Through the Valleys&quot; and &quot;Bloody Blades&quot;, the latter of which contains some very high quality-sounding brass.\n\nAside from the powerful brass theme, Oblivion also contains some quieter music. &quot;Wings of Kynareth&quot; is a restrained string quartet with an intricate layered sound, which is later joined by woodwinds. &quot;Sunrise of Flutes&quot; is similar but dominated by flutes. The album ends with &quot;Dusk at the Market&quot; and &quot;Peace of Akatosh&quot;, two quieter cues, which end the album on a slow note. The latter is more synthetic sounding than the other cues and includes a wordless choir.\n\nThere are a few moments that sound a tad familiar; the theme in &quot;Reign of the Septims&quot; has a bit of a Pirates of the Caribbean edge to it, and &quot;Auriel&amp;#039;s Ascension&quot; sounds a lot like James Newton Howard&amp;#039;s theme from Unbreakable.  Nonetheless, Oblivion is a relatively solid score that builds a soundscape for an epic fantasy genre well. While not quite on par with Soule&amp;#039;s other works like Prey and Dungeon Siege II, it is certainly worth checking out for fans of the game and Soule&amp;#039;s fantasy scores.\n","torrent":{"xt":"urn:btih:f8fff60624ff6319018a809890872a522f4c703f","amp;dn":"The+Elder+Scrolls+IV%3A+Oblivion+Soundtrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8fff60624ff6319018a809890872a522f4c703f","infoHashBuffer":{"type":"Buffer","data":[248,255,246,6,36,255,99,25,1,138,128,152,144,135,42,82,47,76,112,63]},"announce":[],"urlList":[]}}