{"title":"Vasily Grossman - Fiction, Journalism, Essays (5 books)","uid":9131280,"size":6423868,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9ad84f1922d499a0eb62049fed0465669889285&amp;dn=Vasily+Grossman+-+Fiction%2C+Journalism%2C+Essays+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"workerbee","files":-1,"time":1383324185,"description":"\nVASILY SEMYONOVICH GROSSMAN (1905 - 1964) was a Soviet writer and journalist.  Grossman trained as an engineer but changed career in the 1930s and published short stories and several novels.\n\nHis early work earned the admiration of such diverse writers as Maxim Gorky, Mikhail Bulgakov, and Isaac Babel.  At the outbreak of the Second World War, he became a war correspondent for the Red Army newspaper Krasnaya Zvezda, writing firsthand accounts of the repeated early defeats of the Red Army, the brutal street fighting in Stalingrad, the Battle of Kursk (the largest tank engagement in history), the defense of Moscow, the battles in Ukraine, the atrocities at Treblinka, and much more.\n\nBecause of state persecution, only a few of Grossman's post-war works were published during his lifetime.  After he submitted for publication his magnum opus, the novel LIFE AND FATE (1959), the KGB raided his flat, seizing the manuscripts, carbon copies, notebooks, and even the typewriter ribbons.  The Politburo ideology chief Mikhail Suslov told Grossman that his book could not be published for two or three hundred years.  Understandably bitter over the suppression of his work, the author worked on EVERYTHING FLOWS -- a shorter, but even more eviscerating, meditation on the monstrous results of the Soviet experiment -- until his death from cancer in 1964.\n\nTHE ROADÂ brings together a selection of Grossman's short stories, journalism, essays, and letters.  The stories range from Grossman's first success, &quot;In the Town of Berdichev,&quot; a piercing reckoning with the cost of war, to such haunting later works as &quot;Mama&quot;.  THE ROADÂ also includes the complete text of Grossman's harrowing report from Treblinka, one of the first anatomies of the workings of a death camp; &quot;The Sistine Madonna,&quot; a reflection on art and atrocity; as well as two heartbreaking letters that Grossman wrote to his mother after her death at the hands of the Nazis and carried with him for the rest of his life.\n\nA WRITER AT WAR depicts in vivid detail the crushing conditions on the Eastern Front, and the lives and deaths of soldiers and civilians alike.  Antony Beevor and Luba Vinogradova have taken Grossman's raw notebooks and fashioned them into a gripping narrative providing one of the most even-handed descriptions -- at once unflinching and sensitive -- we have ever had of what Grossman called &quot;the ruthless truth of war.&quot;\n\n\nThe following books are in EPUB format:\n\n* A WRITER AT WAR: VASILY GROSSMAN WITH THE RED ARMY, 1941-1945 (Harvill, 2005).  Edited and translated by Antony Beevor and Luba Vinogradova.\n\n* AN ARMENIAN SKETCHBOOK (New York Review Books, 2013).  Translated by Robert and Elizabeth Chandler.\n\n* EVERYTHING FLOWS (New York Review Books, 2009).  Translated by Robert and Elizabeth Chandler.\n\n* LIFE AND FATE (New York Review Books, 2008).  Translated by Robert Chandler.\n\n* THE ROAD: STORIES, JOURNALISM, AND ESSAYS (New York Review Books, 2010).  Translated by Robert and Elizabeth Chandler with Olga Mukovnikova; Commentary and Notes by Robert Chandler with Yury Bit-yunan.\n","torrent":{"xt":"urn:btih:f9ad84f1922d499a0eb62049fed0465669889285","amp;dn":"Vasily+Grossman+-+Fiction%2C+Journalism%2C+Essays+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ad84f1922d499a0eb62049fed0465669889285","infoHashBuffer":{"type":"Buffer","data":[249,173,132,241,146,45,73,154,14,182,32,73,254,208,70,86,105,136,146,133]},"announce":[],"urlList":[]}}