{"title":"Frankie Valli &amp; The Four Seasons album","uid":5472428,"size":2208870210,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f9bd1df36fa2cc993b11e656ee0f897d4900d5be&amp;dn=Frankie+Valli+%26+The+Four+Seasons+album&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"flitigalisa","files":653,"time":1269958609,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nFrankie Valli (born Francis Stephen Castelluccio, May 3, 1934, First Ward, Newark, New Jersey) is an American musician, most famous as frontman of The Four Seasons. He is well-known for his unusually powerful falsetto singing voice.\nValli, Tommy DeVito, Nick Massi, and Bob Gaudio, (the original members of The Four Seasons), were inducted into the Rock and Roll Hall of Fame in 1990 and the Vocal Group Hall of Fame in 1999. \nValli scored 29 Top 40 hits with The 4 Seasons, one Top 40 hit under The 4 Seasons' alias 'The Wonder Who?', and nine Top 40 hits as a solo artist. As a member of The 4 Seasons, Valli's number one hits included &quot;Sherry,&quot; &quot;Big Girls Don't Cry,&quot; &quot;Walk Like a Man,&quot; &quot;Rag Doll&quot; and &quot;December 1963 (Oh, What A Night).&quot; As a solo artist, Valli scored #1 hits with the songs &quot;My Eyes Adored You&quot; and &quot;Grease.&quot; Valli's recording of the song &quot;Can't Take My Eyes off You&quot; reached #2 in 1967. &quot;You're Ready Now,&quot; a Valli solo recording from 1966, became a surprise hit in Great Britain, as part of the Northern soul scene and hit number 11 on the British pop charts in December 1970\n Valli was born Francis Stephen Castelluccio in the First Ward of Newark, New Jersey. His father, Antonio, was a barber; His mother, Maria Castelluccio, was an Italian immigrant. He was inspired to take up a singing career at the age of seven after his mother took him to see Frank Sinatra at the Paramount Theater in New York City. His early mentor was Texas singer Jean Valley, from whom he obtained his last name, although it took him some time to settle on the spelling &quot;Valli&quot;.  Until he could support himself with music, he worked a dayjob as a barber. \n\nPlease SEED and enjoy, thanks, thanks and thanks so mutch........!\n\n","torrent":{"xt":"urn:btih:f9bd1df36fa2cc993b11e656ee0f897d4900d5be","amp;dn":"Frankie+Valli+%26+The+Four+Seasons+album","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9bd1df36fa2cc993b11e656ee0f897d4900d5be","infoHashBuffer":{"type":"Buffer","data":[249,189,29,243,111,162,204,153,59,17,230,86,238,15,137,125,73,0,213,190]},"announce":[],"urlList":[]}}