{"title":"David Busch's Nikon D3200 Guide [ ePub, Mobi]","uid":9211948,"size":12891795,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa2efeee259544dc030e7003aeeb733296e4163c&amp;dn=David+Busch%27s+Nikon+D3200+Guide+%5B+ePub%2C+Mobi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"Celtoid","files":-1,"time":1384803047,"description":"David Busch's Nikon D3200 Guide\n\nThe Nikon D3200 is the most advanced entry-level camera that Nikon has ever introduced. It boasts a class-leading 24 megapixels of resolution, blazing-fast automatic focus, and full high definition movie making. As the owner of a Nikon D3200, you demand the ability to take outstanding pictures with your new camera. David Busch's Nikon D3200 Guide to Digital SLR Photography shows you how, when, and why to use all the cool features, controls, and functions of the Nikon D3200 to take great photographs and movies. Introductory chapters will help you get comfortable with the basics of your camera before you dive right into exploring creative ways to apply file formats, resolution, and exposure. Beautiful, full-color images illustrate where the essential buttons and dials are, so you'll quickly learn how to use the Nikon D3200, and use it like a pro! With David Busch's Nikon D3200 Guide to Digital SLR Photography, you'll learn: How to select the best autofocus mode, shutter speed, f/stop, and flash capability to take great pictures under any conditions; Advanced shooting techniques, including high-definition movie making; Troubleshooting and prevention tips to keep your camera and media operating smoothly; and The basics of good photography as you master your camera's operation!","torrent":{"xt":"urn:btih:fa2efeee259544dc030e7003aeeb733296e4163c","amp;dn":"David+Busch%27s+Nikon+D3200+Guide+%5B+ePub%2C+Mobi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2efeee259544dc030e7003aeeb733296e4163c","infoHashBuffer":{"type":"Buffer","data":[250,46,254,238,37,149,68,220,3,14,112,3,174,235,115,50,150,228,22,60]},"announce":[],"urlList":[]}}