{"title":"To The City - Urban Photographs of the New Deal (Photography His","uid":8866231,"size":4367199,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa5e018ad99c6f967a1ce0ca7495e7b1e059039d&amp;dn=To+The+City+-+Urban+Photographs+of+the+New+Deal+%28Photography+His&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"STBGD","files":-1,"time":1377913913,"description":"Julia L. Foulkes, &quot;To The City: Urban Photographs of the New Deal (Urban Life, Landscape and Policy)&quot;\nEnglish | 2010 | ISBN 1592139981 | PDF | 144 pages | 4,2 MB\n\nIn the 1930s and 1940s, as the United States moved from a rural to an urban nation, the pull of the city was irrepressible. It was so strong that even a photographic mission designed to record the essence of rural America could not help but capture the energy of urbanization too. \n\nTo the City showcases over 100 photographs from the Farm Security Administration (FSA) project along with extracts from the Works Progress Administration (WPA) guidebooks and oral histories, to convey the detail and dimensions of that transformation. This artfully grouped collection of photographs includes magnificent images by notable photographers Dorothea Lange, Walker Evans and Gordon Parks, among many others. \n\nFoulkes organizes this history of Americana into five themes: Intersection; Traffic; High Life and Low Life; The City in the Country; and Citizens to illuminate the changes in habits, landscapes, and aspirations that the march to cities encompassed. As the rural past holds symbolic sway and the suburb presents demographic force, the urban portion of our historyowhy and how cities have been a destination for hopeorecedes from view. To the City is a thoughtful, engaging reminder. This book will make an excellent addition to undergraduate courses in U.S. urban history.","torrent":{"xt":"urn:btih:fa5e018ad99c6f967a1ce0ca7495e7b1e059039d","amp;dn":"To+The+City+-+Urban+Photographs+of+the+New+Deal+%28Photography+His","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa5e018ad99c6f967a1ce0ca7495e7b1e059039d","infoHashBuffer":{"type":"Buffer","data":[250,94,1,138,217,156,111,150,122,28,224,202,116,149,231,177,224,89,3,157]},"announce":[],"urlList":[]}}