{"title":"How Europe Underdeveloped Africa [pld991]","uid":8790385,"size":2983153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fab8b351ced500bdb1d9eddfa4a60c01b5396bd8&amp;dn=How+Europe+Underdeveloped+Africa+%5Bpld991%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":0,"uploader":"blackatk","files":-1,"time":1375930037,"description":"[img]http://image.bayimg.com/5d0c1741e64316707e2fe7dec967eb01f7a12fb9.jpg[/img]\n\n\n\n| With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload. | filetype: pdf |\n\n\nBefore a bomb ended his life in the summer of 1980, Walter Rodney had created a powerful legacy. This pivotal work, How Europe Underdeveloped Africa, had already brought a new perspective to the question of underdevelopment in Africa. His Marxist analysis went far beyond the heretofore accepted approach in the study of Third World underdevelopment. How Europe Underdeveloped Africa is an excellent introductory study for the student who wishes to better understand the dynamics of Africa s contemporary relations with the West.\n\n\n[b] Editorial Reviews [/b]\nAbout the Author\nWalter Anthony Rodney was born in Georgetown, Guyana on March 23, 1942. He is recognized as one of the Caribbean s most brilliant minds. Rodney attended Queen s College, in Guyana, and graduated first in his class in 1960, winning an open scholarship to the University of the West Indies (UWI). He attended UWI Mona Campus in Jamaica, and graduated with 1st class honors in History in 1963. Rodney then attended the School of Oriental and African Studies in London where, at the age of 24, he received his PhD with honors in African History. Rodney s thesis, A History of the Upper Guinea Coast, was published by Oxford University Press in 1970. Rodney combined his scholarship with activism and became a voice for the under-represented and disenfranchised a distinction from his academic colleagues. His interest in the struggles of the working class began at a young age with an introduction to politics by his father. His PhD thesis illustrated his duality as an intellectual and activist as he challenged the prevailing assumptions about African history and put forth his own ideas and models for analyzing the history of oppressed peoples. Influenced by the Black Power Movement in the U.S., third world revolutionaries and Marxist theory, Rodney began to actively challenge the status quo. In 1968, while a UWI professor in Jamaica, he joined others to object to the socio-economic and political direction of the government. Unlike his counterparts, however, Rodney involved the working class, including the Rastafarians (one of Jamaica s most marginalized groups) in this dialogue. His speeches to these groups were published as Grounding with My Brothers, and became central to the Caribbean Black Power Movement. Rodney's activities attracted the government s attention and after attending the 1968 Black Writers' Conference in Canada he was banned from re-entering Jamaica. This decision sparked widespread unrest in Kingston. In 1974, Rodney returned to Guyana to take an appointment as Professor of History at the University of Guyana, but the government rescinded the appointment. He remained in Guyana, joining the newly formed political group, the Working People's Alliance. Between 1974 and 1979, he emerged as the leading figure in the resistance movement against the increasingly authoritarian PNC government. He gave talks across the country to engender a new political consciousness. As the WPA gained popularity and momentum, the PNC began a campaign of harassment including police raids, house searches, and beatings. On July 11, 1979, Walter, with seven others, was arrested following the burning down of two government offices. Rodney and four others (known as the Referendum Five) faced charges of arson, but without proof, and scrutiny from international supporters, the government was forced to drop the charges. The persecution continued; two party members were killed, and the government denied Rodney permission to travel. Despite this, he continued his political work and attended Zimbabwe s independence celebrations in May 1980. Rodney s voice was also heard in the U.S. and Europe. In the early-mid 1970s, he participated in discussions and lectures with the African Heritage Studies Association at Howard University; the Institute of the Black World in Atlanta, GA; the African Studies and Research Center at Cornell University; and the State University of New York at Binghamton. On Friday, June 13, 1980, at age 38, Rodney was assassinated by a bomb while in Georgetown, Guyana. Rodney completed four books in the last year of his life: A History of the Guyanese Working People, 1881-1905; People s Power, No Dictator, and two children s books: Kofi Baadu Out of Africa and Lakshmi Out of India. Walter Rodney was married to Patricia Rodney and together they have three children Shaka, Kanini and Asha. \n\n\n\nPaperback: 340 pages\nPublisher: Black Classic Press (October 1, 2011)\nLanguage: English\nISBN-10: 1574780484\nISBN-13: 978-1574780482\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Europe-Underdeveloped-Africa-Walter-Rodney/dp/1574780484/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Europe-Underdeveloped-Africa-Walter-Rodney/dp/1574780484/&lt;/a&gt;\n\n\n\nTags: underdevelop, IMF, World Bank, eurocentric, eurocentricity, anglo, anglo-saxon bias, race, racism, oppression, nation, nationalist, marx, marxism, marxist, das kapital, africa, african, america, american, african american, black, literature, diaspora, Carib, Caribbean,Manley, ww2, cold war, ghana, Kwame, Nkrumah, IMF, capital, communism, capitalism, left, right, politics, pan-african, black star line, Malcolm X, W.E.B. Du Bois, Kwame Nkrumah, Martin Delany, World Bank, self-reliance, self-determination, independence, colonialism, UK, GB, Great Britain, England, French, dark continent, african studies, afro-centric, divide and conquer, colonialism, contested heritage, unity, nigeria, south africa, economic warfare, resource, REM, rare earths, gold, precious metals, bauxite, aluminum, economic warfare, lawfare,levies, sanctions, export restrictions, tech restrictions,","torrent":{"xt":"urn:btih:fab8b351ced500bdb1d9eddfa4a60c01b5396bd8","amp;dn":"How+Europe+Underdeveloped+Africa+%5Bpld991%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fab8b351ced500bdb1d9eddfa4a60c01b5396bd8","infoHashBuffer":{"type":"Buffer","data":[250,184,179,81,206,213,0,189,177,217,237,223,164,166,12,1,181,57,107,216]},"announce":[],"urlList":[]}}