{"title":"I Was Hitler's Chauffeur: The Memoirs of Erich Kempka","uid":16035439,"size":2474306,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fb854f7ad9bcc6065655249aee26f852b27dc2c4&amp;dn=I+Was+Hitler%27s+Chauffeur%3A+The+Memoirs+of+Erich+Kempka&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":6,"uploader":"marty14","files":1,"time":1476475632,"description":"I Was Hitler's Chauffeur: The Memoirs of Erich Kempka - Erich Kempka [epub]\r\n\r\nErich Kempka served as Hitler’s personal driver from 1934 through to the Führer’s dramatic suicide in 1945. His candid memoirs offer a unique eyewitness account of events leading up to and during the war, culminating in those dark final days in the Führer's headquarters, deep under the shattered city of Berlin.\r\n\r\nHe begins by describing his duties as a member of Hitler’s personal staff in the years preceding the war, driving the Führer throughout Germany and abroad, and accompanying him to rallies. The crux of his memoirs however covers his life with Hitler in the Berlin Führerbunker. During this time he was responsible for a transport fleet of cars, and often drove the likes of Speer or Kesselring on inspection tours to the hot spots on the front; and in March 1945, he accompanied the Führer to his final front-inspection tour. Kempka was also present when news came through of Göring and Himmler’s efforts to seize power and negotiate a truce with the Western Allies.\r\n\r\nCrucially, Kempka also witnessed Hitler’s marriage to Eva Braun, and his last dinner and personal farewell to all those present, before he and his wife committed suicide. Hitler’s final order to Kempka was that he have ready enough petrol to burn him and his wife. Under constant Soviet artillery fire, Kempke, Linge and others poured petrol over the bodies and burnt them.\r\n\r\nThe account concludes with Kempka’s hazardous escape out of a burning Berlin more than 800 km through enemy-occupied Germany, home to find his wife at BE. There he was arrested by American C.fI.C. personnel and interrogated before being sent to serve as a witness at Nuremburg","torrent":{"xt":"urn:btih:fb854f7ad9bcc6065655249aee26f852b27dc2c4","amp;dn":"I+Was+Hitler%27s+Chauffeur%3A+The+Memoirs+of+Erich+Kempka","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb854f7ad9bcc6065655249aee26f852b27dc2c4","infoHashBuffer":{"type":"Buffer","data":[251,133,79,122,217,188,198,6,86,85,36,154,238,38,248,82,178,125,194,196]},"announce":[],"urlList":[]}}