{"title":"Topgrl--Fear Play  Rain DeGrey  London River High","uid":15533211,"size":3737031914,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:fc9361c1841561c296e45ddcdc0cc0c369d94853&amp;dn=Topgrl--Fear+Play++Rain+DeGrey++London+River+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"merzedes","files":1,"time":1470854729,"description":"Fear Play | Rain DeGrey | London River \r\n\r\nAugust 9, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nDominant Dame Makes a Deal With the Devil \r\n\r\nRain Degrey is used to being dominant in most of her games, but she and her friend London River have made a deal. London is allowed to use her as her personal sex toy, but only if she promises to really deliver a challenge. And that's exactly what she does. Right away Rain finds herself confronted by one of her worst fears as over two hundred crickets are poured into her tiny plastic cage. If she hurts or steps on any of them she will have to lick them off of her skin. She is crying within a few short minutes. Rain does a good job of not hurting any of her creepy crawly roommates, but that doesn't mean she needs to know that. London decides she still wants to punish her further.\r\n\r\nIt isn't just bugs that scare Rain, really anything dirty will do. That's why London has brought a whole tub of mud to slather all over Rain's body, turning her toy into her own worst nightmare. Then she sticks her in a tiny electrified cage. If there is anything Rain hates as much as dirt it's electricity. London pokes at her feet hoping to make her dance around enough to bump into one of the walls and get an intense shock. But when Rain doesn't cooperate with her games, she is forced to be a little more hands-on with her methods.\r\n\r\nAfter a long day of torment, London lays Rain down on a box and shackles her feet up so that her legs are spread and London can have access to her pussy. London pulls out a dildo and a hitachi, the most powerful handheld vibrator we have, and fucks Rain until she doesn't know up from down. Rain is screaming and speaking in tongues from the intense pleasure she is receiving. Her body bucks and shakes completely out of her control as she has orgasm after orgasm. When London is done, she unshackles Rain and she collapses in a pile of limbs. Her eyes are glazed over and her mouth still babbling incoherently. She has been taken away into complete sub-space. \r\n\r\nScreens \nhttp://www.topgrl.com/female/bondage/trailer.php?y=2016&amp;p=08_09rdegrey6&amp;u=TopGrl-Rain-DeGrey-London-River-Fear-Play\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n21 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:fc9361c1841561c296e45ddcdc0cc0c369d94853","amp;dn":"Topgrl--Fear+Play++Rain+DeGrey++London+River+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc9361c1841561c296e45ddcdc0cc0c369d94853","infoHashBuffer":{"type":"Buffer","data":[252,147,97,193,132,21,97,194,150,228,93,220,220,12,192,195,105,217,72,83]},"announce":[],"urlList":[]}}