{"title":"Primal's Taboo Sex - Britney Amber - Mom only needs me - 720P","uid":15605266,"size":944918007,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:fd18233f03b7ea66a962e7e5ffe0e86d81fbc2dd&amp;dn=Primal%27s+Taboo+Sex+-+Britney+Amber+-+Mom+only+needs+me+-+720P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":3,"uploader":"distinc","files":1,"time":1471712786,"description":"Primal's Taboo Sex - Britney Amber - Mom only needs me - 720P\r\n\r\n...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=1043895726\r\n \nhttp://imagedisco.net/?g=7022227789\r\n\r\n\r\nPlot:\r\n\r\nBritney is distraught over her date cancelling when her son comes in and asks her what's wrong. She's just so frustrated that men are such jerks, but she knows she raised him better than that. and being the loving son that he is, he hugs and consoles her. He doesn't even care about the date that he had planned because his mom is his most important priority. Britney's son is so grown up now and she knows that she can count on him for anything. She tells him to lay back and just pretend that she is one of the girls from his school, because she can take care of him and his very hard cock. She strokes him and slides his dick between her big, beautiful breasts before sliding her pussy up and down his shaft and balls. She can't take the temptation anymore and she slides her son's cock inside of her and rides it. He fucks her until he blows is big, fat load for mommy's titties.\r\n\r\nBritney is outside sunbathing while the rest of the neighbors are out having holiday weekend fun. But when her son sees her lounging out in her sexy thong bikini, he decides to cater to her by rubbing lotion all over her body. It feels so good that she can't help but start rubbing herself and when he strokes his cock, she needs to feel it inside of her. She has to bite the towel so that the neighbors don't hear her moans of pleasure. She finishes him off in her mouth and lets his huge load drip out of her mouth.\r\nCategory: TABOO\r\nRelated Categories: MILF, OLDER WOMAN / YOUNGER MAN, OUTDOORS, HOT WIVES, MOMMAS BOY\r\nKeywords: britney amber, fucking, orgasms, thong, big tits, blonde, blowjob, housewives, handjobs, bikini, cum on tits, cum in mouth, masturbation, fingering, cock worship\r\n\r\nGenre:Hardcore , Fetish","torrent":{"xt":"urn:btih:fd18233f03b7ea66a962e7e5ffe0e86d81fbc2dd","amp;dn":"Primal%27s+Taboo+Sex+-+Britney+Amber+-+Mom+only+needs+me+-+720P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd18233f03b7ea66a962e7e5ffe0e86d81fbc2dd","infoHashBuffer":{"type":"Buffer","data":[253,24,35,63,3,183,234,102,169,98,231,229,255,224,232,109,129,251,194,221]},"announce":[],"urlList":[]}}