{"title":"Infernal Restraints--So Inclined  Mimosa High","uid":15737185,"size":2517693000,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:fdc158eeaddb695c7589b0f6492b4e41350237f3&amp;dn=Infernal+Restraints--So+Inclined++Mimosa+High&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"merzedes","files":1,"time":1472856022,"description":"\nSo Inclined | Mimosa\r\n\r\nSeptember 2, 2016\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nSpoiled Brat Gets Her Ass Beat \r\n \r\nOur model for the day, Mimosa, was given an absolutely wonderful gift, her beautiful ass. And she is going to shake that beautiful ass today for your entertainment. To start the show, O.T. demands that Mimosa strip for us and she does not disappoint. She slowly removes her fancy dress as she rolls her body and swings her hips and grinds up against a slanted metal pole. This all becomes much more impressive when you consider the fact that she is attached to that pole by a metal collar around her neck.\r\n\r\nMimosa is a bigger girl than most of our models and that comes with some distinct advantages. One of those is that you can really see the impact our handlers make when they smack her around. O.T. has Mimosa bent over the pole in handcuffs and her ass up where he can play with it. He spanks it and punches it and canes it and each time you can watch as the impact rolls over her ass and down her legs. It's beautiful, and she loves it almost as much as we do.\r\n\r\nWhile fun to play with, Mimosa is also an ungrateful spoiled little brat. O.T. is doing so much for her: setting up and moving this heavy metal rig, beating her ass and whipping her tits until she gasps and moans. But all she can talk about is wanting to cum. Each and every time he has the hitachi pressed up against her it's all she can talk about. &quot;Can I come?&quot; The girl doesn't even say please. So O.T. is going to deny her as long as he feels is necessary, no matter how much she whines and stomps her feet to try and get him to do what she wants. \r\n\r\nScreens \nhttp://www.infernalrestraints.com/device/bondage/trailer.php?y=2016&amp;p=09_02mimosa&amp;u=InfernalRestraints-Mimosa-So-Inclined\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n22 000 Femdom/BDSM/Fetish torrentuploads since 2004, including almost everything from Kink/Intersect.\r\n\r\nJust keep on leaving us nice comments below and we are happy for the next 20k:)\r\n\r\nAlso, a huge thanks to Kink.com for making the videos we all love (and Intersect and all the others too ofcourse). Keep up the awesome work!!!\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://s4.postimg.org/5zaprzep9/Merzedes_Shallow2_FAQ2_1337_X_3.jpg\r\n \nhttp://s32.postimg.org/ym8wkx6hx/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:fdc158eeaddb695c7589b0f6492b4e41350237f3","amp;dn":"Infernal+Restraints--So+Inclined++Mimosa+High","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fdc158eeaddb695c7589b0f6492b4e41350237f3","infoHashBuffer":{"type":"Buffer","data":[253,193,88,238,173,219,105,92,117,137,176,246,73,43,78,65,53,2,55,243]},"announce":[],"urlList":[]}}