{"title":"Dinner With Buddha By Ronald Merulo Audiobook","uid":16025993,"size":307540654,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fe276d896e3294c4e91c45a1283254be2d0b7951&amp;dn=Dinner+With+Buddha+By+Ronald+Merulo+Audiobook&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":3,"uploader":"deepak60","files":1,"time":1476387125,"description":"DINNER WITH BUDDHA BY RONALD MERULLO. AUDIOBOOK\r\n\r\n\r\nThe author of Breakfast with Buddha brings his characteristic whimsy to a new novel about New York book editor Otto Ringling and Mongolian monk Volya Rinpoche, who embark on a road trip from Rinpoche's meditation center in North Dakota to the glitter and glitz of the Las Vegas strip.\r\n\r\nWhat prompts the trip is Otto's recently altered life, having lost first his wife then his job, and then seeing both his children leave home for lives of their own. With Rinpoche's guidance, he hopes to find a new meaning in his life and a new direction. But what begins as a quietly contemplative journey becomes much more as the two men travel through the heart of the American Midwest, witnessing the decimated lives of so many American natives and giving Otto new perspective on the trials he is experiencing in his own life.\r\n\r\nAlong with these inner awakenings for Otto, there is also a very real hint of menace in the novel, as men show up who may be looking to make sure that the world never knows of the existence of Shelsa, the eight-year-old daughter of Rinpoche and Otto's sister, Cecilia. Shelsa has consistently shown that she has the markings and the instincts of a spiritual leader, leading to speculation that she may be the new Dalai Lama","torrent":{"xt":"urn:btih:fe276d896e3294c4e91c45a1283254be2d0b7951","amp;dn":"Dinner+With+Buddha+By+Ronald+Merulo+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe276d896e3294c4e91c45a1283254be2d0b7951","infoHashBuffer":{"type":"Buffer","data":[254,39,109,137,110,50,148,196,233,28,69,161,40,50,84,190,45,11,121,81]},"announce":[],"urlList":[]}}