{"title":"Marc Dorcel - Lola Reve, The Virgin XXX NEW WEB-DL Split Scenes","uid":13228557,"size":1351870962,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:febca92afcd69909db13b22936dea0407f08f74c&amp;dn=Marc+Dorcel+-+Lola+Reve%2C+The+Virgin+XXX+NEW+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":2,"uploader":"SudoSu","files":7,"time":1452905166,"description":"\nhttp://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n―――――――――――――――――――――――――   \nhttp://imgpremium.com/album/pN\r\n\r\nStudio: Marc Dorcel\r\nDuration 105 min.\r\nLanguage : French\r\nDirected by : Kendo\r\nGenre: Anal, Blowjob, Cowgirl, Cunnilingus, Doggystyle, Masturbation, Missionary\r\n\r\nTiffany Doll, Lola Reve, Cathy Heaven, Keni Styles\r\n\r\nLola is 19 and a half and will take you along with her in her sexual initiation to the outer limits of the pleasures of the flesh. Prudish and reserved, Lola can't stand the behaviour of her mother, who, since her divorce, has been collecting male conquests and now seems to know no limit. She decides to go to round to see Denise, a friend of her mother's who has always been understanding with her. Denise has been living for a short while with David, a very attractive young man, who immediately starts to fantasise about Lola. The innocence of this young virgin with her youthful body and beautiful blond hair start to play on his mind a lot... While David's fantasy turns to obsession to the point that he has to fuck prostitutes while making them wear blond wigs and cumming on underwear stolen from Lola's bedroom, Denise takes an active hand in the young woman's sexual education. Starting with gentle lesbian touching, the experienced woman will finally call on the virility of her man to teach Lola the secrets of fellatio. Then, Denise will guide Lola towards her first sexual encounter with a man.... Never having experienced this before, Lola will completely lose herself to the intensity of this first orgasm. Whole new worlds of pleasure now open up to young Lola. &quot;The exploration can begin...&quot;\r\n\r\nMore exclusive porn at:  https://thepiratebay.ms/user/SudoSu/","torrent":{"xt":"urn:btih:febca92afcd69909db13b22936dea0407f08f74c","amp;dn":"Marc+Dorcel+-+Lola+Reve%2C+The+Virgin+XXX+NEW+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febca92afcd69909db13b22936dea0407f08f74c","infoHashBuffer":{"type":"Buffer","data":[254,188,169,42,252,214,153,9,219,19,178,41,54,222,160,64,127,8,247,76]},"announce":[],"urlList":[]}}