{"title":"The Art and Aesthetics of Boxing (2009).pdf Gooner","uid":13222242,"size":5930188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff8a8434ea817d3c3133209e174a81ec8752df03&amp;dn=The+Art+and+Aesthetics+of+Boxing+%282009%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":8,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1452807164,"description":"The Art and Aesthetics of Boxing (2009).pdf Gooner\r\n\r\nPublisher: University of Nebraska Press; First Edition edition (January 1, 2009)\r\nLanguage: English\r\nISBN-10: 0803213867\r\nISBN-13: 978-0803213869\r\n\r\nWhat separates the chaos of fighting from the coherent ritual of boxing? According to author David Scott, it is a collection of aesthetic constructions, including the shape of the ring, the predictable rhythm of timed rounds, the uniformity of the boxers’ glamorous attire, and the stylization of the combatants’ posture and punches. In The Art and Aesthetics of Boxing, Scott explores the ways in which these and other aesthetic elements of the sport have evolved over time. Scott comprehensively addresses the rich dialogue between boxing and the arts, suggesting that boxing not only possesses intrinsic aesthetic qualities but also has inspired painters, graphic designers, surrealist poets, and modern writers to identify, expand, and respond to the aesthetic properties of the sport. Divided into three parts, the book moves from a consideration of the evolution and intrinsic aesthetics of boxing to the responses to the sport by cubist and futurist painters and sculptors, installation artists, poster designers, photographers, and, finally, surrealist poets and modernist writers.\r\n \r\nWith distinctive illustrations and photographs in nine short chapters, Scott creates a visual as well as a textual narrative that supplements and concretely demonstrates the deep, dynamic relationship between the art of boxing and the world of art and literature","torrent":{"xt":"urn:btih:ff8a8434ea817d3c3133209e174a81ec8752df03","amp;dn":"The+Art+and+Aesthetics+of+Boxing+%282009%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff8a8434ea817d3c3133209e174a81ec8752df03","infoHashBuffer":{"type":"Buffer","data":[255,138,132,52,234,129,125,60,49,51,32,158,23,74,129,236,135,82,223,3]},"announce":[],"urlList":[]}}