{"title":"Final Fantasy VII - Last Order.mkv","uid":6085078,"size":365502374,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffcb9efcf026685e8c245a083a26fceb29f6e4f1&amp;dn=Final+Fantasy+VII+-+Last+Order.mkv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":9,"leechers":0,"uploader":"xankou3","files":1,"time":1294288483,"description":"Last Order: Final Fantasy VII is an original video animation from 2005 directed by Morio Asaka, written by Kazuhiko Inukai, and animated by Madhouse. It was released with the &quot;Ultimate Edition&quot; of Advent Pieces: Limited in Japan and was included in the collector's edition of Advent Children in North America. There is no English dub, and the OVA is subtitled.\n\nThe OVA is an anime rendition of two flashbacks that took place in the game. One details events from five years before Final Fantasy VII, revolving around the Nibelheim scenario that focused on Zack, Cloud Strife, Tifa Lockhart, and Sephiroth. The other involves Zack and Cloud on the run from Shinra. The anime cuts back and forth between these two flashbacks, linked by the Turk commander Tseng's reflection on the Nibelheim events.\n\nLast Order also forms the basis of the PSP game Crisis Core: Final Fantasy VII, and serves as a tie-in with the mobile phone game Before Crisis: Final Fantasy VII, as several of the game's playable Turk characters appear as minor characters, with some getting spoken lines.","torrent":{"xt":"urn:btih:ffcb9efcf026685e8c245a083a26fceb29f6e4f1","amp;dn":"Final+Fantasy+VII+-+Last+Order.mkv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffcb9efcf026685e8c245a083a26fceb29f6e4f1","infoHashBuffer":{"type":"Buffer","data":[255,203,158,252,240,38,104,94,140,36,90,8,58,38,252,235,41,246,228,241]},"announce":[],"urlList":[]}}